{
  "name": "69-inch_Wood_and_Glass_2-door_Storage_Cabinet", 
  "price": "EUR 251.23", 
  "reviews": [
    "We bought this to be a linen closet in our master bath and it is working well so far! Easy to put together, looks nice for the price, and feels sturdy. We did notice a slight chemical odor the first few days but it's beginning to go away.", 
    "This cabinet could have been perfect, but almost every surface was marred, cracked, torn, or just poorly finished. It comes in a box with all sorts of protection, which shows that it was packed with all of the issues. There is no way the damage was done during shipping.", 
    "it looks really good in my kitchen and I already put it to use..it opens up some cabinet space that I can put smaller things in..with this nice and roomy cabinet I can put any size box or can that I have..i buy in bulk so this cabinet helps me out tremendously..i am happy I got it..and very sturdy", 
    "This item is missing several pages of instructions! We were able to figure out how to assemble it on our own but it took much longer.", 
    "Super easy to put together. Holds a ton! Beautiful! You'll LOVE this cabinet!", 
    "Defiantly need two people to put together. Is a beautiful piece. Has an elegant look and is true to color and size. Shelves easy to move. Great for storage or display case.", 
    "Everything came in great. Fast delivery as well.Glass had some glue remnants on the edges which was difficult to remove. The shelves also had a couple spots where the finish was separating from wood. Overall, these are very minor and aren't noticed when china is in the cabinet.Easy to follow instructions are also included. It was a fun project to put together.", 
    "This particleboard wasn't able to hold up to this unit's own weight. I was unable to even finish putting this together before all the plug screws pulled out and stripped their anchorage into the sides and top of the unit. Very poorly made and not worth your time. I've put together plenty of my own furniture and this is by far the worst experience I've had. I kicked the corpse of what remained downstairs and I'll jerry-rig the remains into something useful in the garage.", 
    "This cabinet works well as a bookcase & looks like one of the more expensive cabinets. I am very happy with it. One thing I would like to mention is that it did not come with instructions. The box was pretty banged up when it was delivered to us. I came home at the same time the FedEx delivery driver dropped off the package & he basically just pushed it off his trolley/hand truck. I understand that it's heavy but I think they could have been more careful in handling the item. Some parts of the box were already missing & the styrofoam was exposed. There was some minor scratches to some of the pieces but nothing too big that I felt like I needed to be replaced.", 
    "only drawback is that it is a bear to put together, i have an ikea a few towns away so i am used to assembling pieces, this thing had like a 5 page manual, and so many extra pieces...it was so time consuming... but again, it does hold a ton of my kitchen extras...", 
    "I love this it's really nice doesn't look cheap.Ever time I look at it I'm so glad I bought it.It's a good choice!", 
    "Pre-drilled holes in many places are off so wood splits when you screw in the bolts, You will need to shim if you want it to sit level. Kind of flimsy. Pretty much looks like the picture once assembled. Glass doors are nice.", 
    "I like the classy looks of the white pantry in our kitchen.", 
    "I transported the doors to this item separately from the rest of the cabinet and during the ride, another piece of very heavy furniture fell on the door. I was certain it would be broken (at least the glass!) but to my amazement, it was just fine--no broken glass, no chips, nothing. I was able to put this together mostly by myself (I only needed help with the above-mentioned doors). It is a nice size and looks really good. Only real complaint is when it was shipped, the styrofoam got all busted up and little bits of it were EVERYWHERE. I had to use a vacuum on the unit to get it all off.", 
    "Used it as kitchen pantry. It's a solid, great looking cabinet. The glass door is a plus. Was actually looking at a similar cabinet at **** but it's much cheaper here. My husband makes custom cabinets for a living before so it wasn't hard for him to assemble this."
  ], 
  "link": "http://www.overstock.com/Home-Garden/69-inch-Wood-and-Glass-2-door-Storage-Cabinet/9919579/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9919579/Glass-2-Door-Storage-Cabinet-d1e122ed-fe8d-4fea-ab7f-bb21be885eae_600.jpg"
  ], 
  "description": "Customize this wood and glass two-door storage cabinet which features three adjustable shelves and two fixed shelves. The glass doors allow you to display precious heirlooms, fine china or other items of meaning and value.Storage cabinet is available with a black or white finishStorage cabinet features crown molding and brushed nickel knobsIncludes two fixed shelves and three adjustable shelvesStorage cabinet is constructed of MDF and is intended for indoor useStorage cabinet measures 69.34'' H x 31.52'' W x 17.34'' DSold individuallyMaterialGlass, WoodAssemblyAssembly RequiredColorBlack, WhiteOrganizer TypeCabinet Organizer"
}