{
  "name": "ABBYSON_LIVING_Signature_Convertible_Sofa", 
  "price": "EUR 375.78", 
  "reviews": [
    "This is a nice looking convertible sofa, however it is too firm to be comfortable for frequent use. We used a foam pad when sleeping and that works fine. It isn't used often so don't know about how long it would stand up with frequent use. It fills the need for a transitional piece of furniture.", 
    "This is perfect item for my game room. I have twin 12 year old boys who are rough on furniture and this couch seems to me their needs. The cup holder was really a big sell to them. It is exactly what we needed.", 
    "I thought this convertible sofa would be nice for my husbands man cave but it really looks kind of cheap to me, although it really depends on what you need it for. If its for sleeping on please don't buy its very hard. I'm going to keep it for him and his friends to sit and watch the games on: its cool for that I guess. The picture is a true description it sits low and very firm.", 
    "Purchased this convertible sofa for my son's apartment. Very impressed and a great deal. Would definitely recommend this for a small space.", 
    "I love overstock great quality look just like the picture so fancy it came with white gloves and shoes covers. much better than going into the store.", 
    "I ordered this futon because of it's sleek look and convenient cup holder center. When I received it, I was terribly disappointed in how small it was. It looked as if it was made for children. Also there was a slight tear in the back lining on the opposite site of the secret zipper compartment, which made it very difficult to try and return without manufacturer giving me static.", 
    "It arrived completely assembled, accept you easily hand \"screw-in\" the legs; fabulous! looks so sleek and substantial.", 
    "This futon looks very nice and I'm pleased with my purchase. The reviews about it being small are correct, but it fits 3 average people comfortably in the seated position. I think what most mean is the futon sits low to the ground. I don't have a problem with this and most folks won't have a problem sitting down or getting up. It sleeps fine if you are ok with a firm mattress. If not, just throw a mattress pad on it. I would not hesitate to purchase this item again.", 
    "It's not even a proper full-sized bed when folded flat, but it's pretty comfortable and the middle shelf is great when it's just the two of us.", 
    "Futon/sofa arrived today my soon to be husband was not on board. So I kept a little secret in the center is a cup holder. I must pat myself on the back he now see how it ties into our movie room. It's not very large a different twist for a sofa bed. But yet modern for those who are bold and don't mind mixing furniture for a unique look.", 
    "I really like this sofa. I bought it to use in my home office, and I love the functionality it provides us. With limited space available, I will be able to use this furniture either as sofa or a nap bed without having to move the furniture or trying to create more space when I have someone over. On top of that, this sofa is very stylish and hip. I am very pleased!", 
    "it looks fine but I agree, seating is not very comfortable. the noise it makes when you move around while seating is very annoying.", 
    "Not comfortable this sofa not a good product", 
    "Nice look but uncomfortable. Will need a topper if used for a bed.", 
    "This couch is cool, and nice design. It is terribly uncomfortable. It is so firm, like no padding whatsoever. The seams makes it feel like you're sitting on wooden planks, and really hurt. I really have only used it three times due to this. I would not recommend.", 
    "I bought this sofa for my basement that I was finishing. We wanted to use our basement for overnight guests. To date, we've had one overnight guest, my sister. When I was vacuuming the floor today, I found one of the legs had fallen apart. They are simply plastic cup like things with the bottom plastic hooked to the couch by a long bolt. The plastic holding the cup bottom to the couch broke. This left a long bolt just sticking out, and it was bent. I can't repeat enough this was after one use by a normal weight individual. I would not recommend this product.", 
    "An extremely uncomfortable piece of furniture. Good for a college dorm, maybe...."
  ], 
  "link": "http://www.overstock.com/Home-Garden/ABBYSON-LIVING-Signature-Convertible-Sofa/8232493/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8232493/Abbyson-Living-Signature-Convertible-Sofa-ff8fe48f-b0f8-43fd-bcb6-3826ad672da2_600.jpg"
  ], 
  "description": "Relax in style and sophistication with the black convertible sofa from Abbyson Living. A faux leather cover surrounds high-density foam for maximum comfort, while a solid oak wood frame makes the contemporary, convertible sofa sturdy and durable. A flip-down tray provides a convenient place to put drinks and snacks while watching the big game.\nStyleContemporaryMaterialFaux LeatherTypeSleeper SofaAssemblyAssembly RequiredColorBlackFurniture PatternSolid"
}