{
  "name": "Alborg_End_Table,_Zebra_Series", 
  "price": "EUR 183.01", 
  "reviews": [
    "The package arrived in good time, the look of the table was what expected and the ease of putting it together was not bad at all. The problem lies with the way they packaged the item. The legs come in a box stapled with a rope holding the box to the inside of the table. Once you get the box out you have to pry the staples out of wood from the inside of the cubby of the table with out slicing your hand and pull the rope out. Mine also looked as if this had been done twice to one table. Very dissapointed with this. Also the joints of the table on the fron and back are white where the wood meets. I understand these are not a ton of money put poorly put together and packaged. If you don't mind doing a little touch up and ripping staples out of the brand new furniture, they will not be too bad.", 
    "Great look, quality, functionality!", 
    "This table is indeed very orange, but it mates my mid- century bedroom furniture perfectly. The table is much larger than I expected. I'm using as a nightstand, but these would be beautiful end tables.", 
    "this is such a neat piece, very stylish and solid - adds some real pizzaz to my daughters living room", 
    "Did not have the same packaging problems as others have noted. Assembly is very easy although the box has a strong paint thinner smell. The color is more orange-y than Walnut but the style is very nice. Front of table does have a few knicks but not enough to return. Would probably use as a nightstand instead of an end table because of its size", 
    "Adding my two cents to the previous review. Yes, terrible packaging, and I also struggled with the staples. There appeared to be one or two nicks in the table as well. If the shipper could fix the packing issues, this would be a 5-star item. As is, it's still worth the purchase price. The wood is beautiful and the vintage style was exactly what I was looking for."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Alborg-End-Table-Zebra-Series/8231762/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8231762/Alborg-End-Table-Zebra-Series-665522f3-7252-4969-86ca-279b891c13f2_600.jpg"
  ], 
  "description": "Alborg End Table, Zebra Series. Set includes: One (1) end tableMaterials: Solid hardwood, veneerFinish: Zebra veneerDimensions: 23.5Dx24Wx24.5HAssembly Require: YesStyleContemporaryMaterialWoodTypeEnd TablesAssemblyAssembly RequiredColorMulti"
}