{
  "name": "Altra_Emmett_Gunmetal_Grey_TV_Stand", 
  "price": "EUR 74.71", 
  "reviews": [
    "It looks good and was easy to put together. Assembly tools included along with spare parts. There was a slight crack on one of the surfaces but easy to disguise. Make no mistake, though, this is a \"cheap\" product, made in China. It does not wobble when put together and from a distance its \"cheapness\" can't be seen. For the price, I can't complain.", 
    "I bought this stand for our master bedroom and I think it's perfect. I didn't want to spend a ton of money, needed something with a small footprint and visually appealing - this fit the bill on all accounts. It is much more sturdy than items I found at many other stores and I love the modern/rustic look it has.", 
    "We actually bought two of these and put them together to make one long TV stand. We had been searching for something that size and we we're only finding things $250+! I'm sure this isn't high quality, but it looks great and doesn't look cheap!", 
    "The wood looks cheap as any ******* furniture but at this pricing I guess my hope was too high.Note : One thing to watch ==> when you assemble plate a and plate b DO NOT LOCK THE BOLT TOO HARD, ALIGN AND LOCK. Otherwise you will bend the plywood.", 
    "I use it as a TV stand, plus you have plenty of room for storage underneath. You can use it as coffee table or whatever else you think of. I love its modern design and its simple, sleek, industrial look. It's so easy to assemble, a child could do it. Awesome value!", 
    "This TV stand looks much more expensive than it is. Excellent price/value for such a great piece. It's simple, modern and very versatile (goes with most other furniture you may already have in your living room). Highly recommend this piece of furniture!", 
    "I absolutely love this table, looks so good under my TV, I actually have a 52\" tv and I have it on the wall. The table holds all my electronics. I am so happy I bought it, so sturdy and looks great. I would definitely recommend, not to mention the great price!!", 
    "The style of this table is a nice mix of modern with industrial, but the construction is pretty weak. Sort of on par with the price, I guess. Thicker metal and actual wood would make it much nicer. I thought about replacing the panels with real wood, but they are fixed within the metal framing. The \"Sonoma Oak\" finish looks like cheap paper glued to particle board, but it works to hold my oversized printer and supplies.", 
    "This wouldn't be for a nice living room. I bought one for each guest room. I needed gray and not too big, so this fit the bill. Looked easy to assemble mainly because all I did was watch:)As always, shipping was fast.", 
    "Good product for the price. Sturdy and was easy to put together. Just what I needed for a small apartment.", 
    "Bought this for my daughters first apartment. Nice and sturdy and easy to put together.", 
    "Great product fit my décor", 
    "I'm so glad I bought this I thought it was look super cheap but it's actually perfect for my family room", 
    "I have enjoyed this TV stand.", 
    "This was easy to assemble and looks great!", 
    "So easy to assemble and great quality. Looks expensive an is really study. Very happy with my purchase.", 
    "Very nice piece of furniture - priced nicely", 
    "I have a small living room and wanted a stand for my new TV. This was just the ticket. It holds my 50 inch flat screen just right. I love the industrial look of the stand. It was very easy to assemble.", 
    "Good product, love it and it goes with my decor very well.", 
    "Easy to assemble! Looks as good as the picture. Perfect in my small den!", 
    "its a simple tv stand but at least the materials are good quality it will last!", 
    "very nice looking table when put together", 
    "True to picture, easy to assemble, too short for what I was looking for", 
    "Just like the photo and I think I rather use it as a coffee table. Easy set up as well.", 
    "Easy instructions to put together, lots of screwing things. But the end result is amazing. Beautiful and very sturdy, I have the matching end table as well. Worth the money!", 
    "I really wanted to buy a TV stand that I could double up as storage in the industrial modern style. I came across this one and bought it because it was so inexpensive. The shelving is NOT made of wood, but is definitely realistic. You get what you pay for in that regard. Super easy to put together and looks great in my room. I plan on having baskets on the lower shelf for storage.", 
    "The TV stand started out as just that. I put it together in a very short time and placed our TV on it. Looked great. However, after a week I decided to have the TV mounted on the wall to save the floorspace in that spot. And the stand instantly became a very modern looking coffee table in our den. Very happy and would recommend it for either purpose.", 
    "Don't expect anything wonderful and you won't be disappointed in good shape, simple to put together. Takes about 45 min due to the number of screws.Not real wood, but the metal is sturdy and the height is what I wanted.", 
    "Was in need of a new TV stand after a move and saw this on Overstock. For the price I couldn't resist trying it. My husband assembled it in about 10 minutes. It was very sturdy when assembled and fit our 47\" perfectly (just a tiny bit of over hand but it looks fine!).", 
    "The size and construction were perfect and as described. Love it.", 
    "I love the quality of this TV stand, I have actually used it as a console table to sit beneath a large window in my living room. The height was perfect, so I was happy. It was very easy to put together, about 30 minutes max. Nothing was missing, no broken pieces, and I like how the wood looks.It truly helps keep my space looking \"open\", as I live in a smaller NYC apt. This is worth the investment, so if you like it, go for it!", 
    "Nice furniture and very easy to put together.", 
    "Basic materials, but versatile, can serve as a TV stand or a coffee table, and light weight, so can be moved around as required by one person.", 
    "Perfect height for the living room.", 
    "It's a nice stand and it was easy to set up.", 
    "This was by far the easiest tv stand I have ever put together....20 min tops! The quality is right up there with much more expensive stands.....Love it!", 
    "When I put this product together, i found that it wasn't as long or as high that I wished. However, turned width wide by my sofa made a great side table. The color was really good to mix with my gray and white livinging room.", 
    "Pros great color, sleek look!Cons sis really low and no where to put any TV accessories!", 
    "Very easy to put together, and the style of it I really love. May be buying some more", 
    "Sturdy, slim, smart and simple to assemble! We bought two stands in order to create a larger unit. Didn't give it 5 only because there was a tiny dent on one.", 
    "easy to assemble and looks nice", 
    "Just what they needed in their college apt! Great quality and easy assembly. Even for the girls", 
    "Very basic, simplistic tv stand. Modern look with rustic wooden shelf. Good quality. Color of wood is slightly lighter than looks in pictures online.", 
    "Perfect fit for a small place", 
    "After moving, my old TV stand got broken. I wanted to get something completely different from the last one I had. I wanted a sleek, modern piece that wouldn't break my bank. I found this one on overstock and loved the way it looked! I received it yesterday from UPS. It was well packed and took me ten minutes to assemble. It's sturdy and the height is just right. It says it holds up to 50 pounds and/or a 42 inch television. My 50 inch television fit fine and without any collapsing. I love the open storage space on the bottom.", 
    "Great look, great value! I'm using it in my guest bedroom!", 
    "I ordered 2 of these, as my TV was wider than a single unit. I also wanted the look of a wall unit. I absolutely love the look of it. The fake wood is textured and looks nice. The frame is very sturdy. I love the versatility of the piece. You may elect to not put the legs on, if you want a shorter piece, or want to stack units. You could also remove the wood from the frame by loosening screws, if you want to insert something else. Looks more expensive than the price. I've received many compliments on this piece. Two of my friends want to order this.The piece is very easy and fast to assemble.", 
    "Great size, easy assembly great industrial look", 
    "does what it is suppose to", 
    "One of the easiest things I have ever assembled ! Perfect size for my small living space.", 
    "Quality made, looks good, just way smaller than I imagined. Make sure you check the dimensions.", 
    "This stand was perfect for the TV and it does not make look the room crowded. For me it worked perfect, easy to assemble and very affordable.", 
    "I am not a fan of this product. I bought it because in the pictures it looks nice and quality. In person it looks very cheap, especially amongst my more put together furniture. You can see all the wires when used as a media console which just looks tacky and as a coffee table the low quality would quickly be noticed. It was fairly easy to put together though. I ended up buying a more expensive console and am now selling this one. If you are looking for something on a budget, then I guess I'd recommend this. It's not terrible, just not the quality and style I was hoping for.", 
    "Product is as stated, but seems pricey for what it is. Could find something comparable at ***** for about ***", 
    "Blends in with my living room furniture at a great cost!", 
    "Great piece that was easy to put together. First time I'd used directions that literally LABELED THEIR PARTS - so helpful. My only hang up is that one of the pieces came out dented. With the black trim you won't notice...but still. Otherwise still a great buy.", 
    "Looks much different on line. Looks very cheap when it arriver at my home", 
    "Didnt have any problems assembling it by myself (22 year old woman with medium strength haha) took about 20 minutes. Good product!", 
    "Easy to put together took less than 10 minutes. I did not pay attention to the height so its a bit lower than expected but will work ok for my sons college apartment ."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Emmett-Gunmetal-Grey-TV-Stand/9079815/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9079815/Altra-Emmett-Gunmetal-Grey-TV-Stand-6cebd59f-a797-4d5f-9eb4-4a50c8cd03cd_600.jpg"
  ], 
  "description": "Update your entertainment area with this Altra Emmett TV stand.\nBuilt from metal and engineered wood, this stand offers a reliable\nconstruction that lasts for years. A metal finish gives this piece\na modern and luxurious look, and its slim profile enables this\nstand to conveniently fit in smaller spaces. Sonoma oak laminate\nshelves allow this piece to also work perfectly as a coffee table.Crafted from metal and engineered woodFeatures a metal finishGunmetal grey color and Sonoma oak highlight contemporary\n  styleSleek and slim profile suitable for small spacesWork as a TV stand and as a coffee tableSupports a flat panel TV of up 42\" and weight of up to 50\n  lbRequires assemblyIncludes one tableMeasures 18\"H x 40\"W x 17\"DStyleContemporary, Industrial, Modern, TransitionalMaterialLaminate, MDF, MetalTypeTV StandsFinishOak FinishAssemblyAssembly RequiredColorGreyNumber of Shelf2Weight CapacityUp To 50 Pounds"
}