{
  "name": "Altra_Arron_Lane_Soft_Grey_Bookcase_with_Sliding_Glass_Doors", 
  "price": "EUR 209.87", 
  "reviews": [
    "The item came with no directions so we had to download it online. Not a problem though. The problem was we didn't have all the hardware so we had to go to the hardware store. Then the holes weren't drilled in the correct spots so we had to make our own which made the sides crack. The only reason I gave it one star is that it looks nice and customer service at overstock was amazing", 
    "This is much smaller than I anticipated. The grey paint is also sprayed on, and it is apparent they missed a few areas during painting. It is made cheaply, but looks decent at a distance. I still fell like I overpaid for the quality of this item.", 
    "I put this in my kitchen. I love it!", 
    "The chip was disappointing but overall it is good for what we need it for. Not great quality but for the price it isn't bad.", 
    "Came with no instructions! Had to go on line and it was not all accurate. some of the bolts did not work and had to resort to screws. The finished product looks very nice."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Arron-Lane-Soft-Grey-Bookcase-with-Sliding-Glass-Doors/10986752/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10986752/Altra-Arron-Lane-Soft-Grey-Bookcase-with-Sliding-Glass-Doors-fd828a8e-6e41-49a1-bb07-fe3b1a5fb527_600.jpg"
  ], 
  "description": "Featuring an exceptional design, the Altra Aaron Lane Bookcase with\nSliding Glass Doors is a practical and beautiful addition to your\nhome. The elegant soft grey finish looks stunning when contrasted\nwith dark bold colors, or it can bring a subtle sophistication to\nyour home when paired with neutrals. This bookcase includes four\nshelves behind the two sliding doors. There is plenty of storage\nspace for books, personal items or to display decor. The sliding\nglass doors protect your books and keepsakes from dust.Includes: One (1) BookcaseThe versatile Altra Aaron Lane Bookcase with Sliding Glass\n  Doors is right at home in your living room or home officeNeutral soft grey finish brings a timeless style to any\n  roomFour (4) shelves, two (2) are adjustableBrushed nickel hardwarePainted MDF and particle board with solid wood feetAdditional dimensions are shown on functional drawing\n  providedFinish: Soft greyMaterials: Engineered wood, glass, MDF, PB, paint, woodWeight: 72.82 lbs.Weight capacity (top of unit): 60 lbs.Weight capacity (top shelves): 20 lbs.Weight capacity (bottoom shelf): 30 lbs.Dimensions (overall): 51 inches high x 31.75 inches wide x 13\n  inches deepStyleContemporary, Modern, TransitionalMaterialGlass, MDF, WoodFinishGrey FinishShelf TypeBookshelves, Display, Media Cabinets, StorageAssemblyAssembly RequiredColorGreyNumber of Shelf4Product FeaturesAdjustable Shelving"
}