{
  "name": "Altra_Black_Forest_Glass_Door_Bookcase", 
  "price": "EUR 179.76", 
  "reviews": [
    "I bought this hoping it can act like a media center for my 7.2 Yamaha Receiver, DVD player and cable box. The unit itself is beautiful and the glass is a great feature. If you plan on using this unit as a media center, be prepared to cut your own holes at rear for power but other than that, I highly recommend.", 
    "This arrived very quickly and assembly went great. Bought for my daughter and her family and it is just what they wanted. Very happy with my first purchase from Overstock.com and shipping was FREE.", 
    "Item shipped with a couple of scuffs, but hey, I wasn't looking for \"centerpiece\"!", 
    "looks cheap and the doors are made uneven! it is flimsy and I am very disappointing!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Black-Forest-Glass-Door-Bookcase/11038832/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11038832/Altra-Black-Forest-Glass-Door-Bookcase-5de6f1bb-401d-4a7c-89fc-c023ed91f75c_600.jpg"
  ], 
  "description": "Designed with two framed glass doors, the Altra Glass Door Bookcase is an elegant piece for living rooms, offices, dens and other areas of your home. Four shelves offer space for dozens of books or a mix of decorative accents. Two of the shelves are adjustable, enabling you to make room for larger hardcovers and other items. The doors are made with tempered glass, which is stronger and safer than traditional glass panes. Distinctive hardware on the doors gives the bookcase an antique look. Complete with a Black Forest finish, this beautiful bookcase will make a great addition to your home. Easy to assemble with household tools. Built in USA of U.S. and imported parts. Assembly requiredThe versatile Altra Glass Door Bookcase is right at home in your living room or home officeFor books and collectibles that deserve a more prominent showcase, the Altra Glass Door Bookcase is the ideal choiceStore books or display family photos and keepsakes on the shelvesDoors are made from tempered glass, making them strong and safeBlack Forest wood grain finish with antique style handles adds an instant upgrade to any roomTwo (2) sliding glass doors display keepsakes while keeping them protected from dustFour (4) shelvesTwo (2) of the four (4) shelves are adjustableAssembly requiredIncludes: One (1) bookcaseMaterials: Laminated MDF and particleboard with tempered glassFinish: Black ForestWeight: 80 poundsMaximum weight capacity for shelves: 40 poundsTop of Bookshelf is not designed to support any weightDimensions: 53.25 inches high x 29.56 inches wide x 15.6 inches deepShelf Type: Bookshelves, Storage, Media Cabinets, DisplayProduct Features: Adjustable ShelvingMaterial: MDF, Glass, Particle BoardStyle: Modern, Contemporary, TransitionalAssembly: Assembly RequiredNumber of Shelf: 4Exact Color: BlackFinish: Black FinishColor: BlackStyleContemporary, Modern, TransitionalMaterialGlass, MDF, Particle BoardFinishBlack FinishShelf TypeBookshelves, Display, Media Cabinets, StorageAssemblyAssembly RequiredColorBlackNumber of Shelf4Product FeaturesAdjustable Shelving"
}