{
  "name": "Altra_Fremont_Espresso_Audio_Stand_Bookcase", 
  "price": "EUR 115.51", 
  "reviews": [
    "I didn't know what to expect with a put-it-together yourself model, but it wasn't too difficult to do and is solid construction once complete. I can't say this will last 50 to 100 years, but it doesn't appear to be as cheap as most units in this price range. I expect this unit to last for quite a while and it looks very nice (especially for the price).", 
    "Does its job well. Sturdy material. Make sure you decide where you want the open side to be prior to constructing. It is best placed where the wires will enter. Using it as an audio shelf and it displays our dvd and games well with ample space for home theater and xbox.", 
    "I'm a 53 year old woman. I put this shelf together all by myself. I bought it to go in my home office for storage and display. The instructions were accurate and it is very heavy and sturdy. It also includes a bracket to secure it to a wall if you put something heavy on top. Overall, very happy with the unit.", 
    "We ordered two units for each side of our 50 inch TV. It looks amazing, it fit all our DVD's, and pictures of our family. The second unit came better packaged. A suggestion on the unit, consider allowing for power cords in the back. Pre-drill and covers, if person wants to use unit for show of accessories. Great storage space, looks clean neat. Love, love!", 
    "It definately serves its purpose. It's obviously not as heavy or sturdy as a real wood pier, but it looks better than most non-wood options. I'm ordering a second one for the rest of our movies/dvds. An interesting piece.", 
    "This was a lot shorter than I expected, however I most likely misread the dimensions. Still working on this piece in my house.", 
    "This product fits my needs in a guest room perfectly: the right style, color and size. Luckily, the damage that was done during shipping was limited to the rear corner (crunch!), so it doesn't show. However, it is *quite* disappointing to receive an item not in perfect shape. I blame the company that shipped it, as they should have wrapped this heavy item with greater protection--expanding foam product or double-reinforced corners, perhaps. Otherwise, I am pleased with the piece. It was not available locally or else I would have shopped in my home town.", 
    "This was a good buy, we love it. It fits nicely into the corner and doesn't take up a lot of room.", 
    "Not very big, but that's what I needed. It looks very nice.", 
    "very Nice, well built, easy to assemble, perfect for the little corner you need a shelf!", 
    "Sturdy, heavy construction. Surface doesn't allow water damage. Took a few minutes to put together, but overall a nice piece for the price.", 
    "It took 4 hours to put together, but, worth the effort. Perfect compliment for the office.", 
    "Easy to install, good quality!", 
    "Fits my shoes perfectly and very easy to put together. I will highly recommend it - plus good quality", 
    "Beautiful piece its different the design is exceptional, & when I move into my new house I'd have more space to justify a second purchase. In case the assembly instructions did not get included with this purchase as it was missing for me you can gone go online and find the assembly instructions that way.", 
    "the unit arrived with a hole in one of the shelves which is not surprising considering the flimsy, shoddy construction. I'm not sure what it was mad e from but what ever it was is just slightly more durable than making a shelf from pieces of paper. When I tried to get it back in the box to return it, the unit broke into pieces and I just threw it out. Don't believe what you see in the pictures or product information. It's obvious that they do not check the merchandise before they put it on the site for", 
    "Pretty nice and not difficult to put together.", 
    "I love this piece THANK YOU!!! Everything was perfectly labeled. The mounting holes all match up. Further, Although the company offered tutorial videos, it wasn't needed given the well written instructions, labeling and holes matching up. It's also very sturdy and quality excellent. The description and timing of delivery were both clear and expedient. Excellent purchase. (After looking at another storage unit, I am returning as this company and these pieces as I purchased 2) set the bar of what ease/quality for a DIY/need to assemble furniture. Thank you.", 
    "We bought this for our son's room as a corner table/bookshelf. It looks sleek & very handy to reach for all the stuffs located on the table.", 
    "overall decent quality but very unhappy to see one of the shelves had been smashed when it arrived :(", 
    "nice and sturdy. can't complain.", 
    "very good thank you! came quick and great quality! easy assemblyGREAT CUSTOMER SERVICE", 
    "This \"audio pier\" is a perfect way to utilize corner space. It is beautiful and sturdy. Once assembled, this piece looks exactly like the picture. Directions were easy to follow & assembly was not very difficult. Great buy!", 
    "Nice shelf but small/short.", 
    "got 2 of these to flank a sofa in an office room. You can have the opening on either side when you assemble, so they look nice opposite one another. They are hollow core, so you can't really put anything on the top that has any weight to it. They are also short, which actually works well in my room. I've had many compliments. One did come with a broken bottom shelf. It did take about 8 weeks to get the replacement piece. The customer service was very friendly, just the response time for shipping was slow. Although once we got them put together, we've been very happy. Had them about a year now.", 
    "Fairly straight forward assembly. Seems sturdy. It's about 20% smaller than I expected but it'll work.", 
    "Looks cute and easy to assemble. Smaller in height than looks in the picture.", 
    "This shelf works perfect for what I needed it for. The color is spot on with the photo, my only one dislike is I wished it was just a few inches taller.", 
    "As described. Perfect for audio equipment.", 
    "Extremely easy to assemble and looks great in the corner of my room. I use it to hold my entertainment items, such as Cable box, Xbox, Etc... It seems like a solid construction and has been holding pretty well. Delivery was quicker than anticipated, which is a plus.", 
    "i bought two of these. One for each side of the middle piece. The entire entertainment system fits perfectly in my space. The shelving provides plenty of space for storing photos, books, candles and other decor. I love everything about it!", 
    "Fairly Easy to put together. Not wood, but very solid! Thought the part that sticks out would be taller. And the shelves have more height. Other wise cool shelf", 
    "I Love it thanks it looks great in my home!!! Very happy", 
    "I thought it would be taller, but other than that it's great!", 
    "This item was a lot smaller then i imagined so it didnt work out for the spot i wanted however my daughter took it over and loves it", 
    "Solid sturdy great handy piece that went together easily. Well made", 
    "I put this together by myself. It took a little time but worth it. I just wished I looked at measurements closer because it's short.", 
    "The workmanship on this item is awful and so not worth money. It cannot be put together.. stripped holes.. Very disappointing!", 
    "Great looking corner unit for holding your useless chachkis and other useless nonsense you should've tossed long ago. I love the choicolate wood look and the fact all this junk is nicely displayed in the corner, I'm over the moon.....buy it, I hardly say that...go to it, Lilly.....go to it now.", 
    "This shelf went together very easily. It looks just like the picture; true coloring and description. However, there is one issue. There are no holes/cut outs for cords. As an audio cabinet you would think there would be a place to put cords through towards the back; Maybe I'm missing something there? Anyway, overall this is very nice for the price seems sturdy modern look and it can hold a range of items for storage/display. Overall I am quite happy with this purchase.", 
    "It would look good if it assembled well. Fell apart as soon as I tried to move it.", 
    "It's very nice looking, but the shelves are not adjustable and you cannot stand a book on either of the bottom 2 shelves. The wood is high quality, which makes it heavy. This is good for sturdiness, but can make it difficult to move when assembling.", 
    "looks good in picture, but much smaller in actual! some of the pieces came damaged. lucky its on the under side and with my husband's artist hand, he's got it covered pretty nice. but since we put it together already, we didn't bother to return, just hope it will hold up good for awhile. but if I have known of the quality I wouldn't have order it.", 
    "The product was exactly how it was described. It arrived faster than I expected. it was easy to assemble, directions were good.", 
    "Product came in damaged and I tried to get a replacement on line but couldn't get it to take. Called the number for a replacement and was told 7-14 days then was told the part had to come from overseas all toll that was a month ago. was give the number to amariwood or Altra and called that to find out it's not a working number. So all in all I'm done with overstock and anything to do with amaiwood or Altra", 
    "This is a very attractive corner unit. It can be built in either direction. Easy to assemble myself. Nice quality", 
    "This little item arrived a few days ago, I like what I see on line, as for the shelf I haven't taken it out of the box yet. I will whenever I get the time.", 
    "I've never see an \"audio pier\" that did not come with some sort of pre drilled holes to run wiring through. Ever. Does the manufacturer know that audio equipment has to be wired? Plugged in? I had to drill the holes myself, and the hollow construction coupled with the barely stronger than cardboard surfacing made it a complete mess. Also, the product is barely large enough to hold any actual audio equipment, my relatively small 2 channel Sony receiver does not fit, and the cable box barely fits. DO NOT waste your money on this junk."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Fremont-Espresso-Audio-Stand-Bookcase/7860170/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7860170/Altra-Espresso-Hollow-Core-Audio-Pier-55b57cab-6936-464b-91e4-2fc3f8d00589_600.jpg"
  ], 
  "description": "The Altra Fremont Audio Pier/ Bookcase features 5 open shelves, providing plenty of space for media devices, decorative items and books. The dark espresso finish compliments the modern style of this Audio Stand/ Bookcase. Altra Fremont Audio Stand/ Bookcase requires assembly upon delivery.Display and store your entertainment components on the Altra Fremont Audio Stand/ BookcaseUse it as an Audio Stand next to your TV for your gaming console, DVD player and speakers or use it as a stand-alone Bookcase to organize your books and keep your favorite pictures and decorations displayedFive (5) open shelves provide plenty of vertical storage for all your itemsItem is designed so that the open end of the shelves can be on the left side or right side, giving you unlimited placement options in your roomThe straight lines, modern look and dark espresso finish bring an instant update to any roomLaminated hollow core and particleboardAssembly requiredTwo people are required for proper assemblyMaterials: Hollow core, PB, paper laminateColor: EspressoFinish: EspressoWeight: 52.49 lbsDimensions: 52.44 inches tall x 17.52 inches wide x 16.34 inches deepAdditional dimensions are available on the functional drawing provided in the imagesStyleContemporary, ModernMaterialLaminate, Leather, WoodFinishEspresso FinishAssemblyAssembly RequiredColorBrownNumber of Shelf5"
}