{
  "name": "Altra_Carson_Espresso_Coffee_Table", 
  "price": "EUR 125.62", 
  "reviews": [
    "This table is very nice. A little shorter than past furniture, but all the cubbies make up for that. There is plenty of room to store things in baskets. I like that I can change the look of the table by simply putting in new color baskets/ totes. It was fairly simple to put together. It will take about 2 hours to complete, and there was 1 part of the instructions that you have to use common sense instead of blindly follwing directions. Watch the finished sides. All in all, 5 stars!", 
    "It went together easy, but only complaint is stickers are used to cover screw heads. Otherwise great", 
    "Lots of scratches looks like from manufacturer not shipping. Took over 2 hrs to put together many holes aren't predrilled big enough takes a lot of extra effort to screw in. 2 wooden pegs never could figure out where they go no hole where instructions said. Looks cheap compared to other Alta furniture I bought. Warning this is a very small coffee table. Looks bigger in pictures on website. It'll do but I'll probably get something else in a year or two. Doesn't look like the finish will hold up."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Carson-Espresso-Coffee-Table/11069678/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11069678/Altra-Carson-Espresso-Coffee-Table-25547358-86ac-4281-ad84-b0a63612fdfc_600.jpg"
  ], 
  "description": "Keep essentials close at hand with this Carson storage coffee table by Altra. Featuring open cabinets and shelves, this piece makes it easy to locate and retrieve magazines and remote controls or display decorative items. The espresso finish on this table provides a great complement to your traditional or modern decor.\r\nThis versatile furniture serves multiple functions, making it perfect for your living room or den. Use the generous surface of this coffee table to spread out work you bring home or respond to letters, or enjoy it as a perch for a snack and drink.Open shelves store magazines and remotesLower storage stores blankets, board games and knick- knacksSilver metal accents and hardwareOther pieces in the Carson collection available and sold seperatelyAssembly requiredIncludes: One (1) coffee tableMaterials: Laminate, MDF, MetalFinish: EspressoWeight: 49.28 poundsMax weight on top is 80 pounds and 20 pounds for bottom shelf\r\nCompartment Dimensions: 7.875 inches high x 11.2 inches wide x 15.69 inches deep \r\nDimensions: 16.6 inches high x 42 inches wide x 18.4 inches deepStyleContemporary, TransitionalMaterialMDFTypeCoffee TablesFinishEspresso FinishShapeRectangleAssemblyAssembly RequiredColorBlack"
}