{
  "name": "Altra_End_Table_with_Metal_Frame", 
  "price": "EUR 73.63", 
  "reviews": [
    "These end tables are great and such a good deal! I ordered two in the espresso finish and it looks very industrial-sheek. I was concerned that the wood would be of poor quality or that the espresso finish would not be deep enough. Fortunately, I was pleasantly surprised that the wood is solid/heavy and smooth, and that the finish is very rich in color. The metal pieces are also solid, not flimsy. Because I had to assemble two tables, it probably took me 45 minutes, but I also really did not want to scratch the wood or anything while putting them together. They look like they will last and go with any style, highly recommend!", 
    "The actual \"wood\" on these tables is pretty cheap, but still looks really nice. Since it's just screwed onto the metal frame (which is quite sturdy) it would be easier to switch out with some hardwood plywood or something if at some point I wanted something of high quality.For the price, though, awesome and I'm quite satisfied.", 
    "The tables arrived timely and were very easy to put together. Love the weathered look. Great value.", 
    "I Love these tables for the price easy to assemble", 
    "Outstanding assembly instructions and fit. Fit perfectly on both sides of my bed.", 
    "These tables serve their purpose as a table but the \"wood\" is actually just paper sticker type material stuck to a square. When I peeled off the \"Made in China\" sticker, it peeled the \"wood\" off with it!! Beware of what you're buying. The metal frame is surprisingly decent. Shame they couldn't manufacture the \"wood\" squares to match.", 
    "Perfect size for end tables. Color true to pics (oak). Easy to put together. Sturdy. Packaged well (be careful using blade to open). Another great buy from O.", 
    "The description says this is \"laminate\", so I expected a non-wood product, but I didn't expect this to mean it is basically a glossy, wood-grain-look decal placed on MDF. The edges of the \"decal\" are sketchy in areas and the \"wood look\" is very artificial. From the description, I expected a wood-like laminate product that had some texture and variation to simulate \"wood\". If you're not particular about quality, it's probably fine, but if you're wanting something more authentic looking, skip it.", 
    "I absolutely loved this table. It was easy to assemble and the quality of this product was amazing. I brought a table lamp with it and it makes everything look very well coordinated..!!", 
    "These are perfect for a basic end table. They took about 10 minutes each to assemble.", 
    "I really liked this table. Nice color, easy setup and very sturdy.", 
    "Very heavy and don't thing anything could strach it", 
    "These are study end tables that look exactly as they look online. I got two of them in the Sonoma Oak, and they are incredibly easy to put together! I wish they were a tad bit bigger, but overall, they are stylish and durable!", 
    "Amazing quality for the price", 
    "Cute table that is easily portable.", 
    "Well made. Great deal for the money.", 
    "Works great and looks goo!", 
    "Practical, moderna, esay to clean and match with my small living room.... Love it", 
    "Great value for the price. Looks great with my furniture and the size was perfect and very sturdy. I'm very pleased with them. And glad I bought them. Tres, OH.", 
    "Looks great with the coffee table and fits well in my living room. pretty solid for the price", 
    "It is easy to put together. A nice piece, just wish it were a littler taller.", 
    "Doesn't look like the picture when assembled, bad instructions on the item also", 
    "Nice looking inexpensive table", 
    "Not worth the price at all. We have had these for a VERY short amount of time and they're already scratched to bits. I'd love to show a picture. The tops have obvious white gouges in them, and they haven't even seen much use. The scratches are from coasters, we have no children and don't actually set things on them aside from drinks. I would never purchase these again. The $** **** side tables we had before showed less wear after 5 years of use than these had in 5 weeks.", 
    "This inexpensive table was a great solution in our great room!", 
    "Basic table. Sturdy frame. Easy to put together.", 
    "Nice and sturdy. Looks like the picture", 
    "Sure these arent top of the line and are cheaply made but they came just as they look in the picture and you cant beat the price!", 
    "The openness adds a visual of space....", 
    "Incredibly low quality. The quality control stickers peel off the top coat from this thing. And it came damaged.", 
    "love this table, nice color and sturdy", 
    "It looks nice, but I question the durability of the method used to attach the platforms to the frame. Again, for the price, I'm not upset.", 
    "Great end tables. Easy to assemble and match to almost anything.", 
    "Inexpensive, decent end table. Easy to assemble.", 
    "Easy to install, simple, cute", 
    "We needed a table for our sub woffer and our receiver. This table is perfect!! Close to the ground for the sound and wide enough to handle both!!Excellent but!!", 
    "True to picture, just a little too plain for my taste.", 
    "These look great in my bedroom and are just as pictured in my opinion. Putting them together is so simple and fast. Nice that u don't need a bunch of tools.", 
    "love this side table, very good value. Easy assembly, too. Definitely worth the $$", 
    "The wood is cheap looking, but that is to be expected for the price. Was easy to put together and the frame is decent quality", 
    "I've gotten lots of compliments on this piece. Easy instructions to put it together. It's extremely sturdy and beautiful. I got the matching tv stand as well.", 
    "It is sturdy and great looking", 
    "I bought this table to put my printer on. The dimensions were exactly what I needed. It was easy to assemble.", 
    "Very classy look... easy to assemble... very sturdy...", 
    "easy to put together, good deal for the price. looks nice with two", 
    "Sturdy, but the laminate top stains easily.", 
    "I wasn't sure if this table would look cheap in my living room. I decided for the price I would order it. I was so pleased when I received it. It is perfect next to my new sofa. Great price, and look fantastic.", 
    "We were really pleased with the look of these end tables. They were very easy to put together and look great, especially for the price.", 
    "simple good looks, great for minimalists.", 
    "\"They are nice, simple, tables.Easy to put together.Worked out just as I expected.\"", 
    "Great table - purchased two to use as night stands - LOOKS WONDERFUL. Easy to put together", 
    "Looks quite good, very easy to assemble and priced well.", 
    "It was easy to assemble, nice, and sturdy.", 
    "Great price and quality on this table", 
    "I was really surprised how easy it was to put this table together. And I hate assembling anything! I did it in about 30 minutes. It looks good, particularly after I put some decorative items on top of it. It was well worth the cost.", 
    "i got this table and put it together myself. it was not hard to put together. i think it took me about 15 mins. the table does its job as a side table. i love the height and how sturdy it is. however, i should have gotten the all black one to match our furnitures. instead i got the cherry/black color and it looks cheap to me. i would return it but i don't think i can, plus i am too lazy to take it apart.", 
    "Great table . Easy to assemble with clean lines that fits anywhere", 
    "perfect hight, super strong, matches my ottoman and all other blacks and greys i own, and it fits the leather serving tray with space to spare...best price for the product!", 
    "I wasn't expecting much for the price, but these look great!", 
    "I was pretty skeptical about these end tables. I was worried the quality would be horrible because they are so cheap, but I was pleasantly surprised! Two of these tables were exactly what I was looking for and half the price of similar tables. They are perfect for what we needed.", 
    "These end tables are a great buy for the price. I was looking at more expensive ones but glad I found these. Easy to assemble and are sturdy. The expresso wood top goes nicely with other furniture I have.", 
    "Great product ! Easy assembly and I love the look!", 
    "Cute table, very easy to put together. I ordered \"Sonoma Oak\" and it is much more grey than the picture, which looks like a light wood. It still works in our room though.", 
    "Great piece of furniture but the directions are horrible.", 
    "Very easy to assemble and is a good size. Nice aapearance too.", 
    "Went together very easily.", 
    "Purchased two of these, and very cheap tables. Easy to assemble, but definitely could have found something better!", 
    "A couple of the bolts nuts are off-axis and I had one that just would not go in all the way. Had to turn that side to the back. However, the table is VERY sturdy and looks good as well. I do wish the spec's had been a little more detailed; as it turned out there was too little room for the large item I intended to put on the bottom shelf despite the specs seeming to show there would be room.", 
    "but they are a little cheap and generic looking and dont quite look industrial in person", 
    "Decent. b\\Bought as temporary fix but I actually like them a lot. Easy assembly.", 
    "These are cheap Ameriwood put together tables. They are fine for my needs (a 3 season room). I wouldn't recommend them for inside living room/family room furniture.", 
    "Picture is NOT a true depiction of what this table looks like. Trust me, DONT BUY this table."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-End-Table-with-Metal-Frame/9054445/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9054445/Altra-End-Table-with-Metal-Frame-da8219bb-bf9f-4e08-a4e7-266cb72c1579_600.jpg"
  ], 
  "description": "Complete your home with this modern end table by Altra. Made with a strong metal frame, this end table is sturdy and ideal for holding a plant, lamp, books or beverages. Ideal for use in smaller areas, the square shape of this table conveniently fits a variety of spaces.Constructed with paper and metal frame for strength and durabilityChoose from multiple finishes for the look that best suits your homeCompact size allows for convenient positioningWood grain finish looks sophisticated and modernIdeal for use as an end table or accent piece in your living room, bedroom or officeEnd table measures 20.87\"H x 20.87\"W x 20.87\"DStyleModernMaterialLaminate, MDF, MetalTypeEnd TablesFinishCherry Finish, Espresso Finish, Oak FinishShapeSquareAssemblyAssembly RequiredColorBlack, Brown"
}