{
  "name": "Altra_'Rade'_Black_Oak_Coffee_Table", 
  "price": "EUR 157.01", 
  "reviews": [
    "Was very pleseantly suprised by the quality of this table, for the price I was nervous it might be very lightweight and cheap wood but it really has a nice shine and look to it. Very sturdy. And he metal on the bottom is very shiny and modern, not cheap looking at all. Defnitley suprised me with the quality for the price. My boyfriend put it together in probably a half hour with minimal assistance from me. Great deal and great looking table !", 
    "It's obviously difficult to judge the overall quality & *look* of something like this piece of furniture by just reviewing a few staged photographs, but I thought between the price & Overstock's return policy, the risk of receiving something flimsy and poorly made would be worth it...I'm happy to report that I'm very pleased with this purchase ...It's obviously not a *high-end* piece, but it's well made and sturdy...easily and quickly assembled...What I especially like is that being an artist with very eclectic tastes, the table fits right in very nicely with some antique and mid-century modern pieces, and while not terribly large, it's well designed and easily accommodates typical coffee table items while still looking quite stylish...Also, while so far, all I've had to do is a quick wipe with a feather duster, but it appears wiping off smudges, food crumbs, etc. won't turn into a major cleaning chore...However, i'd suggest you get in the habit of using some kind of a coaster under anything where moisture will form as added protection... All in all, I'm real pleased with my table and can't think of anything negative to mention...I also take these online reviews very seriously, and always appreciate folk's honest opinions, and that's what I strive for in my own reviews...", 
    "Pefect table for the money. I put this in my daughter hangout room in front of her white leather sofa and it is perfect. Screw the legs on and you are done!", 
    "It look better in the photo then I person", 
    "Great Table, great size and I am in love with it! Took me around 20-25mins to put together and easy directions to understand.", 
    "It is a simple coffee table, but we like the multiple cubby holes for storing things, and the two level design. It works well in our space, and it looks just like the picture.", 
    "Bought this and recently received it without any issues. Assembly was a breeze and the finished product is beautiful. Even though it's MDF it's solid, heavy, and extremely stable. Way more value than what I paid for it. I actually just bought the matching console table and TV stand because of the high quality of this piece. Definitely recommended!", 
    "It really is an attractive table. One thing that was hard to tell in the photo is that the edges are beveled which makes it look fancier. You are going to be doing a lot of hex wrenching to put it together, so be prepared. It helped to have a second person when putting it together. The side shelves are deep enough for a pretty large book or any standard magazine.", 
    "I love this piece because of the many compartments to store things like placemats, books, magazines and even my laptop! And I love the black wood and chrome legs!", 
    "good quality and would recommend it to friends", 
    "great item, easy to get it together, i love it!!", 
    "Nice fit! Just like the pic", 
    "I didn't expect much but I did expect it to last longer than a couple of months.", 
    "This table is a little small and very heavy for its size. The cubbies are perfect for storing magazines and the remote. Be careful because the edges do chip easily. Overall, it's nice looking and a good value.", 
    "arrived promptly. Easy instructions and assembly. Looks nice.", 
    "I bought this coffee table for my son. It is really nice and versatile with extra storage space. Perfect for a small apartment.", 
    "Love this crisp, modern table with plenty of internal storage to put books, remotes, etc. Simple and clean.", 
    "Very good item. I like it!", 
    "Simple but contemporary and elegant. It looks awesome in our tv room. Love the little shelves also. I can finally find my remotes every time.Easy to put together. My 5 yr old son actually read the instructions and did all the work. My husband didn't have to do any of it except lifting...", 
    "nice table, looks exactly as pictured", 
    "Pretty simple table. It's a bit on the smaller side. Does the job and holding up well so far.", 
    "easy installed.looks great", 
    "made of cheap pressed wood, but looks good and can be put together easily.", 
    "LOOKS EXPENSIVE BUT NOT! EASY TO PUT TOGETHER I DID IT BY MYSELF AND TOOK LESS THAN 45 MINS. SOLID, STURDY AND ADDED JUST THE LOOK I WANTED FOR MY LIVING ROOM! HIGHLY RECOMMEND!", 
    "Table was very easy to put together. Looks perfect with the grey couch that I purchased.", 
    "It was easy to put together, BUT, one of the legs, The support bolts that are in the wood that your screw into to keep the leg on, they came out, it would not hold the leg. I had to glue the screws in and glue the leg down. Other than that. Looks nice", 
    "We love this table. It's exactly as pictured online and even better in person.", 
    "Just loving this coffee table! We were looking for something with storage, but I don't like the tables with a shelf near the floor because I sometimes like to sit on the floor with my legs under the table. This is perfect!", 
    "I love this table. It has lots of fun space to store stuff.", 
    "Of all the furniture I have assembled, this was by far the easiest and probably the sturdiest. Love the \"mid-century\" look.", 
    "I love this table. I am a newly self-proclaimed DYI-er. And this table was super easy to put together.", 
    "Great quality, easy assembly.", 
    "Table came just as pictured but ours had a scratch on the black wood and the legs weren't even so it wobbled a little. It could've been our floors but overall, we returned the item as it was just average looking and didn't go with our living room décor.", 
    "This table was exactly what I was looking for. Super easy to put together and seem very sturdy.", 
    "Had a small issue with screws", 
    "Exactly what I wanted. Easy to assemble and bonus of great storage space.", 
    "Has the right look at a good price and seems durable.", 
    "Larger than I expected, heavy, the top seems to be real wood. I wasn't sure about the table at first. My son put it together for me and he absolutely loved it from the start. It has grown on me, however, and I like it a lot. Quality product, fairly simple to put together. Another satisfying purchase from Overstock.", 
    "Easy to assemble looks great", 
    "I bought this table for my son's new apartment. IT's a little smaller than I thought it was going to be but goes great in his little apartment. Nice and sturdy and easy to put together.", 
    "A very nice, solid, stylish table.Not to big, or to small.Went together very easyWould recommend !", 
    "After days of searching for a coffee table online and in the stores, I settled on this one. I totally love the style and it is very affordable and easy to assemble. I put it together myself and with ease and I loathe assembly of furniture! The table is sturdy..and looks great. It is easy to match with other dark colored furniture.", 
    "I have assembled many 'flat-pack' furniture items over the years, but this coffee table stands supreme in its quality, finish and strength. The hidden cupboards are very useful. Congratulations to the designer and builders.", 
    "The assembly was a breeze however I was hoping this table was going to be longer as its showcased in the picture. Nevertheless it's a table that fits with our current set up of our living room.", 
    "Love it! Great quality and looks great. The one thing that was annoying were the instructions had to wing it since none of the pieces were marked but other than that I love it.", 
    "It was very easy to put together and very very sturdy. Love it.", 
    "We ordered two of these...really liked the style, color, and size. The bad: Opened only one box...it was undamaged on the outside, however the top and bottom of the table had crushed corners, making the table unusable. Did not open the second box, fearing the same. Returned both items. The good: Arrived quickly, all components appeared to be included in the box. Easy process to produce a return label with Overstock and drop them off at UPS. Quick response from Overstock on a refund once the tables arrived at their location. This is my first bad experience after many years of ordering from Overstock, I'll chalk it up as bad packaging on the production side."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Rade-Black-Oak-Coffee-Table/8202536/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8202536/Altra-Rade-Black-Oak-Coffee-Table-f2f2b4db-4815-4b85-9c49-f2efce81b87a_600.jpg"
  ], 
  "description": "Use the clean lines and spare construction of this modern wood\ncoffee table to accent your living space or evoke mid-century\nglamour. Finished with black oak, the large tabletop surface\nprovides the perfect place to display your decorations, while an\nopen shelf underneath gives you space for storage. Silver-tone legs\ncomplete the modern look of this black coffee table. Materials: Engineered wood, metal, paperFinish: Black oak/ silvertoneDimensions: 17.1 inches high x 39 inches wide x 23.62 inches\n  deepStyleContemporary, VintageMaterialMDF, Metal, Oak, WoodTypeCoffee TablesFinishBlack FinishShapeRectangleAssemblyAssembly RequiredColorBlack"
}