{
  "name": "Altra_Carson_Open_Storage_Coffee_Table", 
  "price": "EUR 93.66", 
  "reviews": [
    "love this table. color is great and matches with everything. lots of use for space and decorations. and sturdy! a must with children! :)", 
    "It's a nice coffeetable. They should also sell the baskets that go in there, that gives such a great look. It's hard to find those & with out that it looks incomplete.", 
    "This table would have been perfect except, the laminate lifted, the screws and legs did not fit properly.", 
    "This is a cute coffee table for smaller spaces. It's exactly how it looks and was easy and quick to put together, and this is coming from someone who finds everything difficult to put together.", 
    "Excellent, fantastic for my new decoration", 
    "looks great, very easy to put together took about 15-20. Great deal for the price", 
    "nice center piece for downsizing", 
    "good coffee table. I have not use this coffee table since I bought it; but I of the opinion that it will serve the purpose for which it was purchased.", 
    "best coffee table, lots of storage space in it. It is a pretty short table not as tall as it looks in the picture but it's what I was looking for!", 
    "This table looks great and was very simple to assemble. The open storage areas and the shelf provide plenty of room for remotes and magazines.", 
    "Daughter likes her table but I was a bit disappointed with the quality.", 
    "For the value of it, I'm enjoying to have it in my living room plus I did use it as a TV table stand. I love it.", 
    "sturdy and well built, perfect for my Den", 
    "This table is really nice, and a great size. I am going to get the baskets to give it that great look in the photo", 
    "The top bubbles up if you don't use a coaster for drinks", 
    "It's an okay coffee table but there are many better ones out there if you spend a little more.", 
    "Note, it does NOT come with those adorable baskets shown in the picture.", 
    "Awesome coffee table for the price", 
    "Cant complain the quality for the price. Could have been more strong but it is good enough.", 
    "Very happy with this purchase . I was looking for a solid coffee table with nice staying and I found it in this one, great price and easy to assemble", 
    "A pain to put together but it works perfectly if your space is limited.", 
    "I like a contemporary design. excellent for the price.", 
    "Easy to assemble. It is a good looking table, but it is rather small.", 
    "This is not a bad table, just that we have extra holes that were drilled that do not need to be there, unable to hide them!", 
    "Product arrived promptly exactly as described. Easy to put together. Great price. Looks very nice in the living room.", 
    "easy assembly great fit lots of storage. the tops seems some what water proof", 
    "This item is the worst piece of furniture I ever owned. The construction of the piece damaged it, the materials are sub-standard, it is damaged from paper moving across it roughly - do not buy this unless you need something for target practice.", 
    "Awesome just love it. Wish they had a tv center like it.", 
    "I have enjoyed this end table and would recommend it to any of my friends! Two thumbs up!", 
    "I bought this for my sons room. The room is oversized so he also has a seating area w/couch and this table. It looks modern. I think its more suitable if you have a smaller living room or maybe for office or bedroom", 
    "coffee table looks great...a little trouble on assembly as some of the predrilled holes didn't match up. good for price though.", 
    "Nice look. Quality ok. Easy to assemble. Top already showing wear, but to be expected given the cost.", 
    "We didn't want to spend a lot of money but we wanted something that didn't look cheap and this table filled the bill. It was not difficult to build. It was sturdy and was the right size for our apartment.", 
    "Lovely table classy sturdy and love the design", 
    "Was easy to assemble but a few edges were cracked and scuffed up from shipping.", 
    "For the price I believe it was a good buy. I was expecting more cherry wood it is black. No glass top but I think makes it better for me. Sturdy and just place beautiful. Easy assembly. Altra Carson worth a buy.", 
    "It's a cute table. However it needs a glass top because anything you put on it shows up as streaks. Easily cleaned but also easily dirtied.", 
    "Exactly what I expected. Holds well, looks good. Cleaning the surface is a bit more involving if you are particular about wiping off handprints as well.", 
    "It is small and compact which is why I got it. Easy to put together. It came with one small scruff but I don't even notice it anymore. It is that painted plank board so it won't be a forever table. My main downfall would be that it collects dust and is very visible. I have to dust it 3-4 times a day, but I have 2 HIGHLY shedding dogs and that pretty much goes for my whole house, you just see it mostly on the table.", 
    "We absolutely love the size and style of this coffee table. The only downfall is the top scratches very easily. We have a 7 year old and it wont last through her childhood.", 
    "This coffee table is awesome. I love the black and brown color combination and there is a ton of storage space nicely divided into compartments. The assembly instructions were easy to follow and the construction is sturdy. I'm very satisfied with this product.", 
    "Terrible quality. I spilled a little bit of water on it and by the time i got paper to wipe it, there was a bubbled mark on it. Now it's ruined and I just got it.", 
    "just be weary, don't hit the dowels with a hammer..they will go right thru the wood..just glue them in..other wise nice product. also would be nice if they sold the wicker baskets in them they are impossible to find.", 
    "My mother loves it. It was a Christmas present. It didn't come with instructions. It's also very sturdy.", 
    "I purchased the coffee table and matching end table for my niece as a Christmas gift. Style is nice & very appealing. We put the end table together with no problem. Looks great. We started to put the coffee table together & noticed that the box appeared to have been opened then resealed. We soon found out why. It must have been a return item because all the hardware was missing along with 2 of the 5 short legs for the base. Overstock customer service was great and very helpful. However this item is OUT OF STOCK! This item should not be shown as available as the manufacturer advised they did not know when the item would be back in stock. We were not able to get any of the missing parts and my niece is very disappointed as we now have to return the coffee table. Both my niece and myself are sad that we cannot complete the set.", 
    "just what it looked like ez to put together very sturdy", 
    "Great quality for the price! I love multi functional furniture and this coffee table really fits the bill. Great for my \"theater room\"!", 
    "love this coffee table, its a great size for my apartment. the only negative thing I have to say about it is that it was missing a piece and one of the sides was a little scratched. other than that, its a very nice coffee table.", 
    "This is a nice, basic coffee table that my daughter picked out for our teen hang out room (formerly the play room). It's a bit modern looking, and has lots of storage. It feels sturdy. It must be easy to assemble, because my 13 year old did it herself.", 
    "This is a very nice coffee table. It is sturdy and has lots of storage space. I bought the matching end tables and those are also very nice. It was easy to set up and took about 30-45 minutes.", 
    "I had to return this because pieces were missing and it would not go together. Returning was very easy and i was credited very quickly!", 
    "This table came all scratched up and was not shipped the best. I didn't have time to bother shipping pieces back and forth to the manufacturer as it would have been a huge hassle and I needed something soon. The table looks nice from far away but up close there are a lot if imperfections. At least the instructions for assembly were easy to follow. The table was also relatively low in price. Overall, it's okay.", 
    "The coffee table looks really nice and the price is good. Safely packed, arrived in 3 days and very easy to assemble. I would totally recommend this product.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Carson-Open-Storage-Coffee-Table/7924198/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7924198/Altra-Carson-Open-Storage-Coffee-Table-2a5566a2-14cf-48f4-b1f8-af8bc85917e8_600.jpg"
  ], 
  "description": "Keep essentials close at hand with this Carson storage coffee table\nby Altra. Featuring open cabinets and shelves, this piece makes it\neasy to locate and retrieve magazines and remote controls or\ndisplay decorative items. The black and cherry finishes on this\ntable provide a great complement to your traditional or modern\ndecor.Particle board, metal, MDF and laminate materials supply\n  durabilityBlack and cherry finishes with silver hardware and silver\n  accents elevate your decorOpen lower storage cabinet and shelves for easy access to\n  your belongingsMeasures 16.6\" H x 42\" W x 18.4\" DStyleContemporaryMaterialLaminate, MDF, MetalTypeCoffee TablesFinishCherry FinishShapeRectangleAssemblyAssembly RequiredColorBlack"
}