{
  "name": "angelo:Home_Carissa_Upholstered_Autumn_Grey_Floral_Arm_Chair", 
  "price": "EUR 400.68", 
  "reviews": [
    "This chair is beautiful. Love the nail heads and fabric, however, it is SMALL. It looks like it would belong in my four year old daughter's room. It's very short and narrow.", 
    "The chair is true in color as the picture but is half the size of my other chairs. Make sure and look at the measurements to see if it will work in your space.", 
    "This made a beautiful accent addition to my bedroom. It was just the perfect size to put in the corner near my bed without taking up too much room.", 
    "I was nervous to buy chairs online but the color was exactly what I was looking for. Love the nail head trim. Chair is a little stiff but will be rarely used in the living room and look is more important than comfort."
  ], 
  "link": "http://www.overstock.com/Home-Garden/angelo-Home-Carissa-Upholstered-Autumn-Grey-Floral-Arm-Chair/9719889/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9719889/angelo-Home-Carissa-Upholstered-Autumn-Grey-Floral-Arm-Chair-c5d0e698-5a9f-4a85-9a0d-12eed4ae1e02_600.jpg"
  ], 
  "description": "The modern Carissa floral arm chair features deep arms accented with a pewter nail head trim for timeless design and classic style. Perfect for the living room, dining room or office, the scale of this chair coordinates well in any room environment.Set includes: One (1) arm chairMaterials: Mixed hardwood frame, polyester upholsteryFinish: Dark espressoUpholstery color: Grey, Orange, Yellow, CreamPattern: FloralSeat dimensions: 18 inches high x 19.5 inches wide x 20.5 inches deepOverall dimensions:31 inches high x 31 inches wide x 29.5 inches deepStyleModern, TransitionalMaterialFoam, Polyester, WoodChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorGrey, Orange, White, YellowFurniture PatternFloral"
}