{
  "name": "Anna_Grey_White_Chevron_Accent_Chair", 
  "price": "EUR 346.53", 
  "reviews": [
    "I wanted a chair for my living room that was on the modern side. I had just repainted that room and the color matches really well. Only two complaints about it. The pattern on the chair seat doesn't align with the pattern on the seat back. And be prepared to have someone else help you to put it together. It's not easy! But I like the way it looks in the room...gives it a whole new feel. Would I buy another one? Probably!", 
    "I LOVE THESE CHAIRS . I HAVE TWO AND EVERYONE COMPLIMENTS THEM AND ASKS WHERE I BOUGHT THEM FROM! I HAVE THE GREY AND WHITE AND THEY ARE AWESOME .", 
    "Great value for the price. ;These chairs work well with my bedroom décor. Not to big but just right for a reading nook. I originally only bought one because I thought it might be too big for my bedroom corner. I loved it so much I immediately ordered another one and made a conversation nook. I traded out the pillow with a yellow and white one which went better with my décor. Loved it.", 
    "I like how this looks expensive, but it wasn't! It arrived in perfet shape & it was pretty easy to put together. Not the most comfortable chair, but not too bad. It will serve its purpose well as a decorative chair & extra seating when extra guests are around.", 
    "Nice accent chair for the price. Looks nice, easy to put together, a few pieces of hardware missing, went to Lowe's to get the missing hard ward. Otherwise I like the accent chair, looks good where I have placed it.", 
    "I really like the chair (I bought 2) but I don't know if I'm mad in love with them. The fabric is a little on the cheaper side but then again for the price I think they are probably good value. Easy to put together, comfortable and nice looking. I've seen others for much higher prices but they probably have a nicer fabric.", 
    "Very comfy, assembling very easy, firm, exactly what I needed and what is in the description, love them, I both two of them for my living room, they are enhancing the look of it and making it look modern. They are coming with the accent pillow also.", 
    "Good product but a little difficult to put together on your own. Nice fabric and the two chairs I bought look great. Bigger than I expected", 
    "This chair is adorable. Using it as an accent chair. Have gotten so many compliments on it.", 
    "I love these chairs! They are very comfortable, and easy to put together. The pattern is very modern and look exactly as pictured. The quality is great for the price. I am very pleased", 
    "This chevron print is so popular right now and it's hard to find a piece of decent furniture with a chevron print at a great price. I was so impressed when I received this. Whoever designed this chair knew what they were doing. Love the color, print, design etc. This really ties my office together and was what I was looking for.", 
    "The chair is bigger than I thought but its very comfortable versus just an occassional chair that is used for display. The color is a steel gray, but with the white background it makes the gray seem lighter in color. Its light in weight so I purchased some rubber cups so the chair doesn't move too easy on my hard floors. If I get a larger carpet those won't be needed.", 
    "Love it, very easy to put together-I am newly divorced and have always done things myself so it was easy! I love ANYTHING Chevron stripe and the grey just goes with my couch and loveseat!!! Don't hesitate.......I have been watching ads and stores and this is a good buy and quality!! and the pillow included was a bonus-you don't get that in stores!!! .", 
    "This chair was actually bigger than I expected. The seat is deep and very comfortable. It was really easy to put together and looks expensive.", 
    "Love this chair! I bought it for our guest room & couldn't be more pleased. It took about 20 minutes to unpack & assemble.", 
    "Great chair! We just renovated our upstairs and I wanted a modern, sleek chair that added pattern without adding color. It's perfect. It was very easy to put together and it's sturdy. Every single guest compliments it. I love this chair.", 
    "This is a great looking chair and very comfortable. We were looking to replace a chair in our living room with an updated design. We figured for the price we couldn't lose. The chair exceeded our expectations.", 
    "This chair is comfortable and goes so well in my living room.", 
    "It is exactly what we expected and it fits well in our living room.", 
    "Cute chair - adds some zing to any room...fun!", 
    "It's very very nice but not sturdy", 
    "I received this fast. And when I got it it was so easy to put together. This is my favorite piece in my living room. I love it. Its so comfy. The lines are light gray not dark which is perfect.", 
    "Pretty but not comfortable. If it's something you plan on sitting on all the time I would not recommend", 
    "It was a little awkward to put together but not difficult. The pillow that came with it, at least for me, was discolored on one side - like a sun-faded kind of look but it doesn't bother me so much since it's only on one side. The 4 star rating is basically because it is very stiff to sit in. I wish it was a little longer, more like a chaise? Or maybe if it could come with a foot rest. Other than that it is a pretty accent in my living room.", 
    "This chair was larger than I expected. I say that because I have been looking for awhile and any other chair in the same price range was really small. The color is true to the photo. It is a very nice grey color. It was easy to assemble and fairly comfortable. It fits well in my little office!", 
    "my mistake buying this type of chair with a dog in the house. they look awesome but get dirty so quickly and are impossible to clean.", 
    "We love it. It's high quality, beautifully made and really comfy.", 
    "Beautiful chair perfect size for avg size apartment, gray&white is so crisp & clean looking, zig zag pattern is gorgeous", 
    "Gorgeous,what can I say so happy with my chairs.people asking where did you get those chairs.easy to assemble,thanks overstock great job.", 
    "This was very easy to put together and has been a great accent to a newly remodeled bedroom", 
    "This chair was the perfect addition to my living room. Very comfortable. I love it.", 
    "I am happy with the construction of this chair. The colors are true to the picture - grey and white. The reason I am giving 4 stairs instead of 5 is that the chair is a bit lower to the ground than I like. I may go to Home Depot and see if I can swap out the legs to give it a bit more height.", 
    "This chair is beautiful. Goes beautifully with my two tone gray walls. I get compliments from everyone who comes in my house. Was very easy to assemble.", 
    "I bought 2 of these for my living room. They are much bigger than I expected and are substantial in size. They don't weigh very much and don't have a ton of padding. But they look great.", 
    "Love this chair, added it to our newly remodeled Master Bedroom. Perfect for this space.", 
    "Paired two with white round table and Safavieah dark gray rug. They are perfect. Nice and wide. I put a pillow behind my back so I don't sit all the way back. Don't use them everyday so it's not a problem.", 
    "This is a good looking chair. I bought two to go in the little landing area at the top of the stairs but two don't fit because the chair is so large. I gave one to a friend who loved it and put it in the corner of her master bedroom. I put the one chair on the landing with a cute side table and magazine rack and a pouf ottoman at the foot of the chair. This chair would be great in a kids/baby room as well.", 
    "Comfy, cute accent to our bedroom. Very happy. We had a little trouble figuring out the angle of the front legs...but otherwise very easy assembly.", 
    "These are some great accent chairs to add to any living room. Just keep in mind these are accent chairs, not a pillow top mattress so there is some firmness to them. Exactly what I was looking for!", 
    "The chair was larger than I was expecting and it was a good surprise. It was packaged well and I was able to put it together easily without a hitch. I keep receiving compliments form how good it looks.Fits my living room so well. I love it.", 
    "Easy to assemble! Perfect for the use for which I ordered it (home Staging). The scale was better than I thought so I was very pleased with the product. We had a little glitch with wrong legs sent, but the company mailed out new legs overnight so I had them in time for my job. Would order through them again!", 
    "I ordered 2 of these chairs to complement 2 other armchairs I purchased for a sitting room. 2 months later and the first chairs I bought aren't delivered by my Overstock chairs came lightning fast! One more reason to love the O. Anyway, back to the chairs. They're easy to put together. My word of advice is to thread all of the screws in a bit before tightening any of them. Makes it much easier. I'm still trying to figure out which way the legs should face but not at the top of my priority list. The pillow is firm and great. Use it to slide up a little higher on your back because this chair is kind of a lounger. As for my review title - this is a wider chair and good for big bottoms. As I told my sister, I call this my \"no one looks fat sitting in this chair!\" chair.", 
    "The chair looks very modern and high quality. It is very comfortable. Only the actual chair is bigger then I felt form the picture. A bit too big for the space I intend to put them.", 
    "Perfect accent chair in my newly remodeled guest room. Crisp white and medium gray chevron...just what I was looking for! Somewhat longin the seat for the average height person, but the pillow helps. For a guest room where it won't be used daily or for long periods of sitting, I think it is perfect! Couldn't be more pleased!", 
    "I bought this chair for the bedroom and it is stylish and comfortable. It went together quickly (under 20 minutes) and without problems. It's a good size chair, I'm small and my husband is a larger man and we both found it comfortable. I love the pillow. Not only does it add style but makes a great arm rest for reading. The picture online was very accurate.", 
    "THE CHAIR HAS TO BE ASSEMBLED THAT IS THE ONLY PROBLEM AM HAVING AT THE MOMENT. BESIDES THAT THE CHAIR IS EVERYTHING THAT I EXPECTED.", 
    "I received the product 3 days after I ordered it and it was just like the on-line picture. The fabric was of a good quality and very soft. I was worried that the chevrons would not match up after I read another review, but was thrilled to find that they were perfectly matched. The frame and legs seem to be sturdy. It came in two pieces and I was able to assembly it in 10 minutes. The chair is for my bedroom, so I imagine it will last for many years. It adds a very nice touch to my bedroom, without costing too much. I love it!", 
    "I love them. Great chairs for the style, look, comfort and price.", 
    "You get what you pay for. They really are cool chairs--large overstuffed and firm. They can hold almost 2 butts a piece. But can a functional chair really be this cheap?.....one of my pillows came with a big red line sewn into it (have to flip the cushion over). The other chair had a wanky leg that couldn't fit into the pre-drilled hole no matter what I tried. Had to use a chisel and screwdriver to really redo the framework. The leg is attached....but it isn't very solid. Luckily, the chairs are so low to the ground that you won't get hurt if the chair collapses underneath you.", 
    "fun and functional, and actually comfortable. easy to put together as well. will last the few years until i get tired of chevron :)", 
    "These chairs are really beautiful and imho even better in person than they look on the site. They are the perfect size to fit into my small living room, but you can still sit comfortably with your legs crossed or beside you on the chair. The chairs are sturdy and the assembly was easy. The only problem is the beauty of these chairs means I now need to replace my sleeper sofa which is looking ugly as sin in comparison.", 
    "These chairs are super cute and easy to put together. My husband did it by himself in about 10 minutes. They add alot of character to our living room and are comfortable too."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Anna-Grey-White-Chevron-Accent-Chair/7009146/product.html?recset=5065fc47-d070-48c3-94d0-44333334f652&refccid=5NYNIZSMD7H3SW2KT6ARHCPQ3Y&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7009146/Anna-Grey-White-Chevron-Accent-Chair-064a9740-a9a5-44bb-a87e-80ba3a0e8a7b_600.jpg"
  ], 
  "description": "This high-back accent chair brings a stylish and contemporary look to any room. Supported by sturdy hardwood with a bold espresso finish and upholstered in soft fabric with a fashionable gray-and-white chevron print, this contemporary accent chair is durable and comfortable enough for everyday use. The included back pillow adds extra plushness.\nSet includes: One (1) chairColor options: Grey/white Chevron print Materials: Fabric, solid wood legs, solid wood and plywood frameFinish: EspressoUpholstery color: Grey and whiteUpholstery fill: FoamSeat dimensions: 28.5 inches wide x 24 inches deep x 17.5 inches highDimensions: 35 inches high x 28 inches wide x 34 inches deepStyleContemporary, TransitionalMaterialFabric, Foam, WoodFinishEspresso, White, WoodPatternPrint, SolidChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightHigh Back, StandardColorGrey, WhiteFurniture PatternChevron, Print"
}