{
  "name": "Ave_Six_Kendall_Tufted_Chair", 
  "price": "EUR 111.10", 
  "reviews": [
    "I am so happy with this chair. The detail in the tuft tacks is very dramtic and pretty. I bought the plain cream color, yet it is so very elegant., Real nice accent for the office I set up.", 
    "This lovely accent chair is perfect in a corner of my dining room. The color (floral) is really nice and matches picture. It was pretty easy to put together for this sixty year old woman.", 
    "I would buy these again in a heartbeat! They look lovely next to the new chess table in our living room. They were easy to assemble and look much more expensive than what I paid for them.", 
    "This is a really pretty chair. The first chair I ordered had to be returned because one of the legs was too short causing the chair to rock. I ordered a second chair and I was very please that the chair sat level after it was assembled.", 
    "Quite pleased with the first one we ordered, so decided to order another identical with a chair-side table to go between. Assembly directions COULD BE a little clearer but not so complicated of an assembly that it couldn't be figured out.", 
    "The chair looks really nice and elegant, and appears more expensive than it was. It is also a very comfortable chair. However, the assembly was difficult and frustrating for my very handy husband and me, which is mainly what brought our rating down to three stars. The bottom of the seat has a Velcro panel to hide the bolts holding the chair together, which is nice. The holes made in the fabric where the bolts need to go through are too small and had to be cut larger. Two of the legs were shorter than the other two, so the chair rocked on the diagonal until he pried the plastic feet off the bottoms and added a 3/16\" rubber washer between each short leg and its foot to even them out. It took over an hour and countless bad words to put it together, but now that it is assembled it's a beautiful addition to the room (den). We have the lotus pattern which is a Jacobean design and coordinates with the oriental rug and drapes in the room. If you are handy like we are, this is worth the price (especially on sale) and the effort. If you're not very good at assembly, you will be better off with another option.", 
    "I had lots of trouble with assembly as I couldn't get the screw holes to line-up. Once assembled, I love the looks of product. Also, I bought for my ding room table. One is unable to cross legs when seated as seat height is 2\" higher than other chairs.", 
    "Love this chair. Fast delivery. Quick and easy assembly. Very sturdy. Colors exactly as pictured. I couldn't be happier!", 
    "Bolts and nuts were loose in one carton (never did find one locking nut) but after learning to put in the middle bolt first, came together okay. More difficult than IKEA furniture though. Looks great and fairly comfortable so overall I am very pleased.", 
    "I was asking a lot when I searched for dining room chairs to compliment my Nana's Mahogany table and buffet. Though the antiques were formal in design, this set took over the space that was the livingroom for a house of 9 occupants (ages 80 to 11) and would serve as our regular meal space as well as used for everything from entertaining to homework. These chairs are beautiful enough to dignify the antiques they were purchased to compliment, and sturdy and comfortable enough to serve the family that lives on them. The best compliment comes from my mother who was thrilled that her mother's dining set was able to follow her to my home: \"Have I told you how much I love these chairs?\" she says, every time she passes by them.", 
    "I can't believe I found this chair and for a steal of a price, too. It is beautiful. The back ground is kind of a khaki that in certain lights has the slightest green tint to it. It might look just like a light khaki to you. The whites are white and not cream. I am so glad for that. The greens seem like a dark khaki green to me. Maybe that is why the background seems to have a greenish tint to it. The red is a rusty red but far more red than orange. The color is deep with no muddiness to it at all. I hope this helps someone else. I tell you what. If they made a club chair in this fabric I would be all over it, too.", 
    "Easy to assemble. Beautiful print.", 
    "I chose beige to go with my Oh! Home Marseille Wing Chair. Perfect.", 
    "Chair required some assembly. Comfortable for the price. Nice pattern.", 
    "This chair is beautiful to look at and comfortable to use. We are extremely happy with it", 
    "This was a great purchase. I bought to use as a desk chair and it looks beautiful in my room. The only issue was that one bolt was missing so I had to buy one, but otherwise it was a great buying experience.", 
    "Great and easy to put together. Lovely print, received many compliments. Thanks for working with me so that it was not shipped to my home but to UPS since I have employment that does not allow me to take off for a simply delivery and for safety factors. of receiving the items.", 
    "I really like the chairs in the floral fabric. The colors are rich--taupe, deep red, olive and cream--and they make great accent pieces in our fairly neutral great room. They were reasonably easy to assemble and everything fit properly. Be advised if you have cats, the firm-ish feel to the seat and back and the nice fabric will appeal as places to scratch! Right now we have the angles covered with double sided tape. Hope that will do the trick.", 
    "Bought brown chair and very happy with quality for price. Solid wood legs and brass buttons are nice appointments.Material was good quality. Only complaint was chair was a little unbalanced.", 
    "Nice chair. I ordered it for a small desk in my family room and it makes for a nice quaint area. I'm happy with it for the price :).,", 
    "This chair is awesome! we are using it at a desk in our guest bedroom and it is very elegant and good quality for the price. the chair went together very easily.", 
    "Beautiful chair, well made and great design. I bought the white linenfor a simple clean look, you won't be disappointed on this one.", 
    "Works perfect for my office. Easy to assemble and comfortable.", 
    "I am pleased with the chair after a few weeks of use. It is lightweight but seems sturdy. My complaint would be with assembly. The enclosed instructions were inadequate. It was hard to reach the areas where screws needed to be installed, and the items enclosed didn't match up with the instructions. But after finally figuring it out, I was able to finish the assembly. It took me over an hour but still, I am pleased with the final product.", 
    "Great chairs with a rich look", 
    "It's a quality Chair and well Crafted. I'm Very Happy with this product.", 
    "This was my first furniture purchase that I got to put together--very easy. The bottom cover Velcro's on after assembly, which was clever. I bought the multicolor chair to match up with a red and white desk. I added the Chime Brown/ Multi Rug (3'10 x 5'7) underneath and now have a colorful home office to enjoy.", 
    "It was a gift for my Mom. Beside, having to assemble it, which I didn't think about. My Mom love the style and comfort of this chair. Thank you!", 
    "I wanted a comfortable, sturdy chair for the guest room and this was perfect.", 
    "These chairs are beautiful and very well made. I love them.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Ave-Six-Kendall-Tufted-Chair/9106205/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9106205/Ave-Six-Kendall-Tufted-Chair-ffc5196f-fb2f-4635-9c2e-3083a8da775c_600.jpg"
  ], 
  "description": "Invite your guests to pull up a chair and have a seat with this Ave\nSix Kendal tufted chair. With its rolled back, armless design and\ngently flared rear legs, this accent chair is versatile with a lean\ntowards traditional decor. Silver nail head detailing and a\nfour-button tufted back complete the elegant look of this chair.Solid wood construction holds up to 200 lbs for a safe,\n  secure seatHigh-performance upholstery grade fabric is durable and easy\n  to care forDeep espresso-finished legs provide a rich, handsome\n  lookChoice of upholstery color for flexible design optionsHigh-quality foam fill and sinuous spring construction\n  provide a cushioned, comfortable seatRolled, tufted back and silver nail head detailing add a\n  traditional touch to the accent chair styleTapered front and flared back legs provide style and\n  stabilityAssembly is quick and easySeat measures 19\" W x 16.5\" DChair measures 33.75\" H x 19\" W x 24\" DStyleContemporary, Country, Modern, Traditional, TransitionalMaterialWoolChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Brown, Off-White"
}