{
  "name": "Ave_Six_Andrew_Tufted_Back_Armless_Chair", 
  "price": "EUR 126.70", 
  "reviews": [
    "This is astounding chair, the fabric looks nice. I have had this cahir for only 2 months but it looks durable.The only downside is the chair is not so confy and the base bends a lot, I weight only 190lbs. My wife is 130lb and she feels the same.", 
    "Such a great looking chair. My girlfriend picked it out and she loves it.", 
    "First time ordering from this site, and product was very easy to assemble. I ordered two of them, and they are very comfortable. Very satisfied with my order.", 
    "Everyone loves this chair, and it's a nice decorative accent piece. But for the price? It's just a simple chair, far from high quality and not particularly comfortable. I put more stuff on it than actually sit in it. Probably could have found an equivalent for cheaper.", 
    "Easy to put together. Material is very nice. Chair is comfortable.", 
    "Has an item ever caught your eye that you just can't shake? You search for something with comparable style and quality, with maybe a better price, but you keep coming back to the original? Well, I have had my eye on this chair for MONTHS. As soon as I saw the blue ikat chair, I knew it would be a perfect addition to my home office. However, the blue ikat chair always seemed to be more expensive than the grey ikat or solid chairs (it was usually $130-$160) which made me sad. A few times, the blue ikat was also completely sold out! However, I kept checking back to see if the price would drop and finally it did! I pounced and now I am the happy owner of a stylish Andrew Six Blue Ikat chair!! I am sitting comfortably on it now while typing this review. There is plenty of cushioning in the seat area and good support in the backrest. A word of warning to those who will be assembling: the seat was a little challenging to attach to the backrest. One of the wood holes wasn't drilled deep enough and so the screw is sticking out slightly (would not go deeper not matter how much me or my husband tried). Luckily, it was in deep enough that we felt the chair was still safe to use. Also, there is a fabric flap which you fold over the bottom of the seat so you can't see any of the screws or wood joints underneath!", 
    "Very nice chair for the money. Easy to assemble and the grey color is true to the picture. Perfect as an extra dining chair.", 
    "Front legs were missing. Called and had them ship missing parts, that was 2 weeks ago. Still waiting!!", 
    "Got the grey ikat chair looks wonderful. Not sure how it will hold up but it went together beautifully and looks great now.", 
    "Love this chair! The color is beautiful and the chair is large and sturdy!", 
    "Love these chairs. very easy to put together. very stylish", 
    "I received the product in a timely manner but was missing parts. The manufacturer had the parts on back order 4-6 weeks. Overstock allowed me to return the product and did not charge me a return fee or shipping to return it. I will definitely purchase from them in future due to their customer support. Thank you.", 
    "Great chair! Love the color", 
    "Worked perfect for our office", 
    "nice chairs, easy to assemble", 
    "So cute! Comfy and goes well with the other colors in the room!", 
    "Looks wonderful with my dining table!", 
    "Used this chair for my office and I love it", 
    "Looks good, fits well, is comfortable.", 
    "I just received my 4 chairs today, and put them together. The fabric is nice, and the chair is comfortable. The problem with these chairs lies in the manufacture quality control. There is one short leg in every chair. You have to bolt in the backrest (legs attached already) to the seat. It takes 6 hex bolts..nice and sturdy. Then you have to just bolt on each front leg (2 bolts each.). I had to adust the un-eveness of the short leg with shims or pads so as not to wobble. Also, in one chair, the installer covered over the bolt hole with fabric. I guess he forgot they were supposed to be exposed. These are imported chairs from China, and the company who sells or imports these chairs needs more quality control taking place, with more eye on details like uneven legs. We do like these chairs though and intend to keep them. They seem well constructed.", 
    "Comfy and cute for the price. Great statement pieces", 
    "Got this chair in blue.. beautiful color and fabric. Cushion is nice and firm. Easy peasy to put together HOWEVER once done, the chair wobbles as one of the FRONT legs is shorter ever so slightly but enough to drive you nuts. SOOO I read other reviews and saw that many got sent a \"replacement\" leg which involves two screws to replace. The chair is worth it enough for me to do that rather than send it back. The chair back comes in one piece with back legs already attached so I only had to attach seat cushion and then front legs. I also took away one star as the item was packaged beautifully EXCEPT for the hardware.. the red bag was ripped open and flung in the box and if I had not found each little washer amid the styrofoam, I would not have been able to put it together.. so it is NOT Overstock's problem but one complaint I will be making to them about where they get the chair. Little annoyances but I do love the chair so it's a keeper. Bought this for my sewing table.. sit there for long periods and wanted a comfy cushion and back support. This gives both and it matches my craft room! Makes me happy.", 
    "after putting the chair together I was very pleased", 
    "These chairs are better then I expected for the price. They are super comfy! I really did not expect that! I bought two solid and two patterned and wow did they give off a unique vibe. I paired them with a metal industrial table. Once you put together one chair the rest are fairly easy. It took close to 2 hours for four chairs to be assembled. They seem pretty sturdy too. I did take away one star, due to one chair is wobbly. Overstock is in the process of sending us a replacement leg for that chair. I was pretty nervous buying chairs online, but boy am I glad I did.", 
    "These chairs were easy to assemble and are beautiful against our dark wood table. Very happy with the price/quality.", 
    "Love it and so easy to put together!", 
    "Beautiful - easy purchase fast delivery.I've gotten lots of compliments.", 
    "perfect for what I wanted to use them for. Good quality.", 
    "I placed these chairs at our kitchen table, and the whole family is happy. The colors really pop, and they are comfortable.", 
    "I purchased these to put in the office of one of the attorneys I work for. The color (grey/blue) is pretty; however, the chair has a cheap, unfinished feel to it. For example, the stitching around the edges of the chair if not flat, leaving a somewhat jagged look and some pieces of the actually thread was still sticking out, which I cut off. I kept these because I was in a bind, but I wouldn't re-order or recommend for a high-end space.", 
    "I bought the blue IKAT patterned chair for my desk and love it. It looks great, is well made and very comfortable.", 
    "These chairs are perfect in my kitchen dining area. They're well-made and easy to assemble. Please know they are more of a taupe-gray than gray. So if you need something that leans blue-gray these won't work. While they look great, they are a bit difficult to match other grays to - I had to replace placemats because they clashed. I'm loving their soft comfort and love the color now too.", 
    "nice looking chair. pretty easy to assemble. Lovely touch to my bedroom", 
    "not the most durable but good value for the price", 
    "I bought this chair for my office, it' a nice, comfortable chair. The legs were slightly unbalanced, but nothing to big. Everyone comes to sit in it. It looks very nice with the tufted back.", 
    "These chairs are not only comfortable bit they are also light weight for easy moving from room to room. Also, they are compact so they can fit in the corner of a bedroom and the colors match many design patterns.", 
    "Worth the money. Had to put it together but was very easy to do just legs and back.", 
    "Legs were no even. I had to add something to one leg to get it to quit rocking", 
    "Very pretty chairs and a fabulous price. I bought these to use in my home office. One as a desk chair and the others for additional seating. Highly recommend.", 
    "Gorgeous chairs....the azure blue is a little darker and with more green undertones than pictured in the description BUT it is still gorgeous.The seats are soft and plus...I am buying 2 more to complete the set for my dining room!", 
    "These chairs pair perfect with the Monoco 48 inch Glass Top Table that we purchased. They are tall enough for the height of the table and the seats are very thick, comfortable and sturdy! ! We couldn't decide which color to get so we ordered one chair in gray and one in blue and then decided to do 2 in each color and they look amazing! GREAT PURCHASE! I am very HAPPY!", 
    "Purchase for her bedroom to upgrade it... It's beautiful!", 
    "Love these chairs. Very good quality and the color is perfect. Not too bright or dull, just right. Matches new rug just perfect. Love them!", 
    "I have the grey chair in my office and it looks stunning. Easy to put together, well made, and visually pleasing. I love all the other prints and think they would be fantastic as dining chairs as well.", 
    "we received it when they said we would get it Dec 24th, the day before Christmas. The chair was very nice and easy to put together, very happy with it.", 
    "Although it required a little assembly, these chairs were sturdy and quality. The legs finish were perfect abd the fabric upholstery was great with the tufts looking plush and luxurious.I had received the wrong colour because I had originally tried to choose a patterned chair, so I had to send then back for a replacement. But I feel good knowing the quality of chair I'm going to get for a good price", 
    "Needed a chair for my parents room. Nice looking and a nice bold blue looks great against the light blue walls. Fit perfect for a bedroom", 
    "Very please with my chairs. The are comfortable and sturdy.", 
    "The chair goes very well with a desk I bought at overstock. The gray ikat looks great and it is very comfortable to use as a desk chair.", 
    "The Grey color is horrible and does not look like the picture at all. It is actually a brownish grey, which makes the chair look like it's from 4 decades ago."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Ave-Six-Andrew-Tufted-Back-Armless-Chair/9106204/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9106204/Ave-Six-Andrew-Tufted-Back-Armless-Chair-a4626195-c8fb-470c-a3bf-f4654b8257a1_600.jpg"
  ], 
  "description": "Enhance the look of your desk or vanity with this Ave Six\nAndrewchair. With its armless design, the chair provides unfettered\nupperbody mobility, allowing you to complete tasks without\nmovementconstraints. Button tufting on the seat back adds charm,\nwhile aselection of four fabric colors ensures a match for your\ndecor. Thechair's compact size makes it portable and lightweight.Solid wood frame and upholstery-grade fabric offer\n  qualityEspresso finish complements many wood tonesFabric is easy to care for and available in four options to\n  match your decorFoam padding and sinuous springs provide comfort and\n  supportTufted seat back for eleganceTapered legs offer stabilityCompact profile makes chair easy to moveEasy assembly, so you can enjoy right awaySeat measures 20.5\"W x 17\"DMeasures 37.5\"H x 22\"W x 23.5\"DStyleContemporary, Country, Modern, Traditional, Transitional, Urban, VintageMaterialWoodFinishGrey Finish, White FinishChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Grey, Ivory, Multi, WhiteFurniture PatternSolid"
}