{
  "name": "Baxton_Studio_Agathe_Modern_and_Contemporary_Kids'_Bedroom_Twin_Size_Fabric_Upholstered_Headboard_", 
  "price": "EUR 90.63", 
  "reviews": [
    "I liked the nail head design on this headboard. It's simple but stylish. It arrived on time and was easy to get up."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Baxton-Studio-Agathe-Modern-and-Contemporary-Kids-Bedroom-Twin-Size-Fabric-Upholstered-Headboard/11461127/product.html?recset=eb9b0a73-d2f2-444b-8ce4-2c3f64db486c&refccid=JK2NPAOOYZ3I6MKALSKTJLUF74&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11461127/Baxton-Studio-Agathe-Modern-and-Contemporary-Kids-Bedroom-Twin-Size-Fabric-Upholstered-Headboard-fb41a964-bf15-450c-99a6-6774da164d18_600.jpg"
  ], 
  "description": "You can imagine this designer piece feeling right at home in a villa in the Hollywood Hills or a lavish loft in New York. Transform your space into a luxurious hideaway.  The beautiful nailhead detailing cornering the headboard adds that subtle sparkle that every glamorous bedroom dreams of!  Constructed of solid rubberwood frame and plywood, the headboard is built to last.  Soft polyester fabric available in greyish-beige or dark grey fabric over the foam filled headboard provides ample comfort for you to lean against.  Leg supports are invisible once set up and can be adjusted to suit the height of your ensemble for convenience.  Headboard sits between the wall and the ensemble frame, attaching not to the bed base but to the legs, for stability.  Made in Malaysia, this Twin size headboard requires assembly.\rModern and contemporary twin size upholstered headboardMaterials:  Solid rubberwood frame, plywood, foam and polyester fabricFabric color:  greyish-beige or dark greyCurved shape with silver nailheads trim for a classy and glamour lookThe headboard comes with 2 pre-drilled holes (with height from ground up of 5.5\" and 8\") that go with any Leggett and Platt bedframe The upper part on the back of the headboard's legs comes with 5 predrilled holes with 2.55\" apart from one another for height adjustmentAssembled size (Inches) : Twin - 39.17\"W X 25.99\"H x 2.36\" Thick; Legs: 0.79\" X 1.77\" X 38.98\"; Each Pre-drilled hole is 2.52\" apartAssembly requiredMade in MalaysiaStyleContemporary, ModernMaterialFoam, Polyester, RubberwoodFinishBeige Finish, Grey FinishBed StyleHeadboardsAssemblyAssembly RequiredColorBeige, GreyFurniture PatternSolidProduct FeaturesAdjustable Height"
}