{
  "name": "Baxton_Studio_Brittany_Upholstered_Button_Tufted_Modern_Club_Chair", 
  "price": "EUR 181.93", 
  "reviews": [
    "I like its quality, very steady and joint seams are neat. Color is just right and perfect for my room design, naturally matching with the main style. Very easy to be assembled. The seat design makes your back feel comfortable. Overall, affordable price with good quality and nice style, plus proper functional design. It is worthy for this purchase. Perfect for living room, hallway and bedroom as well.", 
    "Great for the price. Easy to build and clean. I bought 4 for my new salon and they look amazing. Super comfy and sheek!", 
    "Looks good! Very light, classic simple design, and a sinch to assemble. For the money you can't go wrong.", 
    "I got these for my studio salon, and my clients compliment them every day!I am continually asked where I got them, and I have to say Overstock!", 
    "Very stylish and perfectly sized for a small space. Seat cushion not too comfy…could be softer.", 
    "The chairs are shaky and not stable after assembling. Definitely not an everyday chair.", 
    "very small and very cheap", 
    "This chair is attractive however the seat is hard as a rock!! I like the look of them so I am keeping them and have ordered new foam inserts for the seats....", 
    "The fabric on these chairs is ok to me better then other reviews had stated. A cream color more on the pink side then beige side if comparing similar colors. They are small but that was expected from the dimensions given. The cushion is very hard not super comfy for a living room chair. I ended up putting them in my master bedroom and they look nice and serve their purpose.", 
    "Well it looks good from a distance, however it's like sitting in a metal folding chair with a slight cushion. Good for an entryway or accent that doesn't get used very much.However I'd never put this in a living room that where many people would use it. For the $$$ I paid I can live with it.", 
    "Not a bad chair--decent quality, however, the actual chair color is way off from the picture. I thought I was getting an off-white/very warm vanilla chair and instead, the color is like burlap. Too lazy to return, but am certainly disappointed in how inaccurate the online color is. Chair isn't exactly the most comfortable and if you have larger friends...this chair definitely won't be accommodating. I am a 5'3 110lb female and the chair fits perfectly for me, but cannot see anyone much larger for it to be particularly comfortable. Just beware of the color and how small the size of the chair.", 
    "This is a classic style chair that I use in my staging all of the time. However, I am not sure if it would hold up very well to daily use and definitely not for larger people. But otherwise, it looks very nice and tailored.", 
    "the chair is not well padded, on the arms you can feel the wood frame, it is smaller than expected and did not look very sturdy.", 
    "Wrong color - looked like brown burlapCheap, not comfortable", 
    "The chair has an elegant look and it is very comfortable. The shipment was timely and the assembly very easy.", 
    "They are a bit uncomfortable but for the price they look really nice and are perfect for my sitting area (more for show) :) The color looks a lot darker in person, like a beige not linen", 
    "the grey is green not grey and the chairs are very uncomfortable", 
    "chairs look great in our sitting room. I did not give them five stars as their were no directions to assemble.", 
    "Purchased for sitting area - color is definitely more beige than the picture on-line, but nicely neutral. Easy to assemble, and decent quality for the price. Not sure if is comfortable enough for constant usage, but quite pretty as an accent chair and I am not uncomfortable when using it.", 
    "It looked nice in picture. It is small and the cushion is not comfortable to sit for everyday used. It's OK just for decors.", 
    "Looks good but quality and comfort not to good.", 
    "This chair is poor quality and not to mention the color difference. I ordered the white looking chair as shown on the picture and came as light brown. It is extremely hard to sit on and the material that is made of is not good. I guess you get what you pay for but if you are looking for something nice that's not the chair. Very disappointed in this purchase.", 
    "Love it! Perfect Using it in my bedroom", 
    "great purchase, love it, just as picture", 
    "This chair is small, but pretty. I love the color but this chair is very firm and if you are over 5'6\" it's not very comfortable but for price I like it. It's In my guest room and not many people will be sitting in this chair.", 
    "This was a great deal!! And the price couldn't be better!", 
    "It turned out smaller than i thought. Its a bit hard but i think you just need to break into the chair. I ordered 2 for my living room.", 
    "great chair for short $$$$", 
    "This chair is very nice. Simple and sleek for my living room space!", 
    "I got a smokin' deal on these chairs so I can't complain about the price. They look great, and were super easy to put together (just had to screw on the legs). The quality was better than I expected and the fabric is fairly thick and durable. Only complaint is that the cushions are quite stiff/hard. So they're great decorative chairs, or serve their purpose for extra seating when entertaining, but wouldn't be my first choice to pick for a long movie.", 
    "These are very small, hard and not very comfortable. Good enough if you don't plan on using them everyday.", 
    "Easy to assemble and looks more expensive than it was", 
    "I got two of these chairs and they're really cute and were pretty easy to assemble.", 
    "For the price, this is a nice, little club chair. It's attractive and tI really like the material. It was easy to put together. However, the seat is hard, not cushioned and I doubt it will wear well with a lot of use. I did have a problem with shipping. It was delivered to an incorrect address. Overstock was fantastic about resolving the problem. I am happy with my little club chair!", 
    "I was looking for an accent chair for our office at a good price and this does the trick! It's a little thinner on the sides than it looks in the picture and color is slightly darker but worked for me and for an inexpensive chair, I'm happy with it and think it looks nice.", 
    "Got 2 chairs the color and quality are great", 
    "It 's ok, serves it's function .", 
    "Not meant to be cushy seating. Great for a bedroom, office or guest bedroom. Love it!", 
    "Really cute and comfy for my teenagers room!!!", 
    "We thought we ordered the kaki chairs but we ordered the grey. They are more like a slate blue grey, really pretty. Not the most comfortable chair", 
    "Love this chair. It's not highly cushioned but is a perfect accent chair. Looks great!", 
    "All you have to do upon arrival is take it out of the box and twist the legs in. Not huge in size which is perfect for our small sitting area. It's not a 'curl up and read a book chair' but is comfortable enough for my 6 foot, 180 lb husband to sit in. Can't beat the price.Grey has a slight blueish/denim tint.. I think i read a review that said it looked like brown burlap, but ours do not and they are awesome (we like the bluer greyness). I wish overstock would let me post pics...", 
    "I bought this as a housewarming gift for my daughter... She loves it! It's very well made and comfortable. PLUS it was $$ cheaper than ******. It went on sale the next week for an even lower price, but Overstock immediately issued me a store credit when I contacted them. THANKS!!!", 
    "We purchased two of these chairs in the dark grey color (which is such a beautiful color!). I will say, if you are looking for some incredible comfort and a chair that you never want to get out of, this isn't the chair for you. However, we were looking for SMALL accent chairs that would improve the look of our living room and that were comfortable enough and these were perfect. The bottom cushion is a little stiff (but not uncomfortable) and thin, but I think they are getting more comfortable as they get worn in (we've had ours for a month now). But these chairs are absolutely fantastic for their price. If you're on a tight budget and going more for aesthetics, I absolutely recommend these.", 
    "These chairs are of very good quality and style. If anyone else is looking at them... Get 'em!!! You won't be disappointed.", 
    "Sturdy. Fits right where I wanted it. Nice color.", 
    "Fits very nice in my loft, the quality is good I will recommend anyone to purchase this chair.", 
    "Great chairs for the price. I really like the size and clean lines. You don't get lost in them and they don't dominate the space.", 
    "Although I measured first, the chair was smaller than I thought it would be. Nonetheless, It is a good deal for the price.", 
    "Extremely uncomfortable and the color is way off from the picture.", 
    "I really liked the look of these chairs but they were so uncomfortable that I had to send them back."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Baxton-Studio-Brittany-Upholstered-Button-Tufted-Modern-Club-Chair/9548607/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9548607/Baxton-Studio-Brittany-Upholstered-Button-Tufted-Modern-Club-Chair-91bd1cb1-3527-4a1f-99a1-9cb13e39be79_600.jpg"
  ], 
  "description": "Add comfortable extra seating to your living room, study or bedroom\nwith this Brittany club chair from Baxton Studio. Neutral color\noptions mean this upholstered chair blends in with most any decor\nscheme, and the button-tufted back and curving design add a pop of\nmodern style to your room. Black-stained solid wood legs make this\nclub chair sturdy and durable. Contemporary club chairSolid wood legs with black-stained finish      Tufted detailingOptional color: Beige, grey      Set includes: One (1) chairMaterials: Fabric, foam, woodFinish: Dark blackUpholstery color: Beige, greyUpholstery fill: Foam paddingSeat dimensions: 18.25 inches high x 19.5 inches wide x 19\n  inches deepOverall Dimensions: 31.25 inches high x 24.5 inches wide x 24\n  inches deepStyleModernMaterialFabric, Foam, WoodChair TypeClub ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, GreyFurniture PatternSolid"
}