{
  "name": "Baxton_Studio_Sofia_Modern_Contemporary_Beige_or_Grey_Fabric_Nailheads_Trimmed_Sofa_Twin_Daybed_with_Roll-out_Trundle_Guest_Bed", 
  "price": "EUR 584.78", 
  "reviews": [
    "The daybed trundle is perfect. I think the quality is wonderful, especially for the low price. I searched elsewhere but no other price came close to this. Looks great and super easy to put together!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Baxton-Studio-Sofia-Modern-Contemporary-Beige-or-Grey-Fabric-Nailheads-Trimmed-Sofa-Twin-Daybed-with-Roll-out-Trundle-Guest-Bed/11534725/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11534725/Baxton-Studio-Sofia-Modern-Contemporary-Beige-or-Grey-Fabric-Nailheads-Trimmed-Sofa-Twin-Daybed-with-Roll-out-Trundle-Guest-Bed-ce805cb7-848b-41bd-8412-9f6be858f5d4_600.jpg"
  ], 
  "description": "Elegantly styled with silver nailheads on the back panel and side panels, the Sofia Fabric Sofa Twin Daybed features clean lines and sophisticated design.  The 3-in-1 Sofia Daybed comes with a twin roll-out trundle so it can accommodate up to two overnight guests.  It's a sofa!  It's a bed!  It's another bed!  Constructed from solid hardwood and boasting beautiful nailhead trim, it's fully upholstered in beige linen or grey polyester fabric.  Comfortably padded with foam, the Sofia could  be a sofa for a small apartment or condominium where space is limited.  Alternatively, the Sofia could be your daybed for rest and relax during day time while converting into a guest bed at night.  Perfectly suitable for small bedroom, kids' bedroom or teens' bedroom, providing additional bed for your kids' sleepover guests.  In your living oom or family room, the daybed could be used as extra sofa seating by throwing couple of throw pillows.  Constructed of CARB-compliant solid rubberwood, the Sofia assures you on the child safety concerns.  Trendy and up-to-date, the Sofia will be a timeless piece for years to come and will match all of your modern and contemporary home decor.  Made in Malaysia, the trundle bed requires assembly. \n\nModern and contemporary upholstered sofa twin size daybed with roll-out trundle guest bedSet includes two side panels, back panel and trundleMaterials: solid rubberwood, plywood, MDF slats, linen or polyester fabric, foamCARB compliance hardwood, plywood and MDFFinishing: black finishing legsBeige linen or grey fabric upholstery over padded frameSilver nailhead trimStraight back panel and side panelsDetailed stitchingsStandard twin size mattress recommended, mattress not includedSelf-assembly requiredMade in MalaysiaDimensions: Overall: 84.06'W X 42.52'D X 30.31'H; Trundle: 76.78'W X 41.15'D X 11.22'H, Net weight: 131.12 lbs.MaterialFabric, Foam, Linen, MDF, Polyester Blend, RubberwoodFinishBeige Finish, Grey FinishBed StyleDaybed, Trundle BedAssemblyAssembly RequiredColorBeige, GreyFurniture PatternSolid"
}