{
  "name": "Baxton_Studio_Constanza_Classic_Antiqued_French_Accent_Chair", 
  "price": "EUR 474.86", 
  "reviews": [
    "I purchased this chair to replace our \"manly\" chair which is need of reupholstering. I had purchased chairs of similar style from a high-end furniture store so I was somewhat hesitant to make this purchase. The fact that the price at Overstock.com was many times less than the cost of the chairs I already own was the deciding factor. When the package arrived the box looked a bit worse for wear but on unpacking the chair I found it to be in perfect condition. I'm not terribly good at visualizing size so this chair is slightly smaller than the chairs I have; this proved to be an advantage in the location where it is placed. The size is more than ample for an adult to sit in: it's just not bulky. The look of the chair is stunning. The color exactly matched the color on my monitor. The fabric is a bit coarse, but this is an advantage for a chair that is in constant use. The chair cushion is quite firm, which we prefer, it will probably soften over time. I love this chair and would not hesitate to purchase it again. Thank you. Overstock.com!", 
    "I'm overwhelmed with happiness about these chairs (I bought 2). Very similar to the picture on the website. The style, color, fabric, material...everything is just beautiful. I literally cannot express how happy I am with my purchase. Gorgeous, gorgeous. If you find this chair appealing...do not hesitate to buy.", 
    "A lil smaller than I expected - Has a hue of taupe/lavender feel. Love the style - Looks amazing in my home", 
    "Beautiful chair! Looks exactly as seen on the website. Not very comfortable, but it looks great!", 
    "After having this chair for a week, I thought it might be okay to write this. I sat in after I got it out of the box, and I thought it was a little on the firm side. Some people like that in the chair and not have to climb out of it from being too soft. Maybe that will change over time, but for right now I'm listing it on the firm side. It looks big in the listing page, and it is big. I'm 6'2\" and it's big on me. The seat portion would be big enough to seat two small kids. As in the seat is 22 inches near the backrest, and 24 out front. It's not all that heavy, in order to move it around, but does take up space in that it's just big. It does seem well built, and I have sen any loose pieces or fabric hanging from it. It comes with a pillow and I think that will help. Not for just myself but for your quests. The page color is actually right on. So for right now, time will tell. I didn't rate it all that good, and for now I am not recommending it, because I probably wouldn't buy another one, based on what it's like now. I might not have bought it if I was sitting in it at a store.", 
    "All information including the box said the color was beige, after opening the box the color of the chair was grey. The wood on the arms is rough. Not happy with the wood on the arms.", 
    "Chairs are beautiful, very well constructed, but was disappointed with height. Way too low for average adult to get in and out of. Almost ridiculous. Love the chairs, but will have to have them elevated.", 
    "I bought 2 of these. They are not without faults but I decided to keep them as they are nice looking and the price was right. They are true to pictures on sight and as described. The wood is slightly rough as many commented but that is the look I was going for. One chair did have a chipped and splintered piece in the back and one leg is slightly shorter than the rest. I fixed this by putting a chair pad on the leg.I agree with the others who said the pillow is not great looking and the cushions does not fit properly. There is an inch or more of space between it and the arm frame.The seat cushion is firm so if you like a firm seat I would say you would find it a comfortable chair with plenty of seat space.I will close with saying \"You get what you pay for\". If you are looking for a perfect chair I suggest you pass on this one.", 
    "Comfort and class, all in one, the quality is exceptional", 
    "I'd been looking at almost this identical from Wisteria for nearly twice the price. This looks exactly as pictured and seems much more high end than the price.", 
    "I ordered two of these chairs for my living room. The legs and arms look very distressed liked the picture and the fabric is a neutral beige/gray. I am really pleased with them, exactly what I've been looking for. Great purchase. They arrived assembled and quickly!", 
    "Grand chairs. Love the arm, the white washed wood, the upholstery is well done. Looks like a $$$$ dollar pair of chairs.", 
    "Was supper excited about the chairs, little disappointed with actual product. One came is damaged in transit, overstock was extremely nice about resolving that issue. The second had some imperfections in fabric, glue all it and uneven/rough wood.", 
    "Just received these chairs, and could not be more disappointed. Paying over $*** a piece for them, you would expect that the seat cushion would, at the very least, fit in the chair! It is mis-sized and doesn't sit flush against the back. Both chairs arrived in damaged boxes, which were torn open. The tops of both chairs were chipped and dented in the wood frame. WHAT is going on OVERSTOCK?? Have ordered three pieced of furniture from them, and ALL THREE have arrived damaged..never happened once with amazon. Also the color is completely different that shown in image. Was looking forward to these chairs...super disappointed. Buyer BEWARE.", 
    "workmanship was poor. color was off. Total mistake.", 
    "Overall, this is a very nice product. I like the wood finish. I wish there were more color choices for the fabric, if not other fabric choices. The other thing is the seat cushion: it looks like it's made out of foam and I don't think it should, not for this kind of product. It makes it look cheap. If I were the manufacturer I'd be looking closer at the shape of this cushion. I've read reviews saying that the seat is firm or very firm. Well, I'm sure that when this kind of chairs were made with springs the seat was very firm at the beginning. Excellent service at Overstock.", 
    "I love this chair I order couples of month ago. And couple of weeks I order the second I totally recommend this chair.", 
    "Great chair. Color is as advertised. We love it. We did put on a protective coating for the fabric.", 
    "I LOVE these chairs. Exactly how pictured and very very comfortable. Sturdy.", 
    "A beautiful and comfortable chair which looks exactly as described. Very happy I bought it and will probably buy another.", 
    "We are very pleased with this chair. It is very sturdy and the colors are what we are looking for. Looks very similar to a chair we saw at an expensive furniture retailer, but a much better price.", 
    "we have two of these gorgeous chairs in our living room and they are wonderful looking, and even better to sit in! my husband is 6'5\" and doesn't feel comfortable in a \"dainty\" chair. He LOVES sitting in these chairs when we entertain!", 
    "very nice, comfortable, good packaging, ship time, just the color of the wood is dark like a golden oak not natural oak, linen color is dark also not beige at all more taupe with a hint of violet , I was expecting at least in the tan family. I would recommend but caution for color. we put in a sun room with an accent pillow works but not exactly the color we wanted, bothers me but life goes on", 
    "Exactly as pictured. Good quality.", 
    "My whole apartment is super contemporary and I needed to mix it up with something more classic looking. This chair was a good choice. Good quality and good looks make it perfect <3", 
    "Very nice piece..will go well with my home decor...i love the neutral colors..and it's very comfy and roomy", 
    "Lots of compliments- wish I'd bought two. The pillow is cheap looking so tossed it out.", 
    "The style and color are perfect for my living room. And I can change the pillow cover with the season. No problems or damages with the order and delivery.", 
    "Very pleased with my puechase. I saw one in RH very similar and it looks like the same.Little short and the cushion is a little hard but it is ok for me", 
    "Comfortable and so pretty.", 
    "first one arrived damaged, but customer care were was great and helpful", 
    "I really like my new chair. It is smart looking and is fittinginto my decor nicely.", 
    "way darker than showed on picture", 
    "Great chair. Great quality. True to color. Pillow looks a little cheap but I bought it knowing I wanted to replace it. From reading other reviews I knew it would not be the most comfortable chair which was fine with me because its an accent chair, not a chair that I will be sitting in often. Very happy with my purchase.", 
    "I ordered two of these chairs and they are great. Very sturdy and the fabric is very durable. Very pleased with this purchase.", 
    "Overall I like this item very much- It looks exactly as shown in the images, it is a good size, comfortable, and it is sturdy. The wood portions are rough to the touch.", 
    "Love this chair. I bought 2 for my formal living room. As other reviews have stated, the chairs are firm but look beautiful. They are smaller than I had envisioned, but work really well for me. One of the chairs in my pair was damaged in transit and Overstock worked with me to provide a replacement.", 
    "I love the look and size of this chair. It is not oversized as the picture suggests. However, I prefer that for the space I put it in. The only complaint I have is that one of the legs was slightly shorter than the rest. I fixed this by putting a sliding chair pad underneath that leg. It isn't that big of a deal to me."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Baxton-Studio-Constanza-Classic-Antiqued-French-Accent-Chair/7901374/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7901374/Baxton-Studio-Constanza-Classic-Antiqued-French-Accent-Chair-f3f9518e-ff5d-45fb-89e7-eeef9bb3bafa_600.jpg"
  ], 
  "description": "This beige accent chair takes style cues from traditional French\nstyle. With its beige-grey linen upholstery, it has the look of an\nantiqued French accent chair. Constructed of rubber wood, this\nchair is designed for durability. It comes with one matching throw\npillow. The chair should be spot cleaned only. Traditional French accent chairVersatile, neutral beige-gray linenRubberwood frame with distressed, antiqued finish including\n  white streakingPolyurethane foam cushions with matching throw pillowSpot clean onlySet includes: One (1) accent chairMaterials: Linen, foam, rubberwoodFinish: Distressed, antiqued finish including white\n  streakingUpholstery color: Neutral beige-grayUpholstery fill: FoamSeat dimension: 18.5 inches high x 25 inches wide x 24 inches\n  deepDimensions: 37.5 inches high x 29.25 inches wide x 29 inches\n  deepStyleCountry, Rustic, Shabby Chic, TraditionalMaterialFabric, RubberwoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeigeFurniture PatternSolid"
}