{
  "name": "Bellcrest_Button-tufted_Upholstered_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 214.42", 
  "reviews": [
    "What a great value! These chairs look like they cost 3x as much! They are just the right size, not too big for a medium sized table but also not too small either. They are also very comfortable. I ordered the ones in the faux suede finish and they have a lovely vintage looking texture to them. It is almost a crackled effect. I had been looking for this style of finish for quite some time but was having a hard time finding something that fit within my budget. I was delighted to find these! They took a little longer to arrive then some of the other items I have ordered on overstock but they were well worth the wait!", 
    "The chairs look beautiful, however, they are very poorly made. No matter how tightly you screw the legs in, within a few short weeks they will undoubtedly become loose and wobbly (as other reviews have indicated as well). This problem did not present itself until about a month after having sat in the chairs, and I thought it to be a one time problem so I simply tightened the legs and thought nothing of it. However, this is constant and persistent issue that requires crawling under the chairs once a month to retighten them. Because the problem took over a month to initially present itself, Overstock has refused to issue a refund. BEWARE of this issue. DO NOT PURCHASE THESE CHAIRS (unless of course you like constantly worrying about retightening your chair legs).", 
    "These are comfortable chairs. I love the tufting and the curved back. These are an upscale chair at a very good price. My table will fit additional chairs, so I will order more of these side chairs for my dining room.", 
    "All of the chairs have at least one or two cracked legs after assembling. We have never even used the chairs . Just put them together. They all cracked in the same spot where the screws go in the wood all splintered. Overstock wants me to contact insurance I bought which policy clearly states \"does not cover manufacture defects\". It is an accidental policy. I am within the 30 days and they are not helping.", 
    "This was my first time purchasing anything from Overstock. I love the chairs. However, out of the 8 chairs I ordered, 2 had to be replaced due to the legs and pre-drilled chair holes not lining up. Plus, I had to take the chairs to a UPS location as they would not do a pick up service, so that was a bit inconvenient. Otherwise, I love the chairs. I wouldn't say they are high quality, but they have a middle-to high end look and since they are in our formal dining room, they won't be used eveyrday. Only time will tell if the chairs will hold up. I would recommend these chairs.", 
    "These chairs were easy to assemble and came with a guide for how to manage wobbly chairs. They are lovely and comfortable and a great value for the price. Tightening the screws is typical for most furniture, and in the mean time, these chairs looks and feel great!", 
    "Love these chairs! They match perfectly what I was trying to do in my dining room. Great quality and easy to put together.", 
    "These are great chairs for the price. They will go perfect with my table!!", 
    "I HAVE BEEN LOOKING FOR THESE CHAIRS FOR A YEAR I KNEW WHAT I WANTED JUST COULDN'T FIND IT WHEN I WENT ON THE OVERSTOCK SITE THERE THEY WERE AND THE PRICE WAS FANTASTIC THE CHAIRS ARRIVED IN A FEW DAYS I PUT THEM TOGETHER MYSELP SO EASY THEY LOOK WONDERFUL IN MY DINING ROOM JUST BEAUTIFUL", 
    "The look is the same as on the picture and I love the color. The fabric is a bit rough, which I actually don't mind because it appears more durable, but the chairs look cheaply made on you sit on them.The legs are not stable. After every use, I have to tighten the screws because the legs won't stay in, they become lose. I'll have to figure smth out and probably add additional screws to keep them in place.", 
    "Easy to put together... Look great with any style of furniture.", 
    "Excellent quality for an excellent price.", 
    "color was good. Have used these before", 
    "Ordered the 'Linen' color and it was the perfect light creme white I was looking for! Good quality as well.", 
    "I am giving this 3 stars because they look very nice and expensive. The color is also exact to the picture. There was another review that listed this same issue, but I elected to buy anyway. For this chair, all 4 legs need to be screwed in (no problem) it is just light assembly. After a few days, the legs became loose and wobbly, which was very unsafe and would probably break the chair. The Chair comes with Washers, but no lock washers or a way to get to the back of the screw to put a nut on each one.I went out and bought lock washers for each screw (12 cents a piece) and so far so good.", 
    "The quality of these chairs leaves much to be desired. They are a bit shaky. But they look great and I think were a great purchase for the amount paid.", 
    "I have been looking for chairs like this for awhile, these have been the best price. We put them together easil. I can see what some of the other reviewers were saying, a couple of the legs were not cut perfectly, but it did not affect the look or use of the chair. I have only had mine a few weeks and we don't sit on them daily, so far I have not had a problem with them becoming lose. I think they are a good value for the price.", 
    "Fabric has already faded on one of the chairs and it is not even in direct sunlight. They are not that sturdy and one of the chairs is slightly different shaped and height. Not sure how that is possible but one is noticeably off!", 
    "Good quality for the price, nice linen fabric. Highly recommend that you scotchguard them if you have children!!", 
    "After a couple of months, the cushions were worn out, and we didn't use them that much. It's been about a year and we already want/need new chairs. Style is beautiful - we even added decorative nail heads to the trim.", 
    "I purchased two chairs to flank a round kitchen table. I wanted something that looked stylish and elegant for a fraction if the price. These did the trick. I am happy and can report that the install was easy. The only thing I would caution is that of course this is not going to be the highest quality fabric - it does show signs of wear (pilling) after use. If that's not okay, you are going to need to spend more money and move up in quality.", 
    "These made beautiful dinning chairs for us", 
    "I ordered these as an alternative to my table's wooden chairs, and I love the new look!", 
    "Love the chairs. Great value. Very comfortable and color was perfect. On time and went together quickly. Did spray with scotch gaurs to protect fabric.", 
    "I have to tell you..These WAY better than I thought ! No problems with anything.I bought 4 chairs total.Seriously compares to PB chairs at over $380 a piece.TAKE THE CHANCE.Fabric excellent..I will Scotchgaurd before use..", 
    "Great chairs, really solid and comfortable. Assembly was very simple", 
    "Love these chairs... Sophisticated yet stylish.... They are also very comfortable. The color is great we bought the Linen color and it matches our dinning room perfect!!!", 
    "These chairs worked perfectly as extra seating for a party. So much nicer than folding chairs and they work well with decor the rest of the time. Still like them 5 months later", 
    "Sturdy and nice but one of the legs was hard to put together.", 
    "These chair are amazing they are super comfortable and look really stylish in my dinning room. Super easy to put together as well all u have to do is screw on the legs", 
    "Love these chairs and the ease of putting them together. We bought 6 chairs and they go great with the table we bought from Overstock last year.", 
    "Love my chairs, so stylish.", 
    "Its very nice chair - style, quality and easy to assemble. Great for price too!", 
    "After ordering my first set of chairs and not being happy with the quality, i ordered these chairs and when they came they were exactly what I expected. They were very easy to put together. They were exactly what I had in mind.", 
    "If you want high-end looking chairs but do not want to break the bank, these are wonderful. The tufts add sophistication to my dining room. They look much more expensive than they are. I did not have trouble with assembly like other reviewers did. My chairs came with washers, and when I screwed the legs in, the wood did not split. The foundation in my dining room is a little crooked, and they are adjustable to this. I got the linen, and they are a neutral color that goes with everything. Beautiful chairs!", 
    "Love them! Great chairs! Easy to assemble!", 
    "I ordered a set of these chairs. As other customers have stated, they have a strong odor (which has not gone awayafter three weeks) and the legs are not even so they wobble. Despite of this I enjoyed the style and they are pretty comfortable so I decided to keep them and order another set. When the other set arrived, I noticed they were slightly taller than the other chairs, had a slightly different shape, and had a different shade of linen. I called Overstock to discuss this matter and was less than pleased with the outcome.They said it is common for fabrics to be different shades when they are not ordered at the same time. They may consider this common knowledge, but this is not stated on the website. It also doesn't explain the difference in height or shape. I was told I would not be refunded fully since the return window passed. I would have returned them sooner had I known they would not match!", 
    "I love the look of these chairs. The fabric was a bit lower quality than I expected, but I'm willing to overlook that. The fabric is a rough linen, closer to something you would find on a tote bag. When I was constructing the chairs, the screws for the two front legs caused the wood in the legs to split when you tighten -- not overtighten, as the legs still were not secure to the base. I had to add washers to the screws to be able to tighten the screws without splitting the wood, but enough to keep the legs from wobbling. It was an inconvenience but not enough of one to prevent me from ordering six more chairs. For less than $$$/chair, I am willing to put in some extra work. Now I will have 8 dining chairs for just over $$$. You really can't beat that price.", 
    "I love the design style of this chair. The fabric is very nice, but we had to send back one set because the legs were not even. They are out of stock, but will reorder when back in stock.Very easy to put together!!", 
    "I like the smooth feel of the linen used on the chair. I wish there was an option for a lighter color for the legs. There was an unpleasant chemical smell when unpacked from the box it came in, and it took several days for it to disappear. The actual quality of the chair is not that great because some chairs in my set of 8 have even legs and some don't, so the chairs rock a little bit from corner to corner. Overall, a good value for the price.", 
    "I bought 4 of these chairs. They look great from across the room. I love the grey color, the fabric, the style. However, up close, I notice the imperfections and quality issues. The chairs work for me because I rarely use them. If I sat at my dining table a few times a day, I'd probably be unsatisfied. Two of them are totally stable, but two have legs that don't align and are very wobbly! I put felt pads on the bottom of the legs to prevent scratching my wood floors, and I ended up putting about 7 felt pads on one of the legs to make it more even. Also, when I unpacked the chairs from the box, they SMELLED like preservative (formaldehyde). Gross. I febrezed the crap out of them and let them air out outside, and about a week later, they didn't smell any more.", 
    "Very nice quality for the price. We got the beige, so sprayed real well with scotch guard as we have with light chairs in the past, and they stay clean for years with a light wiping of any spots.", 
    "the chair is very pretty to look at, but after every few weeks I have to check the bolt on the legs as it becomes loose.", 
    "I love this chairs they were breeze to put together. Just screw the legs on. I did order gray and got beige but I can live with that.", 
    "The color is great and it is exactly what I wanted!!!!!", 
    "Just received them and look great in dining room. Very easy to put together.", 
    "The chair was very cheap and the legs are about to fall off. We have only had them a little over a year. I would not reccommend!", 
    "I ordered the rustic leather chairs and they look incredible with my wood table with an iron base. They match great and are a wonderful quality for the price. Definitely recommend!", 
    "Just received it today looks nice bUT two of the chairs came with delicate gel pouch open. It was a hassle cleaning the up. Velcro are not done nicely almost hurt my fingers on that staples. I got 3 sets 6 chairs total and one of the chair is making some kind of plasticky noise whenever you move.", 
    "Love this chairs they are beautiful and great price", 
    "i like it very good quality", 
    "Easy assembly. Great value on a chair you can spend much more on. I love them", 
    "These chairs are a beautiful addition to my antique dining room table. They bring that touch of elegance and are definitely quality.", 
    "Chairs look great with my wooden table. However, the linen material I am not too fond with and I wish it was more ivory than beige.", 
    "They were easy to put together but I did get one that had the hole drilled in completely the wrong angle. I had to do a little adjusting on my part. But overall they have held up two dinners in them. Nobody has landed on the floor yet.", 
    "Legs need to be tightened regularly... Fabric a little rough but great value", 
    "unfortunately we tried airing out these chairs for several months and they continued to have a chemical odor. we had to return them :( very cute though!", 
    "The legs to the chairs are shoddy. They needed constant tightening, so we purchased locking washers. That only caused the legs to splinter. I contacted Overstock within a month (or so) of purchasing these chairs to inform them of the poor quality. They were not helpful in offering any sort of refund or replacement item. Terrible service.", 
    "My chair broke within a couple of days of purchase. The legs can't support any weight. Terrible!", 
    "Very nice chairs! Look great and were a great deal!", 
    "Very nice. Easy to assemble", 
    "I bought 2 sets of this chair last year and these are definitely the worse purchase I have ever done. The legs broke for two chairs, the fabric is a very poor quality. In general is a not even safe chair you can sit on it", 
    "I bought this for my dining room. They don't have a lot of cushion but I still love them. They look great!", 
    "Simple to put together and very comfy. Used for my office.", 
    "With these chairs you get what you pay for. I would recommend them if you aren't planning on heavy usage. They work for me because they are in a dining room we don't use often. The color is true and the fabric is acceptable, they just weren't made to last.", 
    "Overall great chairs for the $. The linen seems to be great quality and the assembly was fairly easy for my husband.", 
    "\"These look great and are just what we needed as we relocated from out of the country and needed to fill a house with furniture quickly. For the price, I can't really argue!However they are not that substantial and the stuffing in the seat isn't great so after sitting for a bit, you realize that the back of your thighs are pressing again the hard board at the front the chair.We won't have them forever, but until quality long-term furniture is our priority, these definitely do the job.\"", 
    "Chairs look much nicer in person than pictured. Cushions were not completely even but not very noticeable. I would not recommend these for everyday use. The price you can beat though. The overall look I liked better than chairs at world market that were over 150.00 a piece.", 
    "The chairs are a little stiff & I noticed that the material on the seat is starting to gather. Otherwise, it's a nice accent chair", 
    "Really wanted to like these since they looked so nice. But I ended up returning it. The seams just didn't look like good quality.", 
    "What I expected. Comfy.good looking chairs.", 
    "overall great chair true to picture and very stylish. Is not comfortable on the cushion after longer than 30 min of continuous sitting though.", 
    "Very comfortable. Only wish they were a bit larger in size. They look small with table.", 
    "Product looks great around the dining room table, but material looks inexpensive.", 
    "I got these chairs for a small dining table I have. I opened the box and could tell the linen color was more of a light beige linen rather than a white linen. I assembled the chairs anyway to see how the look and the are a good quality. The were sturdy when I sat in them and the fabric type is what I wanted. Ultimately I returned them because the color didn't match my room.", 
    "Inexpensively made. I'm not happy with the chairs. Will be contacting to return.", 
    "Sturdy and comfortable. They look great! Priced right.", 
    "Thank goodness these are going in a rarely used dining room because they feel shaky!!", 
    "Purchased two sets of these in Linen fabric but ended up returning right away. Unable to attach front legs to any of chairs due to poor construction. Guess we could have cut the wood to make them fit, but may have compromised overall durability of chairs. Linen fabric felt and looked of a poorer quality. Really wanted to like these chairs for our dining room due to price and style, but you unfortunately get what you pay for. Overstock made return very easy.", 
    "These chairs are great, they look much more expensive than they were and are very comfortable to sit on.They are in our formal dining room so only get used occasionally, I would never let my kids sit on them everyday as the material wouldn;t be easy to clean.The screws on the legs need tightening every few months as the legs wobble slightly over time, but that is the only indication that these were not expensive chairs.", 
    "The chairs brought a clean look feeling to our breakfast nook. We needed to send off for another leg due to the leg did not hold the weight of our youngest son. It's good to know you sent the additional leg with no problem.", 
    "These chairs are cheaply made. The legs do not stay screwed to the seats, the cushions are low quality- you can feel the frame through the padding, the fabric is cheap and thin. Overstock was fantastic about offering a full return on these chairs. The return process was easy- they even sent ***** to pick the chairs up from my house!", 
    "Very nice looking. A little thin on the legs but still pretty.", 
    "These chairs were a great find! The price was very nominal comparatively speaking and the fabric looks great! The color is right in line with the photo. The only downside was that the bolts that came with it didn't fit, and my husband had to work with what he already had on hand...", 
    "They look nice, but poor quality. We used them for 2 adult dinners and 4 of the chairs had loose and wobbly legs. Our other dining chairs we've had for 10 years and have never had to tighten the legs.", 
    "Chairs are nice but too small for a dining room table.", 
    "I bought these chairs because I thought they were heather gray like the color of a sweatshirt. In reality, they are way darker than expected. However, the quality is pretty good so I am just going to exchange them for the ivory color. They are pretty easy to put together and look fantastic! I'd recommend them, but be weary of the color.", 
    "I would recommend to a friend because they are reasonable and they look rich in colour and style. The only downside is the the back of the chairs it's an eye sore seams they are not even and it's two seams pressed together and it cheapens the chairs. The other downside they are not confortable because of their shade it leaves your lower back empty which requires for a small narrow pillow in order to fill the gab and be confortable, but that's the nature of the style. If your looking for resonable chairs and it's for everyday then it's for you.", 
    "I had ordered similar chairs even though they cost more and not as nice looking as the Bellcrest. This was only because I hadn't shopped on Overstock although I checked out the web site several times. When I found out that the chairs I first ordered weren't available as indicated and were back ordered, I canceled that order and went to Overstock. I was nervous when reading the reviews that some people had trouble putting them together. I don't have tools other then very basic so if I even needed a drill, I would have to call a friend for help. I was impressed with the quick delivery and nervously waited until I could start the process of putting them together.I expected to have trouble putting them together and soon questioned if I really needed 6 and wondered what I was thinking! I had two legs out of the 24 that gave me fits but I won! They took a little more patience then the rest and of course the first leg I started with had to be one of the trouble ones. I was really wondering what I got myself into. After a few tries it thought I'm not lining the holes up just right. I decided to put that one to the side and work on another. No problem so after the three were in I decided to tackle the trouble one. I had to put a little more pressure on the screw and got in in within a couple of minutes. I am very happy with the chairs. I do wish they had more padding around the front of the seat edge. This is why I rated the quality a little lower. I am barley average height and the back of my legs rest a little on the front edge. These chairs aren't the only ones I have this problem and they won't be the last!I got the steel gray color and they look great! I really like the chairs and get lots of compliments on them. The quality is better then I expected. We have had them for about three weeks now and they were put to the test at Thanksgiving. A couple legs needed to be tightened and something I will keep an eye on. I have since ordered other items from Overstock and will continue to do so.", 
    "Nice chairs. Easy to assemble. Stylish. Comfortable.", 
    "Very easy to assemble. Very nice chairs - a great bargain - especially if you us a coupon and O dollars. Delivery was quick and I may buy a few more. Very happy with this purchase.", 
    "After receiving these chairs and looking them over really good I noticed the stitching and seems we're not in straight lines and the fabric folds looks to be done by a child. I love the over all look So I kept them", 
    "I have never ordered chairs on line before. I was pleasantly surprised. They are so nice and fit right into my dining room. I love the color and the style. I would recommend them to a friend.", 
    "These chairs did not fit together at all I had to take apart the entire chair to make the legs fit. I ordered two sets of these chairs and both sets ended up not fitting together. I do not recommend these chairs and for just a little more money can buy you a quality product that you can actually sit on.", 
    "These chairs are decent looking. They did require assembling by me. Not very heavy or sturdy....", 
    "Very disappointed in the quality of the upholstery, the depth of the seat and the overall stability of the chair.", 
    "These chairs arrived and the legs wobbled. After checking our construction it was obvious the chair would not sit even. The color was not as represented in the picture. They were a very dark and unattractive muted grey not at all bright as in the picture. There were nail pops on the backs of the chairs. I really wanted these chairs to work but had to send them back.", 
    "The style and color of the chairs matches the pictures online but let me stress that assembly was a BEAST. What should take a few minutes simply inserting the legs and screwing the bolts tight took several hours in total. If you don't have: a sander, Dremel, mallet, drill, drill bits, a lot of patience and muscle, etc., then look elsewhere for seating options. The rear chair legs fit perfectly. The front were another story altogether as they needed to be sanded on the edges that are inserted into the actual seat. Also, I had to use a Dremel with cutting disc to trim down the notch on the chair legs for them to actually sit down far enough into the seat. I used the same rotary cutting tool to cut the bolts for the front legs shorter as they were about a centimeter too long. So all in all, too much work when this should be corrected by the manufacturer. I don't ever write reviews but chose to on these as I hope to save at least a few people the trouble I went through. On a side note, I have gotten compliments on the chairs.", 
    "Nice dining chairs for my small apartment, only problem I encountered were the legs to one chair didnt match and went with another chair. Assembly was easy and quick. Minor adjustments to keep the chairs from wobbling, just add some felt pads and helps take care of the issue.", 
    "Chairs arrived in about 5 days, they are beautiful! I can't believe how nice they look. Only problem: On one of the legs the screws don't seem to align with the holes. When my son comes over I'll have him take a look. Assembly (except for that darn leg) took me about 1/2 hour. I would definitely recommend these chairs.", 
    "Excellent chairs! I had been putting off buying new dining room chairs for a long time because I didn't want to spend the money. We definitely received a fair price and are very happy. They are stylish and my fiance said, \"That's a comfortable chair.\" the first time he sat in one. We bought the linen color and I love the way they brighten up the dining room the only room in the apartment without natural sunlight. Overall, we are very pleased with these chairs. Definitely recommended.", 
    "Loved these chairs, they looked great and were high quality and a great price.", 
    "I bought 3 set of chairs for a new dining table. The chairs are nice looking but 2 of the 6 chairs had different set up for attaching the legs. The pre drilled holes were also very sloppily done, not lining up perfectly with the holes in the legs. Many of the legs ended up being uneven, so I will have to figure out a way to fix that. All and all disappointed in these chairs.", 
    "I really loved the way these chairs looked. I was really excited to get them. Assembly was easy, but the legs didn't want to fit. Then I had issues getting them to sit evenly. Now, a few months later, after some light use, one of the legs has cracked and I have 3 chairs at the table instead of 4! Ugh, so disappointed. Also, the fabric is fine, had no complaints, until you get a little food dropped on them. It's really hard to clean because the fabric is rough, the food gets stuck/embedded into the texted weave of the fabric. Lastly, the seat bottom has poor cushioning. It's not horrible, but it's not close to mediocre.", 
    "They look great! I can't speak to the durability yet because they are sooooo new! I'm hoping that they hold up well.", 
    "This chair looks great and is good quality...but we had one come damaged and one the legs were the wrong legs & another the legs wouldn't fit into the chair! It's upsetting when you buy products and receive them with problems. If you can get them put together though they are really nice!", 
    "All chairs when put together have a slight wobble....felt pads seem to help balance but clearly manufacturer needs to adjust right front chair leg assembly.", 
    "The chairs are quite nice for the price. The material looks like real leather and the button accents are very nice. The feel of the material isn't as smooth as it looks but still very soft. I bought these as guest chairs for in front of my desk at my office. So far, everyone has said how nice they are. I did get the 5-year warranty just in case.", 
    "These chairs are a great buy. I bought 3 sets for a total of 6 chairs. They look nice and are comfy to sit in. If I had a complaint, it would only be that it takes some time for seat to regain its puffed up shape after sitting in it for some time.", 
    "First time I hated something I bought at Overstock. I wanted to love this product, but really couldn't. It is not very hard to put together, but that's the only good thing about it. Of the 4 chairs I bought (2 sets) two were defective and Overstock CS was very nice and helped me exchange them. One of the chairs in the third set I received as an exchange was defective again. I'm so annoyed with those chairs that I won't even bother to ask for an exchange one more time (consider taking it to UPS once again; not worth it). The fabric, the \"wood\" of the legs and frame of the chairs are of terrible quality. I'm not picky at all and was not expecting the perfect chair for this price, but I did expect a better quality than what I got. You can certainly find better deals out there.", 
    "I sadly will need to return these chairs, but not because of quality. The color of the fabric did not quite match up to the rest of my decor like I was anticipating. I did set up the chairs to see if it would work in different lights. I thought they were easy to set up and very comfortable to sit in. The quality seemed like it would hold up well. I am sad to see them being returned. Very nice style, the fabric was nice, quality was nice and priced well too.", 
    "chairs are pretty to look at, but I would be a nervous rack if I had a dinner party. I probably could not thin about anything else but all the stains that chairs would collect. You can't wipe this chairs off. The fabric which is used is totally not suitable. It's a linen/cotton material which is probably your worse choice if it comes to stains removal. I was very disappointed with a poor quality, yet I understood why they were priced so low. When you seat on that chair, you can the seat rim, it's like seating on the bucket. I would only buy these chairs if I was staging a room for a quick sale.", 
    "These chairs are really beautiful and for the price made it easy to buy 4 of them. They are sturdy and the material is not cheap looking. The chairs aren't perfect (the buttons are not lined up on a couple of them) but for the price it's a great deal and they add a nice richness to the dining table without all the cost!! Easy to put together. Don't buy the ********* chairs with these though...although the color and material are stated as being the same they are completely different. The ********* material is completely different and really cheap looking."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Bellcrest-Button-tufted-Upholstered-Dining-Chairs-Set-of-2/7984149/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7984149/Bellcrest-Button-tufted-Upholstered-Dining-Chairs-Set-of-2-7c07586f-3350-4ffa-9c73-482f88583055_600.jpg"
  ], 
  "description": "Add a classic and elegant touch to your dining area with this\ndining chair set from Bellcrest. This set of two chairs features\nbutton-tufted upholstery and soft foam fill for luxurious comfort.\nThe dark walnut finish contrasts with the muted fabric color\npalette to give these chairs a warm, contemporary look.Add a classic and elegant touch to a dining areaButton-tufted upholstery and soft fill provide luxurious\n  comfortAvailable in a hard-wearing linen fabric or a faux leather\n  finishDark walnut finish contrasts with muted colors for a warm,\n  contemporary lookSet includes two chairs for symmetryCrafted of durable pine woodFire-retardant foam fill for safetyAmple 20 inch seat dimensionTotal dimensions measure 30\" H x 21\" W x 22\" DStyleContemporary, UrbanMaterialFaux Leather, Linen, Pine, WoodFinishGrey FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrown, Grey, WhiteFurniture PatternSolid"
}