{
  "name": "Better_Living_Yellow_Medallion_Rippa_Chair_with_Silver_Frame", 
  "price": "EUR 119.11", 
  "reviews": [
    "Could not put together. Bolts were not compatible with frame and bolt holes in chair didn't line up with those on the frame. Included zero of the seven necessary lock washers. Does anyone check these items before agreeing to sell them thru overstock?", 
    "Okay on style and comfort I would say 5 stars but assembly is a hassle. I got 2 and both the frames had to be bent by two of us to get them to screw in properly. On one of the arm screws the batting kept getting caught on the screw and it was a nightmare. I spent about 3 hours putting together these things. I do not think one person could do it. However once together they are wonderful! I love the lines and they are comfortable and the colors are gold and cream and grey and brown and they really are a statement piece in my home.", 
    "My complaint is with the side holes for the arm pieces. The holes where hard to thread into and the metal was sort of bent so my contractor had to yank it back to make it fit. I could not have done this assembly alone. I have put together lots of furniture alone and while this had just a few screws, the frame bending was simply too hard for me. I ordered 2 chairs and both had the problem so statistically it seems that this is a manufacturing issue. As for the look, the chairs are adorable. The color is wonderful and they look like they will last a long time. They are sturdy and quite comfortable too.", 
    "Is a very sturdy chair that was easily assembled by my husband and looks great in our living room. We have pale grey walls and a grey sofa and this brings some color into the room. The chair is very retro looking. My daughter would love one for her college dorm room.", 
    "it was a challenge putting last screw in but it's well worth it... love the new look in my family room. GREAT PRICE?", 
    "VERY,VERY PLEASE.GOOD BUY", 
    "I bought a set of these and love them!! Design is unusual but very comfortable with a deep seat. Fabric is gorgeous and is holding up very well to wear. I bought these for my kids to use when they play their wii and want to sit. Much better than their banana chairs that we previously had"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Better-Living-Yellow-Medallion-Rippa-Chair-with-Silver-Frame/8874067/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8874067/Better-Living-Yellow-Medallion-Rippa-Chair-with-Silver-Frame-4b9184e5-f682-41ef-b5ef-d3455fac73db_600.jpg"
  ], 
  "description": "The Better Living Rippa chair features a suspended seat design and is covered in a yellow medallion design fabric. The unique suspended silver frame allows for a gentle motion seat.Retro designed silver metal frameEco-friendly and efficient product design uses less fossil fuel based components in construction and deliveryVarious components are recyclable at the end of useInstructions and tools for assembly includedTakes less than 30 minutes to assembleMaterials: PolyesterFinish: SilverUpholstery color: Golden yellow accented in shades of dark brown, pewter gray and ivoryUpholstery fill: Foam and fiber filling with no sag springsDimensions: 37 inches high x 24 inches wide x 31 inches deepSeat dimensions: 18 inches high x 22 inches wide x 19 inches deepArm height: 23 inches highStyleContemporary, Modern, Traditional, Transitional, UrbanMaterialFoam, Metal, PolyesterFinishBrown, Gold, Metal, Pewter, SilverChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBrown, Grey, Ivory, Off-White, YellowFurniture PatternPinwheel, PrintProduct FeaturesEco-Friendly"
}