{
  "name": "Christopher_Knight_Home_Hawthorne_PU_Leather_Glider_Recliner_Club_Chair", 
  "price": "EUR 476.49", 
  "reviews": [
    "This chair is perfect! I'm a big guy and it suits me well. It was easy to get in the house. We have narrow stairwells due to the house being built in the 1700s. It comes in the box in 4 pieces that are SUPER easy to assemble. Just slide the wings on the back and slide the back onto the main frame of the chair. It locks in place and can be removed should we need to ever take it out of the house. Unfortunately for me, my wife has already taken it over and is comfortable passed out taking a pregnant day nap! Great chair and free delivery as compared to the local furniture stores that would want the price of the recliner plus $50-$80 for delivery.", 
    "Especially for the sale price ,this is a very good value. Firm, but very comfortable. Good for my bad back. Only one thing. I am 6, 4 inches, and this chair will not support my extended legs when in the reclining position. Something I'm learning to live with, but wish it was not so short.", 
    "Nice sized chair if you are over weight, easy to put up foot rest, but a little hard to close foot rest if you don't have the strength. Over all good chair and I would recommend it. But they sent me wrong color. I wanted a black chair and got brown. To much trouble to send back for the color.", 
    "Great great great chair . You won't be sorry .....", 
    "Wonderful in every way ! A satisfied customer ..", 
    "I had to call the company directly to have the right arm piece sent to me. It was free, but quite a wait.", 
    "Looked bigger on picture but I do like it a lot. Delivery was only 5 days. I'm a happy customer.", 
    "chair picture did look look a lot bigger. im about 200 plus and it was strong enough to hold me and did not fall back or anything. was hope for a lil better headpiece that would give it a lil more support. good as its going to get.", 
    "I love the recliner, it is so comfortable! I have degenerative arthritis in my knees and I can get up and sit down easily in this chair. Quality material and workmanship.", 
    "Very Good item. For the price, I feel that it was worth every dollar I spent on it.", 
    "I bought 2chairs, they are light, the bottoms are. Hard to kick in for me. Very pretty, but I would like a heavier chair. One chair seems to be easier to get out of for some reason. Over all I like the chairs", 
    "Sent the Chair with a missing part. I called and asked for the part to be sent. They sent the part . but it was the wrong part .", 
    "Love this recliner! It was easy to assemble, great deal for the price!", 
    "having problem with leg rest not working, don't know what to do the recline is real comfortable if only the leg rest would work", 
    "We received this chair during a doorbuster deal for a little over $$$ and it is an amazing chair for that price. It's firmer than it looks in the picture, but it's comfortable. We wouldn't have purchased this price at the original sale price but for the price we got, it was a steal.", 
    "this is a great chair confortable and the price you cant beat that i recommend this is an excellent choice", 
    "The price is great, the couch is amazing, my husband loves the comfort in it.. great investment", 
    "This was delivered in such a timely manner and was a great surprise Christmas present to our son! Thank you, thank you!", 
    "Sale & delivery were easy & prompt. Service & product was very good.", 
    "This chair is very soft and comfortable! I love rocking in this chair and it was very easy to assembly.", 
    "This recliner is great looking and very comfortable. Very easy to recline..especially love using the glider feature to rock the little ones while reading to them. Very little assembly required...Excellent price for a recliner of this quality.", 
    "This rocker recliner was more plush than I expected. It came in a box that easily fit through the door. It suggested to have 2 people for putting the 4 pieces together but it was so easy my husband was able to put it together by himself.Terrific purchase!", 
    "I recommended easy to assemble cushioned is for a king.", 
    "Good quality putty comfortable and beautyful look I buy for my dad birthday really fast shipping and free. i didn't finded nothing better.", 
    "EXCELLENT. VERY COMFORTABLE", 
    "Bought for my husband for Christmas and the recliner is fabulous. Love it because it is not big and bulky and does not take over the whole room. Want to buy a second one if it goes on sale again!", 
    "Wonderful chair my husband is very happy great comfort and very well built", 
    "Comfortable enough easy to put togetherFour stars because after reclining Must push hard with feet to close", 
    "This recliner is extremely easy to assemble and will go with any type of décor. I am pleasantly surprised at the quality of the leather and the comfort of the chair in any position. It seems to be well made and is quite sturdy, plus it fits perfectly in our living room.", 
    "This charge is not comfortable.arms are low back is straight across .it does not envelope you"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Hawthorne-PU-Leather-Glider-Recliner-Club-Chair/10673334/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10673334/Christopher-Knight-Home-Hawthorne-PU-Leather-Glider-Recliner-Club-Chair-379ba187-65f8-4320-9b82-a6c3bf04bedd_600.jpg"
  ], 
  "description": "The Hawthorne PU leather glider recliner club chair is the perfect\ncompanion for any media room or living room. The chair's\ndual-function operation allows you to recline and elevate your\ntired feet at once. Furniture Pattern: SolidChair Type: ReclinersMaterial: Wood, Faux LeatherStyle: Casual, Contemporary, Modern, TraditionalAssembly: Assembly RequiredExact Color: Red, Black, BrownColor: Red, Black, BrownIncludes One (1) reclinerMaterial: PU leather, woodColor options: Brown, black, or redAssembly required: YesWeight: 102-poundsDimensions: 39.75 inches high x 39 inches wide x 42.50 inches\n  deepSeat dimensions: 19.50 inches high x 22.50 inches wide x\n  21.75 inches deepStyleCasual, Contemporary, Modern, TraditionalMaterialFaux Leather, WoodChair TypeReclinersAssemblyAssembly RequiredColorBlack, Brown, RedFurniture PatternSolid"
}