{
  "name": "Christopher_Knight_Home_Tafton_Tufted_Fabric_Club_Chair", 
  "price": "EUR 348.70", 
  "reviews": [
    "This chair has nice lines, is comfortable, and well constructed. The only thing to do is take it out of the box, screw on the legs and you're done. The fabric is nice but leans more to a blue grey than just grey.", 
    "This chair is probably worth a little less than the o.co price. For a little more money, you could proably get a much better chair somewhere else. The chair looks nice - that is really the selling point for this chair. It is not particularly well made, not terribly comfortable, and it is clear that the chair will not have a very long life if used frequently. I got the chair for % off and shipping, and I still think that the chair was a bit overpriced. I will probably end up upgrading in a couple years, which is not exactly what I was hoping for in this purchase.", 
    "This chair looks great in our living room. The back is lower than I expected (I should have read the measurements). This chair is very roomy. My only minor complaint is that I was expecting to sink into this chair but it has a pretty firm seat.", 
    "It's a nice chair, but it looks sturdier than it is. The fabric seems to be a good quality, and I find it comfortable to sit and watch a movie or read for a while. However, it's quite wobbly and the legs keep turning around. I'm sure someone handy could make the wobblyness go away. It's big enough to sit cross legged on the chair, but the back isn't high enough to rest your head against (unless you're very short I guess). All in all I'm happy with my purchase.", 
    "First, I could not believe that it would arrive in 5 weekdays. It did! The legs were easy to install. I like the combination of less formal fabric, with the tufted application. Otherwise they would come across as too formal. They were perfect for the living room (with the hardwood floors and stone fireplace). I needed the fabric to soften the look and absorb sound. I hate those overstuffed, mushy chairs. These are firm (but comfortable) and roomy.", 
    "The shipping may be free but the delivery was unsatisfactory. The chairs were set in the driveway and we had no idea they were there . Not even the courtesy of a doorbell ring to say they'd been delivered. The chairs are very firm to sit in luckily more for show in our house so that's not important. One of the studs was knocked off but luckily we found it in the wrapping. One of our chairs looked like it had been used and returned with one corner of the chair scuffed. Overall not impressed.", 
    "We ordered these chairs to fill a corner of our room, thinking that they would barely be sat upon. To our surprise, they are really comfy -- my dogs love to snuggle up to me on the side as the seating cushion is large! Very happy with this product - wish it had a matching footstool!", 
    "For the price did not expect a very comfortable club chair for my living room. I have had many complements as it sits well among my other furnishings. Great Deal and super to assemble. Just put the legs on . Simple", 
    "I love my new chair. I hesitated purchasing this chair because I like to sit on furniture before purchasing. This chair arrived quickly, easy to assemble, just screw on the legs. Chair arrived well packaged, with a nice protective cover. This chair is comfortable and a beautiful addition to my master bedroom. Great reading chair!", 
    "nice color and spacious good size", 
    "Great alternative to ******* **** chairs. Fraction of the price and still seemingly good enough qua", 
    "Received this char in good shape and as pictured. The legs are easy to attach and the location was well labeled on the instructions and packaging. It was a little unbalanced but I used two of the extra included washers to level it and now it is perfect. It is wide enough to curl up in and seems to be well made. Would buy again.", 
    "I read all the reviews on this site and other sites before purchasing 2 of these chairs for my living room. They are \"nice for the price\" but really are not any sort of heirloom chair. Because I am really just using them for show and occasional seating I think they will be fine. Things I like...the fabric is thick and I feel like it will wear well. The gray has a lot of blue undertone which is what I wanted. The frame construction seems sturdy and the craftsmanship of the tufting and nail heads is nice and neat. I actually find the chair very comfortable, albeit firm. Things that could use improvement...the cushion seems cheap and a bit lumpy looking. I would imagine the foam in it would break down quickly if used and sat on everyday. The section of the chair right below the cushion in the front also has those same issues. I find myself trying to constantly smooth things out. I realize that you cant make a $$$ look and feel like a $$$ chair so I am overall happy with this purchase, but if you are looking for an everyday piece, I would have to agree with other reviewers and tell you to keep looking.", 
    "Chair is extremely stiff...maybe it will soften up with use. Looks exactly as pictured.", 
    "Not what I expected. It didn't worth my money could've of put a little bit more money in towards a better chair.😔", 
    "I love this chair only had to screw the legs on and that's important to me since I don't have any help putting things together", 
    "I received the chair's I ordered and was impressed with the way they were so carefully packed, I love the color and the chairs look very nice, I was disappointed with the stiffness of the seat- they are a bit hard when you sit down. I wanted them as accent chairs for my living room and I bought two of them. For the price they are well worth it and they look very nice in my living room.", 
    "I love this chair. I was hesitant to purchase online, but I'm glad I did. It is the perfect addition to the room. The fabric is great quality and the nail head trip is beautiful. It is extremely firm but I'm sure that will remedy with time and use. It seats a bit deep which is nice if your tall. I'm very pleased with it.", 
    "Seat very hard and uncomfortable", 
    "Not tall in back but pretty comfy. Very happy with this purchase.", 
    "I love these chairs, and I am really happy with the price. They are fairly comfortable and look great. The cushions tend to wrinkle a little bit in the front, but I think I will be able to fix them with a little extra padding. (The cushion cover can be accessed through a zipper.)", 
    "I bought this chair for a reading chair. It works perfect. I wish it was a little higher so it could double as a computer chair as well. Very comfortable though and seems pretty durable.", 
    "I got two of these chairs for the living room in our home to replace one of our sofas! They are great! A little stiff to sit in but it actually isn't bad at all. Nicely built, great color and easy to put together.", 
    "bought this for mom because it has nice arms so she can get in and out easy.", 
    "What you see is what you get, no surprises. Exactly what I wanted.", 
    "Got this chair for my Master Bedroom, It is just perfect for reading or watching TV. Very comfortable and well made. I am about to order a second one!", 
    "lovely, exactly what I was looking for. Very little assembly required.", 
    "Great chair. Beautiful and very roomy. I feel like I can cozy up in it. Very firm seat cushion which I think is a pro because over time I'm hoping it will stand up to lots of use. Easy to assemble. Nice value for price paid. 4 stars because color is slightly more blue than the grey I was hoping for but I pretty much expected that based on the reviews I had read (which was almost all of them!). The fabric is kind of a grainy kind of tone so I'm thinking it will disguise stains pretty well.", 
    "Comfy and welcoming .... A perfect addition to a cozy corner of my bedroom!", 
    "Perfect chair! A great price and good quality.", 
    "I read a lot of reviews of this chair before I purchased. Unfortunately, most people said it was extremely comfortable which it is not. The cushion is hard. If you are short, this does not work for you. You have to sort of lean back into it. Looks great. Not for everyday use for sure.", 
    "I purchased this chair for my bedroom because of the size and shape. The color is a bit more toward blue and that works perfectly for my room. While this chair is very pretty it's a chair that you \"sit on, not in\". By that I mean is looks great, but isn't a chair for curling up and reading a book. I would purchase it again, however to use as an occasional chair.", 
    "These chairs are very nice. Was disappointed that they seem a tad understuffed. Also, the bottom lining sags.", 
    "Love the color - gray - a bit harder than we had though. You definitely don't just \"sink into\" this chair. But it seems sturdy and looks expensive.Its a keeper. Bought an ottoman at the same time - and chair seat is lower than the height of the ottoman.", 
    "I bought two of these chairs in gray fabric. Easy to attach the legs. I like that the seat cushion is firm. So happy with this purchase. Enjoy sitting in my new chairs. So cozy.", 
    "Looks great and everyone loves it, even the kids!", 
    "If you're looking for a chair to really settle into and watch a movie or read a book, I would say this is not the best chair for that. It's not uncomfortable....just not cozy. It looks more expensive than it is and I love the look.", 
    "This chair is exactly what I was looking for for my living room. It's a good size and very comfortable. It is fabric, so my concern is that it will stain, but I scotch guarded it and so far it's held up well.", 
    "Beautiful, comfortable chair. Great buy.", 
    "It's great looks perfect. Everyone who sees it wants to know where it came from. Not good for a looooong sitting time. Perfect as accent piece", 
    "Purchased 2 in Spring and I love them. They are attractive and super comfortable. Surprisingly comfortable for both our 5' and 6'3\" frames. Have received multiple compliments on these chairs and I couldn't agree more.The only issue I had with them is that the back legs are supposed to face outward and I had difficulty getting them to screw on tight enough that they wouldn't spin, but still face outward. Removed a plastic washer and problem solved.", 
    "Material seems to be nice and should wear well as this chair will not get a lot of use.", 
    "Looks great but not very comfortable.", 
    "I love this chair! It's the perfect chair for my space. I wish I would have purchased two of them. Larger in size and you can lean back a bit. Deep seated and very nice looking. Easy to put together and really is a nice purchase. Good price too!", 
    "We've had the chair several weeks now and so far, so good. It looks gorgeous in the corner of the bedroom and is a great reading chair. I love the lines, the styling, and the feet on it. My only concern--which time will tell--is whether the fabric and cushion will hold up. Already the cushion seems a bit lumpy and the fabric has pilled in several areas. Keep in mind this is a bedroom chair we sit in maybe once or twice a day to put shoes on or something. It doesn't get heavy use. But overall I'm really pleased with the purchase. We saw the exact same chair at Tuesday Morning for $400.", 
    "Previous reviews are accurate. Nice looking chair. Smaller (as a whole) than appears on site, but chair is \"roomy\". Not super comfortable, but I expected that from previous reviews. Looks great in my den, and was very easy to assemble. Fast delivery.", 
    "Not a huge chair, or overstuffed by any means, but perfect for a corner conversation. Color is pretty true to photo, but is more like a tweed, it is not a solid color.", 
    "This chair is wonderful! It is a hard cushion, like other viewers had mentioned, but we like it! The color is nice, the material is quality. Overall, I am very pleased with my purchase.", 
    "i was surprised by how comfortable these chairs are! love the tuft look and nail heads. a little more blue than grey in color but that's ok...they still look great. now just waiting to order a loveseat and area rug to complete the room!", 
    "I bought two of these chairs for a meditation/reading room. I love them. If you like soft cushy chairs, these are not for you. I am very comfortable. also, these may not be sturdy enough for heavy traffic or rough treatment. for me they are perfect. They look great. The color is like the photo.", 
    "Super cute. A little bit more firm than I expected but still very comfortable. I love the color and the fabric looks like denim. The only thing you have to do is screw the legs and voila! Not a heavy bulky piece, which is perfect to keep the decor light and clean.", 
    "Really looks nice n rich and quite comfortable with a small cushion at back.", 
    "Great chair. Easy to assemble. Comes oddly packaged, but no damage to chair.", 
    "Love how easy these chairs are to assemble and how beautiful they look but I don't understand why they are so short? Definitely don't feel like a standard height but they are really nice looking for the price! I have three pieces and use them for children's portraits so height is ok.", 
    "I wish I could give it a five star but here is what I experience Pros: good looksEasy breezy assembleLight weight ConsPriceToo light weight that it keeps moving when you try to sitFabric does not look like it will last since I already see tiny small balls of woven surfacing everywhere", 
    "The chair is pretty much perfect. It's comfortable, seems durable, and is the perfect size for curling up with a book.", 
    "A beautiful addition to my daughters room and very comfortable!", 
    "Everyone loves this chair and what a fantastic look. I purchased another one.", 
    "I absolutely love this chair. It's super stylish and cute. It fits well in my little 'library/reading' area of my home.. I wanted something a different color than my black bookshelves but that would also fit in with all the vintage-y type items I have about the space..and it's perfect. The grey is a slightly blue-ish grey but it isn't so blue that you go 'oh hey, nice blue chair'... Everyone who has come over and seen it says it's super cute and asked where I got it from! Would definitely purchase another. c:", 
    "I spent weeks searching for a chair in a similar style as an antique that had seen better days. I found this one, it is exactly as pictured. I read many reviews before purchasing and yes it is an accent chair. It's smaller and low to the ground. The grey is a medium shade. The only reason I didn't give 5 stars is because this wouldn't be a daily use item, I don't think it would hold up to long if it were in a family room but in my formal living room it is perfect!", 
    "these went in my office and add so much coziness great color and texture", 
    "Since this chair was given to my granddaughter for as a Christmas gift I can only say it looks sturdy,wellmade & is comfortable to sit in. Ordering was a breeze,I was kept updated on specifics and delivery was well before the online stated deadline. I am very pleased with the whole purchase process !!", 
    "Bought this to replace a leather club chair and and I am very pleased. It sits low but wide so there is plenty of room to curl up in. The fabric looks like suiting and will go nicely with my black gray and cream room redo. So nice but my cats love it too.", 
    "The chair is a nice quality - especially when you consider the price. It looks more expensive than it is and the size is great for those times you want to curl up. As others have mentioned, it's a bit firm (particularly because it gives the appearance that it will be super cozy) but both my husband and I prefer firmer seating so we're pleased.", 
    "both comfortable and stylish, looks just like the one at a very trendy store at a fraction of the cost", 
    "This chair is stylish and fits right in with my other furniture. It is not a cushy, cozy, snuggle up kind of chair but it's good for when you have extra company.", 
    "I think the look of this chair is great for the price. It looks as good in person as it does in the photo, though it may be a little lower to the ground in person than I expected. It's probably not the highest quality piece of furniture you'll ever buy, but I don't have a lot of money to spend on furniture, plus I have cats.I also like how wide the seat is. There's room for a pet friend to sit with you or room to curl up with your legs on the seat.", 
    "I received this chair today & was extremely pleased. Only assembly needed was to screw in chair legs. Very pleased with the fabric, fabric color & nail head details. Very masculine, for which was my intended purchase for company's President's office. It is also comfortable & roomy. He was also extremely pleased & said I should have ordered two ... well, I ended up ordering a second chair. This chair has a classy, professional look & definitely looks like I paid way more.", 
    "Very happy with this chair. It arrived in good time and good shape and totally as advertised. Mine is more comfy that expected and it's big enough for me and my 2 cats to curl up and watch TV or read a book.", 
    "Love this chair! Looks great! It is very roomy and I use it to read everyday! Also, another plus, it arrived within a week of purchase. Great deal for a great product. Easy assembly too- just screw on the legs. It is a bit lightweight and slides on hardwoods. Even still, I am really glad I decided on this one!", 
    "I became interested in this chair after seeing a similar one at Pottery Barn for 3 times the price. I love the style of it, and it looks great in my living room. However, it is smaller than the Pottery Barn version, so take note of the dimensions before ordering. The photo here doesn't accurately show the color of the fabric, which is really more of a blue-grey. It goes well with my rug, so I have no complaints about that. Also, the chair is very firm. Some people like that, but this is not a \"sink-into-it\" kind of chair. Finally, I have only had the chair for a few days and already there are some \"pulls\" in the fabric (and the chair has been sat in for maybe a total of 15 minutes so far). But I noticed that this was also the case with the chairs I saw in Pottery Barn. All in all, I'm happy with my purchase for what I paid.", 
    "The chairs were damaged on the bottom where the hardware came in. The lining on the bottom of 2 out of the 4 chairs were ripped.I kept the chairs because I needed them right away.I wish I had shopped more for them but the price was fair.I do like the look of the chair but not the fabric.Delivery was quick and they were easy to put together.Not sure that the quality of these chairs is what I anticipated.", 
    "We needed a chair in a small bedroom and this one was perfect. Arrived within days in excellent condition. No problems installing the legs. The color/style is grey tweed and exactly as described. I don't know if this chair would necessarily hold up in a room with high usage area but in a bedroom it is perfect. As others described, it is low to the floor but that was what we were looking for. We've purchased furniture before at Overstock and have never had a problem-we take the product reviews seriously. I would definitely recommend this chair.", 
    "Make sure you check the dimensions of the chair. Okay chair but it looks like a kid's chair.", 
    "Nice Chair to watch tv in.Good price for Christopher Knight Home Tafton Tufted Grey Fabric Club Chair.", 
    "Very pleased with product it arrived on time as stated and in good condition", 
    "perfect for my bedroom, a little low to the ground, but love it", 
    "Great chairs for an amazing price! Very comfortable and look great in my office.", 
    "This is a great looking chair! Love the grey tweed material and the similiar styling to a chair I saw at PB except 1/2 the price and almost instant ship time (compared to 4-6 weeks)!", 
    "Bought this chair for our bedroom, color and size were great, went to Pottery Barn and they have pretty much the same chair for $900.!", 
    "This chair looks great and is very reasonably priced. I was originally going to buy an almost exact chair from a another popular retailer and saw this one on overstock for half the price so I ordered my first chair last fall and now just bought my second one to match it. I use this chair in a room that is used primarily for when company comes so it is not frequently used. The quality is just average, but I think it is perfect for a light use room. It looks much more expensive than it actually is and I think it is rather comfortable considering the price. Would highly recommend!", 
    "This chair is wide enough so that you can curl your legs up into it and read a book under a throw. So, it's more comfortable than most other accent, sitting-room chairs. We spent the extra money and are happy with it. Easy to clean fabric. Rivets are set in nicely. The cushion isn't super soft and puffy, but it seems durable and like it will last a long time. Overall, a comfortable, attractive chair. I'm happy we have it.", 
    "I got the chair in 4 business days, it's a nice size. my only complain is that the seat is a bit stiff", 
    "This chair was a great addition to my living room. It doesn't take up too much space, but is still large enough to curl up in. It is firm but not uncomfortable.", 
    "I'm very pleased with this chair. Also bought the tufted round grey (storage) ottomon on Overstock.com, which is a nice height for this chair - not an exact color/fabric match, but both pieces are close.", 
    "Great chair and quality for the price. It looks just like the picture. It is comfortable.", 
    "very nice chair at a good price. seat a little firm but will hopefully soften with use.", 
    "The great price and stylish appearance of this chair swayed me to order it without sitting in it, something I consider a no-no for furniture buying. It arrived promptly and proved to have a seat which is generous and firm. It also has a nice removable seat cushion which increases the comfort. It was easy to put together and arrived in good condition. It is blue grey as described with legs that are an espresso color. The details in the tufting and the nailhead trim are nicely done. It is a very light weight chair, good for light to moderate use. My biggest gripe is the fabric, which, frankly, has a finish that makes it look a little cheap. The weave suggests it will not wear well. Overall, good for the price but not for heavy use.", 
    "Easy to put together looks great. My one complaint is that the back isn't high enough to rest you head back (if that makes sense). But over all very nice!", 
    "This chair is perfect for my small room! No it is not big enough for your 6'6\" boyfriend, but it is the perfect size for a small apartment like mine. It is not a chair that you will sink into, but it is comfortable. I love that the seat is big enough to curl up into and that the back is wide. Best of all the chair is beautiful!", 
    "We purchased 4 of these chairs for our keeping room. Quality and look was consistent among all four. I am 5'4\" and when sitting in the chair could use a small pillow along the back for additional comfort. Chairs are very durable.", 
    "This is a very comfortable chair and perfect for the corner reading area in a room. You will love this chair if you like to put your feet under you while sitting; plenty wide and the perfect height for the arms. Very happy with this purchase and of course \"O\"!!", 
    "I am really glad that I ordered this chair! It is simultaneously modern and traditional. The shape of the chair is rather feminine (the curved back etc) but the fabric and metal studs compensate for this. So, I think that it will work well in a lot of decors.", 
    "The chair looks like what you see in worldmarket.", 
    "Very good product and fast delivery. I have always been impressed with the service. Thank you.", 
    "Overstock delivered the item within a week of ordering. It was an easy process and the price was right."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Tafton-Tufted-Fabric-Club-Chair/6201477/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6201477/Christopher-Knight-Home-Tafton-Tufted-Fabric-Club-Chair-4c09d9a9-8b20-472a-9d47-bce9eab3b6f1_600.jpg"
  ], 
  "description": "Imbue your den or study with impeccable style by adding this Tafton fabric club chair from Christopher Knight Home. This elegant chair blends comfort and modern sensibilities with traditional style, creating a piece that works well with contemporary decor. The neutral color options allows these chairs to blend with numerous design themes, making placement simple.Includes: One (1) club chairMaterials: Polyester fabric, woodcolor: Grey, light blue, or light purpleFinish: EspressoFeatures: Studded accents and button tuftingAssembly required: YesWeight: 33 poundsDimensions: 33.75 inches high x 35.25 inches wide x 33 inches deepSeat dimensions: 19.25 inches high x 24.25 inches wide x 24 inches deepStyleModernMaterialFabric, WoodFinishBronze, Espresso, WoodChair TypeClub ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Grey, PurpleFurniture Frame MaterialWoodFurniture PatternSolid"
}