{
  "name": "Christopher_Knight_Home_Angelina_Dining_Chair_(Set_of_2)", 
  "price": "EUR 161.78", 
  "reviews": [
    "I am pleasantly surprised that the color is exactly what i thought it would be from the picture online. The quality is great as well", 
    "We love the color of our chairs. The quality is good.", 
    "These chairs look really high end and are very affordable compared to what I was seeing in the furniture stores. Very easy to assemble. They look great!", 
    "I would say that for the price, these are great. They are a little cheap feeling. I probably would not use them in a real dining set, we are using them for a breakfast dining area. They are slightly wobbly.", 
    "Nice chairs. Fabric is nice and well made. They sit well. A true gray color. May be just a coincidence but we had a chair leg break when someone sat down. Overstocks sent us a whole new chair! Thank you, Overstocks!!", 
    "These chairs look streamline and have some neat details such as the buttons and the pleat on the back. Not the most comfortable but good enough for an occasional use. Using them everyday may be a issue for some people. They seem to be well constructed and look good."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Angelina-Dining-Chair-Set-of-2/9239295/product.html?recset=46972b2c-5cef-4292-a3c1-4a2b2738f603&refccid=QKLDIC7TSWG2ELKKAHAJ7FREUY&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9239295/Christopher-Knight-Home-Angelina-Dining-Chair-Set-of-2-c5459981-5f67-4b82-aa0c-9c25e8cabba8_600.jpg"
  ], 
  "description": "The Angelina dining chairs are a perfect set to bring together any space in your home. They compliment almost any decor and even double as extra seating. These chairs will satisfy for years to come by offering comfort, style, and durability.Includes: Two (2) ChairsUpholstery color: Denim blue, light brown, deep orange, or greyUpholstery material: 100-percent polyesterMaterials: Fabric and wood frameWeight: 13 lbs (each)Dimensions (seat / overall): 19 / 39 inches high x 18.5 inches wide x 17 / 26 inches deepStyleContemporary, ModernMaterialPolyester Blend, WoodChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlue, Brown, Grey, OrangeFurniture PatternSolid"
}