{
  "name": "Christopher_Knight_Home_Venetian_Velvet_Dining_Chair_(Set_of_2)", 
  "price": "EUR 216.58", 
  "reviews": [
    "Loved the chairs! After putting together the first chair the rest was easy to assemble! Great price for the set of (2)! They made my dining room set come back to life! Super wide and comfortable!", 
    "This is my first time writing a review. But once I received my chairs I felt I had to. The Christopher Knight Velvet Dining Chairs (4) are exactly what I was looking for and they look gorgeous in Black. They are also very sturdy because after my nephew put them together for me we test them out and I give them an A+ and if they ever become available in Red I would buy 2 more just so I could alternate the colors around my table.", 
    "I put these black chairs on both ends of my kitchen table. Added 4 Leopard chairs & my kitchen table looks great. We have kids & entertain ALO . They are very sturdy & love the quality of fabric", 
    "Bought these chairs for head chairs in dining room and they are absolutely gorgeous! I love them. Only had one minor issue, one of the legs of the chairs was a little short not noticeable though. My handy husband was able to fix. Buying 4 more!!", 
    "I have been searching for the right chairs for over eight months to go with my rectangular glass top dining room table and finally found these. They couldn't be more perfect! They really updated our dining room and give it such an elegant look! We are impressed at how fast we got them, we ordered them late on a Sunday and got them Friday morning. The chairs took about twenty minutes each to assemble, the first one a little longer just because I had to familiarize . They are Beautiful, sturdy and strong! A Great Value for the price!", 
    "My chairs look great in my dining room.... I loved them. They look elegant and trendy.... I highly recommend them :)", 
    "I liked the chairs but, one of the tufted backs came with a pulled thread I called telephone number 818-435-3985 and spoke with several representatives and I have to wait until April 2016 for a replacement. I think it is disgusting especially since I had to pay for them when they were bought!!! Unhappy!!!", 
    "Chairs where flawed and scratched up and weak. Very disappointed.", 
    "I bought these chairs to compliment a farmhouse table. They are well made , looked great, but took a lot of time to put together . Not hard to do just time consuming but worth it they look great.", 
    "Great chairs, not as tall as expected", 
    "I love these chairs. The assembly was relatively easy, the chairs are comfortable and so elegant looking. They look very high end and are good quality.", 
    "I love, love and love these chairs! However, it was a royal pain in the neck to put them together. They are just beautiful and classical. Just make sure you have a good lint brush. Love my chairs!", 
    "These worked really well with my light oak table. They look like a nice contemporary chair.", 
    "I ordered four chairs. One came with a leg that was too short, so Overstock promptly shipped a replacement chair. I love the way the chairs glide smoothly on my tile floor. I love the quality of the velvet. I love the regal look they lend to the table. Thumbs up!!!!!", 
    "The four chairs were more than I had hoped for and the cost was very fair for the good quality of the fabric and construction. I would highly recommend these for a low budget, excellent deal!", 
    "Beautiful Chairs!!! Looks better in person. Absolutely love them!", 
    "These chairs are very rich looking. A little tweeking to assemble according to my husband but very sturdy. The back of the chair is not straight and tilts back a bit which is a little awkward to me but very nice none the less. They were a good buy.", 
    "Great item for the price.", 
    "These chairs look nice and works well if you're only using them infrequently. They are not durable enough to use every day. I have them in my dining room and use them only on holidays. I would purchase them.", 
    "Got them for my business location and they are gorgeous!", 
    "Very nice, the fabric is beautiful. Made very well.", 
    "Love them would recommend to others very comfortable", 
    "I ordered 4 chairs totals (2 sets) The chairs had to be out together, which was very easy to assemble. It took maybe a grand total of 20 mins to but all 4 chairs together. The chairs go perfect with my cherry oak table. They are true to color and height. Love them.", 
    "I LIKE THE PRODUCT VERY MUCH AND ITS VERY GOOD QUALITY I HIGHLY RECCOMEND IT!!", 
    "These chairs are wonderful! They were really easy to put together, and the pull together any look very nicely!", 
    "Chairs look awesome...not the most 'solid' chairs I have ever sat in but I rarely use my dining table so they are perfect for me", 
    "Great chairs for a great deal! Assembly required but fairly easy.", 
    "I bought these chairs to update my large rectangular glass table. They are tall, comfortable, and fit very good under my table. They really look great and make the area pop!One chair had a slightly shorter leg. But my handy husband was able to fix it without being noticed. I gave them 4 stars I stead of 5 due to this issue.", 
    "I thought these chairs were very pretty and were exactly the look I was going for but what made me go ahead and buy them were all of the 5 star reviews. Well I don't know if Overstock is only printing the good reviews or what but the chairs arrived today and I have to tell you, they were a nightmare to put together!! Several of the screws have to be screwed in at an angle with an allen wrench that bangs into the bottom of the chair forcing you to make a million short turns till finally they are tight. Not to mention getting the screws properly aligned at that angle was damn near impossible! Also, the exposed wood on the bottom of the seat is very cheap looking and I really don't expect these chairs to hold out for more than a couple of years. They are not something you will be passing down to your kids! Honestly if someone heavy sits on them at Thanksgiving I will probably be a nervous wreck. All in all, it took hours to put together 4 chairs. The screws will probably have to be checked and tightened every month. Not sure if I would buy again. But now that they are together, they are pretty.", 
    "I have been looking for dining room chairs for a long time finally found what I was looking for.They are the most elegant looking chairs. Very comfortable and look classy. Thank you Christopher Knight.", 
    "Had looked for a while for a chair that would work for my craft room. When I saw this chair I thought it might go well with my color scheme. When the package arrived I put them together and noticed that they didn't really look like I thought the picture was like. Seamed a lot smaller and not proportioned right. Anyway since these chairs came in a pair I ended up putting the other one where there is a built in desk area off the kitchen. I did like the tufted back but to me it's not that comfortable to sit on.", 
    "Ordered 4 and loved them so I ordered 4 more. They come very well protected in their packaging and were very easy to put together. They were reasonably priced for dining chairs these days and they look stunning with my new dining room mirrored table and buffet. They definitely help create the glam effect I was going for. I am very happy with this purchase as I have been with several other Overstock purchases and recommend them.", 
    "Wanted to update dining room, since it is the first room you see when entering the house. I wanted a more modern look and by just adding new chairs the room looks completely different without the expense of a whole new set. If need be I could update the table at a later date. It took at least 20 to 25 minutes to assemble each. Also the front legs are under the cover of the seat if you are looking for all the parts which we thought they had forgotten. Just a wrench and a lot of turning to put together. One chair is uneven but I added a felt pad after trying to level and called it a day.", 
    "They are beautiful and perfect in my dining room love them"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Venetian-Velvet-Dining-Chair-Set-of-2/8343652/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8343652/Christopher-Knight-Home-Venetian-Velvet-Dining-Chair-Set-of-2-a5d5c141-4dc3-4e59-ac51-b4f50d147cbc_600.jpg"
  ], 
  "description": "Add luxurious texture to your dining room with this set of two\nelegant velvet dining chairs. The wooden legs and button-tufted\nhigh backs result in a combination of contemporary and classic\nstyle that is pleasing to the eye while providing exceptional\ncomfort and stability. These armless dining chairs are made using\nsturdy construction to withstand years of use. Includes: Two (2) dining chairsMaterials: VelvetColor: BlackSturdy constructionAssembly required: YesDimensions: 39.50 inches high x 27.75 inches wide x 20 inches\n  deepStyleContemporary, ModernMaterialCotton, VelvetFinishBlack FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlackFurniture PatternSolid"
}