{
  "name": "Christopher_Knight_Home_Crown_Top_Fabric_Dining_Chair_(Set_of_2)", 
  "price": "EUR 204.66", 
  "reviews": [
    "These are very nice chairs, we needed something narrow in the seat but a tall back, we have a Restoration Table that is fairly large and can go up to 120 inches in length. We wanted to be able to seat 12 at some point and with a 20inch width seat this allows for that. Also, the color was very important to us. We have a very light Iovry/Cream couch in our formal living area that shares a pony wall with the dining room, the color on the walls is a light grey too. We needed chairs that were very light, almost white but with a black or espresso leg, our buffet is espresso. All these restrictions made it difficult to find. This chair is very light, almost white, and the fabric has a very slight sheen to it, that I haven't seen described in the reviews but I feel is important, to know about. Nothing outrages just very slight, also the fabric is not a linen it is more like a imitation chenille material. Linen is more weave like and flat material, this has slight variations in the fabric (almost slightly bumpy), and the only way I can describe it, is almost chenille like. I wasn't expecting that but it actually looks very nice. The chairs are simple to put together and very good for the price. I was pricing out chairs that were $250 each and took a chance on these, I'm glad I did.", 
    "I really love these chairs. As another reviewer mentioned, the fabric is almost chenille-like. It's a lovely off white color and looks very comfortable and classy. The legs are a dark espresso and match the table I also got here perfectly (Simple Living Butterfly Table). They are very comfortable and were fairly easy to put together. Note that the parts, hardware, and instructions are actually IN the seat cushion. Took me a few minutes to find it!", 
    "These chairs were very simple to put together - took my husband 10-15 minutes per chair and that includes unpacking! They look gorgeous at our rustic dining room table - the perfect finish for our rustic-chic motif. The cushions on back and bottom are firm but full, giving a perfect amount of comfort and support. I would absolutely recommend these chairs!", 
    "Easy assembly. Looks better in person. Great fabric material. So many compliments and inquiries!", 
    "I searched all over for chairs that would work with my new dining room table. I wanted something comfortable and elegant but I was having a hard time embracing the prices on the chairs that I liked that I saw elsewhere. I almost gave in and paid almost $$$ a chair (for 6 chairs) somewhere else and then I found out that the chairs were on back-order for 2 months and they wanted to charge me a $$$ delivery fee. I was so frustrated and then I found these chairs on overstock.com and loved them. I was cautious about the quality because the price was so good but they arrived in just days with free shipping and every chair was in perfect condition. There were a few loose threads that needed to be trimmed but that was it. My son put all 6 together in about 45 minutes and they look PERFECT in my dining room. I bought the cream color and I love that the fabric has an interesting texture and is not the flat hard linen that most of the chairs on the market have.", 
    "The assembly took quite a bit of time as some of the legs required a rubber mallet to get them to slip into place. As a couple of others have mentioned I have one chair that is a bit wobbly (not unsturdy but as if one leg is shorter than the others) and hopefully with some more adjustment that can be remedied. The fabric is a beautiful white but it is definitely more chenille-like than linen-like.", 
    "Sturdy, well made, comfortable. Nice fabric. Very pleased with this purchase.", 
    "Love these chairs!!! We got them in ivory and they go great with our dinning room table. We bought 8 of them and love everything about them!", 
    "The chairs look and feel great. The problem was in the assembly. I don't know if the measuring was rushed, but I had a chair that had 4 inch spaces for the dowels, and 4.5 inch spaces for the holes to place the dowels! The fabric over the holes would get in the way of screws and overall the craftsmanship was just poor. One of the legs on my chair didn't even have the metal piece to secure the screw! I will be contacting Overstock about this issue.", 
    "I purchased six of these chairs. The chairs came in excellent condition. The color was teal blue. Great feel. A bit hard to put together, but they were worth the trouble. Expensive look to them and have received lots of comments.", 
    "Love the chairs and have received several compliments. Easy to put together and updated my dining room. Also very comfortable!", 
    "I ordered 6 teal chairs for my dining room and they are beautiful. The color is a little richer than the picture and the fabric is very nice. These chairs really make a statement!", 
    "Well made ..Not to difficult to ensemble..Great price for 2 chairs!", 
    "I ordered 14 of these chairs in ivory. The fabric is absolutely beautiful, they are sturdy and comfortable and I love the color of the legs. The legs are dark espresso, but not black as another reviewer commented (IMO). They look fabulous with my P****** B*** dining room table. I can't imagine any chair (even 3-4 times the cost) would be any better than these.", 
    "I ordered 6 chairs in the ivory color and just assembled one today. For the price, it's a great chair. My only complaint (and its kind of a big one), there was no mention of the wood color for the legs so I just had to go on the color in the picture and we all know how that goes. I really wanted a dark cherry but suspected the legs were ebony. Wrong. The legs are black, pure black.Not really happy about that but the rest of the chair is very nice. The ivory color is very nice, not a hint of yellow or brown. The fabric is chenille and has a linen texture. It does not look like velvet. It was easy to put together and no wobbles, thus far. The seat is very firm but comfortable. For the price, it's a very good buy if you can live with the black legs.", 
    "My chairs came yesterday I bought them based on the reviews which was very helpful so this is why I'm writing. These chairs are super easy to put together, well packed and once assembled their very durable. Most importantly their extremely soft very comfortable and absolutely beautiful trust me you won't be disappointed. I got the IVORY and it looks stunning in my dinning room as the head chairs. I'm planning to BLING mine out by adding rhinestones to the tufted buttons that's just my personal preference but you don't need to do anything too them their gorgeous just as they are. They look very high end with excellent quality.", 
    "Delivery was fast. Ordered two sets in the burnt orange. Absolutely the most gorgeous color! All four chairs were defective to the point we could not put even one together. Dowell pins broken off or missing, leg cracked, three legs so large they would not fit into the hole. The only one that did fit, the holes did not line up for the screws. Stitching not right. Sending them back to Overstock. I hate this. So many nice reviews but it just was not in the cards for me.", 
    "We purchased 4 of these chairs in teal. The color is just as I expected. We have been in our new home for a week and my husband has assembled 3 out of the 4 chairs so far. His comment is that they are relatively easy to assemble. It seems to take a bit of time though. He completes one chair per day as we have so much else to do. I would recommend these chairs.", 
    "They are well made and beautiful", 
    "These chairs are bright, but not neon bright. Other reviewers are correct about the chenille like fabric but it only has a slight texture so is not as bad as I thought. It does not look or feel like a blanket. I have received many compliments on them and they are firm (my requirement for a bad back) but also very comfortable.", 
    "On a scale of 1 - 10 I would give them a 20! Very sturdy, heavy, easy to assemble and look EXPENSIVE. I ordered chairs from another site put them together....they were horrible and cheap looking. Sent them back and ordered these. The fabric is gorgeous and the color is exactly as pictured. Just a shade off white (not bone, not yellow) , almost white. Order them....you won't be sorry!", 
    "These chairs are beautiful and quality is very good for the price. It was challenging putting the chairs together alone, would have been much easier with help. The color is exactly as the picture shows.", 
    "I received this chairs on time. They are pretty easy to put them together. They are very confortable even though they are not even, not a problem because they were going to be in my informal dinning room. My only complain is the material. It's shinny, but I still like them because they are confortable and not expensive.", 
    "Great chairs, sturdy, comfortable, and the finished details, like CK name on back with a plaque", 
    "Love these chairs so much, purchased in cream color and they are absolutely stunning!", 
    "they are great and easy to assemble, sturdy and comfortable", 
    "Sturdy chairs, easy to put together, beautiful color.", 
    "very nice and comfortable", 
    "I bought a sofa and these chairs are a perfect match. The color, texture and their sturdy they complete my living room. You would have though I bought them all together.Love them!", 
    "easy to assemble, luxurious fabric", 
    "Love them!! They look just like the picture and are very comfortable.", 
    "Fairly easy to put together. Sturdy and very nice for the price. Love them!", 
    "This was my first overstock purchase and now I can't wait to order more furniture. I got these in the ivory color and they look so nice and elegant. The price was great and assembly took about an hour for all 4 chairs. The ivory is very close to a white color and the fabric is so soft. I have received a lot of compliments on the chairs", 
    "Made very well I love them would recommend them !", 
    "I love the high quality look of the chairs. I was afraid that they would be cheap and wobbly but they are really nice.", 
    "Love these chairs. Add a touch of elegance to the reclaimed wood dining table!", 
    "Ordered these as office chairs and they are perfect for what they were intended. Definitely a bit velour in nature but perfect ivory/off white color", 
    "Very thrilled with my new dining room chairs! I orders the burnt orange and they are more beautiful than I expected! Very pleased with this product!", 
    "Turquoise color not Subtle. I am keeping and using in my bedroom and as a dressing table chair in my master bath!", 
    "Gorgeous! Not 'exactly' as shown however - BETTER!!!", 
    "I purchased 5 pair (10) chairs, they arrived within 5 days. They are really gorgeous, they have a chenille-like finish. I shopped at furniture stores for several months to find new chairs for my new harvest table, and they were all so expensive! These were so reasonably priced, and the quality was just as good or better than the furniture stores. One leg on one chair was about 1/4 inch too short and it made the chair wobble, I notified Overstock, and they sent me out a new leg within a week. Extremely happy with this purchase, 5 stars!!!", 
    "The color is more a bone color. Not yellow like ivory. And there is a slight sheen to it but not in a cheap way. They look beautiful flanking the dresser in our spare bedroom. Add touch of elegance and drama.", 
    "Wasn't as burnt orange as I thought it would be more torward the red family. But still very nice . Happy I bought them.", 
    "Beautiful vibrant colors. Took less than 10 minutes to assemble.", 
    "These chairs are beautiful! The quality of the chairs are very high end. I don't like the name plate on the back at the bottom but it's not so noticeable. I bought 6 chairs, came in very fast, packaged very nicely and was very easy to put together.", 
    "Absolutely love this chairs! If you need some color, this is it. They are also sturdy and the seats are wide and comfortable. The fabric is beautiful, velvety and textured. The high back is a plus. I got the orange ones and I'm glad I did.", 
    "Very nice chair and comfortable.", 
    "These chairs are awesome - very comfy and the teal is a subtle teal that almost looks like a tweed. Easy to put together as well. One chair came broken so I did the chat to get a new one as well as sending them a picture. That didn't go over well as they misunderstood so I called and it was taken care of right away and in a few days I had the new chair. I would recommend if you have issues to call them to get it rectified quickly. Everyone who sees them love them. Now I just have to repaint my dining room.", 
    "This product is great!!!!! Love it!! The colors are perfect and it went great with my table. Would recommend these chairs to everyone who loves style and fashion!!!", 
    "Absolutely love these chairs. The color is beautiful and they are very comfortable. Perfect!", 
    "These are fabulous. Substantial overall size, soft luxurious fabric. Assembly was easy, but tough on the fingers (who invented the allen wrench??). Worth the price in my opinion. Buy with confidence- these are great!", 
    "Great chairs, very comfortable and easy to out together.", 
    "These chairs are beautiful. No problem to put together, color and tufting perfect. One chair had a small wobble but with continued adjustment it is straightened out."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Crown-Top-Fabric-Dining-Chair-Set-of-2/9085671/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9085671/Christopher-Knight-Home-Crown-Top-Fabric-Dining-Chair-Set-of-2-5d809307-e938-434b-84cd-6e60d9a736c5_600.jpg"
  ], 
  "description": "Add a touch of class to any room with the set of two fabric dining\nchairs. Made from solid wood and polyester, these chairs provide a\ncomfortable cushioning. The solid wood frame guarantees durability,\nwhile the fine detailing adds elegance to your room. The armless\ndining chairs are light and easy to clean. Set includes: Two (2) dining chairsMaterials: Fabric and solid woodUpholstery materials: PolyesterUpholstery Colors: Ivory, teal, or burnt orangeWeight: 18 pounds eachOverall Dimensions: 41.73 inches high x 25.59 inches wide x\n  21.06 inches longSeat dimensions: 20 inches high x 21 inches wide x 18 inches\n  longStyleContemporary, ModernMaterialPolyester Blend, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorGreen, Off-White, OrangeFurniture PatternSolid"
}