{
  "name": "Christopher_Knight_Home_Tafton_Tufted_Brown_Leather_Club_Chair", 
  "price": "EUR 359.53", 
  "reviews": [
    "Great chairs. Screwed the legs on and that's it. The chairs flank a fireplace and look great. The seat is wide so that you can curl your legs in, yet not too deep allowing you to touch the ground when seated. That given they are not oversized in the arm rest and this keeps the overall footprint in the room down. The seat was firm when they arrived and already are softening with use. The back isn't a \"sink into\" squishy chair. The tufting on the back adds a nice bit of character.", 
    "This is a very nice chair. It is wide enough to be comfortable to sit and read in (room for the kids to squeeze in next to you). It is comfortable and looks great next to our fireplace. It was delivered so quickly.", 
    "While the seat and arm height was a bit lower than I would have liked, the chair is beautifully crafted ! The support in both the back and the seat is excellent. A very , very, handsome piece of furniture for a fraction of what I would expect to pay in a retail store. Quality plus !!!! I am oh, so verrrry satisified and look toward purchasing a matching chair. I do believe anyone who chooses this product will be very satisfied !", 
    "The chair was accurately described on the website. It is an attractive chair that looks good with my other, higher quality furniture. I was just hoping the quality of the leather would be better and the chair would be more comfortable. This is a wide enough chair that you can curl up, but the cushions are just not soft or cushy. So, will you want to??? Maybe it will break in a bit.....", 
    "I have been very pleased with this chair, my only thought was that I think the legs are too short, and I am a short person. The chair is our favorite very comfy, glad the seat is velcored to the chair to prevent sliding out. Very nice nailhead and tufting features overall a very nice chair.", 
    "First, I believe the indepth reviews were all a GREAT help. Some are so descriptive Overstock shoud reward them with more then just free shipping. There is little I can add, except to write how I love the chair, it fits in perfect with my other furniture, and there is room for me and my dog to snuggle. Extra bonus for me, the chair matches exactly my ottoman from the chair I had to replace (kittens). Two days. I ordered it on the 27th it was in my front porch today the 29th. Now thats great service. One more thing. My husband was thrilled that all he had to do was screw on the legs. Found the legs in a zipper pouch under the chair. Good place to hide valuables. All in all so very pleased I purchased the truly beautiful chair. So comfortable for me.", 
    "Nice chair. I have a smallish living room so I wanted a chair that was comfortable but not too big. I like the looks of this chair, but the arms are a little low and the seat cushion is a bit hard. But this is leather so I expect it will soften in time and I prefer it a little too firm versus not giving enough support. The seat is a little wider than normal which I like. As for sturdiness, it's too early to tell but if does seem a bit on the light side. Overall I'm pleased with the purchase and think it was a good value for the money.", 
    "I had been eyeing this chair for quite sometime and decided to purchase it after researching several other chairs. I really wanted a chair that would not only work best for my living room area but also look expensive and something you get from a Pottery Barn catalog. Once I had received the chair (which was pleasantly fast shipping), I was really happy that I went with it as it is comfortable enough to sit in - it's been my go-to chair ever since! The only complaint that I have is that the chair is lighter than expected. For example, when I am sitting on the floor and leaning against it, the chair tips back. Other than that, I am happy that I made the purchase and am ordering one more for my living room.", 
    "As with any leather product, it needs a little breaking in, but, it is so nice! It is easy to attach the legs, and you have your handsome chair! We used it as a sitting chair in the bedroom, and it is perfect. A generous sized chair, it is not overwhelming either. Great purchase!", 
    "For the price, this chair is a steal. I bought 2 of them to sit near our fireplace..to kind of class up the lodgy feel of our home. They are compact and the rounded backs fit in the small room nicely, but to sit in them, they feel large & roomy. They aren't the most cushy chairs, but if that is what I wanted, I wouldn't have ordered an antique style set of chairs. They are firm, but feel like they'll soften up with use. Both chairs are uniform, so don't worry about 2 chairs not matching. The bonded leather feels firm, but sturdy and nice. I actually look forward to them getting some wear on 'em. They look too perfect! They were shipped amazingly fast too! Sure beats driving to the store & packing this stuff home!", 
    "My chairs arrived in one week to the day. They were carefully packaged and in perfect condition. Screwing the legs on was a snap. They look perfect in my area which required smaller chairs. They are very comfy and I couldn't be happier with them. Everyday I look at them I am very happy I bought them. They look expensive. The tufts are perfectly done and symmetrical, the two chairs are identical. They have no scent. This was my first purchase with Overstock. I am so happy with my purchase.", 
    "Actually purchased another chair before I saw this one and cancelled the order. Chair arrived quickly and I LOVE IT! Needed something for the corner next to the fireplace in my husband's home office and this chair is perfect! Stylish, classy and affordable! Color is a true brown with a low sheen - not shiny and plastic looking. Now wishing that I had bought two! It has the feel of a big chair but isn't huge! Was exactly what I wanted it to be!!!", 
    "This chair is very well made ,it is very nice looking .The seat was a little hard at first but it is getting more comfortable with use .", 
    "I bought a pair of these chairs for our living room & we really like them. The curve of the back gives good support for my husband's bad back. The kids spend hours in them playing video games. Seat cushions were a little stiff but have softened up without going mushy. The chairs are really lovely and introduce a classic tastefulness to the room.", 
    "We've been looking for a chair for a long time, and were a little scepticsl about ordering this since it was significantly cheaper than others we've looked at. We were pleasantly surprised, and will be ordering another one to put on the other side of our fireplace. The cushion is very firm to sit in, but also really comfortable. Gray chair.", 
    "The back is so low that it is not comfortable to sit on. The cushion does not flip over, it is secured with strips.", 
    "I just received this chair...FedX left this big box at my door instead of calling me to the door so we BOTH could bring it inside the door. I had to drag the box in by myself.The chain's back is hard, the seat cushion is good. I would have liked more cushion in the tuffed back. I will see if the back feels better with time.", 
    "This is a nice and comfortable chair, very sturdy but I thought it would be bigger. It sits low to the ground and I wish it would have been a little higher.", 
    "Bought three of these chairs for my husband's office (therapist). We were both blown away at how well made they were, easy to assemble and luxurious. They have a wrap-around comfort and the seat cushion is Velcroed on so that it doesn't shift around. Took a chance on these chairs and could not be more happy with the end result!", 
    "Noting that this chair is not genuine leather, it is bonded and that it is a smaller type of chair - i like it. I got 2 and put them together in my office and they look great. Very firm, but I am hoping that they will break in over time.", 
    "Liked the first one so much ordered a second. What more can I say!", 
    "OMG - I LOVE this chair. I wish I could justify getting 2 more for myself, but my budget and space can't accommodate. This is a beautiful chair, well-made. it is firm and will probably soften up, but I wanted something comfy yet firm and got it with this chair. It will be my go-to reading chair and music chair. First thing I did was sat and played my fiddle in it - the low arms were perfect and not a hindrance for me with an instrument, yet offer nice relaxed support for general sitting. It is wider than most chairs, and probably shorter than most. I'm 5'2\" and it holds my back straight and my feet reach the floor. Most comfortable with an ottoman, though. I don't like sitting slouched when I read, and this chair gives me perfect support. I also like that the cushion has velcro on the bottom to stay put.", 
    "Purchased this chair for its style and seat height for 94 year old. The 21' seat height and arm rests both make it easier to get up. The chair looks just like the picture. Good quality for the price.", 
    "I love this chair. The shape, button tufting, dark brown color and extra width all make it our (me and my dog) perfect reading chair. It's a bit stiff at first, but getting soft enough for me to notice that it's definitely time for my dog to switch sides with me. I am thrilled with my purchase and the quick delivery!!", 
    "Was a little hesitate on purchasing this chair via internet.....there can be variances in the quality and shades of \"brown leather\" Was \"Wow\" on taking it out of the box....better than I though it would be. This is a accent chair...not meant for your \"go to\" chair for lounging (although it will soften up with continual usage) This is a chair that will actually look better with age. The quality for the price is comparable to a chair twice the price....detailing is almost perfect and the tacks are not distracting to the overall look. Less visible than even in the picture. This is a chair to purchase...you will not be dissapointed", 
    "This is not a Sherrill chair (cushy...this is a hard chair); however, for the money it cannot be beaten! It appears durably built.", 
    "I bought this chair for a bedroom and wanted a smaller size, so it was perfect for that. The cushion is very firm, so don't expect a squishy seat. The leather is smooth and stiff.", 
    "I love this chair. It came assembled and I only had to screw on the legs. It's very comfortable.", 
    "Overall I am pleased with the chair. The quality is good for the price and really looks like a more expensive chair. It is small in size and legs are a little short, so it is a little closer to the floor than I thought it would be. I bought it to go in a bedroom and wanted a smaller size chair. It's not really very soft but maybe it will soften up as it gets sat in some. Overall it's a nice little chair.", 
    "For once, an online purchase with absolutely NO REGRETS! As a young girl I LOVED Christopher Knight and this chair definitely keeps him in my good graces! Lovely chair for the living room and a chair I will likely consider \"mine\" on a regular basis. The proportions are really great for our space. I didn't want anything taking up too much vertical space visually and this chair is perfect because it has a lower profile with a slightly wider seat/body than a lot of chairs I have seen similar to this one. It is very firm and that doesn't bother me, it may soften a little over time. The nail head trim is very attractive. The construction of the chair very sturdy and well done. I couldn't be happier. I'd like to say thank you to all the reviewers who took the time to post reviews of this chair. It was the detailed and positive reviews that convinced me to try this chair! This chair looks much more expensive that the price I paid! Loved the free shipping from o.co, that was icing on the cake!", 
    "I wanted a chair to sit in my small but large foyer. This chair matched perfectly! So, perfectly I bought two!", 
    "Bought 2 of these for my living room. Everything was well packaged, no damage at all. The legs were easy to put on but I did have to use the spacers (included) to level the chair. The seat is a little stiff but with more use will probably soften up. The back is a little on the shorter side, but they won't be getting heavy use so it shouldn't be a problem. It would be helpful to have an additional picture with a person sitting in it to show the scale of the chair. They are very nice chairs for the price.", 
    "Great quality, handsome, comfortable. Nothing meets the quality of leather. Love it!", 
    "After reading other reviews, I was expecting a tiny little chair, but it's not. It's a good size, pretty wide too. In agreement with everyone else..it's not a chair you sink into. I hope it softens up. All in all, I'm satisfied with the purchase.", 
    "This chair is a big WOW.....great chair for the cost. Easy to assemble. Thanks overstock!", 
    "I ordered this chair for my bedroom as a companion chair to the chair my husband already had. We have a big screen tv in our bedroom, and like to sit and watch it there in the evening. I knew when I ordered this chair that the back might not be high enough to sit in to watch tv comfortably, and it wasn't. Having this in mind when I ordered, I had an alternate spot for it...in my home office. I was looking to replace a chair in my reading nook, and this chair works perfectly in the office. Very comfortable, and very inviting.", 
    "I loved the chair, it was comfy and good quality leather. All I had to do was screw on the legs and it was ready to use. Very simple!", 
    "This chair works great in our living room, the size is great, it is wide, measure! They give you dimensions, take a tape measure and look, it is very accurate to the description. Comfortable and great for the price!", 
    "I looked for months trying to find the perfect chair to complete our living room. I needed something that had some character, but not over the top because my decor was already colorful and eye-catching. The detail of the upholstery nails and tufted back look extremely high-end. Also, assembly was a breeze. You literally just screw the legs into the bottom. It was a little smaller than I thought it would be, but it worked out great because it fit in the space next to my fireplace perfectly. WIth all the seating we have, I notice that guests gravitate to it first. It's not super cushy, but comfortable enough to want to sit a while. There were only 4 left when I found it, so I made sure to buy it asap. I see why it's a best seller. Shipping was quick and only $2.95! Another great purchase from O.co.", 
    "Very comfortable, large, nice color, easy to assemble feet, fast shipping.", 
    "Beautifully made chair, spacious, looks very expensive compared to the price I paid for it. The seating is lower than your average chair (reason why I didn't give it 5 stars), but its comfortable.", 
    "Love this chair! It looks nice, is comfortable (firm), and especially enjoy that it is extra wide. It may not last forever but excellent value and can't beat the price. Very pleased.", 
    "I had some slipper chairs that were really not comfy and my dog had settled into one as his perch to view outside. i wanted to replace with something that would be comfortable for myself as well as him. Definitely scored with this one.", 
    "Works as advertised, feels like a luxury item.", 
    "Looks like real leather....Love the 2 of them.", 
    "This chair was perfect for the area I wanted it for! It is a smaller chair, but looks more expensive than it actually was! Love it!", 
    "Very comfortable. Feels and looks much more expensive. Paired it with the ottoman for a great reading spot. First chair I ever ordered online. Very impressed!!!", 
    "A good chair to read a book", 
    "Seat cushion too hard otherwise the chair is good", 
    "The only issue I have with this chair is that the seat tends to dip and give after long use. Flipping the cushion helps, but the bottom cushion is not finished. I've moved it from formal living room to a bedroom chair because of this issue. Very comfortable and good looking, but not quite the quality expected.", 
    "THis is chair is exactly what I thought it would be. The chair looks great and at great price.", 
    "Perfect in our bedroom next to the window. A great comfortable chair to sit and read in or watch television.", 
    "Comfortable, good sized chair. Looks great and feels substantial.", 
    "I agree with others that it is has a hard seat but I suspect it will soften with some use. It is a beautiful chair. I would have paid $$$ more if the back was eight inches taller but I knew the height when I bought it. I'll check back in and let y'all know if it softens with use. Oh, by the way, I am 5'4\" and medium build and I can easily curl my legs in and sit in it without sliding out. I will say that when I try to sit in it with my feet on the floor and lean back I slide out of it. I bought this chair for looks and curling up in so I am happy.", 
    "I love this chair. I wasn't able to use it in the room it was brought for because it is a little smaller than I expected.", 
    "I received the chair on 1/11/16. In some way the chair itself has some sort of defect, all the legs are the same size and they all screw in fine, but the chair is not leveled so it wobbles. It is a nice chair except for that little issue.", 
    "Very good looking same as pictured. I've had mine a little while and they still look new.", 
    "It looks nice but not the most comfortable chair. It now sits in my bedroom.", 
    "I can sit down so well in this chair.", 
    "This chairs are ok. Large but the backs aren't too comfortable. But will work with a large pillow. Works perfect for a living room/billiard room", 
    "These chairs are designed and crafted reasonably well. They are wide enough for most any body type and are quite sturdy. However they could use a bit more cushioning as they are comfortable but a bit too firm. Overall a decent value.", 
    "These chairs are much more accomodating in the lobby of our Men's salon. More relaxing and with enough seat space for our big and tall guys as well. Looks really nice with manly our decor!", 
    "Nice looking but don't buy for comfort", 
    "Was very excited to receive this chair for my office. It matches my current decor perfectly. Leather is good quality and the chair is well made for the price paid. The reason for 4/5 stars is the chair is very light and slides easily. Need to put a rug underneath to prevent movement. It's also a little firm, i like softer chairs. but that's just a personal preference. Overall, it's a great buy!", 
    "Beautiful chairs, well made great price. A little hard but that's the way we like it!", 
    "Bought this for my guest bedroom. The box was in good shape when it arrived as was the chair. It is a very comfortable chair. It looks perfect in our guest room.", 
    "Looks nice. Bought 2 of them. Seem cozy and just the right size.", 
    "Nice chair, plenty of room for a \"person of size\". Add a lumbar pillow for best comfort. Assembly was only screwing on the legs. Super easy.", 
    "This chair is very nice looking. The comfort level is disappointing in that the seat is very hard. However I live alone and was looking for an extra chair for when I have company . Decent price and quick delivery. Assembly only requires putting on the legs.", 
    "Minus 1 star for stiffness of the seat, but these look very impressive and over time I'm sure the seat will soften a little with use. Easy to assemble-just screwed on the legs.", 
    "Looks great, easy to assemble. Nice to sit in!", 
    "Very Nice addition and Comfy", 
    "a little smaller than the other couch in the room, but nice looking.. i keep it just wish it was a tad bit bigger", 
    "I like that it is very beautiful and a great price but it is very firm so not for everyone but I like it because it is big enough for me to snuggle and will hold up well and I like firm", 
    "We have had those for a year now, still look brand new. We are very pleased with them.", 
    "Smaller chair. Good for a smaller space. Very good looking. Comfortable. Probably not for a large person. Expensive looking. Great price if you want to class up a room .", 
    "Great chair, but it is quite small. We bought it for our library/study and it's much too small for the space. Be conscience of the overall height. Regretfully we have to send it back.", 
    "Looks great - so long as you don't ever sit in it. I would give it no stars if I could.", 
    "love this chair debated over it but go glad I have it.", 
    "Great purchase. The only thing is that one of the plastic caps was missing from a front leg (1). Otherwise, a great buy worth the price! Love it!", 
    "Yes the seat cushion is stiff but it should help to keep the chair \"crisp\" looking for years.", 
    "I could not have asked for a more beautiful chair to complete my living room. It is every bit as rich and elegant as it looks in the picture! And although it is leather, it is comfortable and easy to sit in. I love it!", 
    "It is nice but I found something similar, less expensive, and seemingly higher quality at Value City Furniture", 
    "Just got my chair and it is beautiful. I just had to attached the legs and it was good to go. It's a big stiff at first but I know as it gets used it will loosen up and become more comfortable.", 
    "This was a piece we put in a formal sitting area and it looks great. The cushion is a little stiff but hopefully that will change over time the more we use it. Definitely a good buy for the price.", 
    "This chair is exactly how it is pictured! And it's very nice looking. The seat is very wide. An adult can sit easily with their legs \"criss cross\" up in the seat. The back is not very high, so it's not a real comfortable or a lounging chair. No complaints on this one.", 
    "Lovely piece, perfect for reading and lounging with a cup of coffee. Firm back and the seat is soft enough. Can't wait to see how well this chair ages!", 
    "Love everything about it -size/comfort/style/", 
    "I got two of these chairs for a study area. They look great and plenty roomy. They are more formal and not snugly, but comfortable. Room for an adult and child (or dog)!!", 
    "Purchased this chair and the Ashton Cube Ottoman for our sunroom. They look wonderful together and don't take up tons of room.", 
    "Great reading chair, or for chatting with guests.", 
    "Pretty small footprint. Reminds me of a nice cush club chair, only scaled down 20%. Fits perfectly in my office. Comfortable, but I wouldn't call it a \"napping chair\" due to size.", 
    "\"Ordered this chair with great skepticism. I was certain it would look extremely cheap. But i was wrong. While the upholstery does not feel like real leather, it does give a very nice and rich appearance. The upholstery is also nicely done. The sides and back and solid, also. In short, it's made very nicely.The cushion is really firm. This is not a chair that's really great for extended periods of reading or relaxing. But for the price, it's a super product. I'm very, very pleased. Handsome and very affordable.\"", 
    "Good looking, but not comfortable. We bought it for a rarely used spot in our living room, so perfect for the price. Our cat did punch her claws through the leather on the first day. :-(", 
    "Chair arrived fairly quickly, easy to put together, but very light weight. It is a nice looking chair, but not worth the money in my estimation. I did not send back, just kept it as was too much trouble. It is not comfortable to sit in. It taught me a lesson to sit in a chair before buying. Sorry Overstock, I have bought many items, but was disappointed in this one.", 
    "This is a sweet chair! Very comfortable and a great buy!", 
    "We ordered two of these chairs for our home library. They arrived very fast, were easy to assemble (just the legs), and they're also comfortable.", 
    "It matches our other furniture and at much less cost. Also, it was delivered to our house free. We couldn't ask for a better deal!!!", 
    "Love the chair....super good buy for the price", 
    "The chairs look expensive and are very comfortable to sit in.", 
    "Fits well in my small nook. Comfortable and stylish", 
    "I purchase the chair for my husband, he tried it out for a few days before he got back to me with his thoughts about it. He indicated that it is a little hard, but feel that in time it will get softer. With that being said he loves it. He gives it over four but not exactly five stars.", 
    "Bought two, love them. They are very comfy", 
    "Love this chair as it fits perfectly in place. I am a \"big\" person & the seat is just the right width!! Not necessarily a heavy duty chair but sturdy & we are pleased!! Sits comfortably well!!", 
    "I'm hoping the chair will become softer with use especially since it is not real leather. As I am not tall the height works however prefer 1-2\" taller. It is a very attractive chair.", 
    "This is a nice-looking chair. However, it's not as sturdy as I expected, and the seat cushion is very hard along with not fitting into the seat pan as well as it should. I was hoping I'd be able to snuggle into it comfortably, but not so. Maybe the seat cushion will soften up over time and be more comfortable and flexible.", 
    "Beautiful chair! Great color and looks expensive. BUT, I did not think this chair is comfortable for every day use, it's light and moves with you if on a bare wood floor. I kept it as an occasional chair and rated a 4. If your looking for a soft comfy livingroom chair! This is not for you...", 
    "I am sitting in this chair as I write this review. This is one of the few charis you can really spend time in and not have an achy back, etc. I ordered three of these. They are the perfect size for everyone in my family. I am 5'6 and am the shortest. Others are all over 6 feet. We can all sit comfortable in these chairs. They are not large and they are not small. I ordered three and wish I had ordered more. We have them in our library. They look perfect. They are so comfortable you can curl up with your feet and read a book or sit with your feet on the floor. One chair arrived with four front feet instead of two and two. Overstock immediately sent out the right feet. The back of the chair comes to right above my shoulders if I sit up straight with my back against the back of the chair. The back is soft but firm, the seats too. I've had these several weeks and they get a lot of use. Our family spends a lot of time in the library reading and these are such a great addition. One of the best things I've ever ordered. Very very pleased.", 
    "This is the second chair I have ordered. The other one is gray linen. They look great for the price", 
    "Nice chair but was a lot smaller then I'd like", 
    "Some reviews stated the chairs were small, but I think they are just right. They are comfortable and look great.", 
    "I Ordered two of these chairs and they arrived on time and in excellent condition. I was impressed with them as soon as the box was opened and they were nestled in a cotton sleeve to protect them. The only thing required to put them together was to attach the legs, which is very easy. As stated, the seats of the chairs are quite firm, but that was a plus for me and everyone who sits in them seems to like them also. The chairs are large and sturdy enough for a \"big\" guy while still being quite attractive. The nail head trim adds a modern twist while the tufting is very inviting. All in all, I can't think of any negatives, and expect to be enjoying these chairs for many years to come.", 
    "I love my new Christopher Knight Club Chair! Looks great and love the feel of the leather. This is a wider chair for as small as it is. As a big guy it feels roomy and comfortable to sit in and put up your feet, For the price you can't beat this leather chair. I never thought I would buy a chair without sitting in it first but after reading the reviews and taking measurements form other chairs I own, I took a chance and ordered it. I am glad I did. It is my every night TV chair now.", 
    "The chairs arrived promptly, they were easy to assemble and they look great.", 
    "Pulled chair out of box, screwed in the legs (hardware already attached to legs) so easy I did it myself! Did not have to wait for my sons help. Very handsome chair & already getting more comfortable, breaking in nicely. I'm happy 😃😊😊", 
    "It is a very nice midsize chair. Comfortable", 
    "These chairs are a great value for the price. They look beautiful and are nice and big. They are a little hard but get more comfy the more the are used!", 
    "very nice, expensive looking piece. it is in our study and now i am going to be ordering another to match", 
    "The delivery was quick and it arrived in perfect condition.As soon as I saw it I knew I made the right choice. Very attractive chair and comfortable. It took minutes to assemble and looks great in my Florida room. Would recommend to anyone looking to update a room.", 
    "A little firm at first, but these chairs are comfortable and BEAUTIFUL - great addition to our library", 
    "I bought two of these chairs to go in my formal living room. They look absolutely wonderful and really polish off the room. The only reason I gave these chairs four stars instead of five was the fact that I wasn't expecting them to be as short as they are. They are, however, comfy, roomy chairs and the height of them wasn't bad enough to want to send them back.", 
    "We were looking for some chairs for our wine room. The price, style and size are perfect. They are firm but still comfortable. They arrived within days. Screwing the legs on was a snap. Very happy with this purchase.", 
    "Bought 2 chairs. Comfortable and quite beautiful! Gives a very professional air to a home office.", 
    "was delivered in safe packing and easy to put the legs on. It is so nice I am ordering a second one!", 
    "Great looking chair. Not as comfy as had hoped. Seems to be holding up months later.", 
    "This chair looks great in our not so big living room. The scale is not small, but not too large either. The color is as described.", 
    "Nice chair. A little hard, but I am hoping they will soften up with time.", 
    "If I had room for another, I'd buy one!!! Looks expensive and is well finished. Seat is comfortable and roomy.", 
    "Chairs work excellent in a small space while being roomy and expensive looking", 
    "My chair took about 10 days to get to me, which I thought was kind of long but when it finally arrived it was very easy to put together. It looked just like the picture and I really love it. The only thing I would \"complain\" about was that the chair legs are very short. So the chair sits lower than I expected. It looks like a piece of mini furniture next to my big couch. I wish the chair legs had been about 5-6 inches taller.", 
    "I ordered two for our living room and I couldn't be more pleased. The seats are firm, but not too firm. The back is comfortable. The chair is nice and wide so my husband can lounge.", 
    "I needed an accent chair in my living room and this fits perfectly. It is a little stiff (that's why only 4 stars) but hopefully given some time the cushion will get softer:)", 
    "we'll see how they hold up to use, but I'll have to say that I was pleasantly surprised at the two chairs we purchased ; firm seating and yet I think comfortable.. great looking and just what the Mrs. and I wanted; I believe we good a good deal and price; quick delivery too.", 
    "This was ordered for our son who absolutely loves it. A bit of a break-in period, but very comfy once you've done that. Arrived earlier than expected, which was a great surprise. Very happy overall.", 
    "Exactly as pictured online and I love it.", 
    "Looks great in my bedroom sitting in front of the bookcases. Perfect for what I wanted.high quality.", 
    "We purchased two chairs and was pleasantly surprised with the easy assembly. They are very attractive and comfortable and friends have stated how expensive they look. WouldPurchase these again.", 
    "We ordered these chairs and we could not be happier. They are the perfect size for our area. We wanted something that would not overwhelm our sitting area and these are amazing. Highly recommend and totally happy with this purchase.", 
    "We got two and couldn't be happier.", 
    "Easy to put together. Seat is firm and large- don't know the weight limit- would be good to know.Roomy to curl up in.", 
    "This was a great addition to my office.", 
    "When this chair arrived, I thought even with the feet attached it would be too low.However it is at an ideal height for me at 5'3''.Also the seat is very wide which allows you to arrange yourself in what ever position is comfortable for you. As others have noted, the seat cushion is hard. The chair itself has a classic shape and has nail head trim and a tufted back giving it a rich look.", 
    "look more expensive then they are,very nice detail, comfortable not an oversized chair, but has enough seat room for comfort, I am quite pleased with these chairs.", 
    "We have a space near our entry way that needed a chair. This chair looks nice and it's functional.", 
    "i wanted a reading chair, and this is perfect. Very comfortable, beautiful, and great price.", 
    "This chair looks stylish and fits in perfectly with a much more expensive leather 3-seater we already had. It is stylish. It's also big enough for someone who may be larger in size. I would not call it soft however - it's not reallly a plush reading chair by any means, but a good chair for living room conversation. At the price, it was by far our best option as we had already spent a lot on other living room furniture. Took about 5 minutes to assemble, which really just consisted of screwing in the legs on to the seat base. I am considering getting a 2nd one to have a matching set for our living room.", 
    "Absolutely beautiful chair! Great quality and price", 
    "I tried two other chairs from another company and they fell very short on quality. When I saw this chair online, allong with the great reviews, I hoped I had found a great match for my brown leather sectional which I've had for about two years.This chair fit in perfectly - good quality, the right size, the right shape and very comfortable. Plenty of room for \"Grandaddy\" to read to our granddaughter while they sit in the chair together. The leather is good quality and the tufting/construction on the back of the chair is done very well; packaging and delivery was excellent - even a special zip-open pouch under the chair which held the legs - the only assembly needed was to screw in the legs - perfect!A great value overalll. If you can use a brown leather chair, this one is the \"perfect choice\".", 
    "I bought this chair for my library. It is made very well, looks great, but I am not 100% satisfied with the comfort. I am a tall man, and I read a lot. I wanted a leather chair I could sink into and read for hours at a time. Unless this seat cushion breaks in over the next year or two, this isn't quite it. If you don't sit up straight, your but slides out of the chair. Having an ottoman/foot stool helps, but it's not the comfy reading chair of my dreams. Still...I love the look and style. If this chair is more for looks and occasional use, buy it!", 
    "In redcocarting the living room, I have found the perfect compliment to the rest of the room", 
    "Chair seating area is very wide and comfortable. Wish height of chair was higher..", 
    "I really love these chairs they are very spacious and i've just placed a order for two more in another fabric!", 
    "This is a \"rendition or interpretation\" of a famous maker design and I simply love it. Looks great and WOW, what a great price. Shipped promptly after the purchase and was easy to assemble (screw on legs only). Thinking of purchasing 2 more.", 
    "Love this chair. I was looking for a accent piece and this worked out great. Highly recommend.", 
    "It's perfect for a small space. Not intended for an afternoon nap.", 
    "I ordered this chair for my bedroom. It arrived in a few days and all I had to do was to screw the legs on! The color matches that of the picture and the leather does have a beautiful sheen. The seat cushion stays in place with Velcro and is a little firm but I feel it with get softer with use. The seating area is nice and wide. The price was terrific and the chair is exactly what I wanted!", 
    "We purchased 4 of these for a sitting room and have had them for a year now. They have held up nicely and are beautiful! They are comfortable enough for a more formal sitting room. You couldn't get a better chair for this price. One tip: When we assembled them we had the back legs on backwards for a few months and they tipped over easily (whoops)! The picture is a very accurate representation of their size/appearance.", 
    "These chairs are attractive and very easy to assemble - just screw on the legs. They arrived quickly and in great condition. The seat is nice and wide, but the back is a bit low. They are not quite \"tuck your legs up underneath you\" comfortable, but I think an ottoman might make a difference. For the price they fit the bill and they are attractive flanking our fireplace. I wish they were heavier. We have wood floors and they slide pretty easily.", 
    "Love this chair. Easy to put together. Great value.", 
    "I'm pleased with out the club chair looks. It's modern and fits well with the rest of my furniture. I get compliments on it all the time", 
    "I absolutely love this chair so I bought another! The quality is great and I love the shape and style of it! The seat is a little stiff but I love the chair!", 
    "Beautiful chair. The seat is somewhat firm but I would imagine over time and after usage, it will soften up.", 
    "I like the look and size of the chair which is true to size from the given dimensions on site. The chair looks as if it will be the soft cushy kind of chair but, it is very firm. The seat is roomy and is held to the base firmly by velcro so I have not tried to lift it. It arrived quickly in one piece except for the legs in a zippered compartment under the chair so all one has to do is screw them in to be complete. I am not too impressed with the quality of the product but, only time will tell if it holds up. It doesn't look bad but, I have a similar Safavieh chair in brown leather purchased from Overstock and although there are pluses and minuses with both chairs I believe that the quality in the finishes and overall appearance of the Safavieh chair wins hands down over this chair.", 
    "This is our second chair we have ordered. That's saying we love the chair, great looks and style... fits our décor... nothing else to say.", 
    "Bottom cushion is extremely firm, not very comfortable, but the overall look is great. Look is comparable to chairs 5 times this price!", 
    "I recently purchased this chair for my living room. I needed a chair that was small enough for a certain high traffic area. The chair this was replacing was a family favorite and had served us well, but aesthetically it was time for something new. This chair is beautiful and stylish, however it is very short! I am 5' 4 and I can not rest my head on the back of this chair. Check height measurements!! The legs screw on and I have already had to screw them back in after 3 weeks of use. If you are wanting a chair that looks beautiful you will not be upset, but it is like I said before short. The back rest is short and the legs are short. The body of the chair is wide enough. I am hoping the leather softens. When we are all watching TV as a family this chair is avoided when my family members are finding a place to sit. Just not comfy for everyday use. The price was great, that is a plus. Would I personally buy this chair again, No. The price was so good that I did not want the hassle of sending it back etc. Again pretty chair, but not comfortable.", 
    "Bought it for office building. Looks great with leather pieces that were much more expensive. Smaller scale in looks than the wing backs that were there but sooooooo very comfortable. I was surprised at how comfortable.n", 
    "This chair looks exactly like the picture. I love the way it looks in my room. It is quite firm but I prefer that anyway. It also is lower than most of my other chairs but I still like the way it looks. The room I put it in is a small room and the scale of room to chair was perfect. The only \"negative\" I have was getting the back legs to screw on evenly, but with a little perseverance, I did it. I would recommend this chair.", 
    "I really like these chairs, BUT with some exceptions. I have very tall 18' living room ceilings, so I wanted two club chairs that would be at least average sized to hold their own in the space. These chairs are very cute, and so far, they have held up over the last three months of regular use. The leather feels like a good quality, and the brass nailheads look great. When the chairs arrived, they were a much lighter weight and lower to the ground than I anticipated. The arms are small and low as well. I put the chairs on the other side of the living room (away from my giant sofa), and they look fine, even with the tall ceilings. I bought a barrel side table, also from Overstock, which works great with these chairs. They seem somewhat hard at first, but they really are very comfortable since you don't sink into them. I would buy them again due to the quality and price, but just make sure they are not beside any huge furniture with taller arms (like my sofa), and they will look fine.", 
    "The chair arrived promptly. We had trouble with one of the legs and had to make adjustments. The chair does not seem to be real leather but still looks very nice. It is quite firm and after two months still has not softened up. It is a small chair. I am just over 5' tall and it just fits me but is not comfortable with no neck support. It is necessary to use pillow to make it more comfortable. I have it in my living room and no one wants to sit in it for very long. It is very lightweight and moves around too easily. I would say if you just want a chair that looks alot like leather and is not for sitting in very long, this is a good buy, otherwise, go to a store and pick out a chair you can actually sit in to make sure it is comfortable.", 
    "Very nice chairs. They were a bit smaller than I expected, ut worked out great.", 
    "Not a big chair but very nice. Works well in our study and legs were easily attached. Am buying another to match.", 
    "We have no complaints for this chair. It is a firm seat, but comfortable. Note that the legs come in a zippered pouch under the chair. The only surprise for us was that it is rather short or low. I was expecting it to be about waist high (I'm 5'8\"), but the back of the chair barely rises to my lower hip. So my knees bend a little when I'm sitting in it. That's on me for not actually reviewing the measurements! Otherwise, the styling is as depicted.", 
    "Beautiful chair. Seamless transaction. Fast Delivery.", 
    "The chair came in in one piece with 4 feet removed and hid in the underside compartment - a nice feature. The chair was large for me (5-foot person) to sit and curl up to read books or watch birds outside in the yard. It was purchased for my husband (230-pound) as birthday present, and he fits in beautifully. He would love to have the matching ottoman though.", 
    "These are very good looking chairs. The other reviews were very helpful and accurate... enough room to curl the legs up or have a toddler sit with you. The seat is a bit firm but is breaking in well. Well packaged and easy to put the feet on.", 
    "There are so many 5 star reviews but I'll add mine as well. The chair looks more expensive than price and is a substantial piece without overpowering a room. Very comfy. I have had good luck with bonded leather that looks great and wears well. Very pleased with price, looks, quality and fast delivery of chair.", 
    "This chair is very nice; they are a bit small for my family room, but no worries, I ended up buying another one and now have two in my conservatory. The chairs were received within a week from placing my order. I love Overstock and my new chairs.", 
    "I was looking for 4 club chairs for a small wine room. I did not want to spend $1,000 on each chair and found that these chairs were perfect. They are comfortable and are great for the price. The cushion is a little hard to sit on, but based on other reviews, this softens up the more you use them. I did buy a small pillow to support the lower back, but this added to the decor anyway.", 
    "very comfortable chair, goes nicely with Spencer brown ottoman. The chair is high enough to support back and neck and wide so can curl up in it. This was a gift and the recipients were very happy with it.", 
    "This chair is great. Awesome value. It arrived quickly. Setting it up was a breeze... just screw on the four legs that are contained within the pouch on the underside of the chair. From someone that is 6' 4\", the cair is not very comfortable for me. I am not sure if it is just not made for a tall person, but I always feel like I am having to arrange my body in an awkward position just to sit in it. That said, I actually love the chair and have no plans on sending it back. Perhaps it will be more comfortable once it has been \"broken in.\" I have also purchased an ottoman that may help. We will see. Overall, a five star product with a minus one for comfort.", 
    "This is a very attractive chair, which was very easy to put together. It's quite comfortable, although I would have preferred a taller back.", 
    "I am extremely pleased with this chair. As a first-time Overstock shopper, I was hesitant to have my first purchase be a leather chair, but I was nicely surprised! The chair's color is as shown - a very dark brown. The chair itself looks expensive and I like the metal accents and the tufted leather. Assembly was very easy, just put the chair's feet on! The chair was a bit smaller in scale than I expected but it works well in the space. The seat itself is just right; it doesn't give a lot compared to more supple leather chairs, but it's just soft enough and deep enough to sit in for a while. Highly recommended.", 
    "I ordered two of these chairs to face the fireplace in an open concept kitchen/dinette/family room. I didn't want to block the view of the fireplace from the kitchen, so it was important to me that the backs of the chairs not be too high, but I wanted the chairs to be comfortable and stylish as well. These chairs are perfect. They actually compliment a large highend tufted ottoman I have in an adjoining room in color and quality. The price was incredibly reasonable for these chairs, the website was easy to use, they shipped within the week and were packaged well. This is probably the best overall purchase I've made this year. I am extremely pleased!", 
    "Unfortunately they are out of stock. Anxiously waiting!", 
    "This chair is suited well for an office or side room decor. We bought it for our living room and sent it back. It looked cheap to me compared to our other furniture. It was good quality but just not for us.", 
    "I was very disappointed when the chairs arrived and I unpacked them. They are extremely uncomfortable and have a cheap appearance. I won't buy any furniture from you again."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Tafton-Tufted-Brown-Leather-Club-Chair/6045761/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6045761/Christopher-Knight-Home-Tafton-Tufted-Brown-Leather-Club-Chair-453919d2-a4ea-4af3-bc27-c3c470480cf1_600.jpg"
  ], 
  "description": "Heighten your study room, home office or library with this Tafton button tufted chair from Christopher Kane Home. With a sturdy wood construction and luxurious bonded leather, this brown chair offers longevity and style, making it an excellent option to add to your home furnishings collection. A classic nailhead trim and curved wooden legs complete this look with contemporary style.\nMaterials: HardwoodFinish: Espresso stained Upholstery materials: Bonded leatherUpholstery color: BrownTufted back for added style and flareStudded accentsLarge wide stance allows enough relaxing space for all shapes and sizesDimensions: 34.6 inches high x 34.6 inches wide x 33.7 inches deepSeat dimensions: 19.5 inches high x 20.5 to 31.5 inches wide x 19.5 inches deepStyleContemporary, ModernMaterialLeather, WoodFinishBrown, Espresso, WoodChair TypeClub ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBrownFurniture Frame MaterialWoodFurniture PatternSolid"
}