{
  "name": "Christopher_Knight_Home_Malone_Beige_Club_Chair", 
  "price": "EUR 286.97", 
  "reviews": [
    "real easy to screw on feet, and to insert back of chair... took me less than 5 min a chair. I bought two and they are very comfortable to sit in. I LOVE the tufted detailing. The only issue that was wrong was the nailheads on one of the chairs, in the back were a little uneven, but its charming to see, makes it look like they were hand done, not too perfect. I gave it a 4 star, should be more like 4 1/2 stars, because of that. They came fast from delivery, and I really like the way they look in my new sitting room. Worth the price !", 
    "You're not paying peanuts for this item but you're also not paying top dollar which is why I think you're getting exactly what you pay for. A mediocre product for a moderate price. It looks good but so do some miniatures in a doll set, it doesn't mean you can sit in them comfortably. Yes it's stylish and the fabric is acceptable but it really is a smallish chair, at least for an adult male. They could have used more foam to give the back a little more substance and the poor design causes the seat cushion to stick up which is why they have Velcro underneath to keep it attached. But that still can't hide the faulty design. If you just want something that looks good for the occasional visitor, than this is fine but if you'd like something that is designed well and is comfortable for daily use then I would suggest another item.", 
    "Overall, I think these chairs are beautiful. Gorgeous, really. I ordered two, and they add so much class to my living room. The nailhead trim in an antique brass color is so pretty. And I'm a sucker for any kind of tufted upholstered furniture. The pretty little turned legs on the front really add class as well. One thing that does bother me is that the two top button tufts on the seat backs aren't perfect. The left one is slightly higher than the right one, and it's like that on both of the chairs I ordered. I'm kind of a perfectionist when it comes to stuff like that, and since I use accent pillows in my chairs, it's really just the top two buttons on the back that show. So having them askew like that is a huge irritation to me. It might be one of those things that other people probably wouldn't even notice, though, and it's just my perfectionist tendencies driving me insane. Another thing is that I wasn't aware of how the chairs would be assembled. It comes disassembled, and you have to assemble them yourself. The good news is that it's just about the easiest thing ever. The back of the chair just slides down over a lip towards the back of the seat of the chair to hold it in place. Very easy. The bad thing is that if you're placing these chairs anywhere in your home where the back will be visible, that crack where the back meets the seat is clearly visible. In other words, the back is not upholstered with one solid piece of fabric like on most upholstered chairs. Depending on how picky you are about things like that, that might be a deciding factor in your purchase. Thankfully, my chairs are positioned so that the backs are against the wall and can't be seen, because having that crack visible would absolutely be unacceptable to me. But from the front, the chairs are gorgeous. One last thing...they're not the most comfortable chairs in the world. If you're looking for something to curl up in and enjoy your coffee and a good book on a lazy afternoon, keep looking. The seats are a bit on the firm side, and they're just not \"curl up and get comfy\" kind of chairs. They are, however, PERFECT for use as occasional chairs in a living room. I'm very pleased with the chairs, and would definitely recommend them, and would even buy them again myself.", 
    "This chair is great. We bought 2 for out living room and came back to get 2 more! They come in a box and the back of the chair has to be placed into seat part, I was leery about it, but it's seamless and they are very comfortable!", 
    "This chair looks absolutely perfect in the corner of our living room. Assembly was very easy and it is just the perfect size (on the smaller side). It is not the most comfortable chair by any means, so beware if you are going to be using it daily. It is so cute though!", 
    "We shopped around for months for 4 matching armchairs, and finally took a chance on these - and are glad we did! Well-made chairs and a really nice height as well. My husband is 6'3\" and says they are comfy, and I am 5'7\" and think they are comfy. The color is a nice neutral color, as well, that we paired with a colorful rug. Happy to have made this purchase, at such a good price!", 
    "Chair came very fast and was extremely easy to put together. Fit perfectly in the small space but was a bit smaller than we anticipated. The chair is very modern looking but with great character details but the cusions are very firm and not a great \"comfy chair.\" Stylistically is on point but comfort could've been done better.", 
    "Very happy with this chair. Chair is very firm and on the smaller side but exactly what I was looking for. Very sturdy and a great deal for the money. Tufting and nail head trim make it a very good looking chair. Arrived about 8 days after ordering it.", 
    "I ordered this chair for my guest bedroom, which is fairly small, so I worried that it might be too large for the space but it is perfect! My husband helped with the assembly. I could have done it myself but he wanted to help. There was very little to assemble: the legs screwed into the bottom and then the back of the chair was inserted into the base. It looks fabulous and is very comfortable!", 
    "We really like these chairs. We got two of the chair for a bay window in our bedroom. They look great! The chairs are quite firm to sit in (and the arms are a little hard). But for sitting and enjoying coffee in the morning in our bay window, they are perfect.", 
    "I wanted to get 2 small side chairs for my den so I ordered this one to see if it would work and I will be ordering another one to go with it. It's definitely darker than it looks in the picture but it's still a very rich looking light brownish/beige color and would go with anything. It's upholstered very neat and looks great and was easy to put together.", 
    "I bought this chair for my husband after he broke his hip because he was not supposed to sit in a sofa, loveseat or recliner(the only seating in my living room). It's design and arms allow him to get in and out with ease and he loves it. It is a small chair, but it is comfortable and certainly beats the straight-back dining room chair he couldn't tolerate. The assembly was simple enough, as you only had to screw in the legs and pop in the back. This chair was something I needed to efficient, a great value, and arrive quickly and it met all my expectations. Thank you!!", 
    "This is a great small scale chair. It's easy to put together and very sold and sturdy. My husband was skeptical of a \"pt together\" chair but finds it perfect for sitting to put on socks and shoes. The fabric is as pictured, the legs are more of a black than a brown. Great value for the money.", 
    "These chairs are made in China. They look great in our bedroom and will not be used to sit in a lot. If they were in my family room and were going to be used a lot I would have sent them back. They are pretty light weight. Very easy to assemble and look very nice. If you need a product that will last for years to come do not choose this. It is a nice looking but not built to last.", 
    "Product was very nice for the value. Assembly was a breeze. Fabric is nice. Not sure yet about the durability but for the price it was a bargain. Don't know if I would recommend for high use areas but it looks great.", 
    "I have never bought on-line furniture but these chairs are perfect! The studs make them beautiful from any angle and they are comfy!", 
    "true in color and fabric . The cushion is very comfortable. Nice chair", 
    "Great chairs, super stylish and pretty comfy too!! I love how much room they have.", 
    "I was so please to receive this chair yesterday. Shipping excellent, packed in fabric case. Material slight texture, pleating and nailheads add class. I'm 65, petite-took 10 minutes to assemble. Others comment on back seam-pieces fit together well, looks appropriate, seam doesn't bother me a bit! Okay not to be super plush, comfortable enough for occasional sitting and good look in my gray/green traditional scheme. Recommend to others, would gladly boy again if space arose.", 
    "This item is a pretty good value for its style and price! We were looking for single chairs that would fit in our city-sized apartment without being so considerably overbearing and these were the perfect solution. They are easy to assemble and are lightweight, yet sturdy. The tufted & rivet detailing add a lot of personality and the light beige is true-to-color. I would expect some wear-and-tear through time - as they say, you get what you pay for. But for now its serving its purpose in our living room and adding the right amount of charm!", 
    "I really do like the style of the chair. It is far less substantial in size than in the photo. That said, I did know the measurements before buying. It arrived well-packed and quickly I might add. However, the nail heads are uneven and one was even off. The body of the nailhead is in the chair and the head was off. I am going to have to glue it as I really don't have any other options. The chore of sending it back versus keeping it seems daunting. Additionally, this linen leans pink in some lights. It is very vanilla toned. My husband does not feel the legs are very sturdy. In any event, I may just wind up using it in our bedroom as a small reading chair. I don't hate it, but I wouldn't buy another.", 
    "The chair is nice to look at but is very small and probably not suitable for large families. The tufted buttons on the back of the chair are misaligned but I easily covered them with an accent pillow. Would not recommend this chair for everyday sitting, but very pretty to look at.", 
    "I bought this chair because of the size. Unfortunately, it is not a chair I would sit in for any length of time as it is very firm. The fabric is a linen look in polyester. I guess you get what you pay for. If I hadn't been so lazy, I would have sent the chair back. Instead of in my living room, I have moved it to the bedroom and will be looking for another chair.", 
    "I love the chair. I am a smaller woman, 5'3 and slender, and it fits me perfectly. I love it. My husband says it's a little small for his liking if he were to sit there everyday. But the price is great and it looks very nice, especially with the scrolled legs. I am hoping to order the chair in another color for another room.", 
    "easy peasy to put together, fast delivery and even though the seat is a bit harder than I wanted its a great buy and fits perfecting in my small living room", 
    "It is sturdy and beautiful. Totally worth it! Made well. The cushion was firm at first, but it broke in nicely without getting too soft.", 
    "I picked this piece because of its dimensions. It fit through the door of my late 1800s bedroom. I have add some throw pillows for comfort and have been enjoying relaxing.", 
    "Light weight chairs. Good for small rooms like offices or family rooms with low ceilings and/or little square footage.", 
    "I USE THIS CHAIR A LOT AND LOVE IT.", 
    "We were looking for an inexpensive solution to furnish an apartment, and this chair was perfect. It's comfortable and the perfect size for a small space. It's probably not something that will get a lot of use. It would be perfect in a guest room too.", 
    "I love this chair.. it is a perfect fit for where I needed it in my living room. I like the tufted back and seat and the metal studs along the sides. Very stylish and pretty and I love the neutral color.", 
    "I just had my socks knocked off when this arrived. First, they tell you it takes two people to put together. I'm well over 60 with arthritis and I did it myself. This is a real buy for the money and shows well. It's is not a comfortable chair - rather stiff but doesn't matter as no one sits in in much. Nice size and design is lovely. Color is as shown. The main problem with the chair is that, as others have stated, the back of the chair, when inserted leaves a large space. In other words they don't meet which is a huge drawback of you can see the back of the chair. Mine is against a wall so doesn't matter. I would order again even knowing the drawbacks - super chair with a few issues that were unimportant to me but worth mentioniong.", 
    "This was very easy to unpack and assemble( legs only and push top in bottom). Loved the color and not too hard on the firmness. It went well in my country home as en extra seat in great room.", 
    "Very nice chair, smaller than expected but fine for an average sized person. Nice appearance and quality for the money.", 
    "I was very excited about these chairs due to the great price and style. They arrived quickly and were easy to put together. The color matched our living room perfectly. They are small, but that is what we needed. I was very disappointed in the backs of the chairs. The chairs come in two pieces and you have to put the back of the chair into the base. Because of this, there is a seam that runs across the back of the chair where the two pieces meet. Most upholstered chairs have a seamless back with one piece of fabric. If we were using them against a wall or in the corner, I could have maybe made them work for the price. The way we are placing them in the living room shows off the backs of the chairs and I didn't think it looked good. If that will bother you too, you may need to find other chairs. I ended up returning them and purchasing different chairs that had similar tufting, nail heads, and a seamless back. They don't have a photo of the backs of the chairs, and this is probably why. If this won't bother you, the chairs are a great price, cute, and will work in small spaces.", 
    "These were great accent chairs for my bedroom. They are really nice looking. They aren't exactly big or plush enough to curl up in and watch a movie, but is a good occasional chair. Good for the price.", 
    "I needed a neutral colored chair for my living room. This is pretty comfortable and looks nice.Good quality for the price. Easy to assemble.", 
    "Perfect for my BR. It is comfortable and looks very good. There was a little box stain on the back but an agreeable adjustment was promptly made. I buy a lot from Overstock.com as they have good, reasonable products and Superior Customer Service.", 
    "The shipping was fast, and I got it on sale. BUT...the color is not exactly how it is in the picture. I am very disappointed in that because I love this chair so much. In the picture, it looks more cream, however, it is more of a tan color. It is so different than what is on the computer that I thought I was sent the wrong one. That is extremely upsetting since I was looking for a cream colored chair. Aside from the color, everything else is beautiful. The quality, construction, etc is all good. If only the color matched the picture.....", 
    "As most have stated, the chair is a bit firm. I bought two anyway and they look very nice in my living room.", 
    "Easy to assemble and appears to be well built. Small size is perfect for a bedroom or small area. More of a woman's chair due to size.", 
    "great chairs and super easy to put together shipping to canada drove the price up but we are very happy with the chairs", 
    "This is a nice, stylish club chair the doesn't take up much space. I love the button detail and it is a style that goes with many designs. I wish a color swatch could be given or sent out in advance to be sure the colors match to my taste. Beige is a wide range.", 
    "Classy looking chair! Our fellowship group loved them! And some have already ordered their own! I scotch guarded them because I didn't realize the fabric was linen! I hope that will keep stains away since it is a lighter colored fabric. I'm pleased with these chairs!", 
    "Ordered two of these chairs for our living room and love them! We have received many compliments on how well they look with the new laminated wood flooring and now my teenage daughters actually want to sit in the living room. Delivery was quick, packaging was great with no damage, and the chairs where put together easily. I am now a fan and buyer of Overstock.com.", 
    "Received in time; no damage; easy assembly. I wish there was a matching ottoman advertized at a decent price while I ordered this item; I would have gone for it. It is difficuilt to find a matching ottoman separately.", 
    "I ordered one of these chairs to help stage my house for sale. I was leery of ordering furniture online without seeing and touching it. The seats are not reversible, but button tufted. The nailhead trim looks very upscale. They were very easy for my hubby to assemble. Loved it when it was set in the living room, I ordered another!! No problem!! Yes, I would recommend this chair for an occasional chair. Wish there was an ottoman to match.", 
    "good quality for the price- Would buy again :) Had an issue with shipping but customer service with Overstock was great and helped.", 
    "We needed a smaller upholstered chair for our bedroom and this one was perfect. I am 6 feet tall and weigh 195 pounds and didn't want to have to squeeze into the chair but that wasn't the case. It is very comfortable with good back support. It was easy to assemble and is sturdy and attractive. My wife likes it too.", 
    "This is a beautiful chair, but it is very small. It is very easy to put together.", 
    "This chair is right for the money!! Chair sits firm which is what I like. Easy to assemble.. basically very little to do.", 
    "This chair is perfect for my bedroom and it's very comfortable and sturdy. I couldn't be more pleased. All that's needed for putting it together is putting the legs on and inserting the back of the chair into the bottom of the chair - very simple.", 
    "Purchased four of these chairs for our living room around a round leather ottoman. Great look and great price.", 
    "Ordered two of these chairs for our sitting room and couldn't be more pleased. The fabric quality is great and the nailhead trim is perfect (and it's real - not the fake pre-fab stuff). These aren't chairs that you're going to fall asleep in but they definitely serve their purpose in our sitting room (plus, they were super easy to assemble). Also, they look way more expensive than they are -- our friends and family were shocked when we told them the price. I wish we had more room and I would order a few more! Would definitely recommend!", 
    "This is a great looking chair. Very easy assembly. Perfect size for where I needed it. I would highly recommend this chair.", 
    "This chair is very easy to assemble. I love the look and the color. It's exactly as described. I would've liked to spend less on it, but if it lasts a long time it's money well spent. It's also super comfortable.", 
    "These chairs are a smaller scale club chair but a good size. My family room is not a large room so oversized furniture wouldn't work. If you want a chair for curling up to watch tv you will want one with rounder arms. The chair is comfortable otherwise. The linen and nail heads are beautiful. It was very easy to put together.", 
    "Great value. Only think I didn't like there's a huge seam in the back that you can tell it's not a solid piece. It's in a corner in my room so I don't mind butt would if I had intended it for a different area of the room.", 
    "Love it great for the price.", 
    "Easy to put together, love the quality and the color, Super comfy.", 
    "Pros, large seat, looks nice, price was good. Cons, not as sturdy as I would like, not very comfortable.", 
    "Great chair for a good price. Comfortable. Easy to assemble. Nice looking. Glad I purchased it.", 
    "Very nice.....easy to assemble....not as comfy as I would have liked.", 
    "This chair is well made, French in style, and looks great.", 
    "great chair for a bedroom. Looks nice.", 
    "The chair has a very high end appearance, it was very easy to assemble and looks great.", 
    "Very classy and chic. I'm so glad I decided to get it. And it goes with everything", 
    "I've been eyeing this chair for quite some time there was finally a sale so I bought it it was easy to assemble and a great look for my office perfect size not to mention. It's a great chair", 
    "These were super easy to assemble since you just have to slide the back onto the bottom of the chair. They look fantastic. Just like some I've seen in higher end catalogues. The price is right. They are comfortable but it is a firm seat and not a cushy seat. We love them.", 
    "These chairs are perfect for our home. We ordered 2, then decided to order 2 more. We have all four in front of our fireplace which makes a cozy little seating area for us. They are not very large, which is exactly what we needed in that space. Pretty comfortable. Added a small pillow to each for additional back support.", 
    "These chairs look great, but definitely will not hold up to kids and regular use. I've had them for a little over a year and the buttons are coming off. I think get these chairs if you want them for your master bedroom, where it won't be used so much, haha.", 
    "Let's be honest, this is not a pricey chair. That being said, it still looks good and I think it's comfortable. It's not the chair you'd choose to curl up in but it's not at all uncomfortable. It was super easy to put together and I think it looks very nice.", 
    "Finally found a chair to fit in my apartment. This chair is not only stylish and comfortable but it was very easy to assemble. Also have a matching Christopher Knight Beige Ottoman. A perfect combination for watching television or just relaxing.", 
    "Very pleased with our chairs. Well packed, but easy to assemble. The color is just as represented and the fabric seems sturdy. These make a great transition from large wingback chairs we have had for many years. These are excellent for the price.", 
    "My first impression of this chair is that it's very pretty. I knew it wasn't going to be huge based on the dimensions and other reviews. The overall size is ok. The seat is actually fairly large. My biggest complaint is that the back isn't very high. It barely comes up past my shoulders when I am sitting. This is not a chair you can curl up in and take a nap...your head will break off! I don't think I would have purchased it had I been aware of that. With that said, it's actually comfy, to me any way. I'm 5'8 and 130 lbs. My husband hates it, he's 6'5 and 230 lbs. The fabric is nice, love the color, however I don't think it's going to hold up very well. I've had it about a month and can already tell the fabric is beginning to get fuzzy looking. I sit in it every day though. This chair might be better suited for use in an unused room or not as an everyday chair. It's a very pretty chair, but I don't think I would purchase again, solely based on the height of the back. Shipping was fast. It was easy to assemble the legs and back. You can't beat overstock for customer service.", 
    "Nice looking chair but smaller than I expected it to be. Still happy with it because it is in a small room. Good for small spaces.", 
    "Chairs are beautiful and comfortable. Bought them for a den. Perfect!!!!", 
    "I read the reviews and felt I knew what I was getting. This is just sitting in my foyer, and will get no \"traffic\". It's a good thing. It's really cute! Great look, stylish, and pretty fabric, and smallish for a foyer. If you want to use this daily, I suggest getting a higher grade chair. It is incredibly uncomfortable.", 
    "This chair is stunning. From the color to the quality it's on eof my fave new additions to my living room.", 
    "We were pleasantly surprised with this chair. Looks really nice as an accent to the room.", 
    "This chair is well made and beautiful, we actual bought it for our formal bathroom so we could sit down and put our shoes on. The nail head design is timeless.", 
    "We bought two chairs for our sun room. Their size is great for a smaller room and they look very nice, but the quality is a bit lacking. The fabric is starting to wear and a button on the seat has already fallen off.", 
    "Was hoping this chair would work as an accent chair in our family room. It is a good neutral color but the size is very small. Unless you have a tiny spot to put it, I wouldn't recommend it. Sorry.", 
    "This chair looks good but isn't very comfortable. It's really only used as a balance accent chair", 
    "For the money, very stylish and comfortable.", 
    "Really nice sturdy comfortable chair.", 
    "Great chairs for the price. Fast shipping!", 
    "Looks like the picture loved it looks very nice in the family room", 
    "I love my chair! It was just what I was looking for and easy to assemble!", 
    "These were super cheap and I admit I was worried when I purchased them. However they are super comfortable and the fabric has really stood up, to my big family.", 
    "I've been looking for a chair like this for a while. Very satisfied with my purchase, fast delivery.", 
    "I bought two for a friends wedding. They used them to sit in at the reception and then used them for their new home. They assembled really easily. Just follow the directions. The shipping was amazingly fast!These are great quality chairs. I would buy them again.", 
    "I bough 2 chairs they are comfortable. They look great. Easy to assembly.", 
    "Good quality for the price. Goes very well with our room décor.", 
    "I am very happy with the chairs. We bought two. They are easy to assemble and they look very nice. I was worried about them holding up. When you don't pay a lot for something I think you watch it more closely for flaws. So far they have been great! I didn't give it 5 stars just because the cushions could be a little bit fuller. But for the price it's better than expected.", 
    "Comfortable but smaller than I expected", 
    "Very comfortable and easy. Sits a little low but looks great.", 
    "This is my second purchase of Christopher Knight chairs. It is of great quality and looks beautiful in my sitting area", 
    "Elegant looking chair and fits my decor. Seat cushion is a little hard but might get better with use. Overall very nice chair.", 
    "These chairs are so pretty! They were easy to put together and comfortable to sit in.", 
    "This chair was exactly what I was looking for to fill a corner of our living room. It is a little smaller than I expected, but it still serves its purpose for us. The color is exactly as pictured and it looks like I paid more for it than I actually did. The turned legs in front add a nice, classic touch. I'm happy with this purchase.", 
    "Love this chair. Cute and classy! Small of course but perfect as an accent piece.", 
    "So thankful we got this one! The style/quality is great. True to color. Easy to assemble. Probably will purchase another one! Great accent chair!", 
    "Small scale , easy assembly , if you need large chairs don't order - but for small spaces they are great -", 
    "I've had the chair for about a year and a half now and it has been amazing! Still looks brand new! (I've taken really good care of it.) It sits in the corner of my room and works perfect when I just want to relax and read a good book. I would recommend it!", 
    "I read all the reviews and bought 2 chairs. I am so glad I did. The chairs are beautiful and comfortable. Great price.", 
    "Love, love, this chair! It was super easy to put together and the details in the tufting, turned legs, and nailhead finish make it look like a much more expensive piece. It is very comfortable and fits my body well. The neutral color goes with any decor, and the fabric has some texture so again looks high-end for a very reasonable price.", 
    "Perfect for our transitional living room: great value for price, very high style and comfort. LOVE THEM!", 
    "I couldn't afford my dream chair for my bedside. This chair, I could afford and does the job. Definitely on the small side and not super comfy but looks nice.", 
    "Before the chair was delivered, I wasn't sure if I had really liked it. I kept going back to the website to check others that were maybe prettier or bigger. Well, the chair was delivered today and after my husband put it together (which took him less than 5 min btw), I fell in love with it! It looks very nice in our bedroom and definitely looks more expensive than it was. I'm very happy with this purchase!", 
    "Well built, me and my girlfriend use this as a reading chair in the corner of our bedroom. It was quick and easy to put together and didn't take us long to figure out it's just what we were looking for. - Thanks", 
    "I bought 2 of these chairs about 6 months ago. They have held up very well despite being my cat's favorite chair. They are very nice and provide good support. They are on the smaller side. I have them in my living room but they may be a better size for a bedroom. The linen color is great.", 
    "nice chairl ...a little small...but elegant", 
    "These chairs look very nice in a room...but are not practical. They are much smaller than they appear in the pictures and not comfy at all to sit in. The legs make it feel a bit wobbly too. I purchased two for my bedroom suite and they were great for that space...because they fit the space, were nice to look at and no one ever sat in them. But if purchasing for a living room or someplace where you want to use these for seating, I'd recommend against it. I moved recently and sold these at a yard sale after having them for about a year.", 
    "We use this as an accent piece so it doesn't get a lot of use, but it's pretty comfortable and well made for the price.", 
    "We receive a lot of compliments on these (I bought 2) They can go into any style home and fit in. They are also very comfortable to sit in.", 
    "This chair fits well with my linen colored sofa, takes up little space in small living room, yet is comfortable enough to meditate in for a long stretch. (My cat's favorite chair, too.)", 
    "Bought this as an accent chair for my room. Very easy to put together, but should note that the back is best against a wall since you can see the separation between the top and bottom pieces where they fit together. Good packaging, no damages during shipping. Color is a darker beige linen fabric. Fabric quality is good. Tufting is good and even. Nailheads are good quality and evenly spaced. It is a softer cushion but comfortable. It is a smaller chair so good as an accent chair in a smaller room or in a smaller corner space so if looking for a more substantial living room chair, this is not it. Otherwise perfect for what I was looking for.", 
    "I have had these chairs for almost two years and they have held up very well! To be honest, these are in a formal room so they only get sat on maybe once a week, so they aren't getting every day use. I am not sure how well they would hold up in that case. But they are perfect and I love the way they look!", 
    "I purchased this chair for my livingroom. I placed it by my fireplace.It looks great .It was very easy to put together.It's sturdy and it looks great! I purchased another one last week.I would recommend this chair to anyone on a budget that is looking for alittle style and alittle fancy in their livingroom.", 
    "Will buy another soon. Easy to assemble. Color is true to picture.", 
    "Great chair for the price!", 
    "I use this for portraits and everyone loves it! So easy to assemble and gorgeous!", 
    "Easy delivery. Only had to add legs.", 
    "Very comfortable chair. Love the fabric and the legs!!! I really recommend this item!!!!", 
    "I bought two and they match my ****** **** linen bed perfectly. They're comfy and elegant. Great price!", 
    "This chair looks great, but is very hard, so it's best for more occasional seating. I have it in my living room and it's perfect.", 
    "I purchased this to be used as a reading chair in a guest room and am very pleased with it. It is on the small side, which I needed given the space, but still big enough that at 5' 7\" I can curl my legs up in it. The nailheads and tufting add a lot of style for the price. There were no quality defects (loose buttons, snagged fabric). The color is a light stone/beige, on the cooler side of beige, versus a warmer camel color (also what I wanted). You won't mistake the quality of the fabric for high end furniture, but the weave is consistent and soft to the touch. All in all, very happy with this purchase.", 
    "Great style but very wobbly and not great construction.", 
    "This chair arrived quickly and was easy to assemble. I was extremely pleased with the quality of the chair. I was unsure when purchasing the chair, given the reasonable price. However, the chair and fabric is beautiful looks high-quality.", 
    "Great little chair. Good value. Easy to assemble.", 
    "Soft color chair, warmed up my home perfectly!", 
    "This chair was exactly what I was looking for. Fits perfectly in my master bedroom.", 
    "Read measurements, small and stiff, but cute", 
    "Very nice chair I ordered it for my living room but it ended up being way to small. I put it in my bedroom.", 
    "Perfect size and easy to assemble", 
    "Bought 2 and they are perfect for the living room. Expensive look for a very reasonable price", 
    "It's a small chair, and would look great in a bedroom.", 
    "These are side chairs for an area in my lower level that doesn't get used that often. I don't think they would hold up to everyday rough use, but for an accent chair that is not used daily, they fit the bill. Very happy with this purchase.", 
    "We were very pleased with the 2 chairs. They were exactly what we needed in the space we had.", 
    "Everything about this chair is basically as pictured. It is a great looking chair but the only thing that is off is the color. I thought this would be a lighter than it actually is, it's more of a dark beige than light beige as pictured. It is a hard but comfortable chair, perfect for reading but probably not for lounging. Overall, good buy.", 
    "Great chair for small spaces. Uncomfortable for large adults. Frame of chair alittle shaky.", 
    "They look so expensive, not your everyday comfy chair but just perfect for that touch of elegance in your seating area. Perfect for the price. Color as pictured, great quality. Easy to assemble.", 
    "Love everything about it. The color, the style, & the nailheads are all perfect for my living area. Arrived very quickly. Very comfortable to sit in.", 
    "This chair added a very elegent feel to my dining room, I added 2 accent pillows to top off the look. It makes a great addition to the space. Is it a chair I would sit in for several hours at a time, probably not. But it looks fantastic and is a great, elegant looking piece.", 
    "We purchased two of these armchairs, and put them in our reading room, by all our bookshelves. We also added a small round table between the two armchairs. The armchairs are inviting, comfortable, stylish, and go very well with the theme of the room. They arrived promptly and were extremely easy to assemble. I did it by myself, and it took about 10 minutes per armchair. I am very pleased with this purchase, and would definitely recommend to others.", 
    "Nice solid chair, on the small side which works for us. Firm but not too firm.", 
    "Great chair. Fits the look I wanted. It looks exactly the way it does in the picture. Great bargain.", 
    "This chair was easy to put together and looks great. It is firm and has more of a tan/beige color than the picture indicates, but is still very nice. It is not incredibly wide.", 
    "The product arrived quickly and looks good. The only problem is it is much smaller than expected and the color is really more of a darker beige/brown and not a light color. It works for a guest bedroom accent chair but too small to put in living room for everyday use. Really it is almost meant for kids. Also- the legs are tucked in a hidden compartment underneath the seat bottom. At first you might think they forgot to ship them with it.", 
    "Great Chair. Best price around.", 
    "WE HAVE RECEIVED MORE COMPLIMENTS FOR THESE TWO CHAIRS THAN OTHER MUCH MORE EXPENSIVE FURNITURE IN OUR HOUSE. WELL MADE AND EASY TO SIT IN.", 
    "came in only 2 pieces. looks much more expensive than it is. Great little chair.", 
    "Very classy looking and great for a smaller area or bedroom.", 
    "Purchased for living room; stylish; comfortable; good price", 
    "I purchased one of these a while back and like it enough to get a matching one. The purchases where about a year apart and the chairs match perfectly. So that tells me that the quality control during the manufacturing must be pretty good. I get compliments often. They are not big and bulky and are perfect for apartment living. Color is light tan.", 
    "I bought 2 of these thinking they'd be a great fit in my front room. True to color and they look like they're picture. We haven't even had the for 6 months and the front legs are bending inwards. The chairs are unsafe to sit in and it is a waste of money since I now must go out and buy new chairs. Unless these are for decoration don't buy them.", 
    "In my opinion, these chairs are meant to be looked at more than used. They are VERY hard and I don't mean hard like stiff overstuffed upholstery or foam, I mean hard like they bottom out and you are sitting on a plank. Fine for company but not for lounging or curling up in to watch TV or read a book. Great price and good if you only need them for occasional, short-term use. They are really good looking and the linen upholstery looks just like it does in the photos. My interior designer friend said, \"cute\" as she passed by them to look at another room.", 
    "Although the chair is described as beige, the picture made it seem more like an ivory. I bought too, and am so sad that they are actually beige. Do not be deceived by the picture. Comfort is firm, but I like that, and the nail head border looks fantastic, just wish the colour was more like the picture.", 
    "Looks great but isn't really comfortable.", 
    "Easy to put together and very nice looking chairs. Perfect for my living room.", 
    "The chairs are beautiful, comfortable, stylish, and easy to assemble. I'm really satisfied.", 
    "In simplest terms, if you've read the other posts, they're accurate and it's what I used to make the long awaited decision to buy it sight unseen.I bought it at the beginning of December as I needed to replace the infamous and well used Poang chair from Ikea for my apartments living room. I often have guests/clients over for events and meetings and needed something capable for people to sit in. As many are overweight and even disabled, I needed something stable and capable of handling their needs. This chair does it in spades.Note: It's true that the sitting pad is stiff but it holds firm which keeps the pleasurable look of the chair constant and isn't like sitting on the floor or cardboard.Assembly was a cinch and needs no tools and very few brain cells to find how it's to be put together even without the instructions.I do recommend it for office or casual suares but not reading a novel like Moby Dick.", 
    "it is a nice chair for the price you can't go wrong", 
    "I purchased one in the beige color hoping for a very natural linen look and color. It is exactly that. Not a large chair--just right for an average size person; but not large enough for an adult to pull your legs up and curl into. The seat is very firm but not uncomfortable. Guests really seem to like sitting in it. So easy to put together! Screw in the four legs (zipped into an under-the-chair pouch that I nearly missed) and insert the back into the seat. This does leave a seam across the back, but that in no way detracts from it's overall appearance. I would buy another one of these chairs with no hesitation at all.", 
    "The chair looks great. I just wish the back was a little higher for comfort.", 
    "No cushion and its rather small. I purchased two and am now looking to replace these but the style is posh however the chair is not comfortable at all", 
    "This chair is really nice especially for the price. The fabric is easy to clean and of good quality. It's a perfect neural chair for a classy room.", 
    "The chairs add an elegant look to my living room. They are not the most comfortable chairs, but everyone loves the way they look.", 
    "I purchased two of these chairs and I am so happy with my purchase. They are stylish and comfortable (pretty firm) and the price was right! Very pleased!", 
    "Very Happy with my chair. Its just as I thought, small, perfect for a little reading nook or bedside where I used it. Chair is very firm. The color is just as photographed. Wish I had another.", 
    "This chair is gorgeous. It looks exactly as pictured on web site. It looks great in front of a window---in corner of my dining room. Was a great price as well!", 
    "The only thing I don't like is that from the back of the chair you can see its two pieces. Other than that, I am obsessed with this chair!", 
    "Bought two of these chairs for my living room. They came within a week or ordering, and were a cinch to put together (took me less than 5 minutes each). They are a beautiful color, and perfect height. Very, very comfortable.", 
    "This is a beautiful chair and extremely easy to assemble. It looks very antique and of high quality. It's not very comfortable (ie. the cushion is not very soft), but it looks pretty in my living room. I would buy again and would consider other colors.", 
    "A beautiful fabric with striking detail and a solid structure make this a wonderful chair. I am using it in our bedroom. Was all that I had hoped for and more.", 
    "This club chair may not be the most comfortable, but I don't mind I mainly bought it for my bedroom. I absolutely love the style of it! I was really surprised of how good of quality it is, for the price I paid I expected less.", 
    "You can't bet the quality for the price! Will definitely be using this site again!!", 
    "In love with this chair! It has such a classic style, and I love the nailheads. It fits beautifully in my room and is quite comfortable too. I searched for three months for the perfect chair for my bedroom, and am so glad I chose this one. Highly recommend!", 
    "We bought these chairs for our sitting room. They are firm - but I like the fact that they are not too cushy. They hold up great! One thing to watch out for. Before screwing in the legs of the chairs, hammer any staples that may be poking up to avoid chipped wood on the leg. That happened which is minor. The style of these chairs you seriosuly can't beat for the price. They match great with our light grey couch", 
    "I'm really loving my chairs. They are simple but elegant. Some bright pillows really make them pop. The legs and back were easy to put on. They aren't extremely soft but I like the \"stiffness,\" it's a nice change from a really soft couch. My Dad and boyfriend who have back issues really enjoy them because they don't sink when they sit in them. I've gotten many compliments from friends. Great price! Definite recommendation!", 
    "Needed two chairs that matched and weren't huge for a smaller space. The chairs look great! They are a great value for the look, in my opinions. Time will tell whether or not they hold up well, but for the value, heck...just buy two more chairs in a couple of years if they wear out.", 
    "I bought these chairs for my husband's reception area in his law office. They are beautiful and very comfortable. The beige color is true to what is seen online. The construction is solid and the linen material looks very expensive They are exactly what we wanted and are a great value. I would definitely recommend this chair.", 
    "Style: great. Really love the look of these chairs. The turned front legs are a nice style element, and the fabric color is a true beige - not off-white, not camel, but in between. Nail heads are good looking. They ARE on the petite side, which works well for our use. I have them off to a side conversation area in my living room. I would not recommend them for chairs you sit in often, like to watch TV or read, because they are rather firm. As firm as a wooden chair with a very thin cushion. Maybe they will soften up, but extremely firm when new. Assembly: Easy-peasey. It took me 10 minutes- tops- per chair to assemble by myself. I looked for a while for chairs, and for the cost, I think these are a good deal. They are not high end expensive chairs, but I knew that when buying. They look great.", 
    "I bought two of these chairs and they are terrific. The nail heads are really nice. They are great to sit in. I also bought the Christopher Knight Home Fielding Ottoman and they look great together. I added accent pillows. Looks like a million bucks! They are in a studio with the ottoman at the end of the bed and the chairs at a casual, small antique wooden dining table in the room. I pull the chairs and ottoman into position together and use them for watching TV.", 
    "I just got these (2) today after ordering them less than a week ago. They are so perfect. Small scale so they fit great in a smaller room. The color beautiful. They are firm but comfortable. I'm in love.", 
    "Nice chair. A little tricky putting back rest on, once in place the chair is very nice and fashionable. Fabric is almost like a linen type.", 
    "I wanted NOT to have a HUGE, BULKY chair, and this is chair is PERFECT. Very easy to put together. The fabric is better than I expected. And I am really surprised how comfortable this chair sits. For this price, you will be pleasantly surprised with the quality of your purchase!! I would for sure say: GO FOR IT!", 
    "I was unpacking this chair when a friend stopped by, she wanted to know where I got such a nice piece, and of course the cost. I told her Overstock has such a great selection and prices.", 
    "AMAZING Loved the chairs so much. Beautiful! Great fabric and great color", 
    "I like the look very much. We used it for a seating area in our bedroom. The chair is on a firm side. Not the most comfortable to cuddle in and read a book. The back portion is rather short too but I do like the look very much. Good price as we'll and a classic look.", 
    "I am very pleased with this chair, not only does it match my bedroom decor but it looks so expensive! I am so glad I purchased this!!", 
    "very please with the purchase of the chairs.More than expected an deliveried within a week.Very easy to assemble.The only problem was where the legs were stored in a zipped compartment under chair.The weight pulled the underlining apart.Should be just placed in the shipping box.Other than that very pleased.", 
    "LOVE this chair! Fabric is beautiful with slight sheen. So stylish. Piece of cake to assemble. Couldn't be happier.", 
    "I am so happy with this chair! I purchased two for my formal living/dining room and they work great. The chairs are very stylish and elegant. You would have to pay a lot more for a similar look at other stores. They are pretty comfy too, not to hard and not too soft.", 
    "The chair is pretty and small. Not comfortable for adaily use. The color is darker than it appears at the site. It was very well packaged and easy to assemble. It has a very bad strong odor, possibly the fabric dye. The odor is disappearing but I still smell it. For the price, it is not worth the headaches of returning it. It is nice as an accent piece or to fill a space for decorative reasons.", 
    "The chair back was too low and the entire chair a bit small for the space we were looking to fill so these chairs were returned. O has a great return policy and we're now making another selection to better fit our needs. PS) When we opened the box, the bottom of the chair had a formaldehyde warning that made us a little nervous. This may be completely normal, I just couldn't stop thinking about it every time I looked at the chair next to our bed.", 
    "I purchased the first one to see if it was up to my expectations (which it was) so I bought another to match it for my office. The seating is very firm which is fine for office use. I would not recommend this chair if you are looking for a soft, friendly reading chair. This is a chair for adding an accent to a room's decor. However, the price was VERY affordable. The packaging is amazingly efficient! It took just a couple minutes to assemble, place and begin to use. The color is as it appears online. The entire office approves of these chairs.", 
    "I am in love with this chair! It is absolutely perfect. The fabric is great quality and color. Looks great with anything because of its textured linen color. It has the perfect beige & grey balance. The nail heads were perfectly lined up on mine. It is a great size for any space...very average for an accent chair. It was simple to assemble. It actually took me longer to remove a little made in China sticker from one of the legs than it took to build the entire chair. :) I was a bit concerned with others feedback as they said you had to attach the back of the chair. It is actually attached, you just lock it onto a wooden rail and It is very secure. It is a heavy chair for its size which made it feel even more quality. The packaging was great and shipping was quick. It even comes in a fabric sack which was awesome since the shipping box was dirty and I would have probably ended up getting a bit on the chair as I pulled it out of the box by myself. If you are stressed about purchasing these online, I would not hesitate at all. They are even better looking in person.", 
    "Great chair for the price. Looks exactly like the picture. Perfect color and simple to put together.", 
    "Chair not as it appears on line, lightweight, color a little darker then it appeared on line", 
    "We just purchased this chair. It was very easy to put together, and is very comfortable, even for every day use. Beautiful. We love it!", 
    "This chair is perfect. We have an apartment sized for 2 people and this fits wonderfully. I am 5'8 and my husband is 6'0 and this chair is comfortable for our sizes. For a club chair, it's a smaller version of it; but it's a regular sized chair in general when compared to non-club chairs. It's firm which we like - yet I curl up with a book to read on it comfortably. Assembly was beyond easy and took minutes. My husband wants to buy another one. Buy this chair, you will not regret it.", 
    "Chair could have been softer. It is very hard but serves the purpose for the price.", 
    "Very happy with the chairs. Work great as extra seating for company. Great look. Lots of compliments.", 
    "The chair is quite nice. Arrived very quickly, and easy to assemble.", 
    "Chair is nice looking. It is on the light side (easy to move around) which works for us. We are very happy with it. My husband of all people insisted I write this review to celebrate how easy it was to put together. Yes I said celebrate. We have been putting together furniture a lot lately and this piece - well... if it took us 10 minutes its because we were staring in amazement on how simple and easy this was to put together. Four legs and slip the back in...done. Very happy with this purchase.", 
    "The Club chair is a petite version of an actual club chair. Cute and stylish with the nailheads, but extremely firm and compact looking. In a parlor setting with a bay window, it is a bit lost in the room. A fashion pillow does bring it to life, but it is not very comfortable. Design and delivery are good, with the legs tucked into the body of the chair. The neutral color works with everything, and can be tweaked with a throw or a pillow. It could stand to be re-tooled for a cushy chair.", 
    "Very comfortable. Color as shown. Quality is also good.", 
    "very nice looking chair. has a classic look that is time less. wish it came in one piece. the top is an insert that goes into bottom so you can visibly see it from the back. overall everybody loves the look!", 
    "I'm an interior designer and finding a good quality chair at an affordable price can be challenging. When I saw these chairs it was the perfect transitional & traditional pieces. So I had to buy two. Thanks Overstock!", 
    "My husband and I were looking for a living room chair to coordinate with our brown sofa. We choice this chair because of its clean lines, color, and, of corse, price. It arrived in less than 48 hours. We couldn't be happier! It's perfect! The chair was easy to assemble. I am really pleased with the construction and the comfort of this piece. Would definitely recommend.", 
    "chair is neither soft nor hard. It's perfect. Fits well in a normal size living area", 
    "I bought this product for our bedroom and fell in love instantly. Its a great product for an amazing price.", 
    "This is definitely not a chair you can sink into. But it is great for a formal living room because it adds style to any space. It is not too small. It is not imposing either.", 
    "I purchased this chair for my daughter's first home. It is a quality product and was easy to put together. It is perfect!", 
    "Love the look of the chairs. They are perfect. Just what I wanted.", 
    "I loved the chair. It is priced right. I looks great in my living room. It does not take up a lot of space or look bulky.", 
    "Great chair, seems kind of small but good quality. It will not get a ton of use in our house, more of a decorative piece so its perfect.", 
    "This chair was very simple to put together took less than 15 minutes. A little stiff, but for the money its a great buy. Very nice looking chair.", 
    "This chair is a good size for a bedroom and the color would go with anything...just add a throw pillow in the color of your choice and you have a great accent piece!", 
    "This chair was sooo easy to assemble, looks great as an accent chair in my apartment living room and looks expensive! its comfortable, and i love the fact that the chair is deep to sit in. I wanted an affordable chair with arms and couldnt be more happy with this purchase! Thank you overstock!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Malone-Beige-Club-Chair/6808259/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6808259/Christopher-Knight-Home-Malone-Beige-Club-Chair-bf6dcd6b-8f11-4fbe-8f28-f1c69b9cb48e_600.jpg"
  ], 
  "description": "Curl up with your favorite book in this luxurious, soft club chair. Its velvet and polyester blend upholstery is exquisitely soft to the touch, and its tufted back and ample padding keep you comfortable for hours. It has a classy vintage design reminiscent of something from a classic film star's living room.Velvet and polyester blend upholstery for exquisite softnessClassic tufted back for added elegance and comfortDecorative brass stud detailing add sophisticationCarved front legs add interestSoft padding on all sides for a cozy look34\" H x 30\" W x 27\" DSeat measures 18\" H x 20\"W x 21\" DStyleContemporary, ModernMaterialBrass, Polyester Blend, WoodFinishBrass, Espresso, WoodChair TypeArm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeigeFurniture Frame MaterialWoodFurniture PatternSolid"
}