{
  "name": "Christopher_Knight_Home_Venetian_Dining_Chair_(Set_of_2)", 
  "price": "EUR 187.12", 
  "reviews": [
    "The chairs have a nice padding, but there isn't enough padding on the front of the seat where your knees bend. You can feel the wood and it's not the most comfortable. The tufting and gray fabric looks nicer in the photos. I got these on sale so I'm going to keep them but if I paid full price I would be returning them. They were really easy to assemble and sturdy. These are packaged really poorly. There is no padding in the box, so the back legs poked through the box and got damaged. Chunks of wood are missing so I have to send them back for a replacement.", 
    "Just like all of the other reviews say, this is not the quality of a $800 dining chair. But I'm super picky, and it's a very very nice chair. I'm doing Hollywood Regency style and my furnishings have to look sharp or I won't pull of the luxurious look. I was concerned about color... too light, weak, pale and sad? It's not. It is a very luxurious, medium-reflective velvet that displays a warm, deep champagne color at one angle of viewing and a lighter, yet still very rich color from another angle. It's better than I had hoped for! They are sturdy. They were easy to put together. I feel like I'm sitting in a well made chair. And I even asked about shipping rates for getting them back to Overstock in case they weren't comfortable because I've decided that my days of sitting on an uncomfortable dining chair while chatting with friends for 2 hours after dinner are over. I wasn't going to settle for anything less that very very comfortable. And guess what... SUPER comfy. Not like a sofa, but dang close! The back is well padded and a great angle. The seat is very well padded with just the right amount of support in the center. I can't say enough about how wonderful this chair is. If you are anything like me and you are concerned that it's going to be a cheap color, poorly made, probably not that comfortable chair.... rest at ease and order. I love them!!!", 
    "These chairs are true to color (bought the light gray)...love the duck fabric feel. They clean up very very well (chocolate, meat sauce, etc.) with just a baby wipe. They are also super cushioned and comfy. We were very impressed!", 
    "Love the champagne velvet. Goes very well with beige and expresso brown table and other chairs. Easy to put together, fast delivery. No damage during delivery. Great value for a set of two. One of the legs cracked when screwed in, I got online with the customer service, and within 48 hrs, they resolved the issue. They shipped out a set of two front legs (even though I needed only one) for me so quickly! Great service and response. The velvet makes it look very classy and upscale.", 
    "These are great side chairs for my dining room. I hope these hold up over time. We don't use the dining room all that much so they should. They are true to the color. You have to put them together yourself but after we figured out the first one the rest were easier. They came packaged very nicely. We had a problem with one of the legs but a quick call to the help desk and all was taken care of. Thanks \"O\" for your excellent prices and customer service and quick delivery.", 
    "these chairs were very unstable and cheap material", 
    "Very nice quality and very comfortable. We got the light grey set and the color is true on the website. Don't hesitate on these they are a for sure nice set, and a great price too.", 
    "These chairs are gorgeous! Super soft fabric, sturdy construction, and they are perfect for my dining room. - The seat is firm but comfortable (so far)- They feel a bit petite in the space compared to my old parsons chair, even though the measurements are the same. That's because the width of the backrest is narrower up until the top where it gently flares out. So they are perfect for small spaces too. (I'll most likely get another 2 to fill up the space visually - and because I love them so much I need an excuse to get 2 more anyway). :)They are elegant and classy. A+++", 
    "i'd rather have had the velvet ones I ordered but these are ok.", 
    "I am reluctant to buy assemble-yourself furniture as I am not particularly handy but these chairs were easy to assemble in just a few pieces and only needed a few adjustments along the way to make sure the legs were balanced. I like the pleating on the chairs (vs. the usual buttons that trap dirt) and the fabric looks nice. The fabric doesn't feel as rich to the touch as it looks but the quality is still good. The seat base is wider than I thought so we are using these two chairs as accent end chairs. Because they are padded, they will also be nice extra seating when we need it as well. For the quality and price, they are a good buy. I bought the ivory and think that they may have looked richer in another color but am still very happy with my purchase.", 
    "These chairs are absolutely awesome! We love them! My husband said they weren't too bad to put together but I bought six so he was glad when he was done!", 
    "I was looking for inexpensive chairs with a chic feel. These fit the bill! Of course they aren't made with the best quality materials but for the money they are great!", 
    "These chairs perfectly compliment the charcoal gray and silver color theme and style of my dining set.", 
    "Very pleased with these chairs and great quality for price. Fairly easy to put together although some of the screws were difficult to line up. But overall very good product.", 
    "assembly was pretty easy, although 2 out of 8 were a little bit of quilter. all i did was sit on them a few times and \"stretched\" the chair out a bit into being straight. good stuff.", 
    "Gorgeous chairs! I purchased the champagne color and I am absolutely in love with them. I highly recommend.!", 
    "Great chairs easy to assemble! We like them very much, however I phoned Overstock right away about a couple of the back legs having cracks through them. I had requested a couple spares feeling like if they broke that I would have the legs on hand... No such Luck! I feel like it was poor service on their part", 
    "Great addition to our new dinning room", 
    "Beautiful chairs, easy assemble and sturdy! Great buy...", 
    "The six chairs were well packaged. They are simple to put together (i used a ratchet with a hex socket and that made the process much easier on my hands). Very elegant.", 
    "The chairs look nice and weren't too difficult to put together. However one of the chairs has a defect which will require a whole new chair. Customer service has been very helpful thus far.", 
    "LOVE LOVE my new dining chairs. EASY so EASY to assemble.I needed to store them in my garage for a month and I was concerned about the exposure to the damp and cold but NO WOPRIES these chairs were packaged with extreme care,cloth like bags and plastic and more plastic.And they are sooo comfortable,perfect height for the seats,my previous chairs were too low.LOVE the look.", 
    "Comfy and Elegant! Took more than 20 mins to put together.", 
    "very happy with this product!", 
    "I've gotten so many compliments on these chairs! They look lovely in the apartment and fairly easy to install!", 
    "I compare a lot of chairs before to buy these ones. It was a good decision", 
    "I absolutely love how my dining room chairs look and feel. They are very glamourous. I purchased the silver/greyish ones and I couldn't be more pleased with the color. They were easy to put together. It took me about an hour & fifteen minutes to put together all four chairs. I haven't really sat in them for longer than 5 minutes, so I can't touch on the comfort level of the chairs... But, they look amazing and the fabric feels soft and durable.", 
    "Great quality and beautiful look!", 
    "I already had 4 but got two more because I expanded my table.", 
    "These chairs were easily put together and are comfortable as well as attractive. I am very pleased with these chairs and would recommend them to anyone.", 
    "Classy but inexpensive dining chairs. Ordered six. Very comfortable seating height and back angle. Easy to assemble and adjust. Legs can be adjusted by leaving front bolts almost loose and sitting in the chair to set correct effective leg lengths. Helps to have a low-powered screw driver with appropriate allen-head bit to set the bolts before snugging up by hand.", 
    "These chairs are a little difficult to put together but once together they look great", 
    "They look nice but I didnot know the material was going to look the way it is. I thought it was like a plush velvet thats how it look on the picture.But it has to do for now.", 
    "Great chairs, went together easy and the legs were nice and even no wobble. They look like they will last a long time.", 
    "Light gray went great with my dark gray bench and espresso table. I think it's good product for the price. O has fast delivery and excellent customer service as always. My husband assembled for me which he needed his power tool and make sure it was all lined up. Only 1 chair gave him problems. I wish fabric wasn't linen but I really like the color and didn't want to pay a lot.", 
    "The chairs go great with my oval table and the button features add a touch of class. They are very light in color- be sure you want a light grey - we used a fabric protection from our local hardware store .", 
    "I purchased 6 of the champagne velvet, only opened and assembled 2 so far, they are beautiful however you can little things that can be fixed ie: black fabric under chair hanging in the back of 1 chair and some threads that need to be cut. For the price you really can't get a nicer look but really can't expect perfection.. So far so good", 
    "Assembly wasn't the easiest and they feel a little wobbly but you get what you pay for.", 
    "I love the chairs but decided to go withe a different color. They are perfect!! Great construction!! Christopher Knight products will not disappoint!!!", 
    "Easy to assemble. I needed a smaller chair for kitchen table. Adds class and was a great value.", 
    "Very Comfortable chairs with style.. Look amazing in our dining room", 
    "I bought 6 of these chairs to go with the Ashley Furniture Tripton table. They are similar to the Ashley chairs, but not as \"nice.\" They are tufted, but don't have the buttons over the tufts, and teh fabric isn't as nice as the Ashley ones. Overall, I'm happy and they serve their purpose.", 
    "The chairs look amazing in our dining room, the espresso finish on the legs is a perfect match to our dining room table. The fabric is nice and can be wiped clean while the cushions are comfy yet sturdy. There were a few minor imperfections on the legs probably from shipping & package handling but are very hard to see which is why I gave a 4/5 stars.", 
    "The color and fabric aren't accurately depicted, but still love them.", 
    "These are gorgeous! The quality is medium because you sink a little lower than I was hoping when you sit but it's nothing to worry about. The color is exactly like shown in the picture. They arrived early and look great.", 
    "These chairs are gorgeous. The fabric is very lush and they are very comfortable. Also very easy to put together.", 
    "These chairs look great but I'm disappointed by the amount of cushioning in the seats. Every time I sit on the chairs, I can feel the padding sink in a bit (I am 110 lbs). Once you get used to it, it feels fine, but definitely noticeable when first settling into the chair. These chairs also required a good bit of elbow grease to assemble. Assembling one or two chairs is okay but beware if you get more!", 
    "These chairs are exactly what I was looking for. They are perfect for my new Arcadia dining table. Love the fact that they are so lightweight. Very comfortable. My sons put them together and said they had issues with the first one but the rest went together fine.", 
    "Bought 8 of these very nice took awhile to put together but worth It", 
    "Pleased with these overall. There is a bit of difficulty lining up all 5 bolts in the back putting together but worth the effort. They are much lighter than they look but still feel sturdy. Have ordered the Greenwich aeon dining table to go with them. Check it out if you are after a table too.", 
    "I was hoping these would give my dining room the look of elegance and they did! Great for the price too!", 
    "I love the way these chairs look, however the quality sucks. The cushions are not firm, in fact the chairs already have cushion indents. These chairs are not sturdy at all and you have to constantly tighten the leg bots. I wish I could get a refund.", 
    "I thought I was getting the white/light color and somehow got the gold looking color chairs. They looked like something your 80 year old grandma would have in the color I got. It then cost a fortune to return - something like $** but Overstock was very good about refunding the rest of the money quickly. They gave me half the cost to return as a credit, which I used to buy something else. Just be careful that the color choice is what you want because there was NO color choice when I tried to order it so I thought I was getting what was pictured. Instead I got an ugly gold color. I also didn't like the way the buttons looked.", 
    "Very easy to assemble, nice color and looks expensive.", 
    "The chair's quality was not good at all. The upholstery was of a poor quality and the color was off. I returned them.", 
    "These look great around my new modern round breakfast table. I bought 4 in the color gray,which was exactly as the picture display. Easy to put legs on the chairs and no problems. The fabric is nice and easy to clean.", 
    "These chairs look expensive and are beautiful with my dark wood farm/industrial table", 
    "They made our dinning room look finished and elegant. For the price they are great. Putting all 6 together took a while, but wasn't too difficult. The quality of the chair is better than I expected for the price. Highly recommend, especially if they are going in your dining room where they wont be used as the everyday chair. Great buy,", 
    "Not too hard to put together, and comfortable. I did buy Scotch Guard at Home Depot in order to protect the light color, but they look great around my reclaimed wood table - makes it look very rich! I had looked at much more expensive chairs - very happy with this purchase.", 
    "Luxurious look and feel but at a budget price.", 
    "Looks great with my dining table! Very lightweight and easy to put together!", 
    "Could not be more satisfied with these chairs. The grey color is perfect, they are well built, easy to assemble, comfortable, and I love the style. I use them as end chairs with an existing dining set, and they complement and stand out just perfectly.", 
    "I ordered natural linen and the linen has white lines in it. It is not solid natural linen. I am not 100 percent satisfied but I am lazy to return. The shape of the chair looks good.", 
    "Nice chairs! Great price!", 
    "chairs look ok,but made cheaply,it too me long time to put together.front legs wrapped separate were knicked and one leg was already splitting", 
    "Beautiful chair. However, after installation, the chairs do not stay balance., that is one leg shorter than the other three. I bought 6, 4 of them have this issue.", 
    "These chairs are so beautiful and adds so much beauty to your home. When I receive my chair no damage thank god, but when my husband was putting the second chair together the holes and screws didn't line up. That was a manufacturer defect not an overstock, I called overstock right away and they are sending me out a new chair. They don't just have amazing stuff they also have amazing service.", 
    "a little more velvety than pictured/described", 
    "Sturdy chairs and easy to assemble. They look beautiful in my dining room. I bought 3 sets.", 
    "Love these chairs, matched description 100%", 
    "I got these to go with my reclaimed wood dining table. They really tie everything together and I get tons of compliments. Assembly was quick and painless (I bought 3 sets and it only took about 30 minutes) and the chairs are really comfortable and sturdy. Haven't had any problems with any of them wobbling.", 
    "It's very comfortable and well made", 
    "Love it . They are beautifull looks great in the dinning", 
    "Chairs are comfortable and can be used in all style of dining rooms with the exception of rustic décor. Wonderful value.", 
    "We like the linen look in our dining room. I picked up some of the felt stickers for the bottom of the legs after reading reviews of the chairs wobbling. These chairs look classy and I think they are comfortable.", 
    "Very nice chairs easy to put together", 
    "Beautiful chair but a little hard to assemble.", 
    "Slightly concerned about the sturdiness of these chairs...will see how that goes. Other than that they look great", 
    "These chairs are beautiful and look more expensive than they are. Takes some time to put together but worth it. Everyone who has sat on these says they are very comfortable.", 
    "I was nervous to order online, these arrived on Tuesday and we assembled Wednesday. I'm in LOVE. They're a great color, exactly as shown on website.", 
    "For this price they are great. I knew I wasn't getting $*chairs - so if you accept that - they are a really nice deal. Also, Overstocked had great customer service. One out of 8 chairs was damaged and they got me a replacement right away.", 
    "great chair for money well built nice color", 
    "Chairs are sturdy, stylish, and a great price. Can't go wrong!", 
    "I purchased these chairs to work as accent chairs in my living room. They were pretty easy to assemble with my husband and look great. They are also very comfortable. I am satisfied with this product.", 
    "color is creamy beige. Looks white in photos online", 
    "Use at dining table with 2 benches at each end! Sturdy yet light weight & comfortable!", 
    "Have had these for several months, they really make my dining room look polished. Comfortable to sit in, and the lack of arms allows easily sliding on and off the chair. Very happy with My purchase!", 
    "Great chairs that are easy to put together. They aren't the sturdiest chairs we have but they work for our kitchen table. I believe these are now sold out as I couldn't replace one chair that came damaged", 
    "Nothing lined up when trying to put these chairs together. Order 8 sent all back!", 
    "very please with my purchase, do not go with the inspire q ones, these are much better quality. heavier and sturdier, yet same price.", 
    "Nice qualityComfortableVery good lookingSturdy Wish they came in more colors", 
    "These chairs are beautiful. Easy to put together. Great deal!", 
    "I purchased 4 during black Friday sale. Excellent chairs for such a great price. I am loving it. Except one of the small part was broken which wasn't a big deal.", 
    "I bought these to replace 4 dining chairs that were well used. Great color, easy to put togethere & very comfortable!", 
    "These chairs are beautiful. After assembled we found that the legs of the chair are slightly uneven but I love the way they look so I decided to keep them. Not the best quality but excellent style", 
    "Love, Love, Love! I bought a new dining set and didn't like the chairs that came with the set(especially at $325 a pop). They were too formal for me. plus the table I chose is a 48\" round dining that extends to 92\"... so I wanted something that looks less formal when it was closed to the smaller round size. I chose these parson linen chairs and my new set looks even better than it did on the showroom floor! I love the color, the fabric, the size, and the style! Not bad for the price. When my family and friends come...they comment on my chairs before my new set!! Very little time to assemble the back and the legs. A few were wobbly...but the direction do tell you to take outside on a hard surface and drop down to have hardware settle a bit. I sprayed them with a fabric protector....so hopefully spills are no problem. All in all I would highly recommend. They truly make my dining room! Wish I could post a picture....", 
    "We haven't used these chairs heavily yet, but they are gorgeous! We purchased the gray color and the fabric is really nice. Not too formal, like the velvet options. My husband had a tough time putting them together and balancing all four legs, but after some elbow grease and felt pads, the chairs are all balanced. Can't beat that price, but the lack of superior quality shows.", 
    "They look nice but wobble and were a horrific pain to put together", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Venetian-Dining-Chair-Set-of-2/8700657/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8700657/Christopher-Knight-Home-Venetian-Dining-Chair-Set-of-2-8d909898-04ce-4849-bd5b-5078022c0035_600.jpg"
  ], 
  "description": "Add beautiful elegance to your kitchen or dining room with these\nVenetian upholstered dining chairs. These upholstered dining chairs\nfeature a wooden frame for a sturdy construction and a fabric or\nvelvet blend seat. Multiple colors lets you easily match your\ncurrent decor. Welcome guests for a get-together with this pair of\ndining chairs. Includes: Two (2) dining chairsMaterial options: Velvet, fabric blend, woodColor options: Champagne velvet, light beige fabric or light\n  grey fabricSturdy constructionSome assembly requiredDimensions: 39.50 inches high x 20 inches wide x 27.75 inches\n  deepSeat dimensions: 19 inches high x 20 inches wide x 20 inches\n  deepWeight capacity: 250lbsStyleContemporary, Traditional, TransitionalMaterialPolyester Blend, Velvet, WoodFinishGrey FinishChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBeige, GreyFurniture PatternSolid"
}