{
  "name": "Christopher_Knight_Home_Crown_Fabric_Off-white_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 254.48", 
  "reviews": [
    "I purchased 3 sets of these chairs and love them. I haven't had them very long(2 months to the date of this post) but so far they are holding up fine. I am a 6' tall 225lbs male and my life partner is also 6' 212lbs and the chairs feel very sturdy and comfortable for us. The fabric is beautiful and the tufting looks great.", 
    "I'm so happy with these chairs. The color is great and just as described. The chairs look expensive and the fabric is great. I orders these chairs to go with a pottery barn table that the chairs I originally wanted from PB cost over $!@#$% for four chairs plus with tax ad shipped would have cost $!@#$#. These chairs from overstock for 1/2 the price look just as good or better. They shipped very fast (4 days) and putting them together was very simple. they look great in my kitchen and I would recommend them. The only down side that I found so far is that the legs are almost black and I was hoping for a dark brown, but it's a minor thing when the rest of the chairs are so beautiful.", 
    "Gorgeous chairs, sturdy and easy to put together and we have received so many compliments. They go with everything and all types of decor. Do not hesitate if you are considering buying!", 
    "I ordered 6 chairs, assembled the 1st 2 and loved them. Went to assemble the next 2 and they were a completely different color of fabric and the wood legs were not the same color as the 1st 2 chairs. I opened the 3rd box and had the same problem not matching. I called customer service and they sent 4 more chairs right away. They came and I assembled all 4 of these chairs(they all matched) but were slightly off color from the 1st 2 chairs. I eneded up sending all original 6 chairs back and prayed that the next 2 would match my other 4 chairs. I just got them today and they are still slightly lighter than the other 4 but I am going to make it work because I am tired of sending items back. Overall I love the chairs and am excited how they look in my dining room. Only gave it 4 stars because of all the hassle, but impressed that customer service handled it so quickly.", 
    "I searched high and low for tufted light colored chairs for my dining room vision. These were by far the least expensive ones that I could find (I bought 8), but that doesn't mean that they are cheap. In fact, they seem like a better quality than what I found for $300/ea at a major department store's furniture department. I'm extremely happy with these, and they fit my vision perfectly. They did take some time to put together, though not hard. The instructions, front legs, and hardware are all stored beneath the chair seat behind the Velcro flap. These do have a linen look and feel, so not a true off white, but definitely light linen. I'll be adding some nickel brad nail head trim but they would be just fine without. Can easily be dressed up or down depending on style preference and where they're used. Super happy with the product - super happy with the price!", 
    "Chairs look better in person then they do online. Very elegant looking and they go great with our dining room table. Make sure you scotch guard them because they are very light. Easy assembly.", 
    "Overall, fabulous buy for the quality and the price. Be aware that the legs are black and don't feel like solid wood. Some of the chairs are not completely even and rock a little bit but I am sure I can fix that with some tweeking. I do think it is a great product for the price. You can't beat the price...I tried!", 
    "These chairs are decent and solid, the only issue is that I ordered three sets (6 total) and three chairs ended up having one leg that was a good 1/2 inch off, so they wobbled. The good news is that Overstock replaced said bad chairs, they even offered to just send a new leg, but the legs were the same length, the issue was that the holes were drilled in different places. These chairs are a pain to put together so the thought of having to do it over and over again until you find the magical one chair in two that is constructed properly is annoying. Kudos to Overstock for offering to fix the issue pronto, but it's a lot of work. The only other alternative is to get a more expensive, less stylish looking chair (and these chairs do look GOOD). They look so good that I was going to have slip covers made but I don't want to cover them up. Would recommend to a friend with a warning.", 
    "These chairs are so awesome that I swore my husband to secrecy, not to tell anyone they came from Overstock. People will think we spent a fortune on them! Now I want to order more but they are out of stock---waiting for a backorder.", 
    "Very easy to assemble. Comfortable. Added a very high end look to our dining room! If I can talk my husband into knocking out a wall between the kitchen and dining room, I'll be buying more!", 
    "Purchased 3 sets (6 chairs total). One of the six chairs was so uneven that I had to request replacement parts from customer service. The replacement legs were uneven as well, so ended up determining that the unevenness was caused by the predrilled holes in the seat and not the legs. In any case, after a couple of rounds of replacement parts, had a set of 6 chairs that look beautiful and much more expensive than they actually are. I'm a little nervous for my heavier set visitors, but I'm sure (hoping) the manufacturer took a wide range of loads to determine capacity. Must say that while the process was a bit cumbersome, Overstock customer service was AMAZING!! Very accommodating and so polite, which goes a long way to help smooth out a not so ideal situation. Thanks a million Overstock Customer Service!!", 
    "These are great chairs. We had a farmhouse table made for and we were looking for the perfect chairs to go along with it. When found these, we had to have them. We initially ordered 3 sets, but came back and ordered an additonal set to put at the ends of the table.", 
    "I ordered 6 of these chairs, got here 4 days after ordering and they are absolutely gorgeous chairs. LOVE them! I have been looking around for upholstered dining chairs for months and was a little skeptical about ordering these offline but I am so glad I did! Very comfortable and the perfect height.They are perfect.", 
    "I purchased 2 sets of chairs about a month ago from Overstock. Compared to similar products from other sites/stores, these were by far the best deal. They shipped very quickly; I received them 2-3 days after I placed the order. These chairs are very comfortable and the color and style fit perfectly with my rustic/country dining room décor. I am extremely happy with my purchase!", 
    "I love these chairs, I spent days online looking for chairs and I couldn't have picked better chairs. Putting them together was easy (my husband says), they are this amazing linen color that fits any house, the legs are dark, perfect fit with the table (the brown/black one). They look like $500 chairs for sure. If you are looking for nice classic chairs look no further.", 
    "These chairs are the very reason I love Overstock. Great quality, affordable, and at my door in less than a week. Who could ask for more? If you are looking to add a touch of sophistication and class to your dining room, these chairs are a great option. The picture makes them appear white, but they are described as \"beige\" or \"natural\" I think. That is an accurate description.", 
    "It shipped super fast and arrived in two days!!! However, Fedex kind messed up the delivery played door tags with me for the whole week! I have to call them everyday to reschedule delivery, finally after a week I finally got the chairs. I have to say they are pretty good looking chair after assembling and good quality as well. The fabric looks very high end and beautifully and generously tufted. Very comfortable and sturdy as well. The only flaw I found is the manufacturer actually forgot to drill the hole all the way though the leg from the metal mount. Luckily I had a drill handy so I finish the drilling by myself. Therefore the assembling took a bit longer time and effort than I thought it would be. And also there's one hole for each chair is not properly aligned with the hole so the screw just doesn't go in then I had to leave one spot unscrewed but the whole chair is still pretty sturdy tho. Overall, it's a good buy considering the price comparing to Carrie Grey Polyester Side Chair (Set of 2) I also bought.", 
    "I need chairs that were the same height as my existing dining chairs. I'm using these as head chairs and they look good with the existing ones.", 
    "Ive gotten so many compliments on these chairs.For this price I was very happy with them in my dining room.", 
    "Nice chairs... They look elegant, however, not very comfortable. For the price they are great!", 
    "The two chairs nicely accentuate my other furniture. Although the actual color is a little darker (almost tan), I am happy with the chairs. Love it. I would buy more when I have a dining table. At the moment, I am using it as a desk chair and side chair.", 
    "I bought these as host chairs to go at either end of my industrial rustic dining table. I have to say I love the look. The tufted back, and soft linen look really help soften and warm the room. My husband put them together in less time than it took me to put together the shelves we bought, and didn't seem to have any issues. We've only been using them about a month, but so far they seem sturdy. For the price, I don't think I could have purchased a better set of chairs.", 
    "Bought these set of 2 for by Breakfast Nook. Loved the neutral color and high backs. I wasn't expecting a high quality based on the price but find these very nice and a great fit for what I was looking for. Easy to put together and came in great shape. Am considering purchasing another set.", 
    "Bought to replace chairs I had. Great quality. Very nice oatmeal color", 
    "Great price for such a sturdy, quality chair.", 
    "I was looking for a high end look without the high end price--thes chairs fit the bill. Love them", 
    "I am so pleased with these chairs. They are great quality and make my dining room look so sophisticated.", 
    "looks expensive and very well made.Only one thing, there were some mismatch screws but my husband could figure out by himself.Got so many compliments.", 
    "great chairs, easy to assemble and love the price", 
    "I absolutely love these chairs! Assembly was a snap, and they come well protected. Best product purchased on overstock to date!", 
    "These are stunning! bought for a desk chair comes in a set of two, my daughter liked so much she is taking extra for her room. Was extremely impressed with the packaging and how easy to assemble. Couldn't do any better for this price", 
    "Great chairs. Only downfall is assembling them. It took my husband a full evening.", 
    "Love the quality, they look beautiful but they are pinkish in color which is not my first choice however they look great otherwise so I am happy.", 
    "Loved the chair. Great quality for the price.", 
    "I love these chairs. They are sturdy and good looking, I expect they will last years. I will buy another set when I get a larger table. Very easy to put together and after years of use they are still sturdy and looking good.", 
    "Matched perfectly. Super comfortable too.", 
    "Looks great! Paired with heavy wooden table and chandelier for rustic, chic look.", 
    "My niece pulled chair up to table and the leg snapped. Poor construction and probably should have a disclaimer reading \" if you are more then 85lbs. do not sit\"", 
    "Sit firm and look expensive, Great chair for the price", 
    "I returned these chairs because I ended up finding other Christopher Knight chairs that had nailhead trim. If not for that, I would have kept these. They work with any decor and add a nice touch to the dining room.", 
    "Great quality. Would definitely order again", 
    "LOVE the style and quality if the chair, however I am returning because the color isn't what I was looking for. Another reviewwrite mentioned it would work well w cool colors, I need warm but I took the chance anyway. It definitely has cool inderyines. If that is what you are looking for, yiu will not be disappointed. It is a beautiful chair, it just didn't work for me.", 
    "I purchased 3 sets of these chairs for my formal dining room. The reason I gave it 4 instead of 5 stars is because it took me about two months to get chairs without damages. I first ordered 1 set to make sure they matched my dining table. Then they went out of stock for a few weeks.. When I finally got to place the order for the other 2 sets, one set had a damaged chair, and the other set was in the wrong fabric/color. So I had to wait for two replacements. If you are not in a rush, these are worth your patience as they are great looking for the price. Overstock of course has great customer service and will make sure you get your chairs without damages", 
    "If I was going to buy these chairs at a store like ******* ****, they would cost me triple. They are really nice and easy to assemble.", 
    "They came faster than I expected, and was easy to assemble! I get so many compliments with these chairs! I'm just in love!!!!", 
    "These chairs were exactly what I was looking for to go with my newly painted shabby chic dining room table. They are the perfect beige. I've looked around and some of the other chairs have too much yellow or brown in them. These chairs are truly off-white. The fabric is soft and the subtle arch on the back is charming. They were very easy to put together.", 
    "I had been looking for dining room chairs in this style for the longest time that I couldn't believe it when I set eyes on these Christopher Knight chairs. They look much more expensive than they are and I've received a number of compliments on them. They are sturdy and very comfortable. It was fairly easy to assemble; however, be careful when screwing the legs of the chair into the seat-- if you over tighten them you run the risk of wobbly/uneven legs. I ordered two sets of these (for a total of 4 chairs). It came in a HUGE box but was well packed and protected. One of the wooden legs in my order was split and broken. I can't begin to tell you how quickly and efficiently Overstock's customer service addressed this problem. Without missing a beat, they immediately re-shipped me the faulty part. Great experience overall.", 
    "I love these chairs, they look great in my eat in kitchen. Well made, easy to assemble.", 
    "I purchased these to be used at the ends of a table that we already owned. They instantly transformed the space. They are more beige than cream.", 
    "Great combination of style, quality and affordability. I purchased six of these for around our dining room table and they look super. They seem very sturdy and were a snap to put together (they key is to make sure there's no material in the holes first and follow the instructions perfectly.)", 
    "I have a beautiful, round dining table. These chairs are a perfect match.They are comfortable, also.", 
    "My chairs are beautiful and elegant! They were very simple to assemble and the pieces were excellently packaged.", 
    "Great purchase! The chairs were beautiful, I totally recommend them. There is only one inconvenience, on one char, one leg was shorter than the other. However; I called customer service and they're gonna send a new one. Awesome customer service!!!!", 
    "Just recieved my chairs and I could not be happier! I have been searching for a beige upholstered chair for quite some time but kept feeling like they were way over- priced and I wanted something with a higher back to it then most offer. These chairs are an excellent value considering you get a pair! First of all they were extremely easy to assemble (i did them myself in about 15min/chair) The color is perfect since I did not want something too light or too dark, so these are the perfect light beigey color I was looking for. They seem to be very well made and are definitely comfortable. I am using one for my desk in my home office and it looks great! Certainly brings the space together and adds the cozy touch I was looking for.", 
    "These chairs look beautiful, but assembling them was a nightmare, and a feat I couldn't have accomplished without my husband's strength & tools. Many of the legs simply did not fit in the base, and the chairs are all slightly lop-sided as a result. Fortunately we have them on carpet, so it goes unnoticed.", 
    "I love theses chairs. They are very comfortable. Easy to put together and look very elegant.", 
    "Love these chairs. Fabric is nice. Color is a beige. Look very elegant with tall backs and tufting. Will be ordering 2 more sets when in stock. Packaging was excellent. Shipping was quick. Assembly was easy and quick. Met all my expectations.", 
    "Great purchase! Like them so much I'm buying 2 more!", 
    "High end chairs at a reasonable price", 
    "I ordered these chairs. the front legs that I was suppose to install, the leg holes did not align with the the position of the pre-drilled holes. was disappointed after completing one successfully and the other one had a problem. I had to completely un-install the other one and send it back to overstock. It was out of stock at overstock so couldn't get a replacement sent out. Sort of very disappointed with the manufacturer for not checking product carefully before shipping it out. I thing the legs belonged to some other chair.", 
    "Love, love, love these chairs! They look fantastic and are even better than I thought they would be. They are very comfortable and have plenty of cushioning. The chairs don't wobble at all. They are extremely stylish, the colors were depicted very well.I would definitely recommend these chairs!", 
    "After searching high and low for nice quality chairs at a competitive price, I came across these on Overstock. I was looking for something to go with my farmhouse dining table that was nice looking but not too fancy. After reading all the great reviews, I decided to go for it and order them. I was not disappointed in the least! These chairs are beautiful and very sturdy. The fabric is an oatmeal color and the legs are a very dark brown stain, almost black. The backs are taller than the average chair which makes it look more upscale, especially the button tufting. The seats are wide and deep which makes it very comfortable to sit and enjoy family meals. I received my order within three days and they were packaged very well...even the packaging was on the high end. So just order these! You won't regret it!", 
    "These are beautiful chairs. I bought four and all but one was in perfect condition.", 
    "***** ***** look for much much less. As long as you follow instructions no problems with screw not lining up. There is a specific order to install chairs. Follow it and you will be fine. Chair legs are very dark fabric a very natural linen color. Very pleased with this purchase", 
    "These chairs are a great buy - and not too difficult to assemble, either. My husband and I put them together in under an hour. We ordered 3 sets, and I will say that 4 out of the 6 are wobbly when they sit on their own, but the minute you sit down in them they don't rock at all, so it doesn't bother us. They look great and we've received several compliments on them!", 
    "For the past two months I've been shopping for two chairs for our bedroom, to be comfortable to sit on not lounge in. They are an awesome value. Everything needed to put them together came with it. They look great, color was perfect. They can also be used as extra dining chairs when needed. I'm more than pleased, it was a great choice and a great buy!", 
    "we loved this chairs and we get complements on them! great quality, great cushions, and great fabric. I want more but don't know where to put them .", 
    "I have had these chairs for over two years and they are holding up well in my formal dining room. The quality of these chairs is good. I had some problems with one set having uneven legs but overstock sent me a new set that was perfect.", 
    "I had never take the time to write a review before, but I am so please with this purchase I wanted to let other customers to know that the quality of the chairs are absolutely great,they are very elegant, good fabric quality and very sturdy, the color is more toward the oatmeal side, great buy for the money!!!", 
    "Overstock did it again. Good quality chairs for a fair price. The color of the chairs look very similar to the online pic. Packaged well.", 
    "I ordered two chairs to put at the ends of my black rustic dining table. They were exactly what I was looking for. Shipped quickly and came packages well. I put them together by myself in about an hr. (And I'm a chic :)) they look amazing and way more expensive than what I paid. I would highly recommend these chairs. They are definitely a linen color which is what I was looking for.", 
    "I purchased six chairs. They are a great value and easy to put together and have a great look. I would definitely recommend these chairs to a friend. They are very comfortable", 
    "Shopped many places for dining chairs, including a consignment shop that I like very much. Nothing compared in price and quality to these from Overstock. They are truly beautiful and well constructed.", 
    "These chairs were exactly as described on overstock.com.The chairs shipped very fast and were in perfect condition", 
    "Love the chairs, very elegant looking, the only issue I have is that my husband could not get some of the chairs to be very stable (they are a little wobbly) but once you sit on them you can't tell. I would have given them an excellent rating if it weren't for this issue. They look beautiful and feel great.", 
    "Bought these chairs for my kitchen table. I was hesitant to buy since I have small children and worried about the stains. I sprayed with a fabric protector and haven't had any issues yet. The chairs are beautiful! Had an issue with one of the 6 chairs having a broken leg, but overstock quickly replaced the part.", 
    "The chairs are very easy to assemble and looks much more expensive than they actually were.The elegant finish and tufted back really brings the entire room an elegant look and feel.Very excited about this purchase and really a good deal!", 
    "Was delivered fast, seemed easy enough for my husband to put together. Had a few issues with the legs not being even causing it to wobble, but he followed the guide and now we have perfectly balanced chairs. The color matches the picture and all the chairs seem to match each other. They are a little more soft and bouncy than I would prefer, but I am pleased with everything overall.", 
    "I bought 4 chairs! Still have yet to put them together, but the look is amazing! I cannot wait to assemble them and see what they look like wiht our dining table! I might buy 2 more! Packaging was the best..as usual! Thanks Overstock!", 
    "The chairs only took a week to come in. They are perfect. I have seen the same chairs in different high end furniture stores but refused to pay the high price. I'm glad I waited. They go perfect with my French Country stye dining table. They look exactly like the picture. I was very pleased.", 
    "Beautiful chairs. Ordered 3 sets for dining room table and they look very expensive. Worth every dollar. Fast shipping. Linen material. Sister spilled coffee on one chair within first week and immediately I wiped it just with wet soapy rag and no stain!! Probably a good idea to spray with fabric protector though. Very good quality chairs. Comfy seating and great color.", 
    "Love these chairs! Bought 4 and then an additional 2. True natural linen color and dark wood legs. Ours are very sturdy and they are very comfortable which was surprising considering the price.", 
    "Shocked and how nice these were.. NICER than Poittery Barb.. easier to put together.. all around very nice.. get them. I got 6", 
    "Bought two sets of these chairs and am about to order a third to complete my table. I originally bought the table from Z Gallerie, but waited to buy chairs hoping to find a cheaper alternative. I read the reviews and felt confident in my order, you should too!", 
    "I love these chairs! I was a bit skeptical ordering the chairs online, but the chairs were well packaged and they match the decor in my home perfectly. As others mentioned, the chairs are more of a natural color, which was exactly what I was looking for. The only downfall is one of my chairs came with four of the wrong size scews. My husband and I went to Home Depot to replace them. I think it's helpful to have two people assembling, and carve out a little time for the process.", 
    "We needed several new dining chairs without breaking the bank. We paired eight of these chairs with a French style table from **** and they look great. They were easy to assemble, however, the hardware was scattered everywhere inside the shipping boxes. I can see where people reported missing hardware -- it probably fell out of a small crack in the box flaps. In all, we were short one entire set of hardware. I requested replacements parts online from Overstock, which we are still waiting for to arrive in the mail. The chairs are heavy ,and have a wide seat to make them comfortable. The upholstery is generally good quality and the tufting is evenly spaced. We only noticed one potentially objectionable problem on eight chairs -- small greasy spot on one chair (probably rubbed off from the uncontained hardware) -- but decided to keep it anyway.", 
    "The chairs are really nice. They are not off-white. Please have someone make sure the color matches as noted in your catalog. Was not difficult to put together.", 
    "Just what I was looking for. The price was great!...............................................................", 
    "Got these chairs for my dining room and liked them so much I ordered two more. Pretty easy to assemble and they look more expensive than they were. Great buy.", 
    "I'm always nervous when it comes to buying sometime that I can not see in person, but I have to say that I am extremely pleased with these chairs. They were simple to put together and look wonderful all together. I was nervous that the quality of the chairs weren't going to live up to my expectations, but I was wrong. I was lookng for chairs to go in a formal dinning room and these fit perfectly with the style I was going for. They were an excellent deal for the price. I would recommend them to anyone.", 
    "I've been hunting for this style of chair everywhere, and this is hands down the best deal there is. I purchased 4 sets of 2 (8 chairs total) and they arrived within a week of ordering. I assembled all eight myself and it took about two hours total (it would be much faster with more than one person assembling). It was definitely worth it -- these chairs feel sturdy and luxurious, and they look amazing around my dining room table. The color is definitely a \"natural\" or \"linen\" color, with just a touch of cooler tones so that it can work with browns or cool navy and grey.", 
    "I love the chairs-LOOK VERY CLASSY!! However, there is one issue-length of the chairs. It is not even on two of them. You can easily fix it by getting PRO felt circles or something like that to put under the chairs.", 
    "Chairs are beautiful. Been looking for the style and quality for months now and you can't beat the price. I'm such a picky person and was not sure about ordering online but I'm very happy with the product and my husband loves them.", 
    "I order 2 chairs and they made the look I was looking for at the ends of the table. Very well made. Love them.", 
    "Was nervous as I had to order 4 sets and my husband wasn't sue he would like. But these turned out amazingly well. They were a perfect compliment and the color is so neutral it fits into any decor", 
    "I am so pleased with these chairs. They add such elegance to the kitchen table. We mixed and matched these with some black wooden chairs and a black oval table. It's just beautiful together. Assembly wasn't too difficult, delivery was quick and they look SPECTACULAR. Not sure how long they will last, but for now they are perfect.", 
    "THESE CHAIRS ARE REALLY WELL MADE!! GORGEOUS MATERIAL!!", 
    "These dining chairs are beautiful. I absolutely love them. They add a touch of sophistication to my dining room. The look and quality are great!", 
    "I bought a total of 6 of these chairs, they arrived on time and were super easy to assemble. They are extremely comfortable and look great! I would definitely recommened them to anybody.", 
    "These chairs are beautiful. They are a shade darker in real life but they are still very neutral. Both chairs went together easily; one chair slightly wobbles when you touch it but once you sit on it, it stops. Very firm and very comfortable. We just ordered 4 more to complete the set.", 
    "I looked FOREVER for chairs that were affordable but nice. I went to every furniture site but they were just too expensive. I've always loved Overstock and the customer service is great. I actually ordered another set of chairs that I was looking at for a long time but when they came they were too small. So I finally found these. They're simple in color so they go with everything. But, they still have a somewhat elegant look to them. It took me absolutely no time to put them together and I'm not a handyman at all! Also there were two promotions going on so they were super cheap! Love them. Love Overstock.", 
    "These are wonderful chairs! They look amazing and are super comfortable. I was so happy they were actually comfortable. Didn't expect it for the price.", 
    "These chairs are as described and look much more high-end that the price would suggest. I had looked for several months for some reasonably priced dining chairs and these are perfect.", 
    "Beautiful chairs!! They are just as described. I bought 2 to see if they were as great as the the reviews stated and now they are out of stock!! Wish I would have bought 6 more. Now I have to wait! Don't pass these chairs up. Great quality and comfy!", 
    "We bought 2 sets of these to go with a gorgeous old farmhouse-style table we inherited from some relatives. They complete the dining room perfectly. The chairs are study and comfortable and were easy to assemble (just attaching the legs with the supplied hardware). We were missing some washers for one of the chairs and I contacted Overstock customer service and they sent us replacement parts quickly and for free. I would definitely recommend these chairs.", 
    "I love my chairs. i like the way they set and the color . the chair was not hard to put together.", 
    "Love, love these chairs. They look amazing in my dinning room I ended up ordering another set and get many many compliments! Very happy with my purchase", 
    "Love them!! I never write reviews but ordering on line you often have to go by reviews to make a decision. These are easy to assemble and you can beat the quality and design for the price! I read many reviews and looked on many sites and in stores before making my purchase.", 
    "These chairs are VERY nice. I made slouchy linen slipcovers for them but they look very nice on their own. Neutral and refined. Had bought another pair and the seats felt too thin and cheap. When I first sat in these they felt too hard and over stuffed/strung but since I have used them they have loosed up and felt really nice and solid. Ordered two and then two more- discarded the others I used after I got these. Feel like \"real\" not \"make do\" furniture.", 
    "I'm so glad I bought these when I did because they just went out of stock! I should have got 6 instead of 4 though. Now i'll have to wait for them to come back to get 2 more! I bought 2 sets and they arrived today, i put them all together by myself in under an hour. super easy to put together. I love the fabric, it's got great texture. I wouldn't call the color beige, its definitely lighter. Get color though. These are awesome. They are sturdy as well which is important when we have guests over. My husband is also 6'3\" so I needed chairs that weren't going to fall apart. If you like these but aren't sure about buying, BUY THEM. Definitely worth it. My home has a contemporary rustic charming feel, maybe a little eclectic too, i paired the chair with my XXXXXXX XXXX rustic farm table that has weathered wood and iron elements. They look amazing with the table. Love these. Hopefully they come back in stock soon so I can get 2 more.", 
    "We love the chairs-exactly what we were looking for. The screws for the legs were a hassle as they were not made correctly.", 
    "I love these chairs. I originally ordered them with plans to reupholster them in brighter colors, but the linen fabric that is on them now is very nice and durable, so I'm thinking I'll leave them like this for awhile. When I received the chairs, I put the first one together without any problems, but the second chair had issues - first, one of the metal pieces inside a bolt hole wasn't circular, so the bolt wouldn't screw into it at all. Then I noticed that one of the sides of one of the back legs was covered from top to bottom in glue. I called Overstock, requesting the replacement parts. Within a few days I received an entire new chair. (that one assembled without any problems) I love these chairs. They are sturdy, comfortable and elegant. I think eventually I will change the upholstery to something bright and fun, but for now they look fabulous as they are. I buy a lot from Overstock.com and I was not surprised at all at how quickly they handled my replacements. I recommend Overstock to everyone, all the time. They're fabulous!", 
    "These chairs are sturdy and substantial in size. I love them.", 
    "I love these chairs and use them often for deign clients and find that they are very versatile. Great look to any dining room or office space.", 
    "The chairs arrived quickly. They are a little darker than the picture but match my decor perfectly and are a good quality. They are assembled by attaching the seat and the back with 5 screws. One of the chairs could not be assembled because the holes for the screws did not line up with the holes on the back of the chair. I contacted Overstock and they sent another back for the chair which arrived in a little over a week. I was able to assemble the chair and am very happy with my purchase. Overstock's customer care department was very helpful and sent follow-up emails regarding the new piece.", 
    "I couldn't bring myself to buy chairs for $$$/each from the store where I bought my dining room table, but I still wanted chairs that were elegant and appropriate for entertaining. I loved the tufted backs, the crown detail, and the neutral color. The height of the chair and width of the seat nearly exactly matched the size of the chairs I considered buying for five times as much. The seat of the chair is nice and wide, and the cushion is thick, not at all cheap feeling. The espresso legs are very dark, nearly black. My only complaint with these chairs is that two of them were damaged/defective- one was wobbly and the other had splintered wood. Customer service was AMAZING. They reshipped me new chairs immediately (I got them in a few days), and returning the bad chairs was as easy as dropping the box off at the UPS store down the street. While it is annoying to have some defective product shipped to you, the response to fix them was so good I couldn't stay irritated for long. Plus, the condition of the other six chairs (and two replacement chairs) was great. I would definitely recommend these to anyone looking for a parson's chair with extra personality.", 
    "These chairs keep going out of stock because they are such a great deal. The quality is fantastic and they are quite comfortable. I ended up having to contact customer service because a couple of bolts wouldn't fit, but replacement parts were sent to me within a week for no cost. I would certainly recommend these chairs to anyone!", 
    "For once, I ordered something online, and it exceeded my expectations. I am so happy with these chairs. They look much more expensive than they were. The fabric on the chairs is a very sturdy linen, and they look perfect around our table. I originally just ordered 4, but I just ordered 2 more to have seating for 6 around the table. I am VERY pleased with this purchase.", 
    "These chairs are awesome! Beautiful!!!! Assembly was a bit difficult but, worth the effort. Quality is so much better than expected.", 
    "Though I had originally wanted the cream/ivory version of these (sold out), I was still pleased with these ones. My only complaint is that the holes don't all line up as cleanly and easily as they could. Still, a fantastic chair", 
    "I purchased four of these chairs for our informal dining area. I did a lot of research before buying these and ordered a number of other versions from other retailers before deciding on these. The others that I purchased at a similar price point don't even compare. The quality of these chairs is excellent. They are beautiful, sturdy, and look like they will last quite a long time. I plan to spray them with Scotch Guard just in case my toddler spills something on them, but for the price at least it won't break the bank to replace them if he does. I was really looking for something with nailhead trim but couldn't find a tufted back and nailhead trim at a decent price, so I purchased these and I plan to add the nailhead trim to the backs myself. Overall, i am very happy with my purchase.", 
    "I bought 2 chairs to see if I would like them, well I love them. They are so comfortable, sturdy and easy to put together. The fabric and the design; just gorgeous. I ordered 4 more to complete the set. Even better I got an email discount of 12% on my next order which made the chairs about $$$ each. What a steal!!!!!!", 
    "I ordered 8 dining chairs for my table as well as a console table from overstock. Every chair is in wonderful condition. The chairs are easy to assemble and are sturdy. I would recommend them to anyone and think they look even better in person.", 
    "We have a dining table that we got a great deal on but hated the chairs that were part of the set. Was a little leery buying them online without having seen them in person but am so glad that I did. The chairs are beautiful and look like the quality of chairs that are 3x the price. Material was great and construction was sturdy. Would definitely recommend!", 
    "I read reviews before purchasing these. I bought 6 of them. My table seats 8 and wanted these for my \"middle chairs\". After purchasing and before arrival I went to a large furniture store and purchased very expensive wingback chairs for my 2 \"end\" chairs. I was shocked when these arrived and matched the fabric of my $$$$ chairs almost exactly ! They are sturdy, comfortable and seem like they will last a very long time. Someone touched one of my chairs with chocolate fingers... and a simple ice cube rubbed over the spot took it right out. Yes, you have to assemble (it's not rocket science) and with 6 of them it took me a bit, but well worth it. Seriously.... you can't beat this price !", 
    "These chairs arrived in great condition. I was very impressed with how the back and seats were packed with individual drawstring covers to protect the light colored linen fabric. This is something you just don't see in furniture at this price point! The fabric and detailing are high quality linen, not linen look. They are an incredible buy at this price point, especially if you have looked at any of the popular home decor catalogs and see how other linen chairs are priced. Highly recommended. I am ordering another pair.", 
    "This was my first Overstock purchase! I was very excited to see everything come promptly, undamaged, and as described! The pair of chairs were a steal. The color is the same as the photos-- a light, light taupe linen. They were easy to assemble and the overall construction of them is very sturdy and the sewing: tufts and cording look good. Are they heirloom quality? no, but I added them to a 5 piece dining set to make 6 chairs and they work well as end chairs-- or I could've bought an entire set to update the look of my dining room for a very great price!", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Crown-Fabric-Off-white-Dining-Chairs-Set-of-2/6036756/product.html?recset=46972b2c-5cef-4292-a3c1-4a2b2738f603&refccid=QKLDIC7TSWG2ELKKAHAJ7FREUY&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6036756/Christopher-Knight-Home-Crown-Fabric-Off-white-Dining-Chairs-Set-of-2-a23b5e40-2703-47a8-8fa7-19005cadafab_600.jpg"
  ], 
  "description": "Add extra seating to your existing dining set with these elegant\nChristopher Knight Home dining chairs. With versatile off-white\nfabric, this pair of chairs features high backs with button tufting\nfor timeless sophistication. Sleek, espresso-finished legs add to\nthe chairs' good looks.Two dining chairs to supplement your existing dining\n  groupCrafted from hardwood for strengthEspresso finish and off-white linen upholstery provide an\n  elegant lookRequire assemblyMeasures 41.75\"H x 20.75\"W x 22.25\"DSeat measures 20\"H x 20.75\"W x 19.75\"DStyleContemporary, UrbanMaterialLinen, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorOff-WhiteFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleSolid"
}