{
  "name": "Christopher_Knight_Home_Darvis_Light_Beige_Fabric_Recliner_Club_Chair", 
  "price": "EUR 216.58", 
  "reviews": [
    "There weren't any reviews up when I ordered this chair, so I took a risk. I am so glad I did. I was looking everywhere for a modern, smaller, recliner that wouldn't break the bank! First of all, this recliner LOOKS AMAZING. It is modern, chic, and goes well with any decor, I think! Its a bit narrower than other recliners, which makes it wonderful for a smaller living area and yet, you get the comfort of a recliner! The seat part is long (think hip to knee when you sit) - so if you are sitting upright in it, a pillow behind you may be useful for good posture (if you are petite like me), but once you recline back, its no longer a worry. It has good head support/length on top. My feet don't dangle over the end (I'm 5'4\"), and it fully supports me. The springs seem very powerful, and I think it may take a bit of breaking-in the reclined position, but I'm a lighter person, so I think it is just me..... Oh, and Its comfortable, too. Not cushiony, just normal. And, when it is reclined, it feels super. I made a little throw pillow for back support and use it when I recline back, too under my neck, just for additional support, but I don't think you need it, I just like to do that sort of thing. I was pleasantly surprised at the quality of craftsmanship all around. However, the back flap has to be velcroed down underneath the chair, and it doesn't measure \"perfectly\" width-wise. I don't think it is noticeable, but its about a half-inch too long on both sides. Again, not an issue, and not noticeable since it is underneath, unless you are the one sealing the velcro. Overall, I love the chair, and for the price, it can NOT be beat! Don't hesitate, order this cool chair! All my neighbors come over and admire it and can't believe I got it on Overstock!!!", 
    "Love this chair, we bought two for our sun-room in desire of a \"beachy\" feel; they are perfect. I loved the fact they are not your typical \"bulky\" recliner, just the perfect sized chair even for my husband who is 6' 1\". Even though I marked \"somewhat soft\" for comfort, this is not negative by any means, the chairs are very comfortable, just different than something such as a plush couch. I absolutely recommend these chairs.", 
    "I was looking for a small chair to put in the corner of my bedroom to read or watch TV in. I didn't have a huge space but really wanted a recliner. This chair was perfect. Small but roomy and very comfortable. Looks very stylish and modern with my linen headboard and dark espresso furniture. I am so happy with my purchase. 2 of my friends have already purchased one for their homes. You will not be disappointed.", 
    "We needed a small chair for the home office, and this fits the bill perfectly. It's a classic style in a neutral light beige that will coordinate with any changes over the years. The chair is comfortable, especially when reclined. I find the back a bit too slanted back just for sitting without the reclining mechanism up, but I plan on adding a colorful pillow and I think that will take care of that. It's a firm chair, which I like, but if you want squooshy, this is not it. It's small; not for a big person, but perfect for the small space in which we placed it. When delivered, all we had to do was screw on the feet and slide the back down onto the metal slats. It comes with some plastic disks you can add if it needs to be balanced, but we had no such problem. I would consider purchasing a Christopher Knight product again.", 
    "I have been searching long and wide for a recliner that was compact enough to fit my small space of a living room. A piece that was also big enough for me(I'm 5 9\") and Let me tell you I have found it. Its not bulky at all. the style is very sleek and the fabric can pass for a linen fabric. the only thing l (and I seen the sane complaint in other reviews) is that the Velcro part in the bottom of the chair which is to far away from the velcro on the flap, they don't meet at all. So what I did was buy some velcro strip with glue already in the back of it and stuck it on the base of the recliner closer to which the velcro on the flap can reach. that only took 2 seconds to do. Other than that this product is great people love it . When I recline totally back I grab a throw pillow and wedge it between my lower back and the recliner and I'm in heaven.", 
    "We were looking for attractive chairs for our smaller living room. We were torn between getting something pretty or something that was comfy. When I found these, which were recliners that didn't look that recliners, I was sold. I was fearful they wouldn't be comfortable, but boy, are they! They were easy to put together and look great. My only complaint is that whatever cushioning they used in the back is noisy when you get up after sitting in it. Hoping that will subside over time as it gets broken in more.", 
    "Terrible odor at first, but it went away in a few days. The legs were not included, but OS sent them right away after I called. I love the look, but it is not a good TV watching chair. Needs more cushion.", 
    "This is a very nice recliner for a small space. It is a good value for the quality. Be careful when you screw in the legs. There are staples in the bottom that may damage the legs, so feel for the staples before you screw the legs on. Quick delivery.", 
    "I received the chair in the middle of February, 4 months later my son comes to visit and sit in the chair and the brace under the chair came un-stapled. The right side of the chair unattached from the main body of the chair. I purchased a 5 year warranty, called overstock explained they gave me a number of a different company that covers warranties. I called them after much research I was told they don't cover furniture and I must call ANOTHER company! That company is only open during the week. So one awful chair and TERRIBLE CUSTOMER SERVICE. I AM VERY UPSET!", 
    "When this chair arrives, have a scissor handy to cut away all of the loose threads hanging off of it everywhere. After about 20 minutes of that, you'll have a pretty nice looking chair. The build quality is fair at best, and it will surely break within a few years. That said, I found a coupon code and got this for like $175 delivered. It looks pretty good, works well, was easy to assemble, and provides a nice place to sit.As long as your expectations are in line with the price you are paying, this chair ain't bad for the money.", 
    "Great little recliner. Defies its function just to look at it you wouldn't know it reclines. Lays almost flat although a bit stiff, but that's OK. For the price you won't be disappointed if you are looking for a small space.", 
    "This chair is perfect for what I wanted it for - smaller space. It was easy to assemble, seems very sturdy, color is as described and reclines nicely. Small children cannot seem to keep it completely reclined, however, because it depends on the weight of the person to keep it down. Still comfortable for taller people, though, considering its shorter length. Very stylish. I do plan to scotch guard as it is light colored and I have kids. Looks nice along side a dark leather sofa.", 
    "Looked great but starting having issues after a month. became very wobbly and hard to recline. Love the style and the fabric but very disappointed with the quality", 
    "So I love the look fo these chairs. I love the clean lines, and no one ever thinks it's a recliner. However, you get what you pay for. I couldn't believe the price. Now I see why. The legs on the chairs never screw tight enough and constantly are rotating- they won't stay straight. I have 2 chairs- so this is not the case of a defective chair. The lines of the seams are not straight. I had to cut away some loose threads. And after some time (I bought these about 7 months ago), I could see where the arms are getting \"wider.\" It's almost like they are seperating from the seat and back of the chairs. The cushions look flatter already. What's more, these chairs don't get much use. They still look pretty good, but being that I remember how they looked brandnew, I'm kind of dissapointed in the rapid decline. I bet I will have to buy new chairs w/in the next few years. For the price, it might be worth the 3-4 year use.", 
    "Purchased this chair recently and have to say that I am pleased with the value of it. Although it is smaller than I would prefer, the quality of the product for the price that we paid was excellent. It was super simple to put together and we have had numerous positive comments from friends and family on it. I would say the only concern anyone should have is whether it will work for a taller person. I am only 5'11\" and my legs hang way over the leg rest portion of the chair. Otherwise it is a very comfortable chair and I would recommend it to anyone.", 
    "Size and color are good - great price! Very happy with our purchase looks good and 4 months later are holding up well! I used scotch guard and with two dogs and two sons they are looking good still!", 
    "We ordered one, we loved it, very easy to put together. We ordered another one. Very happy with our purchase", 
    "Love these chairs for the price!!!!! Exactly as described and as previously reviewed by others!!!! Many compliments so far!!!!", 
    "Good quality chair , perfect for my guest room , very comfortable . The previous reviewer recomended it and I went with it. Very Happy with the purchase.", 
    "I've had the chair for a month now and love it. It's exactly like pictured, it arrived within two weeks, assembly extremely simple. I know it will sound like a joke, but the hardest part was getting it out of the box. I didn't want to rip the box in case I wanted to return it and it fit so snugly in the box that I could not get it out. After attempting to lift it out, then \"shake\" it out, I gave up and ripped the box. The whole base/arms of the chair is one piece, the back another, with the four legs in a bag. You simply screw the legs on, then take the back piece and slide it down some metal grooves into the reclining assembly. That's it, no tools required. The chair is small and fits almost anywhere and is comfortable. I've spent hours in it with no problem.", 
    "This recliner is short in height and long in the seat it looks a little awkward and not stylish, as I had hoped. The color is accurate to the picture. The fabric seems to be thin and the seams on the arms are not straight. I will be moving it to the basement rather then returning it.", 
    "I just absolutely love, love, love these chairs. I bought two for my bedroom. They look absolutely charming. I had an old fashion oversized recliner which I couldn't stand it belonged to my husband when I redid my bedroom I told him it had to go, he was adamant about letting go his throne. But I told him I would get him another chair. I bought two and they are perfect. They don't take much space and are just comfortable enough to fall asleep in. They are perfect for the space and the price. KA-CHING!!!", 
    "I wanted two small chairs to complement our new couch. I had looked around several places but didn't want to spend *** on each chair, knowing they wouldn't be used as frequently as the couch. I found these on overstock and they passed the husband test, so I took a chance and ordered them. At the time, there weren't many reviews and I had never purchased from overstock. I was pleased with the free shipping and only purchased one initially to be sure I wouldn't be disappointed. Immediately after it arrived and was together, we ordered the second. The color is nice, the fabric is soft. While the quality is not something I expect to last forever, it certainly meets our needs and has held up perfectly the last couple months. I feel that the chair itself is sturdy but when sitting and put pressure on the arm sides outward there is noticeable \"give\". Again, it's a great quality for the price and I expect them to work well for our needs for years to come. With the second chair I received, there were two holes in the fabric of the chair back. A quick email to customer service quickly resolved this problem and a new chair back was at my door very quickly. I am very pleased with this product and overstock.com, especially their prompt customer service. Also, while this chair is certainly a small recliner, my husband is 5'10\" and relaxes quite comfortably in it. :)", 
    "I searched high and low for a great quality chair to fit the space we have in our living room... this chair was absolutely perfect. A lot of the reviews were mixed, so I had my hesitations buying this, but considering it was priced under $$$, I figured it was worth taking the chance. I am so glad I did! This chair is great- fabric feels expensive, the chair is comfortable (this was my fiancé's #1 priority with the chair), and it looks great with our leather sofa. My only gripe is that it reclines to one position... I wish there were more options- but definitely not a deal breaker.", 
    "Very small size. The length of the seat is way too long so I purchased a large pillow to put behind my back. Difficult to buy when you can't try it out ahead of time.", 
    "Pros: I ordered this chair because I wanted a recliner that looked like a \"regular\" chair and it just that. I like the wooden feet and its compact size. The color is as pictured. Comfy chair but I did add a small lumbar pillow for decorative and comfort purposes.Cons: The back of the chair has a fabric flap that hangs down when the chair is reclined but that flap of fabric is not cut clean and has a stretched-out look. This was since day one so its better if the back of the chair is not visible. I sprayed scotch-guard but the fabric got dingy quick so I am constantly cleaned it. The seat us supposed to have 2 recline setting (leaned back/feet up, more leaned/almost laying down). It never stays on the 2nd setting bc there is no locking mechanism so we never use that setting. The foam is the seat eventually settles so the fabric moves around a bit so I have to straighten it out. After 6 months of the wooden feet cracked (visible) but still usable. The arms are not as intact as they used to be.Overall a good buy if you want something economical but definitely not something that I would say looks high end and for any super particular people, you will be bugged by the items I mentioned above. We purchased 2 of these used side by side and the defects affected both chairs.", 
    "I bought two of these chairs about a year ago. For the price, I was really impressed and had a number of friends compliment the chairs over the last year. So, until a few nights ago I would have rated these at 4 or 5 stars. A friend was sitting on the chair when suddenly there was a big pop. A wood panel supporting the frame had broken on one side and the chair collapsed slightly into itself. Will see what I can do to fix it, but definitely was disappointed to see the chair break after light use over the course of a year. Was hoping for a lot more time out of these and I'm left now with one functional chair.", 
    "...but I wish there was a way to tighten the mechanism up after a recent move. It feels a little \"wobbly\" now. I'm surmising that's because it was moved about carelessly, though. Other than that, I love these chairs (I purchased two of them). They are a bit difficult to put in the \"recline\" position at first, but once you've mastered that trick - you must push back using your lower back and arms - it is great. All in all, they look great, clean and not fussy. A a wonderful value!", 
    "It was the perfect size for what I needed. It was comfortable with a pillow behind my back but then the left side separated from the chair. I tried to go through the insurance and that was a joke. I got my money back on that. By the time the insurance told me they couldn't help me it was past the 90 day warranty I fought and overstock finally took it back and credited my account. It looks good but if you want to use it it may break.", 
    "I bought this recliner for my husband, who is not a very tall or heavy man at all, and within a couple months of us it started to completely fall apart. The front supporting bar broke in the middle, causing the whole front of the chair to sag like a frowny face. One of the supports underneath broke as well, making it almost impossible to recline. The springs and are located in such a way that they catch the foam cushions from underneath, resulting in piles of baby blue foam appearing under the chair regularly. This was all with him just sitting in the chair a couple hours a night! I know the chair was inexpensive but the quality is still far less than I paid for.", 
    "We love how these look. They are very classic looking. But they are not comfortable in the regular sitting up position or the recline situation. My husband is 5'6\" and his head sticks off the top when in recline position. The angle in the upright position is really extreme. In order to sit back in the chair you have to lean back in a very awkward position that is not normal for normal lounging. It makes your back in a very strange position . The seat base is uncomfortable long as well. I'm sad that these are not going to work out.", 
    "We purchased two of these chairs at the end of summer and were excited to buy something of quality. They were sleek, functional and were supposed to be well made. For the first time in a while, we were finally getting our family room updated with quality furniture. After less than 6 months and very minimal use, as these were accents to our couch, I sat down and the chair just completely collapsed. I am a 5'11'' Male under 200 pounds so weight should not be a factor. I was very disappointed when we called to ask for replacements and they slapped us with a generic warranty that covered nothing. Overstock was kind enough to credit our account partially. Overall this was a terrible experience and I would recommend you buy furniture from a known manufacturer instead of a dried up actor slapping his name on something.", 
    "The craftsmanship on this product is sub-par at best. The pictures looked great but once the chairs were assembled, it was obvious they weren't meant to hold up to regular use. On one of the chairs we received, the velcro on the back was not sewn in properly. And the padding on the second chair was not smooth, gave almost a \"cellulite\" type appearance. In addition, the overall stitching could've been better on both chairs. We really wanted to like these chairs, particularly after reading the positive reviews, but in the end we ended up returning them. I will admit though, the Overstock customer service group was awesome! They were courteous and very helpful. Overstock even covered the cost of shipping the chairs back (apparently they do this when it's your first return). We will definitely continue buying from Overstock, but will think twice when it comes to furniture purchases.", 
    "Love this chair, color was very accurate. Reclines well, and I have had no issues.", 
    "I bought the beige chair for my small bedroom. I like to sit up and watch tv and it is the perfect size for a small room.", 
    "Cute little recliner! Placed it in my guest room not too big not too small just prefect!! Very comfy and for the price you cant go wrong!!", 
    "I decided to trust other reviewers when buying these chairs, as we all know furniture online can be iffy... I am absolutely thrilled with these chairs. They are a lower-profile, smaller scale chair for sure. I am a 5'4 female and not large and I \"fill up\" the chair. This isn't a chair you are going to snuggle down in, but if you know that and you need them for occasional sitting/guest seating, they are fabulous. They look more expensive than they are. The reviewers complaining about the arms feeling flimsy/the chair not being sturdy must be really hard on their furniture. If I pay less than *** for a chair, I don't think I'm buying the Rock of Gibraltar. You always get what you pay for. But I believe these chairs are on par with comparable chairs in furniture stores that they are selling for close to *** I find the chair to be comfortable, as I know the seat cushion will break in the more it is used. They compliment a modern/classic decor just perfectly. I got them out of the boxes and assembled in about 20 minutes, very simple.", 
    "We have placed this chair in our master bedroom. It would not work as a chair that would see a lot of use (i.e. in a living room) for us for two reasons: 1. It's too firm 2. It's too small for us to recline comfortably in (we are 6'00\" and 6'02\"). But...it's a very attractive chair that we have sat in to read or relax and watch TV in our bedroom. For the price, I think it is a terrific value and it is lovely...I just wish it fit us tall people a little better.", 
    "Yes I will recommend this chair. It fits nicely into a small space and is comfortable at every position. However, I'm 5' 11\"\" and I can sit back with my feet on the floor but my fie is 5' 3\" and she can not sit upright with her feet on the floor. Meaning that the depth of the chair in the upright position is too deep for shorter people. She must put a pillow behind her to sit up right and have her feet on the ground. Otherwise its a great product, delivered on time, right color and right price.", 
    "Just what I was looking for. Crisp, clean straight lines. Very classy and comfortable. Very easy to assemble.", 
    "The recliner was more comfortable than expected. I was looking for a recliner that really didn't look like a recliner for my friend's new home. This one was an excellent value and the fabric was a perfect neutral color. He is very happy with the look and the comfort level. I will definately purchase this again.", 
    "My sister lives on the Georga Coast so her home is decorated \"coastal\". I purchased this as a housewarming gift for her and she absolutely loves it. She said it looks like a club chair but is very simple to recline. The size is perfect for her and she's very happy with the quality. She didn't realize she wanted something like this until she sat in it. It's definately not the \"grandpa recliner\" from years past. Thanks for such a bargain.", 
    "I LOOOOOOOOOVE this chair!! It is so danty and feminine. Perfect for a female. The fabric and color are AMAZING, too! Putting together took my grandpa about 5 minutes. REAL easy. There is a funny smell to the chair once removed from the box (a cardboard box smell), but nothing a little Febreze couldn't fix! This is absolutely what I wanted!! ZERO DISAPPOINTMENT from this girl!", 
    "I love it! I opened the box & the chair was very simple; the legs and the back was very simple to pull it down. It took about 5 minutes to do the assemble.", 
    "Great chair. Perfect size for the space I needed it. The color is a little light, so you need to be careful with the foot rest and chair, but my kids did get a couple of stains on the chair and I was able to wipe clean with a damp cloth.", 
    "I am very satisfied with the quality of the chair, The construction seems solid and the material seems really well made. It sits in my home office in the corner so it doesn't get a lot of use but it's comfortable and seems to hold up. I would definitely recommend this product", 
    "This chair/ recliner looks amazing in my small living room in my beach condo. The color is perfect for the soft hues of blues & greens that I have chosen for my coastal decor. It's very elegant and versatile and I love it. It was very easy to assemble. In the few short weeks that I have this chair I have obtained many compliments.", 
    "perfect fit for what i wanted", 
    "Looks beautiful, color and texture of the chair is nice. An inch-2 deeper than I would have liked but comfortable when in the reclined position. The seats are firm yet comfortable. This is not a super squishy chair but not hard as a rock either. I would have given this chair 5 stars except that when it arrived the brakets to slide in the back piece were screwed in up side down so I was not able to attach the back right away. I had to undo it myself and luckily did not cause any damage to to the chair. I was able to attach the back of the chair after doing this.... I contacted customer service last week and they were suppose to send me a new back piece in case this one becomes loose ( I still have not received it). Besides the weird manufacturing defect (which I am glad I could fix on my own) the chair is great. I am ordering another one for my living room. Oh and my husband thinks the chair is too narrow but I think it looks elegant for a recliner without taking up too much room.", 
    "great chair for the price. a little small but perfect for where I needed it.", 
    "For the price, it got the job done. It's attractive but there's not much cushioning. Very cheaply made & on the smalish scale. Even so, I got what I wanted & I'd buy it again.", 
    "Love this chair! Looks great very comfortable!", 
    "wow, I've never written a review before - but we ordered 2 of these chairs and they are just beautiful. Well made and beautiful fabric as well", 
    "Nice color, and fits good in my bedroom. Material is a nice quality.", 
    "Elegant for a recliner yet extremely comfortable. clean lines / beautiful fabric", 
    "I simply love this chair! It looks nice in my family room and I love to set and watch TV in. The color was just as I wanted! Nice and comfy!!!", 
    "Used as a small recliner for our living room. Nice, comfy, and very durable. Highly recommended!", 
    "Great small recliner. Fits in the space for which it was intended. The fabric is nice, true to color and chair is quite comfortable. Be aware that this chair is very small, I have it in a reading nook and it is great, but a larger space (or person) might overwhelm the chair.", 
    "Perfect for studio apartment.", 
    "I have searched for a chair like this one for an entire month. And after reading the reviews, I was sold. I am SO happy I choose this chair. It's great quality and perfectly comfortable! Not to hard and not to soft. I highly recommend this chair!", 
    "We ended up sending back this product.", 
    "Great chair for the price.", 
    "Small chair but the back is high enough to rest head. Probably wouldn't take a lot of overuse but it's been perfect for us.", 
    "Comfortable chair. Little too much angle on back when not reclined. Add a small pillow at lumbar solves that. When reclined, move pillow to under neck and perfect. Box had a hole in it about the size of a baseball when delivered. Something had crushed the side panel of the chair but it is not noticeable unless you press on the Side of chair. Fabric wasn't damaged. Suggest they put an extra piece of cardboard in box on both side to protect side panels.", 
    "it reclines and is nice to relax", 
    "Great chair, holds-up well. We've had for a year now. Wouldn't recommend for anyone near 6' or taller. It's a shorter chair, but VERY comfy for my 5\"10 hubby.", 
    "Color was a bit different than what I imagined it to be based on the pic but that is more on me I guess. The chair itself is comfy and extremely easy to put together", 
    "We bought this for our daughter's nursery and it turned out to be the perfect purchase! A nice sleek size and the reclining feature works great. I would highly recommend it, especially for the price!", 
    "This chair was INCREDIBLY easy to assemble. You just screw on the legs and pop the back on. It's a very low profile recliner, so it's perfect for people who don't have the space for a giant La-Z-Boy. I love it!", 
    "I wanted a smaller recliner that was not big and chunky looking. This looks like a nice chair in your living room but reclines nicely. I am 5'9\" and find it a good fit", 
    "This chair is everything they said it would be. It came packaged with care. I put it together in less than 30 minutes. Very easy. It is quite comfortable. Very happy with my purchase.", 
    "I wanted 2 small, nice looking chairs for my bedroom. My husband had one large recliner but it was annoying when we both wanted to sit and watch TV in there. These two chairs were the best of both worlds! They are small, very modern looking, comfortable, and can recline. Definitely would recommend.", 
    "Very comfortable, easy assembly all around great chair", 
    "Very nice build quality and nice fabric cloth. but the back resting is too short. i am 5' 8\" and my head hangs without no support. being it a recliner it should also support ur head.", 
    "Nice small chair but not very sturdy", 
    "I've had this for 9 more to a year. Works very nicely. A little cheap looking but not terrible. It's nice and small for a small apartment. Great price. No complaints and no regrets.", 
    "Bought 2 of these chairs for a guest room sitting area. They will work perfectly there. They are super firm. I wouldn't choose this for an everyday all day chair. I like sitting in them in the recline position (I'm 5'6\") however my 6'1\" husband did not enjoy the experience. Well made for the price, reclines easily, serves its purpose for the price.", 
    "Glad we purchased this little boy. Comfortable for a small sunroom. Would recommend as occasional use.", 
    "It's a great little re liner for the price. It's very narrow someone who's obese or a man over 250lbs it's not suitable for. But if you have a small room it works well but if you have a large room this little recliner will throw the room off. But other than that it's a very basic recline but it goes well with my decor.", 
    "Works well in our living room :)", 
    "This chair is super comfy. It has a deep seat. If you're long in th thigh here is the chair for you! Sturdy structure, wonderful fabric. My only improvement would be an easier recline action.", 
    "Wonderful recline chair, reviews were all correct, so comfy n easily use, only wish the arms were not so thin...", 
    "I have a short torso and short legs being only 5' tall so the seat is uncomfortable for me. I have to put a pillow in the back so my legs won't stick straight out from the chair. It is also difficult to recline since you have to use arm muscle. This chair looks nice but is not for wimps. I am 79 yrs. old and don't have a lot of strength to recline.", 
    "I came across this while searching for an accent chair for a nook. I didn't want to spend a lot, but was also nervous because I wasn't spending a lot. This chair is wonderful. It's comfortable, nicely made and the perfect size (it's a smaller-sized recliner). The price was the icing on the cake. Money well spent.", 
    "Nice and easy. Like the fact is not too big and jumbo. Just right in the standard room size.", 
    "We have been very pleased with the style and quality of this chair. Arrived in great condition.", 
    "If you want a recliner but you have minimal space this is the one for you. I love it. It probably can't take a lot of abuse but I'm gentle with my items", 
    "Was very easy to assemble, fits nicely into a small apce in the corner of my living room. Looks good. The only thing I don't like is that it is hard to push back. It's as if it needs to be broken in. I would be happier if it was looser on the push back.", 
    "I've had this chair for over two years. You can't tell that it's a recliner by looking at it, and it has held up great for the last two years. A perfect fit for someone looking for a recliner that doesn't look like a huge recliner.", 
    "This is a nice chair for someone without kids. The chair looks nice, but the quality is fair. I scotch guarded it immediately due to the color, but there wasn't much I could do about the sturdiness of the chair. For the price it is a good chair.", 
    "It is the perfect color and size for my smallish condo living room. The color is very light (not very kid friendly). It's kind of long. When you sit up straight with your back touching, my feet don't touch the floor. (I'm 5'4\") I fixed that by adding a decorative pillow. It's compact. It's nice....you really don't know it's a recliner until you use it. It's a nice addition to my two piece sofa set. Love it!!!", 
    "Excellent value and quality", 
    "Quality is alright. Not for everyday use. I have it in my office and don't use it much. Needs to be a bit bigger for real comfort. The linen material is touchy and not for family use.", 
    "I bought this as a small accent chair for a little corner in my kitchen. Did not expect my husband to really enjoy it or spend much time in it. However, I rarely get a chance to use it as my husband has definitely claimed the spot as his! Chair is sturdy and works well. The reclining mechanism definitely needs some use before it will work smoothly and easily. I actually couldn't get it reclined at all after we first bought it. Within a few days of use, it became much easier to recliner.", 
    "Comfortable,nice look,compact recliner.", 
    "The bedrooms in my home are relatively small, so I was looking for a recliner that was comfortable, but compact. This chair has worked perfectly in my limited space. The scale of this recliner is more in line with a woman's size. The fabric, while a good neutral, could be upgraded in quality. Overall, I am very satisfied with this purchase.", 
    "This is an awesome chair to begin with for the price. Add the fact that it feels sturdy and its a recliner as well and you have an excellent chair. Would have given it 5 stars but one of the chairs in the pair I bought had a faulty back. Not sure if it wasn't assembled correctly or a manufacturer defect. Called Overstock and they shipped me a new one. Excellent customer service as always", 
    "We love this recliner! Extremely pleased with quality and we purchased two. Easy to assemble. We say great deal.", 
    "I bought this chair for my moms room. She likes it so much I can barely get her out of it.", 
    "nice recliner, put two in kitchen/dining area for morning coffee. Would give 5 stars if they didn't slightly wobble", 
    "Great for small area. Material looks great. A little stiff but is cozy.", 
    "Comfortable and even rave reviews from my 6'2 husband when he extends leg support. Upholstery has a lovely linen look. Feels and looks like a really expensive chair.", 
    "We love it. If you are over 6foot this may not be the chair for you.", 
    "Great product ... easy to assemble .... very comfortable would recommend to a friend.", 
    "Very easy to put together very comfortable I'm very happy with my chair", 
    "The length of seat from front to back is a lot longer than my body comfortably prefers. Note, my legs are short. I am just a little over 5 ft and no extra height is gained from my legs, to be sure. In order to be comfortable I have to add a pillow or two behind my back. Seat wise, however, the seat is comfortable to sit on. I do like the style and color. The length of the seat is my only complaint. The rest I love.", 
    "Good small recliner. However, the seat is way too deep. You have to add a pillow for the back. Looks awkward also.", 
    "I love this chair. It is small so it fits me just right. Its a little hard to get back in the reclining position you have to push on the arms with your feet but it is beautiful and durable I have had mine for over 2 years and it loooks like new", 
    "It's definitely not overstuffed. It went together easily, it's comfortable and looks great.", 
    "My very first purchase from Overstock and I bought two! They were perfect! Just as they were described. Easy to put together. No tools...Screw on the 4 legs and slide one piece (back) into the other piece (seat part of chair). It locks into place.", 
    "For the price it's ok , it's comfortable enough , however it is very difficult to push back to recline , I'm 5'6\" and I have a hard time , I bought it for my mom and she cannot recline , would never get one without the handle on the side again", 
    "Very small, back cover at bottom doesnt line up", 
    "Bought 2 of these a year ago for a small turret room that is not used very often. Wanted small (ck) Nuetral Fabric (ck). Inexpensive (ck ck). Didn't have to be great quality as it would only be used on occasion, so what could go wrong? They both are wobbly, fabric pilled very quickly and though the cost was Low quality Was not worth the price! Glad I waited 11 months to write this review!!!", 
    "fabric recliner club chair is very comfortable and well make love my fabric recliner club chair", 
    "This chair is fairly comfortable for a small recliner. A great space-saving option.", 
    "I looked far and wide for a recliner that didn't scream \"recliner\" to replace an old, outdated one in my living room. I figured for as low of a price as this one was that the risk was low, and the great reviews certainly made me confident it would be a good purchase. It most certainly was. It's not huge, it was easy to put together, it's got a great modern look, and it's incredibly comfortable. My 6'2 husband is just as happy with it as well. Highly recommend it!!", 
    "Small scale recliner. Great because it has a very modern feel.", 
    "We needed a small chair for a corner of our living room that can recline but not look like the man cave recliner! Great looking but not the sturdiest! For my husband and I it's fine for now and not a huge investment.", 
    "Perfect for what I was looking for. Needed a small chair for my bedroom and this is perfect. No problems so far. It is small and probably not meant for every day heavy use. Looks great. Serves my purpose.", 
    "I ordered two of these chairs for my master bedroom after looking for months for comfortable chairs at a price I could afford. I took a chance and ordered these based on good reviews and the price was awesome! Well I am pleasantly surprised at the comfort and they are nice and small to fit in the bedroom. They look much more expensive and the fabric is quite fashionable. So happy I took the chance!", 
    "Not easy to recline and back.", 
    "These chairs are great-looking. They provide a modern look, and midgrade fabric. This is a great price point for someone who is looking to purchase additional pieces to a room. I will admit, that they are a little stiff. I am hoping this goes away with time.", 
    "Perfect. I didn't want an oversize recliner. I wanted something small and this is absolutely perfect and it was very easy to put together.", 
    "Good looking, comfortable and the price was right. Couldn't ask for more", 
    "Love love love it!! Perfect size, perfect price", 
    "I was looking for some small and inexpensive for my loft area and this is perfect. My husband wanted a recliner but I can't stand those big bulky 'manly' ones. This satisfied us both. Very easy to assemble. Shipped quickly. For the money, I think it's a great and well made item.", 
    "Everything the image and description mentioned.", 
    "I almost gave this chair 4 stars, but it really works for us. Please don't go into it thinking this is a large chair...because it's not. For the price this is a very nice recliner. And it has a very nice modern look.", 
    "We love them! They are comfy and durable", 
    "we use them every day and they are very durable. They are narrow but we like that. We have a dog that also jumps on it most days and it has held up for over a year. Good buy!", 
    "just my size and its was easy to put to gether", 
    "I needed a small recliner and this one fit the bill perfectly!", 
    "This is a comfortable chair but the cushion at the bottom of the seat is not sturdy and needs more cushion on support. I always feel like I am sliding out of the chair, so I put a pillow under my knees. Fix that problem and it would be a great chair. The price is perfect though!", 
    "We love these small recliners! We were looking for something for our front bay window area and bought two of these and love them. They are comfy, but small enough to look unassuming, unlike most recliners.", 
    "I ordered 2 chairs for our small NYC apartment. We needed to renovate and make space and these seem to fit because they were 26.5\" wide. We wanted to add an end table in between and really didn't have much wall space. What I love about it, they look expensive and they are VERY firm. DO NOT KNOW how long that will last and hope it will last at least 5 years. Because chairs always are firm in the beginning, but with time can sink. I gave it 1 less star because they are very long. 31.5\" long, looks a little odd, but it is a recliner after all. but not ugly or anything. My husband is 5'9\" and fully opened, the end of the foot rest ends at his ankles and his head is still on the back support. If your 6' and over, your legs probably will stick out a bit.", 
    "Good price, but not really well constructed. You have to pull up the foot rest, then sit down if you are a smaller person. Some threads showing on the arms and seat cushion, but it is comfortable. Easy to put together as well.", 
    "It's a little narrow but it's holding up very well. Looks great in our spare bedroom which has a TV.", 
    "perfect recliner for our smaller living room. required zero tool to put together. Looks and feels like a 500 dollar recliner.", 
    "Perfect and doesn't overtake the room with its space.", 
    "Very comfortable and sturdy", 
    "All our visitors are stunned that such a small chair reclines... :-)", 
    "This is a beautiful chair, color and all. It looks exactly the way it looks online and it was easy to put together. I would definitely order this again.", 
    "This chair is cute, but not quite what it looks like in the pictures. The color is very much the color of khakis, not a light beige. It's hard to lean back also. It's visually appealing though.", 
    "Very modern and stylish. Perfect size for my bedroom, but ok for another room also.", 
    "When we got this little recliner, we were worried about having to put it together. NO PROBLEM! It was a bit heavy for two women, but we had it done in 30 minutes. It fits nicely in my daughter's small living area, and is surprisingly comfortable for a small chair. Definitely worth the price!", 
    "Perfect for a small space.", 
    "It fits in my smaller bedroom, easy to assemble; I like it.", 
    "After looking for two accent chairs to go in my small living room for over a month, I finally settled on this one. Since the chairs are going in my living room, I wanted them to be stylish, comfy AND inexpensive. This was one of the cheapest accent chair (with arms) that I found...PLUS it reclines! I ordered two and hoped they would be comfortable. They arrived a month ago, and my husband and I are in love! We prefer to sit in these chairs rather than on our expensive sectional sofa. These things are super comfy! The only warning I would give is that they are very light (show stains) and they aren't made for tall people. My husband and I are both under 5'6. If you're any taller than about 5'8, it would not be comfortable in the recline position. 5'8 would probably be pushing it.", 
    "nice addition to a small apartment...classic look...comfortable...priced right", 
    "Chair is easy to assemble and relatively comfortable. Not something you'd want to sleep in but great to cuddle up to a good book or just watch TV.", 
    "Easy to assemble - looks just like the photo", 
    "Good quality for the price", 
    "I was leery when I decided to purchase a recliner on line. But Overstock has wonderful products and I am so happy that I purchased this. I love the chair.", 
    "Love it! Great chair for a smaller room.", 
    "Does the job. Fabric not my favorite", 
    "I bought two of these chairs and they arrived looking good. The fabric is nice, the reclining options are also good. In general I am happy with them although they do feel a little cheap as far as their sturdiness goes. It's definitely not a chair where I can sit in the arms for a moment and when you do that the \"walls\" of the side definitely move separately from the main cushion part. Just feels a little flimsy but again all in all I am pleased with the look and function of these chairs.", 
    "Nice fabric. Chair stays in a recline position. Does not sit straight up at any time. Fits more in a small office or sitting room. Not with big Living Room furniture, as to what I needed it for.", 
    "It is not the most comfortable chair but I bought it as an accent chair and didn't expect it to be. I like that it reclines and I was able to put it together in 5 minutes. I had a coupon so it was a great deal.", 
    "We love this chair, it's firm but comfy and stylish. Not too big.", 
    "We ordered two. They are comfortable and we are happy. They seem like they should hold up for a while. Everything was smooth - ordering was easy, they arrived at our front door quickly, and they were easy to assemble. I would recommend this purchase to a friend.", 
    "Easy Easy chairs to put together and look great in our formal living room (small space). Great quality -- looks more expensive than it was!", 
    "Very light weight it doesn't jerk into the recline position. It is a smooth ride.", 
    "For the price, this is a great little recliner. I purchased it for a corner in my bedroom. It doesn't glide open effortlessly, my 5 year old opens it from the bottom because it's too difficult to push on the arms for her. I wish the seat cushion was removable for cleaning. Overall it's a nice small-sized recliner.", 
    "I was really impressed for this chair for the money we paid. Looks exactly like the picture. Narrow recliner that doesn't take up much space but is very stylish. Plenty comfortable too!", 
    "Great price for a recliner! Looks great in my living room. Recommend if you're looking for a smaller size recliner", 
    "Really nice looking, comfortable, solid chair that doesn't take up too much space. Arrived quickly and easy to put together.", 
    "This was a great chair and it super comfortable! It looks as pictured and is good quality.", 
    "Overall the chair is great.. The comfort and style. Its a great find and bargain for the price.", 
    "Perfit size for our rv. Very nice chair", 
    "pretty easy to put together.Little too deep and slanted in back when not reclining.Hard to push back to recline,but looks good and is comfortable.", 
    "Was looking for a recliner that wasn't bulky or unattractive. This is chair is perfect! Easy to recline and comfortable. Love!", 
    "Minimal assembly, perfect for a small space. Pretty comfortable, too!", 
    "This chair is serously the best it's comfortable and easy to recline. I love the fact that the arms are a big longer than normal I can actually rest my entire arm along it. It's got nice bounce. 10/10", 
    "Was exactly as described in other reviews. Sits deep and you'll likely need a throw pillow for comfort. The Velcro on the back leaves much to be desired; invest in decorative furniture tacks. This chair is not suited for the tallest of individuals (my husband is 5'10\" and too much talker may find discomfort with the backrest). However, it looks amazing with my decor, folds completely flat for napping, and is comfortable. An all around great chair for the price!", 
    "A little longer in length that I imagined, but a more stylish choice for a recliner. Very comfortable.", 
    "I bought this chair for my 14 year old son's room and it's perfect! The size, color and design is wonderful! What really convinced me was the picture of Christopher Knight in the chair. I was able to appreciate the scale. We love it! The delivery was fast and it took very minimum time and effort to put together.", 
    "These chairs are perfect for small areas like rv's replaces big over stuffed recliners. Leans back a little more than like but is super as a recliner.", 
    "I bought two of these chairs for my living room. They're very comfortable and were easy to assemble. I like the simple lines and contemporary look. I would recommend this chair.", 
    "Works nicely, easy to put together, no problems at all.", 
    "Good chair for price. Comfy.", 
    "My husband and I ordered these for our living room He really wanted the comfort of a recliner, I really wanted the look of a stylish chair (which we all know recliners are not..). I showed him these and he reluctantly said yes. We do not regret our decision. They look fantastic and don't take up much space. Would be great for a small house or apartment. They were very simple to put together as well.As for comfort, well of course they aren't as comfy as my husbands old ratty microfiber oversized recliner, but he still enjoys it. The seat part is actually rather long, so you can sit further back in the chair. The downside is there are only two positions. Upright, or reclined all the way. But even then you can still kind of prop yourself up.These were perfect for us and we loved the price point!", 
    "it is a nice looking chair and seems well made for the price. time will tell how well it holds up, but haven't seen a recliner cheaper than this one. A bit tircky to put together. we had some issues figuring out how to put the back on. This chair is much longer than i thought it would be, for some reason, seat is a bit long for me at 5'4, my feet don't touch the ground LOL I will need to get pilows. so keep that in mind if ordering and also it sticks out into the room a ways. The mechanism for reclining requires that you push back with your arms. I am 34 and found it a bit difficult to recline it. Took more effort than i felt it should have, but maybe over time that will get better?? I was sad about this as i bought this chair for an elderly person who will probably need help to get it to recline now. :( Chair was not that expensive, so, will keep. Its nice enough, and still functions as a nice sitting chair even if hard to recline. It is not worth hassle of returning.", 
    "Not the most comfortable but fills in the empty space I needed.", 
    "This is a fairly comfortable chair - the seat is very firm and very deep, so I need to add a throw pillow behind my back. It declined to two positions - the first is just sort of 'feet up' and the full recline is basically flat, but it doesn't really lock into that position so you have to brace yourself to keep it flat, so you can't fully relax or fall asleep or it will rock back up to the first reclined position. Overall tho, comfy and it doesn't look as cheap as it was.", 
    "Super easy one person assembly. Real nice and sturdy design with very comfortable recline! Thinking of getting another...", 
    "This chair is very attractive and works perfectly in the tight space we have. My husband is tall and he can fit comfortably in it. The material and color are just as shown, very nice. And it reclines nicely too. Not for nap taking if you are tall though. Everyone enjoys using the chair.", 
    "High quality for a low price, the fabric is thick and good neutral color. The chair is much smaller than normal recliners, which is what I wanted, a nice looking recliner. I'm 5'7\", not thin, and the size is fine for me.", 
    "These are really nice - small recliners. We have a couple in front of our fireplace. I like the linen cloth - it's elegant and can be decorated with a nice colorful pillow. These are not everyday chairs but are nice accent pieces that should hold up to occasional use.", 
    "I got two of these for a steal of a deal, and they are great for my living room. I was looking for something decorative and more comfortable than the standard club/accent chair. It only took minutes to set these up. Simply screw in the legs and pop the chair's back into place. No tools required. The chair reclines easily by leaning back to open it and you can sit forward while pressing the footrest down with your legs to close it. Now I just need to find a couple of accent pillows!", 
    "Really comfortable and nice and compact. Bought for my smal studio apartment and have adjusted them into my home now. Perfect loungers by the fireplace!", 
    "I was very surprised by how easy to assemble and how elegant the chairs looked. They're a small recliner for people that aren't too heavy. I really love the color and how comfortable they are. You'll need to buy a decorative pillow for better back support since the chairs lean back further than most, but that will make it even more comfortable while keeping the room stylish. Great deal at $207 and I'd highly recommend it. The boxes are heavy, so if you're carrying them up stairs, keep that in mind.", 
    "Looks pretty, price is amazing. Definitely buying another one.", 
    "true to picture. As other reviews stated a little stiff but hope it breeaks in nicely. Nice with throw pillow as the back is angled a bit. Husband likes it, a lot, even though it was purchased for me. Love the materil and the sleek appearance. Not bulky at all. Highly recommend for the price. Well packaged and shipped promptly.", 
    "Cute, clean lines and comfy. We don't sit in it cuz it's in the bedroom but the cats love it.", 
    "Lked chair but just couldn't get it to stay all the way back in full reclining position.", 
    "This item was purchased as a bedroom chair for my daughter who is in college. It arrived and was lightweight enough for her to bring into her bedroom and assemble. She uses it to sit in and study, and does homework there. She has been very pleased with this purchase.", 
    "Works great, very minimal setup required. Pretty basic chair, would go great with an equal-height nightstand.", 
    "We love these chairs. We bought one \"leather\" and this fabric one. They don't take much room, but offer big flexibility and comfort. We put casters on the feet so that it could be rolled around our home office. The chair reclines to almost fully horizontal. It's great. (And it's designed by the guy from the Brady Bunch! It's true! Check it out!)", 
    "I needed a recliner for my husband's recovery from back surgery. Since we are not the large recliner type, I am very pleased with this small one. It was a snap to assemble and is serving him well. It would be nice if I didn't have to raise it up and down for him, but soon he will be able to do that himself!", 
    "They are such nice chairs, and very good quality and I'm very pleased with them.", 
    "A great purchase. Easy to assemble. Parts fit together great. Works well. Fabric a little rough, but I bought a blanket which makes the chair more comfortable. I'm 6'2 and fit in the chair well. A great purchase.", 
    "I really lie this chair. It is smaller than a full size chair which makes it perfect for the bedroom. It is still a little stiff when trying to recline after more than a year. Very good value.", 
    "Love this chair! Easy assembly and beautiful color. I scotch guarded this and the color has not been affected. I have two toddlers who climb all over it. Reclines beautifully. Want another for a different room!", 
    "Using them in our sun room, did not need the recliner feature - but for the money these were a great buy - very easy to assembe. Good value.", 
    "I've had this chair for several months now - you get what you pay for. I've had it in the living room as a TV chair, in the sunroom, and in the bedroom. I'm 5'2\" and it's a bit deep from front to back for me, however my feet touch the floor, which is good. I have to use a back pillow for support. I had to take out the springs entirely and WD-40 the joints because I couldn't push the chair into recliner position because there's no \"grip\" to assist. I like the look of the chair and the fabric seems to be holding up. So for the money for an occasional chair that you're not going to spend too much time in - it's great.", 
    "LOVE this recliner!! Fits nicely in a smaller space and is very comfortable. I have had many compliments on it!", 
    "Had I paid a lot of money for this chair I would not be pleased, but for the price you can't beat it. I needed a small recliner for a small space and this was a perfect fit. Neutral color and clean lines. Very easy to assemble. Love it.", 
    "I have originally purchased this recliner chair for my bedroom. While unwrapping it (in my living room), I found the perfect corner for it and left it there. It is a beautiful chair, very elegant and brings a nice touch to the room. The only issue I have with it, is that it is difficult to put it in the reclining position. You have to be tall to do it easily, which I am not!It is a compact and you cannot beat the price. I recommend it.", 
    "It was perfect!Exactly like the picture! Purchase this item for my husband and loves it! Perfect size, perfect extension. Great piece!", 
    "I bought this for a small area in my dining room by the window. It fits in the space perfectly and is comfortable.", 
    "Chair does not take up a lot of room, and can fit in almost anywhere. It is a little stiff in getting to recline but hopefully it will get better with time.", 
    "It was better than I expected for the price, it is very comfortable and was simple to put together!", 
    "Breaks down after 6 months of use. Comfortable chair though,,, I would buy it again if it's under $$", 
    "Perfect fit for its placement spot!!! Color great!", 
    "Great for a small room. Sturdy with nice recline. Fabric is nice but not lush. This is a great piece to spruce up a room and fit different decor themes.", 
    "Love the chairs and easy to assemble.", 
    "The recliner is just as sleek and nonbulky and yet comfortable and functional as I had hoped! Would definitely recommend!", 
    "For the price, this is pretty good quality. Fabric is a moderate linen grade. Super comfortable. and reclines to two different levels. Worth it!", 
    "I bought this for my mother who stays with us and wakes up with back pain. A recliner helps her relieve the pain. The smaller scale of this recliner fit our guest bedroom perfectly. The upholstery is of good quality. It is a little challenging to get it to recline but I am hoping that this loosens over time. I only wish that the back height was a little higher so there would be more headroom when reclined. Overall...I am pleased with this purchase.", 
    "Chair arrived in great shape. Very easy to assemble. I have a smallish space so it fits very well. It is contemporary looking, comfortable to sit in, nice neutral color, and a good value. I am very happy with this purchase.", 
    "This is a small chair but perfect for the narrow corner I was putting it in. I can be a little difficult to recline. I just a pillow for added support. Good for the price.", 
    "Not good quality, not comfortable, and you can't recline it out enless you are a muscle man, very very tight. it does recline straight out, but, not worth the money. sending it back.", 
    "Love this chair. I deducted 1 star because the reclining mechanism is quite \"stiff\"; we're hoping it will loosen in time. The linen-look fabric will blend with ANY COLOR, and the style fits well with our contemporary feel. It is more attractive in person than the picture.Put a pillow behind your back and you're good to go. I notice some reviewers said it did not fit taller people in the reclining position, but with a standard 18\" decorative pillow tossed behind your head it works for up to 6 ft tall. Can't verify for taller folks.I agree the seat cushion is somewhat stiff, but again it shouod loosen with use.", 
    "This is very cheaply made.it is ridiculously small..it would have cost $$ to ship back because if the companies return policy. ..this us my last purchase from Overstock.com!!!", 
    "Love it! I was hesitant to buy a recliner sight unseen and untested. This chair feels as good as it looks. Definitely recommend it.", 
    "Fits in small places. Is very comfortable. Good when you want a simple recliner. Feels nice.", 
    "Very comfortable and easy to put together. My only complaint is that a couple of the legs were dinged up pretty bad.", 
    "Used for over a year now in my daughters nursery it's our favorite spot for cuddleing", 
    "The chair is narrowAnd might be uncomfortable for \"long\"Naps. It looks good and is perfect for a corner in the bedroom. Good value for money .", 
    "This chair is comfortable and well made. Great chair for the price.", 
    "Needed a sitting chair for an office and didn't want to spend much. For the money, it is sturdy, good quality, and comfy. Spending twice as much, you could get something a little wider, nicer fabric, nicer cushioning, but for the price, you can't beat this.", 
    "After downsizing most of old furniture just didn't fit. We purchased two of these and are pleased with the size and price.", 
    "I've been having my recliner chair for about a few weeks now, and I love it!!! It looks great in my bedroom along with my espresso furniture, and best of all it is so comfortable!!", 
    "Not as bulky as some other recliners so it fits nicely in a corner of my room. I find it comfortable also. Arms do not feel as firm as other decliners might be. I would not necessarily place in living room as other furniture dwarfs it and it looks out of place. But I love it in my bedroom.", 
    "Nice and sturdy. I use cushion covers to keep my blue jeans from dying on the light fabric.", 
    "It's a no frills, nothing fancy chair with a lot of style, and affordable. We now have extra leg room in our compact home with this little recliner. Like a lot!", 
    "This furniture is the perfect size to place in a small corner in your house. It works very well in our bedroom. It looks like a club chair when not reclined. Was also thinking if you had 4 of these in small space, it would give you a nice seating area for guests.", 
    "Chair arrived in perfect condition and it was very easy to set up. The size is slim and great for smaller spaces. The comfort level is not as good as our old, marshmallow-style recliner. But I like the smaller footprint of this chair and our kids still fight over who gets to sit in it, so it can't be that bad!", 
    "Not impressed with the quality, at all. Wish I had not ordered, but too expensive to send back. Don't like the loose weave of the fabric, the wood frame seems wobbly and the reclining mechanism is extremely tight to operate.", 
    "had to be returned due to defect in the reclining mechanism. The return was hastle free.", 
    "Love this. Looks add though it should have cost a lot more.", 
    "We love this chair! Its small size is perfect in our bedroom. My only concern is that it is a little difficult to push back into a reclining position.", 
    "I was a bit hesitant to buy a chair online without trying it first. When we received it and put it together (it took my husband literally 10 minutes) we sat in it and to my great surprise, it was incredibly comfy! It's my husbands new favorite chair. We bought 2!! I highly recommend this chair for anyone looking for stylish clean lined furniture. Well worth it and looks like we spent way more than we did which is always a bonus!!!", 
    "Excellent chairs/recliners for the money. I am very happy with their modern yet functional design. I'm very pleased and get tons of compliments on them.", 
    "Gave this to my daughter in NYC. Her apartment is small. This is sleek, fits nicely in a small space.", 
    "We needed a small recliner for a nook in our living room. This chair seemed to suit our needs well. It's not linen, but has a linen look to it. It's held up very well, despite it being our cat's favorite chair. The arms are very slender, so I don't love how it looks. However, it is surprisingly comfortable for its size. I'm 5'5\" and my partner is 6'2\" and we are both comfortable in the chair.", 
    "this chair works wonderful in my bedroom, perfect size for small spaces and also VERY,VERY, comfortable. My sister came over and tried mine a couple of times and ordered her two. Free shipping is always a plus.", 
    "It was exactly what I expected, oatmeal color, sturdy and comfortable! Nice for a modern or contemporary home.", 
    "Nice chair for the money and looks good in den. Since I sit upright most of the time, I have to use another small ottoman. It reclines fully with footrest up but not when sitting upright. It supports my head since I'm shorter but not a tall person--my husband is 6.1.", 
    "I love this chair. It looks great. It was super easy to put together. The chair is really comfortable. It is rather thin so if your on the fat side beware.", 
    "Great size while not too comfortable due to the back of the chair it is still a great addition to my living area", 
    "This chair was a steal. We use in our master bedroom for reading and relaxing. Doesn't take up much space like most bulky recliners.", 
    "Perfect chair for a small area. Easy assembly & wonderfully comfortable!", 
    "I've had the chair for a couple of weeks, it's ok, firm, which I like, but, as others have said, the back is tilted back to far in and the doesn't stay back in the recline position. The construction is not the best, the padding in the arms are lacking in areas, your arm is resting on the frame and when you lean back it sounds like it has plastic lining inside, it sound funny, it's not real sturdy so it doesn't look like it will last very long before it will start falling apart. But it suits my purpose for now.", 
    "We purchased this for our aging aunt who need comfortable seating and still maintain the high quality design she loves. She is very pleased with the fabric and it is a great fit for her medium size body.", 
    "We Scotchguarded them right away because of the light color. They fit perfectly in somewhat small bedrooms and the girls love them and find them comfortable. We have had them about six months and so far they are holding up very well.", 
    "This is a great way to recline back in style. The only downside is that the design of the chair would only be comfortable for a shorter person. Due to the lower height of the back it does not cradle your head if you are taller that 5'3. It fits me fine, but my husband at 6'3 can not use the recliner feature. Unfortunately I purchased this product for him.", 
    "Very happy with my purchase great recliner for the price very comfortable and fabric is great. Think it's a good buy for the money", 
    "I was looking all over for an accent chair for the master bedroom. I stumbled across this chair but I was very hesitant to purchase sight unseen or feel. I decided to read many of the reviews and after not finding a bad one I took a chance and purchased. I love my new chair! Perfect size, color and it is very comfortable! Even my husband fits in it. Easy to assemble, too. Very happy with my purchase. Glad I took the chance.", 
    "Occasional chair seating investment.. doesnt do full time duty.. but looks great!", 
    "Using as bedroom chair. Great Chair for a GREAT price", 
    "I did my research before I bought this chair. It had the looks and the video of it being comfortable looked cheesy. I figured \"oh well it goes with what I got going on\" Boy was I surprised, not only it looks good, its a recliner that is not bulky. The best thing is that IT IS super comfortable. I bought 2, and so far they are the best chairs in my family room. Better than my living room set. Christopher Knight sure knows what he is talking about.", 
    "Great chair for a smaller space. I bought it for my vacation condo and it fits perfectly. It required a little assembly and it was ready to go. The chair is comfortable however I would say it's not for a very tall person for the recline or heavy person for the width.", 
    "NIce comfortable chair. My husband loves taking his naps in it. Small footprint and fits in with our furniture very well.", 
    "This chair is great for the price! We have alimited living room space and needed something functional, classy, and smaller. It fits perfectly next to the fireplace. Comfortable for me (5'3\") and my husband even likes sitting in it (6'). I'm very happy with this purchase!", 
    "These chairs were a steal! So affordable ... yet elegant, sturdy and most importantly comfortable. Even my plus sized hubby loves them. Don't miss this bargain.", 
    "love love love this chair! took me about 10 minutes to put it together, then i fell asleep in it, it's so comfy. i'm barely 5'4 and my feet do hang over the recliner legs but i don't have an issue with that. great product.", 
    "I was looking for a smallish recliner--and I got just what I wanted at a great price. It's a little narrow--comfortable to sit in but I tend to sprawl. Its also much firmer than expected, which makes it a perfect support for my back. I wish I had room for another one.", 
    "Perfect for a small space ...not for a man over 5'11 ..fabric is quite nice for the price and fairly easy to put together. Needs a pillow for your back for comfort. A little difficult to push into the recline position, perhaps with more wear it will get easier.", 
    "Nice chair. Kinda small. But exactly what I was looking for, for a small apt living room.", 
    "I'm very pleased with my chair. I like the size, don't care for those huge stuffed pillow- like recliners. Assembly was easy and done quickly, no screws, nuts or tools to bother with. My only complaint is that to recline, you have to lean against the back of the chair and push back and at the same time place your feet on the ground and push. I'm fairly tall and the seat is so long that even pushing with my legs as hard as I can I have a hard time getting to the full reclining position. I think the mechanism is too stiff and I'm hoping it will loosen up and become easier to recline as it gets more use. I've only had the chair for a short time.", 
    "This was purchased for a bedroom so space was an issue so we took a chance...It fit perfect! The comfort of the chair was impressive. The assembly was done in less then five minutes, so that was great. Overal great buy :)", 
    "This recliner is a very nice one for the price. It is well made, sets and looks good.Assembly was ok except I had a little problem getting the back to click into place but after it went into place everything was fine.It looks good in my living room and I like the fact it relines all the way into sleeping position,", 
    "Ok, the chair is excellent in style, heavy but fragile, easy to put together, but wonder if it will stay together. Recommend to a friend if the friend is small and wants a chair just for her. The Delivery was a mess... He dropped the box on the porch and it was torn and coming apart. I will say that I like the chair and it does recline for me with out an issue. I have no need to totally recline the chair so none of that is an issue. I can sit in the chair and the chair does feel fragile, but I am not a very big person, so again it will work. Would I buy it again, probably not.... This is not and I mean not a full time chair....but perfect for a bedroom.", 
    "This arrived on time and was very easy to assemble. I am 72 years young and had it unboxed and assembled in about 20 minutes! It is very comfortable and easy to recline--you do have to watch where you put your fingers if you push the foot rest down to help someone get up! I have pinched mine a couple of times.It is perfect for me at 5'2\" but anyone close to 6' or over would not have a head rest! It is challenging for my 5'10\" husband (but works).I love the chair. The small footprint is especially nice for us.", 
    "Purchased this for a friend's apartment. He has limited space but needed a place to read/study/relax in his bedroom. This chair is perfect. It has a small footprint. Fabric is decent quality, soft and easily cleaned. ***** and ****** style with a small price tag. Chair is extremely comfortable.", 
    "Cute little chair...ordered two of them. Easy assembly!", 
    "Love the style, color and price! Little smaller than expected. Good for me, but a little small for my husband. After having a larger recliner, you have to get a little use to it. Definitely firmer...which is okay. But I really like it overall. Good size for smaller areas!", 
    "This chair looks more narrow and longer than described, but I was very impressed with the quality of the chair for the price! We unfortunately ended up returning them because of the sizing issues, but I would definitely recommend them if you like the pictures.", 
    "The other reviews were spot on. It's comfortable and stylish. The smaller size fits perfectly in our TV room and I like the fact that it doesn't look like a traditional recliner. I do have to use a throw pillow behind my back to watch TV comfortably. It was easy to assemble and the color is the same as it looked on the computer.", 
    "These chairs are awesome and perfect for a small space! We love them!", 
    "Thrilled with the whole process. Overstock was great. The chair arrived on time and was beyond what I expected. Love it.", 
    "This is a small recliner - perfect for apartment/condo living. We love it!", 
    "Needed a compact chair for my bedroom. This product gave that plus a recliner as a bonus!!!", 
    "Love this chair, our new favorite. We have an apartment with a smallish living room and this is the perfect solution. It's so nice to have a recliner that doesn't look like a recliner. It's comfortable either as a chair or as a recliner, medium firmness. The fabric is an ivory sort of linen that coordinates with everything. Only problem: it has led to palace intrigue, to see who claims it first!", 
    "I ordered two matching chairs, They arrived in perfect condition, packaged well. The color is true to what I saw on the website, as well as the description. They look great, stylish, and are bigger than I expected. The footrest is small, as pictured. I am putting them in a seasonal cottage, so they will not be getting used every day, not sure how they would hold up under regular use. Happy with the purchase, exactly as described!", 
    "I like the way this chair looks, clean lines and more compact size than standard recliners. The material is a nice linen-like beige, it looks great in our room. But a few months in and the seams are ripping on the back. The material has separated away from the seam on the seat back, no way to repair that. I understand that this is an inexpensive option compared to other brands, but still much too expensive to only last a few months.", 
    "I just unwrapped this and I am in love! I had been searching for a recliner for my husband that was not hideous and came across this. After looking at La-Z-Boys costing upwards of $*** I decided to give Overstock.com a quick look. This was the first thing that came up and I was thrilled...and it had free shipping! When it arrived I quickly and easily put it together and I love it. It's sleek looking and comfortable and fits in with our modern decor perfectly. My husband is happy, I'm happy and I think the chair is happy in it''s new home.", 
    "Needed a chair for small area. This chair is perfect with the added benefit of being a recliner. Material and color make it look like an expensive chair. It is firm but comfortable. Reclines easily. Super easy to put together - no tools needed. Could not have found a better chair especially for the price.", 
    "We bought these for our bedroom and they are perfect not too big", 
    "This is in my guest room and is used very little so I can't review the durability of product or fabric. It is perfect for a guest room or small space. So difficult to find a small recliner and this one fits the bill and looks great as well. My husband (6') and I (5'4\") both find it comfortable. It is exactly what I have been looking for. Thrilled to have found it on Overstock!", 
    "This chair is great value for money and should match most decors. It is especially good for a smaller person.", 
    "It looks very nice for the price and it's easy to assemble and comfortable for reclining, but the back doesn't stay in the fully upright position and the velcro flap over the lower back is misaligned so it doesn't close as it should.", 
    "This is a great Recliner for a small space. Its narrow and can lay all the way back. I bought one just to see how it was going to be. I bought another on the next day and put a narrow coffee table between them for my living room. you can't beat the price. There are 5 pieces to assemble.The 4 legs and the back slides right on. No tools required. there is a wing nut adjustment on the recliner springs to account for wear. The fabric is nice. you will need to trim some strings that are hanging out. that goes with the territory in this price range. Has a very modern look to it with clean lines.", 
    "I love my new recliner. It is perfect for the space I have (i live in a studio). I fall asleep in it regularly, and as soon as I sit in it, here come the animals (cat and dog) \"fighting\" for a position. Construction is a little hard, otherwise I would have given it an overall excellent.", 
    "This is a very good chair especially for the value. It has a modern look and will fit in any space you would want it to. The recline on the chair is fairly good and extends back a good amount. The only one thing that I would say is a negative is that the chair back height is lower than what I would like. But the specifications that are in the description is accurate, so I suggest measuring it before actually purchasing, if that's important to you. Overall a very good chair for the price.", 
    "Im never thought i would buy furniture online, but i figured that everything is made in china regardless. I would have bought my sofa here but havertys had what i was looking for and since havertys was so expensive i had to be frugal with the rest of my budget. So i completed my living room with (2) of these recliners. They are very comfortable, as in i sit in them at times instead of my 1600 dollar sofa. I had them for about 3 weeks and they are still great. As far as quality ? Well like I said made in china so workmanship is far from excellent. However if your into DYI as myself you'd add extra staples and reinforce joints with some glue. Overall the quality is acceptable. Only admired the quality when I reminded myself what I payed for it.Would I recommend this product ? Of course I would. I mean why purchase an expensive recliner at ashleys furniture or at havertys to later experience hell when the expensive furniture breaks or gets scratched or if you get bored and you want to remodel?Save your self the feeling of getting ripped of by low quality furniture supermarkets and enjoy a simple , comfortable and elegant cheaply made recliner. You will not regret it and youll have pleasure when entering a store like ashleys furniture and having the ability to say \"Hey man, I got a couch just like that for half the price\".Good luck", 
    "I wanted a recliner for a corner that wouldn't take up all the area. This chair is perfect for that. Plus it is stylish and doesn't look like a recliner when up straight.", 
    "We bought this for our daughter's room and it fits perfect for a kid's room, for her to sit on our laps and read stories. Also nice but the style is versatile enough that we could move it throughout the house. A little snug for my husband who is 6'1\" to relax in long term but works great for me. Overall a great value for the price. Just what we were looking for.", 
    "This recliner is great for a small den or office area. Is comfy. East to put together.Could recommend.", 
    "I ordered 2 of the chairs for my living room. The fabric is a linen and the color is a light beige and very neutral. They were easy to put together...screw on the legs and line up the back, done. Everyone who has come to my house and sat in them said they are comfortable.", 
    "I bought two of these chairs for my living room. I am very pleased with the quality and aesthetic. As others who reviewed the product mentioned, the color is more beige than shown in the photo. The chair has a linen look to it. The size is great - they are not too big, but not too small. They are surprisingly sturdy and comfortable. The chair looks far more expensive than it is. Also, assembly is extremely easy. I would definitely recommend this chair.", 
    "Perfect recliner for a smaller space. Purchased two for our living room. I am 5'2\" and my husband is 6'2\" and the chairs accommodate our different sizes easily and comfortably. No problems at all with assembly. Fabric is sturdy yet soft. Chairs are firm to body weight and feel very supportive; perfect for reading or stretching out for an afternoon nap. We love these chairs and would buy more if we had the space.", 
    "Finally, a recliner that doesn't require adding another room onto the house. Bought specifically for someone in an assisted living facility, and it fits!", 
    "Bought as gift for my senior mother, who is establishing a new household, needing furnishings. Beautiful piece, easy assembly, and a considerably decent piece of furniture for the value. She has a bit of difficulty \"pushing\" back to recline all the way, but is hopeful that it will become easier over use.", 
    "Looks great, perfect size and comfortable. Bought two.", 
    "I needed a small recliner for my bedroom. I don't like big, bulky recliners and this is perfect. It looks like a fashionable chair.. The fabric is linen-look and color. The chair is comfortable and the reclining mechanism works well.", 
    "I was happy when the chairs came! Got them out of the box by myself and had them set up in a matter of minutes (I'm 5'6\", average build, but a do-it-myself-er that has no patience and wasn't going to wait on my hubby). The chairs are very comfy and I LOVE the look. They look so much more expensive than they were. My husband, who's 6'3\" even found them comfy, though he did hang off the end of the chair a bit when in the recline position. But, it didn't bother him.The only reason that this wasn't a 5 star rating was something that could/should be an easy fix by the company: simple quality control. I noticed that there were several dirty spots on the chairs (sort of dusty dirty) that looked to be in the shape of hands that I had to clean off. I am guessing it was the hand print of the person that packaged the chair parts. They likely had dirty hands and it transferred pretty easily to such a light fabric color. The other small issue (again, fixable and something that I did on my own)- there were about 10-15 loose fabric strings hanging off the chairs that I had to cut down myself. It just seems like such an easy thing to do from a quality control standpoint, and the chair out of the box presented as a 4 instead of a 5. Again, just something more for the manufacturer to spend about 10 seconds working on. I am nit-picking, but that's my only complaint. And again, SUPER EASY to fix myself, but the fact is, I had to fix it myself. It's just a high maintenance notation from my end and had it been done, this chair would've received a 5! HA! I would totally order this again, even knowing this.", 
    "These chairs are the perfect linen color. They are very stylish and comfortable. Super easy to put together!", 
    "Nice look paired with similarly styled small sofa in bright sunset color. Perfect small beach house application. Seat is a little too deep for short folk. I am 5' 2\".But it is a recliner after all and in a reclined position this is no problem. I put a decorative pillow behind my back, problem solved. Soooooo affordable. Great value. Easy to assemble! Stylish!", 
    "I got two of these chairs...one in brown leather and this fabric one. It's comfortable, stylish, and easy to put together. My only issue would be a better color, teal, taupe, lime...something a little darker. But it's a good chair!", 
    "We bought this recliner to replace our now ratty 6-year-old recliner that was on its last legs from so much use over the years. It's perfect! We have a large living room, but this chair goes in a corner, so it's the perfect size for the location we have it in. It's not a very big chair by any means. My husband is a big guy at 6'1 and he fits very comfortably in it. I love it because it very closely matches the color of our microfiber sofa and love seat. It's also very modern and classy looking. We've gotten so many compliments on it from family and friends. I'm actually considering purchasing another one for our bedroom so that we have another place to watch TV besides the bed. If you're looking for a larger chair, this is not the one for you, but if you need something that's not very big that will fit in a smaller area, I would highly recommend this recliner. You can't go wrong!", 
    "For my purposes, this is a very comfortable recliner. The headrest is a bit short, but not uncomfortable. A pillow makes it perfect if I am in a pillow mood. I really like this chair because it is too small to be comfortable for my husband, therefore I always have a recliner now!! LOL. If I could keep the cats off it, that would be wonderful, so I have to keep it covered.", 
    "I was nervous bc of the price but I was on a limited budget the chair arrived was easy to assemble, and looks great! The chair doesn't look cheap at all I would highly recommend it!", 
    "This chair, in the upright position leans back a lot. Even being tall, I have a large cushion in front of the back which helps. The back flap should be a little longer. Perhaps in time it will stretch out enough to be attached to the velcro on the chair.", 
    "When putting the back together the spring clip broke and fly off . We found it later but it was broken. Really does not affect the function but would have liked that not to have happened . The chair is comfortably firm and on the small size not a massive piece of furniture! The price was right and looks very nice with a blanket over the back and a colorful pillow.", 
    "Great recliner with styleGreat recliner with style", 
    "We received this chair in linen design and it is just such a great addition to my office. The color, size and feel of the chair is absolutely fabulous. It has three adjustable ways of sitting: sitting upright, reading and napping. The first night I had it I fell asleep reading in it and I have never done that before. The value of the chair for the price is unbeatable. It makes me want to consider other furniture from this designer. The shipping was also good. The chair came FedEX and arrived in good shape and was very easy to put together.", 
    "We were looking for the right size chair to fit into my Mom's apartment and was pleasantly surprised how well the chair fit her small space. It is well worth it's price, the quality is great and the it is so comfortable as well as easy for my Mom to sit in and get up out of it. Couldn't have found a better chair.", 
    "I was looking for a small accent chair for my living room. Product looked good online and the price was great, so I took a chance. Well, I can say that I should have know that it was not going to be a \"quality\" item. Small, color is light wheat linen (Ok for me), seat is firm, which I do like. The problem is that it is very cheaply made. Bought it as a recliner but am really afraid to recline it since the mechanism is not smooth and does not have a handle, therefore, you have to push back to recline it. I am afraid that the arms will fall off or the back will crack. Thankfully, we are small people and there is only myself and my husband in the house, no children. Otherwise this would definately not last.", 
    "I loved the look and style of this chair as well as the color, but the make is flimsy and some of the bolts fell out or became lose. When I ordered the chair I knew it would be a short term option for our needs, but I didn't think it would fall apart so fast on me.", 
    "My 23 year old daugter was looking for a chair for her apartment. She wanted something that would compliment her furnishings but also something that would be comfy - something she could curl up and read or watch a movie in. When I saw this online I knew the look was right, but at this price I was skeptical of the quality. When the package came I put it together and again, was very pleased with the overall look of the chair. The true test would be how comfortable it is. This recliner is COMFORTABLE. It reclines fully, so that is almost completely horizontal, so great for a little cat nap too. As other reviewers have mentioned it is smaller in scale than your typical recliner. This chair is not meant for a big man or really anyone who is on the taller side. My 5'1\" daughter will love it and I am 5'5\" and found it very comfortable as well. And the smaller scale makes it perfect for an apartment.", 
    "I liked this recliner so much I ordered another one! It is smaller than regular recliners, which makes it able to fit in any area large or small. Looks are attractive and contemporary style. Love it and finally something that women and men can share equally.", 
    "Nicely designed and even though it will fit in a small space, gives the feeling of reclining in a chaise longue. You can get a better quality chair, but not at this price. Also, even though it's a good piece of furniture, but it's not going to last a lifetime. The oatmeal color would complement most decors and it fits nicely in our guest room in a corner with a reading lamp. There were no instructions for assembly, so be careful to put the back on in the correct direction, but otherwise, it's pretty simple to assemble. Arrived very quickly!", 
    "This chair is not beige, it is a gray color. Not really comfortable unless you are shorter than 5'4\". Had to put a beige colored throw pillow to try and bring out the beige color. Also seemed to take a very long time to be delivered...", 
    "I really like the comfort and coziness of this chair. I just dont appreciate how their is an opening in the back of the chair. But it still is a nice chair to recline and relax in.", 
    "I bought two of these chairs when I was looking for recliners that wouldn't take up a lot of space and weren't bulky but were stylish. These fit the bill perfectly, and are true to the pictures online. The chairs came in good condition and were easy to put together by myself (though the box was so big I needed help moving it). They are beautiful and easy to spot clean. My only complaint is that they are very firm, and I like my chairs cushier. Still an extremely good value for the price!", 
    "A little narrow then I expected but very comfortable and great value. Easy to assemble.", 
    "It's amazing! Definitely, you get the value for money ratio on this.Easy to setup, good size and comfort. Could be a little steadier on the arm rest. I love it!", 
    "This chair is perfect! It arrived in 3 days and was incredibly easy to put together. It took me 10 minutes to do by myself. The hardest part was getting it out of the box! Like other reviewers, I have a small space and this is the perfect size. It looks very high end and you really can't beat the price. If in doubt, listen to the positive reviews. They are true! Couldn't be happier", 
    "I bought it to help recover from a spine surgery and I have a 600 sq foot condo. I already had a love seat but this has been perfect and such a great value---wish I ordered a LONG time ago.", 
    "Got this chair for my 15 year-old, she loves it, she has it in the corner of her room and reads seating on it almost every night. Easy to assemble great product for the price.", 
    "Overall extremely pleased with our purchase. Only downfall would be the back height. I am 5'7\" and it works for me but anyone taller they could not recline as your head falls off the back. If you use a pillow it works nicely though. Great value!", 
    "Nice chair for the price, easy to assemble, nice looking.", 
    "I love the look and price of these chairs but the stitching is where there is more to be desired. The edges of the fabric seem to be pulling apart. Works for me, though, because I don't typically keep things more than a few years.", 
    "Great chair for the price. It looks much more expensive than it is. Doesn't take up much room. Easy to put together. It is too small for my husband to recline comfortably but it's comfortable enough for him to sit in it. He's 6'1\". I'm 5'2\" and find it perfect for sitting or reclining", 
    "very happy with my purchase looks well and very happy", 
    "Great recliner especially for an apartment or smaller space, the style is sleek and elegant. It is firm but comfortable to me. It does not support your head while seated upright but supports everything extremely comfortably when reclined! I read some comments about the back of the chair and hoe the fabric doesn't reach to the bottom and is unattractive and must be stationed where you cannot see the back, but mine is absolutely perfect and sits where everyone can see the back. I am a single woman and I put this chair together in 10 or 15 minutes by myself, I love it and would definitely recommend on just one, but two! I love it some much I believe I am going to purchase a second one.", 
    "We have a very small modern living room and didn't want a big bulky chair - this chair is perfect. It's small, sleek & streamlined which makes it very modern looking. I love the fabric -- it's a very light beige, but not yellow, and it almost has a slight shimmer to it. It doesn't look cheap at all. The seat is comfortable, not too hard, but not soft either, so i think it will last. It is sort of deep so my feet just touch the floor (i'm 5'4\"). The negatives, in my opnion, are: the back of the chair is not real high so there is no where to rest your head - it's totally fine for sitting, but for watching a movie i think a pillow would be needed. The other is that it's a bit of a struggle for me to get the chair into the reclining position, i practically have to throw my entire body back with the chair because i was unable to easily push it on the arms! My boyfriend did not have this problem at all. He is 5'8\" and 200 lbs and says the chair is very comfortable, oter than the head issue. I'm not sure a guy 6 ft or larger would feel the same, but i guess that's what we have a couch for! All in all it's a great buy for the price. I love the chair.", 
    "Great chair for the price. They are small so they fit perfect in my bedroom. The colour was a little darker than what my computer was showing. But still a great compact comfortable chair for smaller areas", 
    "These chairs look just like the ones at Room & Board but for a fraction of the cost. They are the same color and size as the floor model I saw there. I did not find the chairs to be small as other posters have mentioned. We are both very tall people and find the chairs quite comfortable. Last night I spilled wine on the arm and it came out relatively easily with soda water. Cushion is not removeable, nor is the cover so you'll have to clean as-is. Assembly was very easy. Chair is very comfortable. It reclines back quite a bit which is awesome so you can basically be in a sleeping position if you want to.", 
    "This chair was purchased, along with a rug to brighten a room that was rather dark. In my opinion, it is a better fit for a woman than a man, as the seat is a bit narrow. Since my husband and I have smaller frames, it is suitable for us.", 
    "For those of you who are looking for a compact \"Club\" chair, this piece of furniture fit the bill for me very nicely. As you may read in other reviews that are basically putting this chair down, I have to counter those complaints with my experience. Yes, the chair is quite firm but, for me, it feels rather supportive as opposed to feeling uncomfortable. It does not feel cheap and the arm-rests are very comfy. You WILL notice the firmness of the upholstery upon sitting on the chair but, it is NOT the kind of firmness that is so bad that, while sitting in the chair, your body is constantly reminded of the firmness, nor does it feel uncomfortable. It feels very comfortable and, when you engage the reclining action, it feels even better. I will go as far to say that if you own and use the chair for a few months to a year, the firmness of it will actually soften a bit, but it will not become soft and squishy, which I find annoying. Even if it doesn't become softer with use, I have no complaints about the firmness what-so-ever. The chair looks like it costs much more than it actually did and, it has a very rich looking upholstered construction. There were a few loose threads here and there but, using a scissor on them, removed them easily. Assembly was super easy and the Velcro back fabric aligned perfectly with the bottom of the chair. All that is needed to accomplish this is a bit of strength to put the back assembly of the chair into position. In my opinion, one person can assemble this chair VERY easily. I paid roughly $XXX for this chair and I am super happy with my purchase. It Is a great addition to my very small (ocean-front) condo living room and I highly recommend it to all who like the way it looks in the pictures. For the price, this chair is awesome. If you want to spend more than please go ahead and purchase something else. For bargain and comfort lovers, I think this chair achieves both objectives. Absolutely recommended.", 
    "My mother-in-law is on oxygen and tires easily. She needed a chair that would allow her to sit back a little without making her head go back to far. This chair worked out perfectly! And the cost couldn't be beat. She loves this chair and so does our cat!", 
    "This is the perfect corner nook chair that we use in the bedroom. It's quite comfortable and the materials are quality. Excellent buy for the money.", 
    "This is a fabulous buy. The chair is of good quality, maybe not XXXXXXXXXXX quality, but it's not XXXXXXXXXXX price. The fabric is solid and appears that it will wear well. The size is fine for a small to medium person. A 6'3\" man will not be able to recline as the back isn't high enough and his head will fall back. If you're 6' or under, you should be fine. We found the width of the seat is typical with other recliners. The chair arrived is great condition, screwing on the legs was minimal assembly and very easy. Two thumbs up!!", 
    "My wife and I had been looking for some narrow recliners for our small sitting room. Prices at the box stores were close to ****. Bought two of these one in leather, one in fabric. All I can say is they are worth the money. A great deal if your not looking for high end furniture. Frame is sturdy and the reclining of the chair is smooth and comfortable.", 
    "I've had the chairs for 3 days and I'm loving them. I got 1 leather and 1 fabric, both very nice. Received 3 days after I purchased. Quick and easy to assemble. Great chairs at a good value.", 
    "Good small recliner that doesn't take up much room. It's got a modern look to it. It's firm and the perfect chair for my office. I got the cream color but wish I got another color to add to my decor. It's not the most superior quality, but really what can you expect for the price. It's a good value, but don't expect a super solid chair. I'm still glad I bought it.", 
    "This chair was just what I was looking for. Looks great as an extra chair in our living room and is very comfortable for me or my husband when reclining to read or watch TV.", 
    "Like the chair and it's simple design. It does have a problem with the cushion trim getting caught when the chair is extended.", 
    "This is a very comfortable chair, not real big or overwhelming. My husband is 6'2 and felt it was very comfortable. We rec'd the chair last night, a snap to set up, liked it so much ordered another one today.", 
    "This chair is a good value for the money. It appears well made and fits in with the decor. My only complaint is that they seem really small as compared to other chairs.", 
    "Chair just what I expected. Nice small size. Fabric is nice linen-like fabric. Looks great. Thinking of buying another one.", 
    "Excellent chair. I have had compliments on it from everyone who has sat in it. A sales person came to my home yesterday and remarked that she had purchased a chair like it from Overstock. I told her that is where I got mine. Very happy with the purhase.", 
    "We needed a smaller chair for our motor home and we were having an awful time finding one with the dimensions we needed; just received this chair; fits perfectly int he coach and it is very nice looking and comfortable. A great purchase for the price.", 
    "Chairs are great...very heavy and easy to assemble. Fabric is a light linen and worked great in my client's Office remodel. Overstock does it again!", 
    "Nice chair, easy to but together & feels durable. I would recommend", 
    "This recliner is exactly what you see in the picture and it was easy to assemble.", 
    "It is exactly what we wanted. It fits perfectly in our bedroom.", 
    "I wanted a recliner that was pretty streamlined. This fit the bill. It is firm and supportive and does not take up too much space. If you are taller than 5'7\" the back may not be high enough to support your neck however.", 
    "a great find for my purpose. I used this in a small guest room. It is versatile and goes with any décor. I find it comfortable for sitting, reclining with some reading material or a nap without mussing the bed! I love it. The comfort level is very suitable...as a BR chair for a brief sit.", 
    "I love this chair so much that I am buying another one. It looks great and comfy. I combined it with a colorful pillow. It looks very stylish at a discount price.", 
    "At 5'8\" I find the back of my head is hit by the seam at the top of the chair back, so it is necessary for me and for my husband (5'11\") to use a pillow. Ideally there would be an adjustable headrest you could pull up into position, as you have in many cars. The pillow keeps falling behind the chair, so we will have to come up with a way to keep it handy. My husband has no problem keeping the chair positioned as he likes. For me the chair stays fully reclined (flat) only if I work at it. The chair usually comes to rest for me at a reclined position that is not fully extended, leaving my feet and ankles below the level of my heart. The chair is comfortable in width and fabric and support (as far as can be determined in 3 days).", 
    "I'm planning to have major back surgery and could no longer sit in my old recliner because I needed to get the pressure off of my spine, and it didn't recline back far enough. This chair makes it possible to recline comfortably in order to read, watch TV etc. while I wait for the two neurosurgeons to coordinate their schedules. It coordinates well with my other furniture and doesn't take up space in my small living room.", 
    "This are perfect for a smaller space. Very easy to put together, no tools needed, 5 minutes each. And they look great! I bought two for my bedroom and while they are on the small side still very comfortable for my 6 foot husband.", 
    "Very comfotable. Stay away from delivery times. Very inaccurate...", 
    "Wonderful. I ordered two of these chairs for reading chairs or watching the telly, They were delivered within a week, easy to assemble and very comfortable to sit in.--- quite surprised as both my husband and I are tall people and we wanted chairs that do not look over stuffed and bulky yet enjoy the comfort---this fits perfectly. Color is accurate. Quality is very good, not too flimsy, has a good weight, but not too heavy either.", 
    "Much bigger than I expected. Love the neutral fabric! Price is unbeatable.", 
    "Great chair. Comfortable and very easy to put together.", 
    "This chair was an addition to our redecorated bedroom. It is a great buy and fits the space and me. I highly recommend it to anyone.", 
    "not a good chair for the share bedroom makes a nice addition", 
    "READ THIS: We sent 2 chairs to a 70 year old recipient for comfort. The recipient was thrilled, then not...back and forth for 3 days. A friend, in that area went over to check them out, The verdict was \"very nice comfortable chairs, nice fabric, good upholstery stitching, good construction\". Overstock Customer Service was beyond helpful in this matter. Absolutely Outstanding. The chairs were returned. We were not prepared for such a disappointing outcome: Upon recipient learning the chairs were scheduled for pick up/return, the truth inadvertently came out. The recipient from the start, planned to sell the 2 chairs. Had also obtained a buyer. The Recipient is back sitting uncomfortably with 2 box's for leg support. ."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Darvis-Light-Beige-Fabric-Recliner-Club-Chair/7818805/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7818805/Christopher-Knight-Home-Darvis-Light-Beige-Fabric-Recliner-Club-Chair-ecd84ec5-4644-48f4-a9ad-ef761a8254ee_600.jpg"
  ], 
  "description": "Lay back, put your feet up, and decompress from a long day with\nthis fabric recliner club chair from Christopher Knight. The Darvis\nfeatures solid wood construction for strong support and stability.\nThe contemporary looking light-beige linen-blend upholstery is soft\non your skin and neutral enough to harmonize with many existing\ndecors.Light-beige linen-blend upholstery is easy to integrate into\n  many existing decorsSolid construction of the frame and feet provides stability\n  and durabilityFoot extension and a reclining back provide roomy and\n  superior relaxationMeasures 35.83\"H x 29\"W x 27.17\"L; fully reclined length is\n  42\"Seat measures 17.5\"H x 20\"W x 22.25\"DStyleCasual, Contemporary, Modern, TraditionalMaterialFabric, Linen, WoodChair TypeReclinersAssemblyAssembly RequiredColorBeigeFurniture Frame MaterialMetalFurniture PatternSolid"
}