{
  "name": "Christopher_Knight_Home_Tall-back_Natural_Fabric_Dining_Chair_(Set_of_2)", 
  "price": "EUR 192.00", 
  "reviews": [
    "I ended up returning these chairs, but want to take a moment to brag upon the INCREDIBLE customer service from Overstock. This was my first experience ordering from them and I will continue to come back because of the high customer service I received. In regards to the chairs...they are an equal match with the price. Definitely decent chairs, not of the highest quality, but the price is extremely reasonable...a 'get what you paid for' kind of thing. When I received the chairs, the cardboard backing on one of them was not flush to the back of the chair, so you could push the back of it in-and-out (basically, the chair was defective). I called Overstock and was amazed and how quickly they handled the return and kept me informed every step of the way. The new chair back came in, and after assembling one of them I just decided I would prefer a little higher quality chair. But at first glance the chair is nice looking, loved the color and high back. The stitching down the sides of the chair was a little off (not in straight lines) so just little imperfections like that is what made me decide to return them for different ones. The return was again, a PERFECT experience, quick and was refunded very promptly. I was very impressed with the whole Overstock experience and just placed my order for my new chairs!", 
    "I love these chairs!! We just bought a house and got rid of our old set (apt size) and have been looking for tufted dining chairs to go with a big round table I bought and painted, and these were not only exactly what I wanted, but the least expensive I've found. We ordered 4 and they came 2 days later which was amazing! My boyfriend and I put them together in maybe an hour or 2. It's pretty easy, just time consuming screwing in all the nails. I love the color because white white would most certainly get destroyed. The linen color is beautiful and we are planning on scotch guarding asap! They are sturdy and comfortable and I'm very happy!", 
    "Overall, very pleased. Color is great, love the height. The wooden frame underneath, on one chair was broke. Contacted customer service, and they promptly sent a new chair.", 
    "These were definitely better than expected, and very well packaged. I have these replacing four very uncomfortable wooden chairs that the previous home owners left. I like the high back and the buttons add a bit of class. The tall backs are very comfortable. A few days before I ordered these I was at another store (World Market) and saw very similar chairs (without the buttons) for $** each. They're basic but functional and when you have pets in the house, buying expensive fancy chairs is pointless. Assembly was easy just screw the seats to the backs (five screws) then two more screws for each of the two front legs. These were very well packaged too.", 
    "The chairs were nice. The fabric was not as nice as I would have liked & the chairs seats sat to low to the ground for the regular height kitchen table that they were going to use them with.", 
    "Good for the price and they look good but under neath the chair is a little cheap", 
    "Slight defects per chair ( stitching off, fabric not sewn tight enough) but overall, awesome ambiance for my modern/contemporary/informal dinning motif. (for the price)", 
    "Love them..They look very expensive and we'll made", 
    "I had two of these chairs and ordered four more for my big farmhouse dining room table. They are awesome for the price!! Assembly is super easy and they are remarkably comfortable and sturdy. I get so many compliments on them as they really pop against the dark table.", 
    "Nice looking chairs- fairly difficult to put together", 
    "I love these chairs. They look great with my recently purchased angled table from west elm and they were relatively easy to assemble and have been sturdy since I put them together. Great set for the price, just wish they came in different colors.", 
    "These chairs were very easy to assemble, and they look really high end while being very comfortable. I have these in my dining room, which is formal without being traditional, and these chairs are perfect for the space. Great value for money.", 
    "The chairs seem to be sturdy. Haven't set in them for long.They match my dark brown dinette table perfectly, so I hope they last.", 
    "I love the look of the chairs but the padding in the cushion is cheap and the seat cushion does not hold its shape after a couple of sittings. I'm hoping I can take apart and reclusion with something firmer. The current padding is so soft you can feel the seat frame. Would not recommend these.", 
    "These chairs are amazing! I ordered 12 for our dining room table and they are perfect! They are a nice size and color and very comfortable. Assembly was very easy. My husband and I put all 12 chairs together in about an hour. Delivery was impressive as well. The chairs arrived about 6 days after ordering and the standard shipping was free. You can't beat this deal as the quality of the chairs compared to the price is awesome!", 
    "I just received my chairs today and just love them! So reasonably priced and look very nice as the end chairs for my ******* ***** Table set. I already spent Alot on my dining set, and just needed 2 end chairs to complete my look. These chairs are a nice quality and super easy to assemble. I just Love the look for less!! Gotta Love Overstock and the Great deals that I have found!! Thank You Overstock!!", 
    "The chairs look much more expensive than they are. I love the high backs", 
    "Chairs arrived with stain on the back. However made it work.", 
    "Nice chairs, look good, light but sturdy. I had a little trouble with assembly, found some legs a little hard to put on.", 
    "These chairs exceeded our expectations. Great quality for the price.", 
    "Easy to put together and the color is exactly as shown.", 
    "Beautiful, beautiful, beautiful. Easy to assembly and sturdy. I would (& have) recommend these chairs to any friend or family member. Cudos!", 
    "Super easy to put together. They are nice quality and very comfy. Chic and clean looking. Exactly what I was looking for.", 
    "i did not buy these for everyday use but for guests. Easy to put all 6 together and worth the price", 
    "Good quality for the price. They aren't the most comfortable for daily use but are the perfect chair for our formal dining room. Color is true to listing. I would purchase these again. Plan on extra time to assemble they aren't the quickest due to multiple steps, some awkward, in the assembly process.", 
    "These chairs came on time and were very well packaged. Simple to assemble and not wobbly. The workmanship is fine and they add a touch of class at a bargain price. Second time I've ordered chairs from O and am very happy. They are true to the picture. Nice and narrow, too.", 
    "Ordered 6 of these chairs. Absolutely love how they look with our big dining table. Solid made and very easy to assemble. Nice tall chairs which will bring lot of praise. Very comfortable too. Wife loves them so much and they are reasonably priced. Very happy with the way overstock helped me with the purchase too. One of the best customer shopping experiences. Fast shipping.", 
    "I love these chairs we bought a 3 set of 2 and it look beautiful in our dinner room... The only thing that I didn't like is that the are a little rocky... Not sure if was the way that we out it together or a factory defect.", 
    "I purchased two of these chairs to use with an antique table. I was worried about the color, and didn't want \"white\" chairs, but the color is slightly darker than shown in the photo, what I would call a dusty linen. They are perfect. It took about 40 minutes to put both of them together, but they seem sturdy, and I am completely satisfied with my purchase. We did spray them witth a furniture protector after assembly. They aren't ultra comfy, but for our use, on the ends of our formal table, they will be fine for us or our guests.", 
    "These chairs look great in my dining room. Sturdy. Nice fabric. Nice details. Great neutral color. Can not beat the price!", 
    "These chairs were a dream from the moment they were delivered. Efficient design. Easy to read/understand directions. The fabric is linen so it's sturdy but very soft. Very comfortable to sit in. These chairs are a must!", 
    "I wanted some stylish, durable chairs for my glass kitchen that would also work with my young kids. We received the chairs less than a week after ordering them and I'm very pleased with my purchase. It took us a while to put the chairs together (neither of us are handy) but once assembled, they look really good in the breakfast nook and match my table perfect;y. You really can't beat the price for these chairs, and Overstock's shipping is super-fast as always. All in all, a good buy for us.", 
    "I had bought two of the chairs at a store for $XXX a piece. Was going to just buy two at a time. I saw these and they looked just like them. There were some slight differences, but nothing that anyone could notice. So I bought 4 of these to put with my other two. And they look great. Would recommend!", 
    "Just purchased 8 of these chairs for an extra-long dining table. They were delivered very quickly and came very well packaged. Easy to assemble and look GREAT! The wood on the legs is almost black and the linen is slightly darker than it appears (which was a relief becasue I did not want too light of fabric). Tall thin chairs - beautiful!!!", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-Tall-back-Natural-Fabric-Dining-Chair-Set-of-2/6033367/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6033367/Christopher-Knight-Home-Tall-back-Natural-Fabric-Dining-Chairs-Set-of-2-b3260e4b-931a-4a25-9315-bd3c70e3c5d8_600.jpg"
  ], 
  "description": "Indulge your living space with pure sophistication in the form of\nthese sensational tall-back dining chairs from Christopher Knight.\nFeaturing gorgeous linen upholstery and sturdy espresso-stained\nwood frames, the natural color scheme of these tufted dining chairs\nensure that they complement your decor with stylish ease. The plush\nseat cushions offer fabulous comfort, providing you and your guests\nwith hours of sitting pleasure. Set includes: 2 dining chairsMaterials: LinenFinish: Espresso stain wood finishUpholstery materials: LinenUpholstery color: NaturalNatural linen is beautifully neutral and can match any room\n  or decorTufted diamond patterned accents for added flarePlush seat cushion for maximum comfortSturdy hardwood frame for stability and years of useUseful in the dining room or any other room as comfortable\n  additional seating       Seat height: 19.5 inchesSeat dimensions: 18.5 inches wide x 18 inches deepOverall dimensions: 43.25 inches high x 18.5 inches wide x\n  25.5 inches deepStyleContemporaryMaterialLinen, WoodChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorOff-WhiteFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleUpholstered"
}