{
  "name": "Christopher_Knight_Home_T-stitch_Teal_Blue_Leather_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 152.04", 
  "reviews": [
    "The chairs arrived really quickly which surprised me. I opened the box and it contained four wrapped pieces - the back segment with the back legs attached and the seat section with legs and bolts inside and all wrapped in packing material. I loved them on site and was especially please the chairs were more blue than teal. Out of the four chairs I ordered, the stitching in two of the back pieces were quite a bit messy and looks bad so I will see about replacement pieces. One of the wooden pieces from a seat that fits inside the chair back was broken on arrival and can't be removed so I will have to get a replacement piece as well. All in all apart from the damaged pieces they were fairly easy to assemble, comfortable to sit on and I can't wait to have the complete set around the table... once I get a table!", 
    "I would recommend this product. I am very satisfied with the decision to make this purchase", 
    "Better that expected! Online I thought the color was brighter and darker than I really wanted but could find nothing better so I thought I was settling for second best. I was wrong! The color turned out perfect for my application and the chairs are much better quality than I expected for the price. Assembly instructions were easy to follow. This made one of my first O buying experiences excellent so I'll be back to purchase again.", 
    "I loved the look of the chairs. I don't think I could have put them together without my husband. He had to struggle because the holes weren't as accurate as they should have been. All in all I love the chairs.", 
    "Loved the chairs hopefully they will fix the holes lining up to put the screws in to fit", 
    "This was my first purchase at overstock.com but it was not my last. I have already made another purchase and I have been pleased with the quality as well as the promptness of the delivery!!!", 
    "These are not Teal, they are baby blue, almost powder blue. The color label should be corrected", 
    "really beautiful color and comfortable chair", 
    "These chairs are awesome! A gorgeous shade of seafoam blue (more blue than green) and look very high quality. They were also super easy to assemble, I did each chair in 10 minutes. Love!!", 
    "I love these chairs. It was easy to put together and the quality of the leather is superior. They are prettier than the photo suggests. I am so pleased with these chairs. I may get two more.", 
    "Difficult to put together so that the legs are even, but once they're assembled they look very nice.", 
    "Hated having to assemble. Durability remains to be seen. It works for our needs now but I truly wonder how long they will last. Doesnt seem as a solid as the dining chairs that i bought from **", 
    "These chairs went together easily and they are really nice. The leather is a soft teal and very nice quality. The chair is sturdy and does not rock, but I followed the instructions to a \"T\" when building. One chair leg arrived with a small chip in the wood. I called the customer service number and a nice woman picked up on the third ring. She said I would have a new chair leg within 5 days - no hassles at all. So, Christopher Knight furniture has excellent customer service and is high quality - even better than expected. Great purchase and will buy their furniture again.", 
    "We have had them a year now, color is true to picture and they have held up well.", 
    "Love these chairs. They are beautiful and easy to clean. I've had them for over a year now and look like new even with the punishment of 2 kids and a husband!", 
    "is a dream home come true", 
    "Nice chairs. Love the color. Description says teal but are closer to aqua.", 
    "Love these chairs brightens up my small dining room. Picture represents color perfectly. Will recommend to others!", 
    "Exactly as expected. Chairs have plastic knobs on the bottom to help protect wood floors.", 
    "What classy looking chairs comfortable also and perfect size", 
    "Looks elegant and comfy. I'menjoying my new chairs :)", 
    "They are sturdy and look very modern but with an eclectic flair. I get lots of complaints on them whenever I have guests over. Completely satisfied with this purchase.", 
    "Not the most comfortable. I bought these for our bedroom and office as an extra chair.", 
    "I love these chairs. Had them for over four months now.", 
    "We ordered these chairs to replace some really wobbly chairs we've had for a while now, and we wanted 6 matching chairs (we only had 3.5 - don't ask). These chairs were a top choice for us because of the price, the leather, the color and the reviews. They're slippery (a bit) but very comfortable. The leather is easy to clean, which is good because we have kids. They're comfortable to sit in - not too firm, not too soft - and a good height. They're also surprisingly warm (they're cool to the touch but warm up quickly, which is good because I'm always cold!) I'd highly recommend them. They're not hard to build either; I built all 6 in about 2 hours. Granted, we've only had them a few weeks, but so far they're working out well for us. I can see them getting damaged because leather is like that, but that's true of pretty much every piece of furniture.", 
    "Love them and they seem to be durable enough to last a good while. Beautiful teal blue", 
    "I put these in a beach rental 3 years ago and they still look new. love them.", 
    "Very elegant and well made. They are similar to the ones \\i passed up at world market for over twice the price....", 
    "they match to a T the 2 chairs I purchased 2 years ago. love them", 
    "These chairs were really easy to put together, came fast, and are perfect for us. We are using as desk chairs in our morning room. They add just the right amount of pop in color.", 
    "I love these chairs! They have held up wonderfully over the years and have been used by many people of different sizes. The color is as shown.", 
    "Beautiful color, comfortable and sturdy.", 
    "Very happy with both chairs that I received. Chair pieces were meticulously packaged. Received in a timely manner. Very satisfied and would recommend. The color in picture is the color I received.", 
    "I bought six of these chairs to put at my dining room table from *****, because I didn't really like any of the chairs they were offering there (at least at the price I wanted). I have these around a very dark brown/black table and I've gotten a lot of nice compliments on them. They were pretty easy to assemble as long as you follow the instructions, and I put all six of them together in one afternoon while watching football. As for comfort, the padded seat and back are great and I have no complaints at all. The color is very much true to the picture, so all in all I am very happy with my purchase.", 
    "beautiful blue. not sky blue, not teal, but very pretty !", 
    "These are beautiful chairs, just as pictured, and easy to put together. Not to mentio. A great price! I would highly recommend these to anyone.", 
    "Superb chairs. Easy to assemble. Great finishes. Very comfortable. Great value. I wish you had more colors.", 
    "I bought 10 of these chairs for our new dinning room. ( we're still building our home) so I'm not able to set them all out yet .... I only have opened one box to check out the color and quality . My 15 year old daughter put one together in about 15 mins ! They are a Tiffinay Blue color ... Love the sharp lines ... They are a little slippery for my little 8 year old but I didn't slide on the fabric at all. I like the shinny look they have. I thought they would look or feel cheap because of the low price .... they exceeded my expectations!", 
    "These chairs were easy to assemble, are very comfortable, and well made. We use them at a breakfast bar and thinking about buying additional for a dining table. We receive a lot of compliments on the color and style.", 
    "Harder to put together then I thought. Very n ice and steady.", 
    "It was easy to install. We love the color and style.", 
    "I bought these for a beach dining room. They are the perfect color for the condo. They seem sturdy and well built. I may buy 2 more.", 
    "These chairs were not comfortable. They lean too far back and the bottom is so slippery. I thought it was just me. I had a couple friends sit in the chair and you slip right out..it is like a joke! Returned. They look super cute in the photo. Would NOT recommend.", 
    "Just opened the box to find that one chair is missing both front legs. It seems ordering, waiting for shipment, then discovering items incomplete or unusable cancels out any \"convenience\" of ordering online. Now I have to invest time to get the first three items of my Overstock ever purchased replaced.", 
    "Love these. Fun color. Easy to assemble.", 
    "I love the look of these chairs, they were just what I wanted. However, they are a pain to assemble. We had to redrill some of the holes for the legs, and the legs were very difficult to level. Each chair wobbled until we loosened and re-tightened them several times each. Even then, the wobble is still slightly there in one of my chairs!", 
    "These chairs were just what I was looking for. They were easy to put together, comfortable, and very stylish.", 
    "Considering the price, these chairs are great and work well with my young family. I just wipe them off and they are cleaned quickly.", 
    "Beautiful color, good quality. Took some time to put together but was not difficult at all.", 
    "These chairs were a little harder to get together the holes didn't line up perfectly but really like them. Just got them so hope they will be durable.", 
    "Everyone who sees these loves them. Almost a Tiffany blue.", 
    "I rarely write reviews, however, I'm happy to do so for this product. The chairs are beautiful, the color perfect. They were easy to assemble and perfect with the shabby chic table, with white legs and a natural wood top. I have a small living area and kept thinking about what would work without overwhelming the space. I ordered four chairs. Two are positioned on either side of the table and two are at different points against the wall. Every person entering the room comments on the chairs and how beautiful they are.", 
    "they look great in my dining room.", 
    "love the color, design goes perfect with my dining table", 
    "I love these chairs! I wanted something that made a statement in my dining room. I got four chairs to go with a dark wood antique round table and they are perfect! Great quality, comfy and with the simple design, they add a subtle elegance to my dining room!", 
    "I am SO happy I purchased these! They turned out to be exactly what my informal dining room needed. The light aqua blue color is much prettier in person and they look as if they cost a fortune. I put them together myself in just a little over an hour. (I'm a 53 year old woman). Everything you need to assemble them is included. They even had an extra of each screw and washer just in case they were needed. I like that. The leather is very soft and smells wonderful. The chairs don't wobble at all.", 
    "Well made chairs that brighten our breakfast room.Very pleased overall with quality and appearance for a reasonable price", 
    "love color, chairs are sturdy, with out airms they are easy to get into at dinner table.", 
    "Absolutely beautiful chairs. Husband had a bit of trouble putting a few legs on, and of the four chairs we received, one leg was a bit too short, so had to put a little furniture pad on it to level. Despite that problem, I would wholeheartedly recommend the chairs. They look elegant and expensive, and the color is lovely.", 
    "Pretty but chair bottom is a little soft and doesn't feel like there is much support", 
    "Seemed too cheap to be true but the chairs are a great buy for the money. They look as pictured, were exactly what I was seeking and I couldn't be happier!", 
    "Am ordering another set - good quality for the price.", 
    "I bought these to use for a sweet heart table at my daughters wedding and later placed them in my kitchen. The color is bright and even and I get a lot of complements on them", 
    "Love these chairs. Fast delivery.", 
    "Easy to assemble. Look great. A leeg from one chair was missing a part - it was dealt with quickly and painlessly. Easy to assemble. Would buy again.", 
    "The chairs are beautiful and truly complement the decor in my mother's split dining room/living room. They were a surprise Xmas gift and she loved opening the boxes to see the chairs. The delivery was prompt, customer service was excellent when helping me to narrow down which style of chair would be the best.Overall experience with Overstock was excellent.", 
    "We really wanted to love these chairs, but we weren't able to. The color is a nice robin egg blue. The chairs looked a touch cheap put together, but the main problems were (1) They are a bit too small for anyone over 180 lbs (2) They are a bit short for most tables (3) They aren't comfortable for long periods of time, and (4) they are slick...you slide off easily.", 
    "I had been looking for chairs to put in a rental and did not want to spend the $175-$225 per chair price I was finding at my local stores. I wanted value and style. These chairs fill the bill. Their are very stylish, made of leather with top stitching. Very expensive look. Less than $70 EACH.", 
    "great chairs!! esp for the price! HI-quality! luv them!", 
    "look great, feel comfy, not oversized. and as an added bonus my little dogs can't jump on them to steal from the table. and cat hair won't stick.", 
    "the chairs are a nice color...in fact beautiful. the other reviews suggest that the nail holes don't match up, etc. this is true. i have sent the first set back and am awaiting set #2. they won't last forever, but for the price, I can add a little trendy to our look. i seriously hope this next set works!!", 
    "Beautiful color and style, look just as they do in the picture. Not so easy to put together as stated in other reviews - needed the help of my husband (I hate to admit), or maybe a power drill! Not the most comfortable chairs either, but ok.", 
    "Easily assembled, look great & quite comfortable.", 
    "Just put my chairs together. One was very easy but the other one was harder to screw in the bolts. Straightforward instructions and had all of the right parts. I really like them!", 
    "Quick way to bring color and current trends into the dining room. Love the fact that they are not too heavy!", 
    "using these everyday for over a year and they look brand new. (except for the one my dog tried to eat the leg off... lol)", 
    "Love, love, love these chairs. Great quality. Look just like the pic. Paired these with an espresso pedestal table.", 
    "Just as pictured. Easy to assemble. One minor flaw and Overstock immediately corrected the issue.", 
    "Not as bright blue as the picture; more of a soft greyer blue teal. Very pretty and well made. Comfortable and classy! Very pleased with how they look with some white leather chairs I already had.", 
    "THESE ARE BEAUTIFUL. NICE QUALITY. I'M NOT SURE I WOULD CALL THEM TEAL BLUE. THEY LOOK JUST LIKE THE CHAIR IN THE PHOTO.", 
    "Nice chairs for the cost. I would not say they are teal however they are exactly as they appear in the picture.", 
    "I bought these chairs for my dining room table. The color is very pretty and fits perfectly with my color palette in my home. It took me less than an hour to put the chairs together. The chairs are very comfortable and \"butt friendly\" as my friend would say. I am happy with the purchase.", 
    "Sharp looking chairs! I bought these two chairs for clients seating in front of my desk at my office to add color and they have accomplished this. Lots of compliments from everyone who walks into my office. Great quality. Shipped to my office quickly. Love them!", 
    "Love the color, style and comfort of these chairs. We bought them to add to an existing table and chairs. The color is not \"teal\" as the description states but it is similar to what the image shows. The chairs were relatively easy to put together however you needed to be patient while doing so. Arrived very quickly and packaging was adequate. I would purchase again", 
    "Could not be more pleased! We bought 8 of these chairs for our dining room. The color came exactly as pictured. Assembly took about 30 minutes each with the supplied Allen wrench, but everything fit together well. Amazing value, comfortable, and very stylish.", 
    "The chairs are beautiful. Not as bright as shown in the picture, but that's so difficult to determine as different video cards display colors different. Great buy!!", 
    "These chairs look great in our \"beachy\" breakfast nook. I read prior reviews and agree that the color is more of a light aqua than teal, which is good, since that's what we needed. The chairs couldn't be more perfect for us! Assembly was easy, although we didn't receive all of the washers needed. A quick trip to the hardware store solved that problem.", 
    "Crap - stitching came undone after six months of very minimal use.", 
    "Wonderful style and quality... I would have given a 5 star on the quality, except for the fact that the front edge of the seat is a little hard on the back of the legs (for those of us whose feet barely touch the floor and our legs fully rest on the front of the chair). Very fresh and cool color... not too bright. Robin's egg blue seems like a good descriptor of the color to me.", 
    "So happy that I went with these chairs! They are a \"tiffany blue\". Looks great with our black dining table. Also, the seat is nicely cushioned. I'm very pleased with them.", 
    "I bought 4 of these chairs to go with a wood table in my breakfast room. The quality is very good. Very soft and supple leather. I've had no loose stitches or flaws anywhere on these chairs. They go together very easily. Packed very well for transit, fast shipping! I love the fresh teal blue color.", 
    "I'm very pleased with the color match and it was delivered without issue or damage, not the easiest to assemble, but patience and good tools got me there with ease after the first try. legs have a slight uneven set, but that worked out after they were used ( sat in for a while)", 
    "I bought six chairs. As others have mentioned, the color online is different from the actual chairs. They are very attractive and really look nice with our glass table. They are also very comfortable. Of the six, only one had a slight issue with one of the legs and I'm working on getting that replaced. I was very impressed with the packaging. They took real care in shipping them. If they make a matching sofa, I would seriously consider getting it as well.", 
    "Very easy to assemble. Chairs look great and are super comfortable. We love our new chairs!", 
    "MY DINNING CHAIRS WORK PERFECTLY IN MY DINNING AREA AND ALSO FLOW WITH THE CLUB CHAIRS IN THE LIVING ROOM.", 
    "For the price, these chairs are very nice. Seem heavy and good quality. I have only had them for a short while and they will be put to the test in our kitchen so time will tell but like them so far. They look very expensive and the stitching is nice.", 
    "Great product, great material. Loved the color it looks amazing. Only thing is that the screws were stripped on some if the bolts. Had re order a new set of bolts so they could actually be screwed on correctly. That was an inconvenient and they should check for that before sending.", 
    "I was extremely pleased. I had been looking for days at stores for the right chairs and found nothing. They came perfectly packaged with all the hardware and excellent instructions. They look like $200+ chairs. Color is muted . Not one imperfection and no damage. Very substantial and comfortable. I would highly recommend.", 
    "I LOVE these chairs. They're beautiful and perfect for my little breakfast nook. They came quickly and I was able to put them together quickly. I haven't been able to get the legs all completely steady, so they rock a bit yet. But I think when I have a few minutes to adjust the bolt tightness on the different legs I'll be able to get them to sit flat.", 
    "We love the chairs, they look great in our dining room.", 
    "These chairs are great! The stitching is very strong and the finish on the wood is great. The chairs were packaged very nicely (the legs and hardware are wrapped in bubble wrap inside the chair bottoms - the fabric on the bottom velcros on and off) and there was no damage from shipping. They didn't take very long to put together. They are super comfortable and look great with my dining room table! Brings a splash of color to the dining room and kitchen.", 
    "Great value for the money, I bought 2 and then added another 2.", 
    "These chairs are great. The chairs went together easily and seem like decent quality. They are NOT Heavy duty chairs, but VERY comfortable. Pleased we did it."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Christopher-Knight-Home-T-stitch-Teal-Blue-Leather-Dining-Chairs-Set-of-2/6185336/product.html?recset=46972b2c-5cef-4292-a3c1-4a2b2738f603&refccid=QKLDIC7TSWG2ELKKAHAJ7FREUY&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6185336/Christopher-Knight-Home-T-stitch-Teal-Blue-Leather-Dining-Chairs-Set-of-2-5bb188f0-2290-468b-b8a5-6a86d0b37f0d_600.jpeg"
  ], 
  "description": "Bring your dining room to life with these brightly colored leather dining chairs from Christopher Knight Home. Each chair in this set of two features teal upholstery that brightens your decor and adds retro-inspired charm to every meal. Made with compact frames, these armless dining chairs fit easily around dining tables of all sizes.\nSet includes: Two dining chairsMaterials: Bonded leatherLeg Finish: Espresso stained hardwoodUpholstery materials: Bonded leatherUpholstery color: Teal blueTeal blue leather is bold yet elegant enough to match any room or decorEspresso colored legsPlush seat cushion for maximum comfortSturdy hardwood frame for stability and years of useUseful in the dining room or any other room as comfortable additional seatingDimensions: 17 inches long x 21 inches wide x 36 inches highSeat: 17 inches wide x 15.5 inches deep x 19 inches highStyleContemporaryMaterialBonded Leather, Leather, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlueFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleUpholstered"
}