{
  "name": "Chrome_5-light_Crystal_Chandelier", 
  "price": "EUR 146.18", 
  "reviews": [
    "LOVE this chandelier! Wanted to doll up our bedroom with some romantic and classey accents and this accomplished that wonderfully. Its gorgeous, perfect size for a bedroom and reflects light from our window beautifully during the day. We installed a dimmer with a remote control to it and bought dimming tear-shaped light bulbs to give it a great effect any time of day or night. I've gotten so many compliments on it. I've even posted a picture of it on Pinterest at http://pinterest.com/pin/224757837623856130/ Great buy, super satisfied, and it looks like a million bucks!", 
    "This was SUPER easy to put together- just time consuming...my only complaint is it did NOT come with the wire caps and elec.tape for one of the steps....so I had to run out to get that while putting together....I have shopped around and the price is fantastic. Saw a plastic version at **** for $100, and this is molded crystal and thus the prisms catch the light and reflect colors whereas plastic does not. Great value!", 
    "I love this chandy! I used it in my little girls nursery and it is a show stoper! I added white shades to it recently and it looks even better! It was pretty easy to put together and we had a professional hang it! check it out here... ********", 
    "We love this chandelier in our dining room which is part of our new big kitchen space. It instantly dressed up the space witout being overly elegant. Great light produced; we put dimmer on it and use that all the time.", 
    "I ordered this chandelier for above my grand piano. I wanted something that would give off a good deal of light, and it does! I had my electrician install a dimmer switch at the wall for times when I do not need 5 full 60 watts of lights. This is a very nice chandelier at an excellent price. It was not hard for my husband to assemble, although he is pretty handy with things like this.", 
    "This is a great chandelier for the money. It is not large but not small. I put it over my tub and put some cream shades on it to soften the chrome. It is truly beautiful. BUY IT! Very sparkly and is not plastic. Very nice.", 
    "What a pretty fixture! It looks great in our master bath. It's not ostentatious yet has enough bling on it to sparkle. It's width is about right for the room as well. Now for the cons (yes, there are cons even though I gave this 5 stars):The Instructions. If it weren't for the exploded diagram of the parts and how they go together (or closely go together), putting this fixture together would have been more dreadful. We've done a lot of DIY projects and with some patience and reviewing pictures and the diagrams, we were able to piece enough together to get it done. The wiring is one spot in which my husband's multimeter was quite helpful. The wires were not colored the way the instructions indicated they should be. With the multimeter in hand, we marked one of the wires coming out of the top of the fixture and he tested the ones coming out of the bottom of the fixture until he identified the one that had to be marked. We wired the lights from there. At the top of the wires where it be wired into the ceiling, there is a hook that attaches to the top of chain. Look carefully. It is hollow in the middle for a reason. Run the wires up through that hollow area. If you don't, you will eventually have to do that or the fixture isn't going to go up. The t-bar that attaches to the ceiling itself has a hollow spot in the middle of the \"screw nut\" (sorry I don't know what the right term is - it looks like a screw that is hollow and it fits in the very center of the fixture). You'll be pushing the wires up through the midle of that! This part is kind of not easy if you didn't trim the length of the wires as you'll have to push a lot of wire up through it. We figured it out. It wasn't that hard. If we assembled a second one, we could do it in half the time. Awesome fixture for a great price. It was well worth more than what we paid for it. Our master bath now has a bit of glitz that's not overly ostentatious. Thanks to the other reviewers for their candid reviews on the installation instructions. We definitely used the information to our advantage.", 
    "I love this chandelier, the picture doesn't do it justice. My husband and I put it together the other night and it really sparkles. It doesn't have a ton of crystals but it shines more than the picture depicts. I can't wait for our guests to see it.", 
    "Bought this lamp two years ago. I hung it in my bedroom for a bit of glamour. I still love looking at it every morning when I wake up. It is excellent quality for the price, the crystals are cut glass and the finish has retained its original shine. Easy to hang. Be sure to put the crystals on before hanging because its harder to do it later. Packaging was intact, all parts and pieces present. Finished product looks better than the picture!", 
    "I bought this for a 100 year old renovation to be used in my teen daughter's bedroom. Everyone who has seen it is exceedingly impressed. The assembly took about an hour in total (but my daughter, who is in a full arm cast insisted on hanging the crystals herself, which prolonged the project). When the lights were turned on, the crystals cut the light into many beautiful butterfly shaped \"rainbows\" that spread over the entire room. Quite brilliant.", 
    "This chandelier is BEAUTIFUL! It is so sparkly and will up the \"foof\" in your room. We painted our dining room lipstick red and added this chandelier. It's exotic and upper-class. The value for what you pay is outstanding! Thank you Overstock for this product. I LOVE IT!!! You must get this. It does take a little bit to put together. Even my husband with his big fingers and hands got it all together quickly. Stunning addition to your home!", 
    "I had an electrician come and assemble then install this chandelier in our master bath. When I walked in to see the finished product, my jaw dropped. It really sparkles and reflects light beautifully on the walls and ceiling. The crystals are heavy and clear, and the electrician said it was a nice quality piece. The photo doesn't do it justice - it's stunning. Note: the size is perfect for our bathroom, but, for my taste, it's too small for a formal dining room unless you used 2 (on over each end of the table.)", 
    "This chandelier was finally installed today after sitting in pieces on my table for over 3 weeks. It is beautiful, especially for the price, but not for the faint-hearted. I had to hire an electrician to help me finish putting it together and hanging it in my dining room. There are many extra crystals and parts included plus a bonus is that the \"candle\" parts have a choice of a modern chrome finish or a more antique looking gold candle finish.", 
    "I wanted something fun and funky with drama in a stairwell. This chandelier did the trick. I was on a quest to find something that was not too expensive. I could find acrylic but this light gave me crystal in the same price range. Of course, I did have to put it together for the electician to hang. It was not that hard. I was able to hang it eye level to work on it and that was a huge help. One point to remember, at the bottom of the fixture. You need to attach the white wires to one main wire and the black wires to the other main wire that has writing on it. The writing on the wire is not clear or dark. It took longer to find the writing on the wire than it did to put the entire chandelier together. Once you get the hang of putting on the crystals the process goes quickly. Love the sparkle.", 
    "Beautiful chandelier. I get compliments on it all of the time. True elegance without too much fuss. Assembly took a little bit of time, but relatively easy.", 
    "I bought this Chandelier for my master bedroom and it is perfect. It was easy to put together and easy to install. The crystals are so beautiful and really sparkle when its lit. I am so happy with this purchase. It gives my master bedroom a high end look without the high end price.I love to see a product in a real space before buying so below is a link to my Pinterest which has a picture of the Chandelier in my master bedroom. Hope it helps someone make their decision :)https://www.pinterest.com/pin/A-aJgwAQQB0G8Smd_5YAAAA/", 
    "Took a while to put together. Right down to wiring each arm to the stem. I've never done anything like this before, but I actually accomplished it! Would have given it an \"excellent\" rating except for the fact it took hours just to assemble.", 
    "This is a sparkling beauty in our old home. It is really a statement piece. It's easy for a person like me, with no handyman skills, to assemble. It comes with two sets of \"candles\"... One set is silver and the other is white...so you can truly customize it for your room.", 
    "I've had my chandelier for two years now, and I am as enthralled and estatic about it as the day I first received it. It looks exquisite, it makes my bedroom look very elegant and its a joy to see when I first wake up. I am very happy with it. It was relatively easy to put together, and it came with extra crystals. The crystals are real. The metal is chrome.", 
    "I bought this chandelier for my master bedroom and it gives just the right amount of sparkle without being too big or ostentatious. I love it.", 
    "Love the chandelier - people think I paid 3 times the price for it - looks expensive", 
    "This chandelier is gorgeous. The light catches it from all different angles and it adds such a nice elegance to any room. It does come in many pieces but it is worth it. It's a nice little project for two people to put together. I would recommend someone with experience installing it. Thankfully that was my husband :)", 
    "Absolutely worth every penny, the prettiest light I have in my home!! So sparkly, plenty of crystals and the quality is great!!", 
    "We love this Chandelier, it was recommend to us from a friend. This is my first purchase with Overstock and we are very please with the outcome. I bought this for my daughter's room. It was more than perfect!!!! beautiful and light up her room. Great price too. Everyone that enters the move just ohhhh and uhhhh.", 
    "diameter of this is perfect for my 13x15 foot bedroom. I hung it 7 foot above the floor and use a lower wattage clear bulb. It's gorgeous.", 
    "Very pretty .... lots of pieces. ;') Get comfy to add the bling!", 
    "This is a delightful touch to our main bathroom. Not over the top, it just makes an elegant statement among both polished and matte finished sliver in the room. If you want to add a touch of elegance to a room, this is the one.", 
    "This chandelier is even more beautiful in person. I wish I had another place to put one. It took a while to put together, but once it was up we could not stop looking at it. Excellent value - I would recommend this to anyone interested in having a high value look at a reasonable price.", 
    "Easy to assemble. Be sure not to do it after getting a manicure. Attaching the the crystals are like attaching keys on a key ring.", 
    "This chandelier was part of my daughters bedroom makeover for a Christmas morning reveal. It really just completes the room. It is gorgeous and definately steals the attention. People walk in and gasp. It's the prettiest one I've seen. You won't be dissapointed!", 
    "I absolutely love love love my new chandelier. I put this piece in the office and it looks amazing. There hasn't been one person over to my house who seen it and didn't comment about the beauty of the chandelier. One of the glass dishes did come damaged and the part was replaced without any problems by Overstock. It took awhile to get the replacement piece in because it apparently came from Hong Kong. Assembly is required and a bit time consuming but I was so excited about the quality of the chandelier that the assembly didnt bother me. Great buy! Go ahead and purchase it!", 
    "This chandelier is truly one of the best things i have purchased for my house under $200. If you dont tell your friends how much you paid for it, they will def think you splurged. It's gorgeous and not very hard to put together. Dont hesitate, buy it !", 
    "We were very pleased with the crystal chandelier. The price was far lower than what we had expected to pay, the description was accurate and the light looks gorgeous in our bedroom. Oh, it was packed very well and arrived on expected date. Thank you.", 
    "Chandelier is so awesome. The crystals are real glass and not acrylic. They sparkle making the entire room glow especially when the sunlight shines on it. I have it in my bedroom converted to a craft room and my 3 sisters are all ordering one for their home. For the price, this is an awesome chandelier. Little time consuming to put together but oh so worth it! This way you enjoy looking at each piece so I'm very pleased with my purchase. The chrome has a beautiful finish that looks very classy and not the dull cheap finish. I would recommend this product to all; you are getting a great deal for the price.", 
    "i bought this Chandelier for my Parent's 50th Wedding Anniversary. My Mother always wanted one for her kitchen. I read the reviews and for the price i decided to get it. It is beautiful !!!!!", 
    "I am extremely happy with the chandelier. I have shopped for a chandelier for my bedroom for months. The crystals are real crystals... not plastic like some out there. I placed the chandelier in my bedroom, it can go in any room, it is very elegant and chic.", 
    "We put this up in our master bedroom last night and I couldn't get my eyes off it! Definitely biggest bank for the buck! Even hubby agreed that I did a good job in picking this one! =) Installation is not that bad, only takes time to hang the crystal one by one. I just LOVVVVVVVVE it!", 
    "It is an overall smaller chandy-I have a fairly large dining room and it is a little small. It seems smaller than measurements. But it is cute for a smaller room. Not that easy to put together either. Not the best quality, but you can't tell when it is hanging. Cute, not great.", 
    "This chrome and crystal chandelier is very transitional in that it is a traditional style chandelier yet the chrome candlesticks add a contemporary flair. It is \"restrained\" in feel and not over the top and therefore, is smashing in my country kitchen. When deciding how low to hang it and before all the crystals are added, don't forget that the crystals at the center of the bottom will add about 6 inches.", 
    "This a a wonderful Chandelier. I put it in my dining room. My house was built in the early 1920s and the chandelier looks both vintage and modern. I love it! It is not too gaudy, nor is it too simple. I was afraid to put it together but it was just busy work, it wasn't difficult to figure out. I would highly recommend this piece!", 
    "I was a little skeptical about ordering this chandelier since the price was so reasonable, but I am not disappointed. It is a beautiful items and looks like it cost a lot of money. The crystals are real (not plastic) and the entire chandelier feels expensive. I have had many compliments on it and several people that are planning on ordering it for themselves. I am using it in a smaller dining room and it fits the scale of the room perfectly. Great item!", 
    "I love this because it is very simple and yet elegant. It takes a while to assemble and hang but once you put all of the crystals on it goes pretty fast. I did not want to call an electrician so my husband and I did this together. It took us three hours including the putting all the crystals on and the fact that we had it wired wrong the first time! It was way less scary than they made it sound in the directions. It gives the time as eight hours for inexperienced people and well lets just say my husband and I are those inexperienced people and the actual hanging time was about an hour.", 
    "Beautiful with lights on but pain to link all the little keep chain circles to the crystals.", 
    "Looks great in my daughters bedroom!", 
    "This chandelier is so glamorous and beautiful! I bought it for above my dining room table. Assembly was pretty easy considering its a crystal chandelier. It's simple and elegant. Love it!!!", 
    "the chandelier is beautiful and easy to put together. i am a bit confused about the mustard colored covers for the candle bits. keeping them just in case i get tired of the chrome versions. i would spray paint them for sure before using though :)", 
    "This chandelier is absolutely stunning and makes for a beautiful statement piece in my \"glam\" farmhouse dining room!", 
    "You will not be disappointed!", 
    "Just perfect love it looks great in my dinning room", 
    "I put it over a marble island and it looks really beautiful!", 
    "The chandelier is beautiful. It would help greatly if the prisms had hooks on them, they were very hard to attach.", 
    "This is such a beautiful light. I unfortunately have to return as it is too large for our room (hangs low). Its beyond gorgeous!!", 
    "The chandelier has to be put together, it's not that hard but it's time consuming. It is beautiful though...", 
    "very pretty and affordable i put it over my kitchen sink but i think its more a fixture for a smaller dinning room or master bedroom", 
    "Hanging in my bathroom......no problems with rust.", 
    "Like it very much.Simple and elegant.", 
    "It took me about an hour to put together, but it was well worth it. The hanging pieces look and feel heavy which made it look a lot more expensive than what it really is. Considering buying another for my bedroom as this was hung above our dining room table.", 
    "LOVE LOVE LOVE this chandelier! Looks like I paid a lot more for it. Not too over the top..perfect for our master bedroom :) Easy install", 
    "Purchased for my daughter's room. Moderate time to assemble, but well worth it. So pretty. Puts of tons of light. We originally did 60 w bulbs but they were too bright. 40 w are much better.", 
    "This chandelier looks amazing in my dining room. I could not be happier. Plus an excellent value!", 
    "I love this chandelier so much I bought another one to put over my bed. AMAZING value for what you get - this looks so much more expensive than it is.", 
    "Beautiful chandelier! Perfect for our daughter's room", 
    "Very pretty when on or off. Lots of pieces to put together but well worth it.", 
    "beautiful and adds elegance to the bedroom.", 
    "I chose this chandelier for my kitchen. And since the kitchen is the first thing you see when you enter our home it makes a statement of elegance and sets the tone for the rest of the house.", 
    "This is by far an absolute beauty and for a reasonable cost. Have shopped around and found similar prices but nowhere near same value in quality. Real metal and crystals, good design and sturdy structure. My only complaint is that there were some minor defects ( one of the loops that holds the Crystals in place was missing) but was able to improvise with a paperclip. Also a couple of the Crystal were damaged, but there were extras provided. It was the perfect touch of elegance to complete my master bedroom. What would make it even better, is if you can install a dimmer to capture and amazing ambiance. Would definitely recommend as a great buy!!", 
    "Very low quality product, looks are deceiving.", 
    "This looks amazing in my master bedroom! It is elegant but mixes well with my distressed furniture. It took a couple hours to completely install and assemble the crystals, but it was totally worth it.", 
    "Got this for my master bedroom and it looks even better in person.", 
    "Chandelier looks incredible when up.as some other reviewers said looks more expensive than the actual price. But putting it up can be a challenge. Directions are really bad", 
    "Directions were easy to read. It was exactly what I was looking for.", 
    "Looks way more expensive! Prettier than the picture! Everyone loves it Christmas Eve!", 
    "Looks beautiful and true to picture. Looks great when lit.", 
    "I have an old NYC apartment with a strange middle room thats not right for anything but i thought it needed a chandelier so I found this one and it's genius. it looks like it should cost ten times more than it does. Now, my odd useless room is the chandelier room, perfect!!! easy to assemble and install (but you need an electrician or a clever friend).", 
    "We have this in our daughters room, it is a showstopper we love it and so many others do as well", 
    "This chandelier hangs in our dining room with a large reclaimed wood table and upholstered chairs. Absolutely love the rustic table with the glamorous chandelier. Looks far more expensive than the price.", 
    "Not enough words to say how much I love this chandelier. It was exactly what I wanted.", 
    "Excellent light ....a great price!!", 
    "This chandelier is absolutely beautiful! Assembly was easy but you do need electrical know how to hang them. I bought two and love them.", 
    "Just as pictured and so pretty....love them", 
    "Looks much more expensive than it is. Fits Amazing", 
    "Beautiful, I get so many compliments!", 
    "Have it over our dining table and it looks very elegant.", 
    "Very hard tobput together but gorgeous", 
    "Perfect for the nursery and great price! Lots of effort to put together though.", 
    "This chandelier is gorgeous it was easy to put together", 
    "Gorgeous. Thank you Overstock for another good experience,", 
    "Great product at this price level.", 
    "I have it above my bed and it is stunning, I love looking at it when I wake up, it sparkles and looks glamorous !", 
    "This chandelier has added so much to my space. I put it in my office and I love the elegance and sophistication ti brings to the room. My only comment is that a good deal of assembly is required for this chandelier. We made it a family event, but if you don't have help assembling along with someone to help hang the chandelier. It's not an easy road to get there, but once it's up, it's breathtaking. Well worth the effort", 
    "Great in my daughters room. Easy assembly.", 
    "This is really cute in my sunroom although I wish that I had gotten a larger size. Not your fault!", 
    "Beautiful, elegant. Many compliments. Recommend.", 
    "Love it! Bought 2, 1 for over master bath tub and 1 for master closet, itgoes over an island in the closet. Both look very elegant.", 
    "This light is beautiful. Prisms are real glass, as opposed to acrylic. The light is a great addition to our home.", 
    "its very elegant in our dning area", 
    "absolutely stunning and the price is right. Assembly is time consuming, and it might be tricky to clean, but I have had so many compliments on it.", 
    "makes me happy every time I walk into my bedroom!", 
    "happy with purchase; fixtures look good and they appear to be well-made.", 
    "Fabulous chandelier! I'm so in love with this gorgeous chandelier. It looks expensive and has a romantic yet chic vibe. I've attached a photo I posted on Pinterest. **************************************", 
    "I bit of a pain to put together, the jewels aren't on very sturdy especially since this product is being used as an item at events and will be moved often. The arms don't fit on straight so it makes it look a little cheap. Price is excellent, but you pay for what you get.", 
    "Love this chandelier. I didn't like having to put it together, but the finished product was fabulous.", 
    "nice size for a small dining area. just like picture. semi easy to assemble.", 
    "This chandelier is even more gorgeous in person! I bought 2 to hang in our master closets and every one loves them!", 
    "This lamp looks absolutely beautiful, excellent value for the price. Quality materials", 
    "Easy and fun to assemble, extremely well packed, looks awesome.", 
    "Elegant, beautifyl piece. Just enough Chrystal do make a room shine.", 
    "This Chandelier is Elegant and Beautiful. Very inexpensive for the quality that gives your home. My friends and family has walked in my home and noticed it right away because of the sparkles and glam it brings to your room. Love it.", 
    "I purchased this for my master bedroom and love it!!I had a hard time finding a matching one for my master bathroom so I just purchased the same one for my Master bath and they look amazing!!", 
    "Very good look for classy but not goddy crystal chandelier. We used it in a medium sized bedroom. Very easy to assemble for a crystal chandelier. Arrived in good condition. Was easy to hang for anyone with some handyman skills. We moved into a different home and are seriously considering using the same chandelier in this house due to the great bang for the buck of this product.", 
    "My chandelier was installed 2-13-2015 in my small dining room. I was totally impressed with the elegant look of this chandelier. It is a charm! Can't stop looking at how it sparkles! And the rainbow colors reflected! My daughter, son and grandchildren were equally impressed.", 
    "My daughter wanted something special for her bedroom and this is definitely it.I had an electrician install it and was planning on helping him to attach the crystals as others had said it needed some thought, but when I came back upstairs, he had it completed and didn't need any help! It looked amazing. The package comes with a pair of white cotton gloves, so that you don't get finger prints all over the chrome when you install it and they work a treat. We get many compliments from visitors when they see it. Super fast delivery and very well packaged.", 
    "It was really hard for me to pick a chandelier but i'm glad I went with this one. It makes my entire open concept living/family room. I will say this came in a million pieces and took forever to put together, you might want to get/hire someone to help but it's totally worth it. Bigger and more beautiful than I expected, i'm obsessed!!!!!!", 
    "Much prettier in the picture", 
    "After spending hours and hours looking online at chandelier options, I finally came across this one. In comparison to all the others I looked at, the style of this one fit the bill. It is not too fussy and not too plain; it has just the right amount of crystals and details. The price was also a big selling point for me. The product arrived quickly and well packaged. When I took it out of the box, I was dismayed by the finish on it. It was a very shiny silver that in my opinion, made it look a bit cheap. I decided to spray paint the body of the chandelier a very beautiful color by *** called Oil Rubbed Bronze. I am really glad I did as it sets off the fixture and makes it look more high end. Spray painting a chandelier does take a little work, but anyone can do it. Just be sure to search the web for pointers before you get started.Another big thing to note is that the chandelier arrives in many parts. Actually assembling the body of the fixture and wiring it was a pretty big job. My dad, who is very handy, happened to be visiting at the time...thank goodness. If he had not, I could never have assembled and hung it myself. Actually putting the crystals on was not that bad and something I more or less did on my own.This chandelier looks wonderful in my bedroom and in the end, I am thrilled with it.", 
    "I saw this and was drawn to the beauty and price. Another reviewer had posted a picture of it on Pinterest in her finished bedroom. Seeing the actual chandelier hung in her bedroom gave me an idea of the size in the room and it looked stunning. I recently had a party and those who saw my bedroom said it looked like a bedroom in a NYC penthouse and all loved the chandelier! Great value for a beautiful light... You won't be disappointed.", 
    "I have not wired this yet but the assembly was super easy and it turned out so beautiful. It is a great size and I like forward to getting it set up in my front hall. It seems to be high quality.", 
    "This is exactly what I have been looking for. I did not want a 'stuffy' chandelier, and the shiny chrome on this fills the bill. The cut glass crystals are well made and reflect light beautifully. It is very well made. I absolutely love it! My only suggestion to anyone who buys one is to hook the crystals on before hanging the fixture. Will make it a lot easier.", 
    "I can't stop staring at my new chandelier! Placement of the crystals is somewhat time consuming but easy to figure out by looking at the picture in the instructions. I had an electrician hard wire and hang the chandelier for me before I hung each crystal. I have a huge bedroom with very tall ceilings (I think maybe around 12 feet) but the chandelier looks beautiful with just a bit of chain hanging. It is just the right amount of sparkle!", 
    "I am very pleased with this chandelier! It is a nice blend of traditional and contemporary with the chrome body and crystal pieces. I did not use the candle covers, but chose to leave the \"candles\" with the chrome look. A few of the crystals were scratched, but when I sent an e-mail to the address supplied (there is a phone number, too, but they prefer an e-mail, as there is quite a time zone difference), they were quick to reply. I received replacement crystals within a few weeks, which I was pleased with, as they came from China. I have received many compliments on the chandelier! With the capability of five 60-watt bulbs, a dimmer is a nice addition.", 
    "Love this chandelier! Has a classic look with cut glass but the chrome seems to give it a modern twist.", 
    "I actually bought this chandelier based on the wonderful reviews it had, we're remodeling and shame on me for not opening up the box to assemble it. Last night I did that....talk about cheap cr-p, I even cut my finger, the metal is so sharp. Wrote to overstock....of course I'm over my return date and won't know how much of a refund I will get until I send it back and they examine it, maximum of 80 percent of what I paid. I'm going to donate this to the local charity shop, I have to be honest, I'm wondering if I even want to shop at overstock again :(", 
    "This chandelier is stunning and what a great value for the price!! I'm thinking of getting another one!!", 
    "Love it! Perfect for adding a glam look to our master bathroom. It looks great with the chrome and nickel fixtures. Great value. We placed it where a can light was by using a simple can light conversion kit.", 
    "This chandelier is absolutely beautiful. I couldn't be happier with this purchase. It looks gorgeous in my newly remodeled bedroom. I completely recommend this if you are looking for a chandelier.", 
    "This is such a stunning light! It looks so glam in my daughters bedroom. Great quality, feels very heavy, not plastic feeling. Very pleased and definitely recommend it!", 
    "When choosing this product I relied heavily on the reviews and I am so glad I did. The reviews were so accurate and I couldn't be happier with this chandelier. It is so beautiful without being over the top, not too big but big enough for the space I have in mind. My husband put it together which was a little fiddly and one of the wires inside the light wasn't connected so at first it looked as though one of the 5 lights didn't work - but this was easily fixed to my relief. This is the second time I have used this website and I am so impressed with how quick delivery is, it's a very easy site to use, I love it!!", 
    "Without the crystals it looked a little cheap, with the crystals it was totally transformed and became a very elegant chandelier.", 
    "I wanted a new light fixture to dress up my dining room. It's a small room and I have a 3.5 foot wide table and this chandelier is perfect. It's a statement piece. I have help assembling, but it only took about 1 hour and love the way it looks in the room. It's the perfect value for the price!", 
    "Easy to assemble. Even more GORGEOUS in person!!! Looks like a million bucks! GREAT value because this chandelier looks more expensive than it really is!!! I have this over my dining room table, and it lights up the room very well!", 
    "All of the other reviews are correct -- this chandelier is a beauty. It is hanging about my new pedestal tub and looks amazing. The assembly was not too bad. My husband and I put it together in about an hour. Very happy with my purchase.", 
    "I have now purchased 3 of these chandelier as they are absolutely glamorous but the chrome gives it a little bit of a modern twist. They are easy to assemble, just need a little time to put on the crystals. Once they are up they are a showpiece!", 
    "We hung two of these chandeliers over our kitchen island and they are such statement pieces! They are really beautiful in person and not difficult to assemble. Great look for the price. Adds the \"wow\" factor we were looking for.", 
    "I read so many positive reviews for this chandelier that I ordered it immediately without reservation. It was so on target. Exactly as specified. Extremely happy with the finished product. My husband put it together and installed it with no problem. He did say the instructions left something to be desired. will most likely purchase another one for my daughters condo. You really can't beat the price.", 
    "Initially purchased this fixture to hang in a master bathroom over the soaker tub. After assembling, the fixture was so much larger and beautiful than expected that my boyfriend recommended hanging it in the foyer. Great call!!! Talk about a standout piece in my foyer! Completely pulls it all together!!!", 
    "Very pretty light fixture Mutiple uses in the home. I put mine in my bedroom but would work in a dining room.", 
    "A Gem! You won't be disappointed! Great Value for the dollar.", 
    "I am very happy with my purchase and would definately purchase it again. A great deal of bling for the kitchen. It would also be great in a dining room, entry, or bedroom.", 
    "My husband and I LOVE this chandelier. We put it in our master bedroom and it looks Amazing!!! We don't often have people touring our Master bedroom, but when they have, they always compliment and comment on it. It makes the room feel elegant and I would recommend it to anyone. As a side note, my husband was able to put this together himself- I think he has an aptitude for that kind of thing though. I would never have been able to do it myself. We hooked it up to a dimmer switch too, which I highly recommend. Otherwise it is VERY BRIGHT. Which you may or may not want...", 
    "This is a fantastic fixture. It sparkles and looks very expensive. As a custom home builder, we buy lots of lighting. This did not disappoint and we will definitely purchase another one.", 
    "This chandelier is amazing! So beautiful and classy. Was a breeze to put together, and my husband hung it in no time at all. Its a steal for the price!", 
    "A great looking chandelier, materials are pretty solid and very chrome shiny, Not too difficult to assemble, but do have an electrician to hang it for you. Doesn't include bulbs!", 
    "I was looking on many sites for a chrome chandelier. This one was among the least expensive I found and it is gorgeous! The best part is it comes with many crystals - so you can decide how dressy or simple you want it to look by either adding all of them or leaving some off. I have mine in my kitchen and it adds the perfect unexpected touch of sparkle!", 
    "Sure, you have to assemble it, but it just takes a little patience, folks. We had an electrician install it with a dimmer in our new little dining room of an older home with wood floors, and arched doorway and ultra-pale gray walls; had to use a ceiling medallion to cover space from previous fixture. It's cool and sparkly, not too contemporary or too old-looking. It's just perfect.", 
    "This was a bit of a drag to assemble (had to attach all of the crystals) but it's really a beautiful light. I get tons of compliments on it and I think it was a really great value for the money.", 
    "A bit time consuming to put together but well worth it. Chandelier looks expensive. A real stunner!", 
    "I bought this for my daughter's room. We were doing some minor re-modeling and this chandelier transformed her room into a gorgeous and luxurious place. It played off nicely with a silver framed mirror above a white dresser with silver/chrome hardware and knobs. So worth the price. I plan on buying another one for another home I have recently purchased.", 
    "I just installed this chandy over my master bathroom garden tub. Its looks so elegant and high end. Everyone immediately comments on how beautiful it is, even my friend's husbands. My contractor thought I was a little crazy when I told him it would be installed in the bathroom. He admits its a \"wow moment\" in the house and couldn't believe what I paid for it. It takes about an hour to put together, and be mindful the crystals are different sizes when you're attaching them to ensure it looks symmetrical. I 100% prefer the silver caps for the 'candlesticks'. Its great that they give you two sets to choose from though. The cups under the candle lights are actual glass and very pretty. Surpassed my expectations. Would definitely recommend!", 
    "I tightened the light arms before hanging the fixture but when we installed it, the arms moved. it is a little hard to get them tightened at that point, but they stay in place while a little wiggly if nobody bumps it. Also, it is rated for 5 60 watt bulbs but when I put the last bulb in it blew out twice. it worked fine with a 40 watt. don't know if problem was the fixture of my homes wiring???", 
    "I was looking for a chandelier for our bedroom for some time before I found this one. The price was far better than anything I'd found, although I'm always hesistant to make a big purchase without seeing it in person, but the reviews sold me. Once the chandelier was installed, I was thrilled. We had a professional install it, so I can't speak on the difficulty of installation, but it really is a stunning piece that draws compliments from everyone who sees it! It looks incredibly high end and gives a really classy look to the room. I'd definitely recommend this product", 
    "I am so happy with this purchase. It does need to be assembled which isn't fun but the directions are easy and it doesn't take too long. It looks amazing, the crystals are glass instead of plastic which is what I wanted. You can't go wrong for the money. It is a larger chandelier so it definitley needs to go in a larger room. I purchased this for my nursery.", 
    "I love this Chandelier! It looks gorgeous in my eat in kitchen! Thanks Overstock.", 
    "Love, love, love my new chandeliers. I bought the 5 and the 3-light fixtures and hung them in my master bath. I wanted a little \"bling\" to add to the otherwise neutral looking bath. These lights are a great bargain and I love looking at them whenever I cut them on. One of my best buys yet!", 
    "All parts are crystal and chrome (no plastic or cheap parts). Everyone comments about it at my house and thinks it's very expensive. Don't be afraid of the assembly - it's really not that bad. I was surprised to see people had trouble. The instructions and pictures are very clear.", 
    "I love this chandelier, its in my office where I can see it everyday. I have always wanted one and never had ceilings that were tall enough until recently. Not too big not too small, its perfect for the look I was going for and the price was terrific", 
    "Excellent small chandelier for small bedroom. Took an hour to install but worth it. Beautiful.", 
    "This fixture is stunning in my master bedroom. I still can not believe the light only cost $126. It is so classy and sophisticated without being overly fancy!", 
    "We did a kitchen remodel and I ordered this for the dining room to match other light fixtures. It was perfect. It adds a touch of elegance without going over the top with too much glitz. Doesn't require a lot of up keep either. I love it!", 
    "fabulous in any room. looks expensive and adds elegance", 
    "Beautiful chandelier! I hung this in my home office and get lots of compliments.", 
    "Absolutely love it! The crystals are heavy and of good weight. The item seems to be made very well. The only complaint I had was that the directions were not great and the wiring portion if you are not an electrician was tricky. In the end, I had my handyman who came to put it up redo the wiring, but it looks spectacular and throws plenty of light. Absolutely perfect for my nursery! Overall I am extremely pleased!!!!", 
    "I have this chandelier in my kitchen over my eat in space and it is a such a beautiful focal point. It takes some putting together, but it is not too bad. The crystals are real glass and are beautiful. When the chandelier arrived some of the crystal cups were broken, but I emailed the company (in China) and got an immediate email response and 2 weeks later the replacements arrived. Great ending to a downer situation. Everyone who comes over notices this chandeliers over the other more expensive fixtures in the house. Great value for the product. If you are looking for a shabby chic chandelier this is your answer.", 
    "The directions are horrible, so my husband and I put it together with directions and the picture from the site. It's super easy, but takes some time and patience to figure it out. Oh, is it worth it though! This chandelier is STUNNING! I love that the silver is polished, and reflects all the crystals, which are so sparkly on their own. I cannot say enough good things about this beauty!", 
    "I absolutely LOVE the chandelier! It was a little intimidating to see all the parts that needed to be put together, but it was easier than it looked. The instructions were easy to follow and it didn't take long at all! The crystals are acrylic, but you would never know it unless you touch them, they're very realistic looking and sparkle nicely when the light is on. It looks amazing in my dining room, the size it perfect, exactly the dimensions listed. I'm very satisfied.", 
    "The chandelier is beautiful I love it. I recommend it. Fast shipping too", 
    "LOVE this product, it is absolutely stunning and completes our space. However, I almost died when I saw the instruction \"pamphlet\". Are you kidding me? Not only was it poorly written and stapled the wrong way (intro in the back, poorly photocopied and with the text cut off) it looks like a 5 year old assembled the instruction \"pamphlet\" as a joke. SERIOUSLY? If it weren't for my smart AND handy engineer husband, I could have never wired this together myself. I would have put together all the chrystals and it would have sat on my table for ages.", 
    "I have to say I am so impressed with this chandelier. It is stunningly beautiful and so affordable. After reading prior reviews, I was prepared that assembly would be difficult. Well, I'll attest that YES it is a pain to install. If you can get past that part, I promise you'll love it. I find myself walking into the room several times just to see it again! A suggestion that adds that extra touch is to add a ceiling medallion. I got this one from Lowes for $18. http://www.lowes.***", 
    "It looks very nice, but will not pass for one that is thousands of dollars. We found the instructions to be very unhelpful and confusing, they should definately be re-written. Once you give up on the instructions and start to figure out it yourself, it's not that difficult to put together- but it is time consuming. You should put about 2 hours aside (or 1 hour for 2 people) to do it from opening the box to being completely finished. You do need some electrical knowledge- my husband has basic abilities and was able to do the wiring part while I did the assembly.", 
    "This chandelier is absolutely gorgeous. Bought it for my mother-in-law for Christmas and just installed it last night - it is waaay more beautiful than either of us thought and the pics on line here do not do it justice at all. Assembly & installation was a bit tedious, but having done it, we could do another one in 1/2 the time. Great value, she couldn't stop looking at it.", 
    "This will be the FOURTH chandelier I have purchased!!! They are absolutely STUNNING and the price is PHENOMENAL! I purchased this one from my dining room in my home and then purchased three more for my photography studio that is currently in the process of major overhaul! ***** The crystals grab the rays of light and shine and sparkle... very high quality! A pain to put together but you can always hire someone to do that ;-) WELL worth it!!!! Highly recommended!", 
    "This product took me about an hour and a half to put together but it was fairly easy. I have 16 foot ceilings and it looks perfect in my house!", 
    "it is gorgeous impressive i saw one in a box store for the same price and it was acrylic. The crystals are awesome and so sparkly.", 
    "I was very pleased with my purchase. The chandelier looks amazing and very sparkly!! I have had a lot of positive comments about it. The electrician that installed it said that I would have paid up to 3 times as much in a lighting store. The only downside is the time it takes to assemble it. It took me about 2-3 hours, no previous experience, so there was a learning curve in the wiring section of the 4 lights. Still it was worth it.", 
    "It's always difficult to buy sight unseen because pictures often do not wholly reveal the product. In this case the chandelier is better than the pictures. It was extemely well packaged and the packaging was well organized. The various packets were well marked. The directions are accurate but take some attention because there is little written detail and the assembler must 'connect the dots.' However, that being said, assembly was straight forward. The chandelier connection fit easily into my existing ceiling fixture and connecting the wiring was simple. Adding the crystal pieces was a bit tedious and involved a few re-tries but went smoothly. I was able to do the installation by myself and, once the old fixture was removed, the process took only a couple of hours. The result was pleasing. The chrome is bright and the crystals hang well. This chandelier, while not overly ornate, is pleasant to look at. You will need to buy the bulbs.", 
    "Love it, adds that shine and sparkle that my dining room needed", 
    "Such a beautiful chandelier. I love the crystals and was so pleased that they were glass not plastic. I have it in my bathroom. Everyone comments on it!!", 
    "LOVE LOVE LOVE this chandelier. You cannot tell that this light is the price it is. It was fairly easy to put together. Had no problems at all. It looks amazing in my bedroom and makes it feel like a sanctuary! I wish i could post a picture of it bc it looks beautiful and I have gotten a million complements on it.", 
    "I bought this chandelier for our nursery. It is the perfect size for our room-approx 10ft x 12ft. We didn't attach the hanging crystal ball as it would hang too low. The chandelier adds an elegant touch to the nursery and provides adequate lighting. The crystals reflect onto the wall when it is lit which you may or may not like. My husband and I love the chandelier and are thinking of purchasing another one for our dining room! My mother wants to purchase one too for her house!", 
    "Takes a lot to please me and this chandelier certainly did. We put it in a guest bedroom directly over the bed and it looks just great. Loved the fact that the prisms are glass and not plastic. The room has a very welcoming, classy look now. Easy to install. Looks so good that I'm now looking for a chandlier to hang in our room and replace the ceiling fan that is there. Shipping was fast and packing was an excellent job. Everything was safe and intact. Love you Overstock.com. Cannot keep away from your website. So many nice things. Thanks", 
    "Exactly what I was looking for. Absolutely gorgeous! A bit time-consuming to install, due to vague instructions, but we managed just fine. It was totally worth the time and effort. I love this chandelier! Can’t stop glancing at our beautiful dining area and it looks way more expensive than what we paid. Love overstock!", 
    "It looks absolutely beautiful in my bedroom. Great size. Agree with others that the directions were not very detailed, but it was pretty easy to figure out. Shipping was extremely fast! Thanks Overstock", 
    "This is a beautiful light for a master bedroom, master bath, or girls bedroom. It might be a little small for the average size dining room. It came unassembled, but was relatively easy to put together. Just lay out all of the pieces before you start. My husband hung the chandelier before hanging the crystals and he said that is the way to go. It took no more than an hour to put together. I have been looking at lights online and at local lighting stores for the past year for a huge addition I put on my house. This light is worth every penny. I have seen lights that retail for $300 that aren't as nice as this one. Also, the salesgirl at the local lighting store told me that all of the crystal chandeliers I was looking at came unassembled so you most likely will have to assemble your light no matter where you buy it from. I have mine in my master bath. I am very happy with my purchase and would recommend this light.", 
    "beautiful---love, love . love it. Makes my dining rook look so elegant", 
    "The most beautiful chandelier I have ever seen! Looks really expensive and breathtaking in my room. I have a corner window and I hung it there with a small table and two chairs. My room looks like its out of a magazine. My Fiance was amazed at how cheap it was and I WOULD SAY DON'T THINK TWICE AND BUY IT!", 
    "Let me count how many things I love about this Chandelier. First it looks awesome. I chose this for our master bedroom. It can be seen from our living room, so I wanted something artful to be framed by the doorways as you looked in. I was trying to decide between this and the 3-light. Glad I went this route, as it is not too big, but looks more complete than the 3-light. Great style and great price. The packing was fantastic; even include white gloves for scratch free install and many extra crystals just in case. I am an average skilled DIY-er, have installed a few basic light fixtures in my time and found this no problem. The only thing I would say, is that the directions are not super clear at the very beginning as to wiring the light bulb sockets. The piece it partial assembled and you have to remove the bottom then connect all the white wires together, and black together (read the directions to know which is which). None the less, a little common sense and I was able to self install without a problem.", 
    "Very beautiful chandelier. Purchased to add some decedance to my master bedroom. It absolutely does that. The only reason I didn't give it 5 stars is the directions for putting together and installing are seriously lacking. There are 3 pictures to show you how to assemble the chandelier with 1 picture for crystal placement. Not very clear and it didn't have any words to describe the steps. There are no instructions for hanging. My husband is an electrician, but it took us three tries to get all the wires and parts in the correct order. Overall, I'm very glad I purchased this. It sparkles beautifully and is very bright (we had to install a dimmer switch).", 
    "This chandelier is absolutely gorgeous. It was packaged very well. It even came with extra crystals if you needed them, which I didn't. I found it easy to assemble. Like other reviewers noted, this chandelier looks more expensive than it is. I am very pleased with this purchase.", 
    "I love this chandy! She is so beautiful. I know everyone is saying how hard and time consuming it is to put together but I didn't have a problem at all. It was just me and a friend and it took about a half hour. Of course that doesn't include installing it. It was packaged really nice and came pretty quick. I really can't believe how nice it is for the money. You won't be sorry. Love it!", 
    "I love, love, love, this chandelier, it's beautiful. And yes, it did take about 2 hours for me to put together, but it was well worth it for the price we paid! After looking at many places on line as well as in lighting stores, we found this the best value for the money.", 
    "Beautiful crystal chandelier! It is real and looks fantastic!", 
    "Oh my.Today I had my chandelier installed by my friend.It only took him 30 minutes to assemble it.All I can say is wow.I can not take my eyes off of it.It looks so gay.I feel like I am at the casino each time I enter my dinning room.I feel so grand to have it. All of my church members Love it.It really sets the tone in my home.I am sooo very pleased with my purchase.What a fantastic find!", 
    "Had this for a few weeks now, and I absolutely love it. And the price is well worth it. Lighting was not hard at all to put together. Really brings out the dining room.", 
    "We love our new chandelier - it was in great condition and looks beautiful. Thanks!", 
    "I got this chandelier for my home office. I'm a photographer and everything in my office needs to be gorgeous. I was so happy with this. It only took two hours to assemble including unpacking, tracking down tools and chit-chatting. The size is fairly substantial in a room that is 15x20 with 13' ceilings. I loved it so much that I just ordered one more for my family room.", 
    "Love, Love, LOVE this chandelier. It looks absolutely stunning in our master bedroom. It is VERY bright if you put the max wattage bulbs in, so we'll be switching to a dimmer bulb. It wasn't too bad to assemble or put up, even with the vague directions. It took my husband and I about two hours total from start to finish (we had some problems getting our ceiling fan down). Looks very expensive and the quality is very good.", 
    "This is awesome! Way cheaper than anywhere else and gorgeous! I would def. reccomend two people to put it together and hang it up. The picture doesn't do it justice!", 
    "We have the 3 light version in our master bath and just purchased the 5 light version for the bedroom. I love it. It adds sparkle to the room and looks much more expensive than it is. I would definitely recommend it to anyone.", 
    "This is a beautiful piece. It looks substantial as well and comes with a ton of extra crystals which I found use for on the chandelier to add more bling as well as on another chandelier that I have. I have it in a reading nook in my home and it completes the area beautifully and elegantly.", 
    "Beautiful chandelier and great value. Only drawback is that it requires an electrician to assemble and install.", 
    "We are selling our home, and the 80's lucite Chandelier was a downer in the dining room. This lamp is very classy, has just the right amount of sparkle without overdoing it. We have a mirrored wall in the dining room (also very 80's but appropriate in this setting), and this fixture just dazzles. I have been checking sites and stores for months to find a decent hanging fixture with the right look and price...and Overstock did it for me!! The picture Overstock has does not do the chandelier justice!", 
    "When I opened the box I have to admit I was a little intimidated by all the pieces wrapped separately. (even though I knew what I was getting into). I proceeded to unwrap and start to assemble and before long I was smiling as I saw this beautiful chandelier come alive. I have to admit that I actually enjoyed participating in this process. My husband did the wiring at the base and I did the rest. It is especially elegant and beautiful and extremely sparkly. I am so glad that I found it while I was searching online for the right chandelier. It will be hanging in my granddaughter's bedroom very shortly.", 
    "The item came unassembled and I was initially worried about the number of pieces. Putting it together took some time, but it was certainly worth it in the end. Note: The package included spare parts, which was a pleasant surprise.This piece is amazing. Completely worth the price and far prettier than more expensive fixtures you see in lighting specialty shops.Would 100% purchase this again.", 
    "I love this product. I have been looking for a chandelier in my price range for some time now and usually when I find one, the crystals have no sparkle. The crystals on this light sparkle as brilliant as any I have ever seen. In reviews that we read about this light the big compaint was that it was hard to put together. It was not as hard as it was time consuming. If you have not ever worked with putting together a lamp before it might create a challange, but the end result is worth the time and effort. I hope this review helps someone else make the decision to buy this chandelier. It is beautiful in my dining room.", 
    "This chandelier looks amazing and I would have paid twice the price. No one can believe that I paid so little, as lesser fixtures regularly cost three times as much. I would definitely recommend to anyone. Assembly was straight froward, though it did take me a few hours to install and assemble. This would take much less time for future lights.", 
    "I got this chandelier to replace one that we were not happy with, and really like it. It looks more expensive than it actually is. I added silk shades and did not use all the crystals. Looks beautiful in our dining room.", 
    "This Chandelier is even more beautiful in person! It added an elegant quality to the whole bedroom and totally made a difference than the old lighting. I would highly recommend this chandelier to anyone and wish I could put one in every bedroom in my house!", 
    "Bought this for my dining room, it is absolutely beautiful when put together, the crystals are of great quality. Not too difficult to assemble, like others said it is rather self explanatory. Yes there are lots of loose spare crystals but I did not need to use any. Terrific value for what it is! I added mini silk lampshades, makes it look like I spent even way more than I did.", 
    "I have not tested/assembled any of the other chandeliers here at Overstock, but can tell you a bit about this one. First, the instructions are poorly written, but the included parts are fairly self explanatory. It will take a while to assemble, and the overall quality is fair to reasonable. Having said those things, when assembled and installed the fixture is quite pretty, sufficiently sturdy as to convincingly hang, and would make most happy. If you use the 60 watt bulbs, casts a full and bright light. On the scale of quality vs cost, we are satisfied with the product -- and understand that a good part of the value proposition here is the assembly. By way of disclosure, although we're relatively \"handy\" almost anyone can assemble this fixture. A good purchase.", 
    "Took my husband 1 hour to put together and then i paid someone $50 bucks to put up. Looks great and we love it !", 
    "I'm using the light above my very small dining room. It seems a little big for the area but will keep it there for now. I've had many compliments on it and I really do like it especially for the price. It looks very pretty reflecting from the mirror I have on the wall in the dining room. It did take my husband the afternoon to put up but not that difficult. Thanks again for another quality buying experience.", 
    "This chandelier looks great! It is very shiny and sparkly with the chrome and crystals. I have looked all over for chandeliers for a price I could actually afford and this is a great deal! It does help to have someone available to do the electrical work but putting it together is not overly hard. There are extra pieces so don't worry that you missed something when you get to the end!", 
    "The finished product is beautiful. The assembly takes care in patients.", 
    "This is my first Overstock purchase and I am a fan! This chandelier is gorgeous in my daughter's room! The electrician we hired to install thought I paid several hundred dollars for it and was amazed when I told him I ordered it from Overstock.com! I have already placed another order for additional items I need for our new home~ Thanks Overstock!", 
    "This chandelier is beautiful! It looks so nice in my daughter's bedroom. The crystals sparkle just as in the picture. It was a bit lengthy to put together, but not too difficult. The price is phenomenal. :)", 
    "I love this chandelier! It looks amazing in my reading room..Do not miss this great buy!!", 
    "It really does look as sparkly and good quality as in the photo. I was a bit apprehensive purchasing it - but this is a FANTASTIC buy! The assembly was not terrible - FYI, there's a pack of extra parts so don't get scared when you see individual crystals. Those long crystal strands are already assembled.It's a nice big size too - I bought it for my bathroom and it'll look gorgeous! Don't hesitate to order this!", 
    "This chandelier is seriously gorgeous! We are so excited and the price is amazing for what you get! We have been looking for a light fixture for our daughter's nursery and just haven't seen anything we loved. This is the style we were drawn to but the prices of comparable chandeliers were easily $700-$1100+. It takes some patience to assemble it- but once it is finished- you will be amazed in the quality and construction. We are so pleased we decided to go with this particular light!", 
    "I love, love, love my new light, it was easy to assemble except for one of the nuts not fitting on the light fixture correctly. Nothing to really complain about though. LOVE THE LIGHT", 
    "Fun to assemble. I did most all of it myself except the installation into the ceiling. Love it!", 
    "VERY PRETTY! THIS ITEM IS ESSENTIALLY A PLAIN CHROME CHANDELIER WITH HOOKS TO ATTACH THE CRYSTALS WHICH REQUIRES A BIT OF TIME AND PATIENCE. IT'S NOT TOP OF THE LINE BUT IT'S DEFINITELY A GREAT DEAL FOR THE PRICE.", 
    "This is a beautiful fixture and with the low price, what a deal! It takes a little time putting it together but it is worth it. We hung this fixture over the tub in our master bath. It's perfect! Great value!", 
    "It looks good but I had to put the whole thing together myself. It was not easy or fun. That is why I would not buy it again. Way to much work for the chandelier.", 
    "I was very disappointed in this chandelier. The glass was very cheap looking and the metal was a dull finish like an old faucet. I sent it back.", 
    "This is a really beautiful light fixture. Even though the \"crystals\" are plastic, they look like crystals. Highly recomend!", 
    "It's very pretty and we're happy with the quality. Used it to decorate a kitchen, and it adds some zing to the decor.", 
    "I returned this product. It was cheap and plastic looking. I was disappointed."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Chrome-5-light-Crystal-Chandelier/3827512/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/3827512/Chrome-5-light-Crystal-Chandelier-86a3bdcb-f5f1-481d-ae25-99e18e51fc91_600.jpg"
  ], 
  "description": "Add this refined crystal chandelier with a chrome finish to your\nhome or office for an element of class and style. The clear crystal\nshades of this five-light chandelier filter warm light, and the\nadjustable forty-inch chain can be adapted to fit to the ceiling\nand decor of your choice. Chandelier will add elegance to any room in your home or\n  officeLight fixture features clear crystal shadesHanging lamp offers a chrome finishChain measures 40 inchesRequires five (5) 60-watt candelabra base type b or c bulbs\n  (not included)Lamp measures 22.5 inches wide x 27 inches highUL listedMaterialChrome, CrystalFinishChrome FinishNumber of Light5 LightsShade MaterialMetalHeight23 in or moreSwitch TypeHardwiredAssemblyAssembly RequiredBulb Wattage60 WCeiling Light Fixture TypeChandelierColorSilverLight Bulb TypeIncandescentLight DirectionUplightLighting StyleContemporary, TraditionalLighting TypeChandeliersProduct FeaturesUL ListedWidth18 in to 36 in"
}