{
  "name": "Cora_Patterned_Fabric_Accent_Chair", 
  "price": "EUR 102.33", 
  "reviews": [
    "This chair is as gorgeous in person as it is in the photo. Easy assembly!! Love the fact that it's convertible, can be a chair or stool easily. Fabric is nice and soft. Overall a very comfortable purchase.", 
    "This chair is much smaller than expected but it seems pretty sturdy for the price. Perfect chair if you don't want to spend a lot of money but still want something substantial.", 
    "Looks just like the picture. My husband was able to put it together in about five minutes. Quick delivery. The colors are vivid and the chair is comfortable to sit in. It sits a little lower then expected. I still like it.", 
    "This chair is a nice accent piece for my meditation room.", 
    "Easy to put together, great quality and looks better than the pictures!", 
    "Love the pop of color in my living room", 
    "Easy to put together, good value (on sale)", 
    "Awesome accent chair, and very easy to assemble, light weight so easy to move around, loved it!", 
    "I ordered this chair in the black and white circle pattern. The color is a little faded, but not very noticeable. It's a comfortable chair, a bit shorter than expected but looks great in my guest bedroom.", 
    "I got the black and white patterned chair for a guest room..it's a pretty small chair..the only downside is the black is more of a charcoal grey not a true black. It was easy to assemble and looks nice in the room"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Cora-Patterned-Fabric-Accent-Chair/9785743/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9785743/Cora-Patterned-Fabric-Accent-Chair-c45268e8-3472-41fa-aaaf-253ffc268f47_600.jpg"
  ], 
  "description": "Bring a wow factor to your home with this luxurious Cora patterned\naccent chair. The sturdy wooden legs and smooth foam padding of\nthis chair make it a durable yet comfortable addition to any room.\nThis upholstered accent chair comes with the choice of three\neye-catching patterns to complement your existing decor. Choose\nfrom upholstery patterns that include blue flowers, brown flowers\nand black circles to complement your existing decor and color\nscheme. A black finish on the wooden legs makes this piece of\nfurniture ideal for contemporary spaces. It's light 19-pound weight\nmakes the chair easy to move around your room.Pattern options: Blue flowers, black circles, brown flowers,\n  beige flowers, grey flowers, purple flowers, flagSet includes: One (1) accent chairMaterials: Fabric, woodFinish: BlackUpholstery color: Blue, black, brown, beigeUpholstery fill: FoamWeight: 19 poundsSeat height: 16.2 inches high x 19.5 inches deepDimensions: 31.5 inches high x 23.7 inches wide x 28.5 inches\n  deepStyleContemporary, ModernMaterialFabric, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Black, Blue, Brown, Grey, Purple, WhiteFurniture PatternSolid"
}