{
  "name": "Cortesi_Home_Miller_Beige_Script_Fabric_Dining_Chair_(Set_of_2)", 
  "price": "EUR 187.34", 
  "reviews": [
    "These chairs are slender enough yet comfortable. I love the way they look with my round dining table. The colors are soft and seem to go with other colors (I have a lot of white, including the shutters). Very glad I bought them. Easy to assemble !", 
    "These chairs look much more expensive than they were. Bought these to go with dark grey dining chairs and they look great. The color is linen and a very light grey script.", 
    "Good bang for your buck, these 2x1 are great!", 
    "Theses chairs are great and look fantastic.", 
    "These chairs were pretty, easy to put together, comfortable, etc... so good that I'm buying two more... The details are good, the chairs are stable and comfy. Definitely will buy more from this company in the future.", 
    "These chairs are great! bought them to go with my farmhouse table and they are perfect together! Awesome chair for the price!", 
    "These chairs look very decent for the price. Because of its colour, they go easily with any other furniture. The seats though not too sturdy, you sort of sink in as you sit down. Were not hard to assemble.Otherwise, pretty ok for the price.", 
    "Very easy to assemble. They make the dining room look fancy and clean.", 
    "Easy to assemble, good quality for the price!", 
    "Lovely chairs go perfect with my white farm table. Always pleased with overstock", 
    "These chairs look excellent with my farmhouse table. They are quite comfortable and sturdy and easy to put together. I would definitely recommend, especially for the price. Can't beat it!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Cortesi-Home-Miller-Beige-Script-Fabric-Dining-Chair-Set-of-2/10130695/product.html?recset=5065fc47-d070-48c3-94d0-44333334f652&refccid=5NYNIZSMD7H3SW2KT6ARHCPQ3Y&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10130695/Cortesi-Home-Miller-Beige-Script-Fabric-Dining-Chair-Set-of-2-9d69072e-9c91-424a-8b2d-82d206b0b46b_600.jpg"
  ], 
  "description": "Take your formal dining room decor to the next level with these\nMiller dining chairs from Cortesi Home. Featuring an elegant script\nprint, these chairs perfectly complement contemporary decorative\nstyles. Accent a classic wooden dining table or highlight a sleek\nglass table to complete the modern look. Nailhead detailing around\nthe seat back gives these chairs an edgy, youthful feel.Wood legs add durability and stabilitySet includes two Cortesi Home dining chairsBeige linen upholstery provides a neutral color paletteCappuccino finish gives a rich, elegant lookNailhead trim offers modern edgeWeight capacity of 200 pounds for sturdiness and\n  durability39\"H x 18\"W x 19\"DStyleTransitionalMaterialLinen, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBeigeFurniture PatternSolid"
}