{
  "name": "Curves_Hour_Glass_Easy_Care_Fabric_Accent_Chair", 
  "price": "EUR 155.93", 
  "reviews": [
    "We were looking for something a little different but didn't have a lot to spend. The value was great and the chair itself is very comfortable. Some assembly required is just putting the legs on and they supply the wrench. It's quite sturdy. The only reason I gave it 4/5 stars was because the description is listed as a burgundy but it's more on the red side. It still fit in quite well with the overall tones for the room. I think if we ever got tired of the upholstery it could easily be redone. It's a keeper and it's becoming my favorite chair to sit on.", 
    "I love this chair. It's exactly the color and style I needed for a small living room. Only minus would be that for elderly person, they usually lean on arm rests, and these are little. That being said, it is a very comfortable chair.", 
    "Love it! Kinda small... But very comfy and cute! I ordered one for my bedroom and once it came I ordered a second chair and moved both to my sitting room.", 
    "The chair is smaller and it's not as plush as I imagined. Not comfortable for extended relaxation.", 
    "This chair was perfect for the bedroom I put it in. The color is a creamy white. It is well made for the price. It was delivered in a timely manner. The box it came in was totally broken apart but the chair was not damaged at all and very easy to attach the legs.", 
    "This chair looks great in my studio.", 
    "Love the rich chocolate brown color. This chair is exactly what I was looking for. Assembly consisted of adding the legs to the chair using an allen wrench. Extremely pleased with my purchase.", 
    "The chair is perfect. Great color and true to description. Love to sit and read in it. I'm short so it's nice to reach the floor. Wide seat. A little deep for me but a pillow fixed that. Problem was came with either the wrong bolts or defective ones. I didn't want to mess with sending back so bought new ones.", 
    "My husband and I are currently updating our living room after many years. I was looking for a red accent chair to go with the new decor. After the arrival of this chair and placing it in the living room area I immediately noticed that it needs a partner. My husband liked it so much that he said are you ordering another one....absoultely was my response. My new living room will look fabulous!!! Thanks to Overstock.", 
    "Color perfect, easy to put together, great value for a bedroom chair", 
    "I had some trepidation about purchasing furniture that I had not seen online particularly because I am sure returning it would be a nightmare. I did and was pleasantly surprised. These are beautiful chairs and as already mentioned in other reviews the color is much lighter than indicated in the picture. I would just actually call it red. If you are looking for luxurious quality, fabric and feel then these are not your chairs. They work well for me although they could have been less expensive. Also, some of the bolts don't fit.", 
    "This chair was purchased as an accent chair for added seating when needed. Got the red color and it is beautiful. Great price/value!", 
    "Lovely color and the style of the chair is beautiful!!", 
    "Beautiful piece, I bought it for my bedroom in chocolate color, looks great. It's comfortable, not too big. Assembly was easy and delivery fast. I shopped around forthe best price and Overstock delivered.", 
    "It is small but fits in the bedroom. The color is rich and inviting.", 
    "This is a $*** chair that looks and feels like a $*** chair. Based on the other reviews I was expecting so much more. It isn't fair to compare this chair to one in the $*** range but there is really no comparison. This chair is not super sturdy. My 240 pound husband is afraid to sit in it. The underside is flimsy. You have to install the legs yourself with 8 screws and an Allen wrench the size of your thumb (super annoying). If you can afford it, buy a better chair. Perhaps, one that comes assembled. But if your budget restricts you to this price range, this is a great chair for the price. It looks nice. I purchased the brown one and added a gold/cream lumbar pillow. I am satisfied, but kinda wishing I spent the extra money and got something a little nicer.", 
    "I bought these chairs to fill in some space in my bedroom. They were worth the money! The legs were easy to assemble. all the parts necessary were included. The chairs are comfortable and look great!", 
    "I love these chairs. I ordered the red ones. Easy to put together. I lust love the look to them. Great quality and price.", 
    "These are just simply perfect for my space...neutral in color and lovely!!! Especially at this price...Yippee!", 
    "We bought 4 of these chairs after first finding a lone chair (same style and brand) in a color we couldn't use at HomeGoods. We really liked it because it was the most comfortable slipper chair that we could find - and we shopped around, hitting store after store. It's the shape of the chair's back that makes it more comfortable than most. They are perfect for our new sitting area (half wine barrel coffee table in the center surrounded by the 4 chairs on an 8x10 area rug).", 
    "I ordered two red chairs and color fits perfectly my livingroom furniture. My mom said that she will alway sit on them, sofa is not any more good for here. It is really lovely accent chair.", 
    "We are using these in the oyster as extra living room seating. The smooth velvet feel of the fabric is nice. Took less than 12 minutes box-to-ready to put legs on and use it. Very easy.I like them very much. The cool times cream color of \"oyster\" is a true neutral. Works well with both a more traditional or modern decor. Seats are wide enough to seat an average size man or woman, normal height for an occasional chair (slightly owner than average dining chair).Overall quite happy, and I hope they last as well as we expect them to.", 
    "I was looking for something for my bedroom so didn't want any bulky accent chairs. They look beautiful in my bedroom. Legs were easy to install. Enjoying them.", 
    "small, do not like fabric .returning", 
    "Love it. It is not lavender though. Looks like a burnt but worked really well for me", 
    "My husband put the chair together with no problems. I put it in my dining room near the fireplace. Very nice and comfortable.", 
    "The chair is good quality and the material and color is exactly what I wanted. It's just smaller than I thought so I had to purchase another one for the space.", 
    "Chair arrived quickly, put together easily, and looks elegant in the corner I put it in.", 
    "I go the chair in red. It was easy to assemble just a little small but gorgeous.", 
    "Love this chair! Low back with wide seat and color is beautiful!", 
    "wonderful..size is perfect for my bedroom- perfect, comfortable, very easy to put together- solid construction will be buying another one for the other bedroom", 
    "these chairs are really cute...however, they do not provide much comfort,,,and basically no arm rest...and the back of the chair is low...which works for my living room, which is a small space", 
    "Needed an accent chair for my master bedroom. This was the perfect fit. The color (cream color) was exactly what I expected and how it appeared on the site. The only neg. was that the back of the chair was a little shorter than expected. No biggie though. Glad I made the purchase.", 
    "Easy assembly, quick assembly, gorgeous fabric - so soft and silky! I dont want to sit on it, its too pretty! It feels sturdy, i really like it", 
    "The fabric is soft and looks very durable. It is sturdy and will be comfortable for a short time (hour or so) , but not for long sittings. Assembly is easy. Shouldn't take more than 15-20 mins. This chair took care of my need for a nice looking, comfortable and stable chair for my living room. Note: when installing legs, don't tighten the first bolt (two per leg) all the way. Leave it hand tight. Then if you have a problem lining the second bolt you will be able to giggle it if alignment is a problem. I recommend this chair 100%", 
    "These are cute \"little\" chairs. If you have a small space for a nice accent chair, then this is it. I ordered the cranberry colored chair and I get compliments all the time on it. They are not particularly comfortable, but after all they are accent chairs.", 
    "Beautiful solid very nice quality", 
    "I got it just to fill an area that was kinda empty by the window. It's not the most comfortable chair you can find but good for decoration .", 
    "Purchased the chair for my daughter's bedroom. She loves it. very sturdy and easy to clean. Will purchase an other.", 
    "Chairs are what I was looking for but when putting the legs on the last one the hardware couldn't be screwed in even half way. Short of repackaging the chair & exchanging it would have been a waste of time. I called manufacturer and waiting to see when new legs/hardware arrives. If not back it goes."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Curves-Hour-Glass-Easy-Care-Fabric-Accent-Chair/9563437/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9563437/Curves-Hour-Glass-accent-chair-Covered-in-a-High-Performance-Easy-Care-Fabric-ac501c11-e290-4c58-bc29-a6a129cf2549_320.jpg"
  ], 
  "description": "Set your seating area apart with the inviting curved design of this\naccent chair. Featuring an hourglass shape, the padded and\nbutton-tufted back cradles you with stylish comfort, while low arms\noffer a resting spot for your weary limbs. Choose from neutral and\nbold fabric color options to get the perfect match. Dark wood legs\ncreate visual contrast against the fabric.Made from wood, fabric and foam for a comfortable and durable\n  seating optionNatural finish lends beauty to the chairHigh-performance easy-care fabric makes maintenance easySolid wood legs create a sturdy baseKiln-dried hardwood frame is solid and durableFor use in residential or private office settingsMeasures 25.5\" H x 29\" W x 33.5\" DStyleTransitionalMaterialFabric, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBrown, Green, Red, WhiteFurniture PatternSolid"
}