{
  "name": "Danbury_Metal_Contoured_Upholstered_Dining_Chair_(Set_of_2)", 
  "price": "EUR 108.28", 
  "reviews": [
    "The build seams pretty sturdy and the finish looks great. The screws heads, not the threads are weak. I used a power tool to put it together on the lowest setting, were i'm able to stop the power tool with my hand and some of the heads slots would get damaged.", 
    "Purchased these for a small office as guest chairs. They look good and the aluminum legs look more like an office chair than dining.", 
    "These chairs were fairly easy to assemble by myself once I figured out which way the middle frame went in. Took about 1 hour to assemble the two chairs. Hope they hold up well. They will be used everyday. Color and description were accurate. Shipment came a day earlier than noted. This is a step up from the folding chairs I've been using the last 3 1/2 years. Price was decent, as I'm on a budget.", 
    "Good to sit on. Nice back support. Nice stitching. Love the black metal legs. Took less than 20 mins. to put both chairs together.", 
    "I love this set! The manufacturing isn't that good; the frame was slightly bent and added time to putting it together which was frustrating.", 
    "These chairs as reasonably priced as they are easy assembled and very comfortable. \"just what the Doctor ordered. We really are happy that we ordered. You should be also", 
    "These chairs were exactly what we needed. We needed a long narrow table to eat at. We don't have room for a true dining table. We found a long table and needed chairs to fit. This worked perfectly for that narrow sofa table.", 
    "A definite style upgrade from standard stacking metal chair. Assembly was easy", 
    "My wife and I ordered 5 sets; 1 chair had a small tear that we received a credit for. They are sturdy and have firm seat, back is slightly softer and not as firm. It is best to place the middle bracket in first and then move to the back of the chair when putting them together, initially light tightening of bolts until the back of chair is in place and then you can tighten as you go forward. Better than any folding or plastic chair that your find and worth the price.", 
    "Great price, easy to assemble, lightweight and sturdy thus far. Very pleased.", 
    "these are really solid really comfortable Nice Looking chairs!! It was very easy to put together simple 123 step and I will be ordering 2 more in red I have BLACK", 
    "The chairs were a welcome surprise. They fit perfectly with the table selected. Easy to put together. The first chair took about twenty minutes. The other three about ten minutes each. I read that the screws did not line up well. It is best to line up all screws and tightened together, not tighten one at a time.", 
    "These chairs go perfect in my dining room. They were easy to assemble and a great value. I got 2 sets. They are quite sturdy and I love the look.", 
    "These are very sturdy and durable chairs. The only thing that would make them superb is to have regular screws. I believe they would be more secure and not have to be tightened as often.", 
    "Nice chairs at a great price. They pair very well with my wooden dining room table.", 
    "Very pleased with the appearance of these chairs. Great price too!", 
    "Recently bought a new house and it came with a huge granite dinning table. Did not have chairs and we looked everywhere but either found poor quality for cheap or good quality for 200-300 per chair. These chairs are awesome for the price I paid.", 
    "Just got this yesterday. it only took a few minutes to put together by myself. they look amazing and are very comfortable.", 
    "Comfortable chairs, looks like picture. Bought two more."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Danbury-Metal-Contoured-Upholstered-Dining-Chair-Set-of-2/10117974/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10117974/Danbury-Metal-Contoured-Upholstered-Dining-Chair-Set-of-2-7d31f20b-f9d5-4e29-9b3b-b0407e1fba99_600.jpg"
  ], 
  "description": "Feel a new vibe with this retro modern style dining set. The faux\nmarble table top with the basic X frame base compliments the\nclassic black PU chairs perfectly. This spacious addition would\nmake a fantastic focal piece for your next dinner party. Get that\nretro feel with this chic dining set in your modern home.Contrast stitchingSet includes: Two (2) chairsMaterials: Metal tubeUpholstery material: Faux leather       Seat cushion thickness: 2 inchesSeat dimensions: 16.75 inches deep x 18.75 inches highOverall chair dimensions: 18.75 inches wide x 21.75 inches\n  deep x 38.25 inches highStyleContemporary, TransitionalMaterialMDF, MetalChair TypeDining Chairs, Sets, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlackFurniture PatternSolidProduct FeaturesCushion Included"
}