{
  "name": "Dark_Grey_Power_Remote_Control_Lift_Recliner", 
  "price": "EUR 681.16", 
  "reviews": [
    "Have tried to be comfortable in this chair.but to no avail. The seat presses on my spine bone so therefore, I cannot sit in it very long.I will be donating it to a needy family.", 
    "The fabic is of poor quaility. I was disappointed with the delivery of the chair. It was raining the day of delivery adn no one called to advise the chair was coming. It was left on my porch and no one rang the door bell advising of delivery. Fortunately I have a covered porch and the box did not get wet.", 
    "Arrived fast, easy to use, easy set up, leg length needed 4-6 more inches for tall 6'1 man, but sturdy enough. Material will last longer with the extra pad I purchased with.", 
    "SO EASY OT OPERATE AN LOVE THE FACT THAT I DON'T HAVE TO STRUGGLE TO GET IN AND OUT OF IT!!", 
    "I found the material very thin, do not think this will hold up well under use"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Dark-Grey-Power-Remote-Control-Lift-Recliner/8880459/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8880459/Dark-Grey-Power-Remote-Control-Lift-Recliner-d6decc79-bf82-4caa-8461-754ced151d26_600.jpg"
  ], 
  "description": "Treat yourself to a relaxing place to unwind at the end of a long day with this remote control lift recliner. With plush pillow arm rests and a tufted back, this recliner is a wonderfully comfortable addition to your living room or den. Dark gray chenille upholstery and black-finished legs give this chair an unassuming air that works well in casual settings.Includes one reclinerDark gray chenille upholstery and black legs offer casual stylePlush pillow armrests and a channel tufted backrest contribute to seating comfortRecliner features a concealed power base that operates a remote controlled lift mechanism for ease of useChair weighs 120 poundsSeat measures 21\"DOverall dimensions are 41\"H x 38\"W x 38\"LStyleTraditional, TransitionalMaterialChenille, Fabric, Upholstered, WoodFinishBlack, WoodChair TypeReclinersAssemblyAssembly RequiredColorGreyFurniture PatternSolidProduct FeaturesPower Lift, Power Recline"
}