{
  "name": "Deco_Solids_Accent_Chair", 
  "price": "EUR 101.78", 
  "reviews": [
    "The chair was easy to put together; however, the bottom cover opened to get the legs on, and sealed with velcro. Unfortunately, it was impossible to completely fasten the velcro because it didn't quite fit around the front legs and couldn't be put under them to keep it nice and neat. The fabric around the back legs didn't fit either and is wrinkled because the velcro opening isn't long enough.. It's not a quality that I would recommend for a formal living room or dining room, but it works for my grandson to use in the den to play video games. The color isn't what is pictured, but again, it will work for a game chair.", 
    "This is a good little accent chair. I ordered one to see if this type of chair would be good for my group therapy room at my office. I decided it might not be sturdy enough for that kind of wear and tear, but it is an excellent accent chair in my waiting room. Assembly was more difficult than I expected, 60 minutes+. I had to call to get a leg delivered as one was bowed. The fabric tends to collect anything floating, so I would not recommend it if you have pets that shed.", 
    "This is a pretty nice chair and was easy to assemble. I notice that alot of people were saying that it was a \"childs chair\"; however, I would have to disagree with those comments. The chair is a little on the small side in regard to the design, when you sit on it though it does sit up high and it does not sink in. I bought the green one, this color matches as I though it would. Being a guy whe dont often buy things of this nature, but when you want to impress others we have to step it up. BUY THE CHAIR FOLKS(IT MAY NOT BE A HUGE CHAIR BUT ITS AWESOME)!!", 
    "Chair arrived quickly; very easy to put together in 10 minutes and it was as described. Very comfortable. The color, however, was off. The seat material was almost two-tone; clearly a flaw in the fabric. I called support immediately and was given superb service. The representatives were sweet and helpful. I was issued a return number for a UPS pickup, I dismantled the chair, repacked it and it was picked up. The whole transaction took less that 24 hours. Amazing! When I originally ordered the chair, the blue was sold out. Customer support told me she would contact the warehouse and see if one was available. She called me much later in the day to say that there was one in blue, and I ordered it. Pretty good follow-through, no? I have nothing but praise for O's customer support. There were no drawbacks in this whole matter except for the fabric flaw. By the way, I was expecting a huge box, but it was packed in such a way that I, age 71, could easily manage.", 
    "This chair is TINY. Looks like a child's chair. MUCH MUCH smaller than the normal slipper chair. The back of the chair only comes up to mid thigh. Is way smaller than the photo makes it look. Back legs are \"blades\"--very this and flimsy.", 
    "I am using this in my office (I am a physician) and I think they are great for the patients to sit on. They are sturdy and beautiful. Perhaps a little low to the ground but accurately described. Shipped very well, easy to assemble. So pleased with them.", 
    "Well if this is lavender, I'd hate to see what you call gray! The lavender chair is definitely GRAY...there's no hint of any color but gray in it. It is so small that my knees are under my chin when I sit in it...I'm 5'9\"...I got it for my granddaughters room so it works for her, she's 6....I would NOT recommend this. Poor quality, even got slivers in my hands when trying to put the legs on. Disappointed, but I'm not paying to ship it back so will use it for childs room. Disappointed.", 
    "Cheap quality. Broke after 3 times sitting in it. The wood split where the rear legs are attached. Would never buy again.", 
    "poor quality..split wood frame...upholstery looked sun rotted...wobbly we had to return them even though the color and proportion and style were absolutely perfect.", 
    "The low price does not justify its poor build and off color.", 
    "If you're a big guy like I am...Don't sit down too hard. Broke after about 4 or 5 months of use.", 
    "I bought eight chairs, they looked great until when my guests sat in them and the backs broke. They snapped in half on two off them. I had only had them one week. Both chairs broke in the same place.", 
    "Apparently, this chair is not for sitting. It has BARELY been used but one leg is falling off. Easy to assemble and color was great, but my husband joked that it looked like a kid chair. It does. And now it can't be sat in. I wish I had spent more money for a real chair. Do not buy this. :(", 
    "Disappointed when I received this chair. Much shorter than anticipated. Not the quality I thought it would be. Would not order again", 
    "I have bought slipper chairs before and yes for more money....but I missed the size on this thing. It is sized for a child or someone under four feet. I am embarrassed to have it in my home and overstock should be embarrassed to sell it. I have one more order encountered and then I am done with overstock. I have used overstock for several years now and sometimes it has been hit or miss. His was a total miss!!!!!!!!!", 
    "After weeks of calling overstock to find out where my chairs were they finally arrived yesterday. To my surprise the chairs are poorly made and not stable at all. I am afraid someone visiting my home will fall out of the chair. To make it worse the legs on the chairs are not even. I want to send them back. I would have found a better buy at the second hand shop. This was an awful experience! Do not be fooled by the purchase price. Not worth it.", 
    "These chairs are very small definitely not for heavy use, more for accent.", 
    "This chair is short, and looks funny next to any full sized furniture. Looks like it is made for children to sit on. Fabric and comfort are fine but the overall construction quality of the chair is poor. When you sit back in it you can hear the wood crack. Pictures and item description look good but in person I would not recommend purchasing this chair for anything but a decorative piece as it will not hold up to acutaly sitting in it.", 
    "Like many of the other reviewers have stated these chairs are very small as in child size. Would not recommend for adults. See height dimension.", 
    "Chairs were poorly made. I was afraid they were going to break if someone sat on them. Sent them back.", 
    "Cute chair except the LAVENDER is no where close to any shade of purple I've ever seen. Will keep it because the GREY chair actually fits the rest of the decor and don't want to deal with shipping this box back.", 
    "Nice chair, good value and mostly as described. As stated in other reviews, the blue chair is definitely darker more teal-ish color that you might guess from the picture online. Still a very nice color. Putting it together wasn't too bad. The instructions were OK, it took me longer than the suggested assembly time. Attaching the back legs was tricky because the fabric is open at the attachment site and meant to cover the screws using a velcro closure, but the opening in the fabric just barely gave enough room to screw in the upper screw. So, it was a bit difficult to push the fabric out of the way enough to screw the back legs to the back rest. But overall assembly wasn't too complicated--this is my first time assembling a chair and I wasn't too hopeless. In addition to the supplied screws and washers, there were also some smaller metal rings that appear to be extra. Don't know why they were included then? You have to really make sure everything is aligned properly so that the screws can be well tightened enough. But when everything is in right, the chair is very sturdy. It is a good sized chair. Not very tall, but it's a good height and comfortably broad. The seat is not ultra cushy (as can be judged from the pictures), but still very comfortable. I only just got it so I can't attest to long-term durability, but overall a very nice sitting chair for under $$$.", 
    "I ordered this chair to fit between cabinets in our bedroom to hold my husband's levis and shirt between clothes changes. Before they were stacked on the cabinet. The chair is small enough to fit, and looks very attractive.", 
    "Nice but too small. Nice sitting and good color but just too small.", 
    "Way to small for a regular size person. I purchased 2 of them for a small apartment but even there they looked smaller than for an average person and I am only 5,3\" otherwise nice", 
    "Love love love.....makes the perfect accent chair anywhere in your home.Color was true to what is shown.Smaller than I thought...but Ive had adults sit comfortably on it.", 
    "Had issues with the chair. Only a piece for decoration. Not for regular use. Returned for a refund.", 
    "These chairs are much better than I thought they would be for the price. They are cute (I got the gray that has a little white in it), and they are sturdy.", 
    "Much smaller than it looked.", 
    "The chairs went well for our mid century modern scheme in the room. We wanted to create a small sitting area, so the diminutive size of the chairs fit well (easy fit for averaged sized person). We got what we wanted for the price.", 
    "I live in a small town home and have purchased three of these. One for my bedroom and two for a sitting area off the living room. They were easy to put together and easy to move around when guests are over. I am extremely pleased.", 
    "If you want a marroon, wine, or burgundy chair this one is for you. I wanted RED like it said. I do not want maroon, wine or burgundy, I have RED accents.I can give OS kudos for delivery, ordered Sunday and it arrived Wednesday. So sad it is not RED.", 
    "The chair is made strong and is comfortable. Also it is a pretty chair.", 
    "Great value for the price", 
    "I just bought it axcent chair. When visitors come in, they always sit in that chair. It's attractive and I love the dark red velvet.", 
    "not crazy about the green. legs seem wobbly, yes we did double check them against instructions. Chair is not very strong.", 
    "After about two years of minimal use of this chair, the stability is the main concern. I am constantly tightening the bolts to keep the legs from wobbling. Otherwise, the material is great and seems to be relatively resilient to stains.", 
    "THE COLOR IS OFF BUT IT FEELS CONFY TO SIT ON", 
    "Works perfectly where needed", 
    "This was a good buy even though I didn't realize the chairs were on sale when I first identified them to buy. By the time I was ready to buy them the sale was off! I purchased them anyway and the color Bark is spot on for my newly decorated master bedroom. The only con for these affordable chairs is the height of the back which is short. Although I needed a smaller scale accent chair, I wasn't expecting them to be this short. I made it work though and they look great!!", 
    "It is a really small chair. It is pretty but small. My husband can not sit on it for fear of breaking it. The kids love it. I will purchase another one for them, but beware, it is small!", 
    "Actually use it in front of our bed to allow our small dogs a way of getting in the bed with us. Looks great works well.", 
    "The chair works for its purpose, but is smaller/shorter than anticipated.", 
    "Easy to assemble. Sturdy enough....i never really sit in it. I dressed it up with a really cute accent pillow.", 
    "This chair is perfect for a small accent seating area in my living room. Sturdy and derable material, I'd definitely recommend it.", 
    "Very nice material, comfortable to sit on. Not as sturdy as I felt it should be however.", 
    "I would have given tis chair 5 stars for sturdiness but the fabric is terrible.", 
    "I ordered two of these in blue, and they are perfect for a small area. They are actually more comfortable than I expected! Love the color", 
    "This is a very nice chair for the money. I found it easy to put together but the front legs look almost like they're bowed, however I think it's just the design. I love the fabric - it's very rich. My only reason for not giving it 5 stars is the pics don't really match the actual color. I ordered the blue but the color is a little darker and more teal than what the picture shows. The size is perfect for a bedroom accent chair.", 
    "Love them, will buy more in the future!", 
    "Nice chair - I bought this to put in a guest room. My husband put it together when I wasn't home and said it was a major pain to assemble. The chair sits a bit low, which is fine I just didn't realize that. I pretty much assume that all chairs have a pretty standard height - I don't know what that would be so I didn't read the dimensions. I got the brown chair expecting a dark/chocolate brown color. What I got was a very dark brown - almost black. Much, much darker than I expected. I'm going to keep it because of what a pain my husband said it was to assemble. I think it will work fine for the little bit of use it will get but I don't think I would put this in a busy area.", 
    "Nice. In my waiting room.", 
    "I ordered the blue chair for my bedroom. It's not exactly blue, its gray with blue fibers. The chair sits lower than I thought it would and when I sit on it, it sinks (I only weigh 130 lbs). So, as far as durable goes, maybe not the most durable. I purchase it for a functional accent piece and it serves its purpose.", 
    "a bit wombly and lower than normal chair but fabric seems ok", 
    "I LOVE this chair. The fabric is very rich. It is short, however, when I sit at my desk which is why I bought it. I believe it is 18 inches height which is not high enough for normal desks (between 29 to 30 inches. So I just put a long throw pillow to sit on top of. Then I put the pillow back on my bed when I leave my desk. My 9 month old kitten, Bella, sees it as a scratch pad so I just cover the chair when I am done.", 
    "Love love this chair. Perfect size and very comfortable. Looks more expensive than price.", 
    "We needed a couple extra chairs, for when a couple more people need a place to sit. These are great! Neutral color, neutral style. comfortable, great value for the price. Assembly was pretty easy - getting the rear leg in without tearing the foam is a little tricky (and I've done upholstery).", 
    "Nice, but smaller than expected.", 
    "I really like this chair for my vanity to get ready in. Be prepared tho, it is low and long (the seat portion) but very soft and comfortable.", 
    "The chair was easy to put together, is sturdy, and comfortable. I would purchase this chair again.", 
    "I bought the charcoal color, and the fabric finish reminded me of velour -- too shiny. And although the measurements are clearly stated, I overlooked how narrow and shallow the chair is. It's more like a dining table chair than living room furniture. (It didn't lose any stars because of my oversight, just commenting so others don't make the same mistake).I didn't put it together because I didn't care for the fabric, so can't comment on any other quality aspects.", 
    "The color was more of a grey than a lavender. It was easy to put together and looks great in a bedroom.", 
    "This chair is super easy to put together and it is a very solid chair. I love it and couldn't ask for more!", 
    "Easy to put together and very sturdy. A great accent for any room however I put it in my living room and it looks great.", 
    "Arrived very quickly, easy to assemble, looks great!", 
    "Good addition to any room..even a bedroom..adds additional seating and does not take much room..I love it..", 
    "fills the need for a side chair in bedroom, easy to match color", 
    "I ordered these in green and grey. They were both nice but the green is a beautiful stunning golden green leafy color. Its beautiful. The only reason I'm not giving it 5 stars is that the back legs were a bit wonky. Be very careful to get them going the same direction.", 
    "I was very happy with the chair after it arrived, the design is beautiful and the I love the color of the red. The only reason it's not a full five stars is because the assembly was a bit difficult. Maybe if I did more DIY stuff, i'd have an easier time.", 
    "Compact but color a bit different from expected.", 
    "It is fine as a desk chair, but the charcoal grey is very misleading. Chair we received is definitely light grey.", 
    "I purchased this chair for a small space and I must say it fits perfect. It does sit a little low but not to bad. I got the lavender one and it looks more grey than lavender which is great because of the colors used for my space.It is also super easy to put together.", 
    "I'm quite happy with this little chair. Assembly was pretty easy. (Just make sure you have the bolts REALLY tight. We had to retighten them after the whole thing was put together.) The color is great and it's pretty comfortable. I would buy it again.", 
    "Cute chairs they are perfect for my little house. They are small so you really need a small room I think.", 
    "I am giving this a 5 star because it is exactly as described. I read the prior reviews and thought \"how small could the chair possibly be?\". Well, it's VERY small, so I give myself 2 stars for not heeding the warnings from other reviewers. An adult can sit comfortably on this chair but that is not the issue, it how the little chair looks so tiny against other furniture. It really throws your eye off kilter. PERFECT for a child's room.", 
    "They are smaller than they look so be careful about checking the dimensions. They are good for extra chairs.", 
    "These chairs are attractive yet comfortable. One of the three chairs has splint wood on one of the legs.", 
    "This chair is a bit smaller (lower) than I thought it would be, but fits in just fine in my living room. color is as it appears online. as mentioned in other reviews, it is a bit difficult to put together, but with a bit of patience, it fits together fine. May order another in a different color for another room.", 
    "They are very small chairs. I think because the back of the chair is so short, it makes the chair look even smaller. It almost looks like it belongs in a child's room. It works but not my favorite", 
    "Pretty but a bit smaller than I expected. Check the dimensions to make sure it's ok for you. Otherwise very nice.", 
    "liked the chair, but had wanted it as a comfortable desk chair. it is comfortable, but it sits a little low for a desk. i'll just have to use it elsewhere.", 
    "To be honest, I got exactly what I expected for the price I paid and the fact that I had to assemble it myself. The chair itself is nice-looking, modern, and small enough for my basement apartment. It was easy to put together: screw on the legs then screw the back of the chair to the seat. Because it's a DIY product, the quality isn't great, but you do get what you pay for.", 
    "The chair is a bit stiff but definitely sturdy. I had hoped for something a little less firm but it is comfortable. Easy to put together.", 
    "This is a nice little chair. I ordered the blue color but found the fabric to have a very slight tweed to it in the green range. Ultimately, that worked well and I think the slight texture to the fabric will keep it looking good for years. It was a bit smaller than I expected so I would recommend looking at the dimensions carefully before ordering. That said, it turned out to be a perfect size for the corner of my guest room and I was quite impressed with the ease of assembly and the final sturdiness.", 
    "This chair looks like a much higher quality in the photos. The chairs are so small that they look like they are meant for a child's room. We ordered for a small lobby and had to find something else b/c they looked comical. If you need a VERY small chair then it will be fine.", 
    "The chair is a lot shorter than pictured. Pay close attention to the dimensions listed. Better as a seating chair in a living room arrangement, than as a home office chair, which is how I intended to use it. Other than the height, the chair is beautiful and sturdy, definitely of good quality.", 
    "Ivory is more of a cream color but is perfect accent piece", 
    "The chairs were not easy to put together. Very difficult to get them tight. Have had the chairs for 2 weeks and have had to retighten already. the fabric is very nice and chair is very stylish. Would have preferred a higher back.", 
    "Ordered this chair in charcoal to use at my makeup desk. Color was perfect as well as the fit. Just the right size. Love it.", 
    "I ordered two chairs. As I opened each box a stale smell of mold was apparent. While unpacking each chair there was noticeable mold/mildew on the wooden legs that presented as small white spots and a flaking of the wood. There was supposed to be plastic wrapped around the various pieces, no plastic was found. The quality of the fabric and cushioning also seemed suspicious.", 
    "The blue is not blue. It is teal with grey/brown specks. The chair is fine style and comfort wise but the color seen online is deceptive and it can't be returned.", 
    "This chair is really small. The dimensions of it are weird. However, I love the Bark color. Its perfect for our bedroom. I probably wouldn't have ordered it if I had truly paid attention to the dimensions and not just looked at the pictures. Overall its an okay bedroom chair.", 
    "I purchased this item to use for the built in desk in my kitchen, turned out to be perfect! The gray color was just perfect to match my kitchen bar stools. Probably not a great everyday chair but it is serving its purpose as an accent to my kitchen and family room.", 
    "The chair looked great on-line, its not really confy at all and I don't like the color that picked out it's a little lite to what the color looked like on-line.", 
    "This is a great staging piece of furniture. It does sit just a tad bit low, but that's forgivable. I'm using this as a showpiece in lieu of a sitting tool. The installation is simple and the look is nice and attractive.", 
    "The chair I received is not at all the way it looked on line. I ordered Blue, and this color looks like a dark bluish green and does not match my décor at all. It looks like a chair for a child's room it is so small. I am very disappointed.", 
    "This chair looks like it belongs in a child's room. It was not what I expected to receive and I'm a little disappointed because everything I have ordered from Overstock has been wonderful. I'm keeping the chair because of the immediate need. If you are looking for a chair an adult please do not order this one.", 
    "LOVE IT, NOT TOO SMALL, NOT TOO BIG. PERFECT FOR AN APARTMENT OR AVERGE HOME. IF ROOM IS LARGER, JUST ET TWO. SIMPLY MARVELOUS! COLOR JUST AS SHOWN ON PICTURE. LOOKS GOOD IN EITHER BEDROOM OR LIVING ROOM. MINE IS IN MY LIVING ROOM GOOD EXTRA SEATING.", 
    "This chair beautiful in color and style, but shabbily constructed. When you sit in it, you can feel the back give, as though any pressure will cause the back to separate from the seat. Found later that chairs carried by Marshalls in the $XX-$XX range were well-constructed at a much better price. I was extremely disappointed with this purchase. Will not use Overstock again.", 
    "We got this for a bedroom chair....which works all right. But we were disappointed in the color which was not a TRUE STEEL BLUE AS SHOWN IN PICTURE. But it works OK in this bedroom...and is not often used, so we have no complaints.", 
    "I was hesitant to order these because the dimensions made me nervous they would look like little kid chairs. We only wanted them For our bedroom next to a small table for ambiance so I ordered them. Once they got here and my hubby put them together I realized they were perfect for what we wanted them for. They are small but the seat is so big that it doesn't look like a little kid chair. We do not plan to really sit in them often since they're mainly for looks but the seat is comfy. The back is too short to really lean back tho. But again, they are perfect for what we wanted them for.", 
    "This chair while on the small side is very comfortable and well made for the price. I bought the dark brown and am currently using it for a desk chair. For comfort and looks you can' t beat it.", 
    "We bought these to fill an empty space in our family room, so I can't really comment on the comfort level. We bought 2 gray chairs and they are a little darker than what was pictured. They were easy to put together and feel sturdy enough. We did search around quite a bit because we didn't want to overspend on something that would only be used when we have company. I would say these chairs are a good value for the price based on our research. They look good even if they don't exactly match the color scheme we have going on.", 
    "This product is easy to put together and looks really nice.", 
    "The grey color is sooo dark- almost like a brown or tan. I ended up ordering the same style just the deco flower and that works but not for style. It is definitely not sturdy enough to actually really sit on! And like all the reviews- it is so so low. But it's cheap- definitely the cheapest one on the site and you get what you pay for. It looks good when you get the right color though.", 
    "A very small chair and the color wasn't blue it was a metallic teal", 
    "I purchase red sunflower and solid bark color. Well red is burgundy with black treads poping and bark is light brown with brown treads. I was hoping for those colors as all reviws said colors are a little bit darker. It was easy to put together, took me about 5 minutes per chair. Chairs are very comfortable and they look great.", 
    "Great chair for my entry way. Very comfortable. Very soft blue color.", 
    "Read the reviews on these chairs and decided to order them. I was not disappointed. They match the décor in my office and are perfect for the space. The color was true and the fabric quality was better than expected. They were easy to assemble and there were no real issues. Set aside about 30 minutes or so for assembly and give yourself room to work.", 
    "Perfect chair for a small space. Quality is good but I think the price is a bit high in comparison to quality.", 
    "Needed a simple, small, upholstered chair in the bedroom for sitting on while putting shoes on. The size, style, and height of this chair were perfect. It is also very sturdy. The color (red/burgundy) was much darker than I had expected, but that's not a problem. Where I WAS disappointed is that, along the seat front where the seat curves around to the front panel - and also for a 6\" horizontal swatch across the back cushion about halfway up - the fabric appears darker and almost worn. Also, it had a slight \"musty\" odor when taking it out of the box. But I decided to live with the color and fabric imperfections (the odor disappeared within a few days), because the bedroom has a rather rustic decor, so the \"worn\" look of the fabric and it being in a shaded corner work in the room.", 
    "Bought it for corner in bedroom for sitting to put on shoes and such. Perfect. Easy assembly with wrench provided.", 
    "I waited for the red chair to come back in stock. And ordered with great anticipation that it would work perfectly in my office, which as a red sofa, red valance and other red highlights. The chair is red, but it looks like someone came along and painted black over the red fabric, making it muddy looking, or even worse. It's drab. I wanted it to pop and it just sits there. It is functional as a chair in a space that needed one, but not pretty as I had hoped.", 
    "The chair itself is nice and comfortable, if a little low to the ground. Easy to put together too. Disappointed with the color, Blue = Green/Teal. Not worth the trouble to disassemble and return them, so I kept them, but I wish they had been Blue or Slate blue rather than greenish.", 
    "Sorry to be negative, but the color lavender was grey. Either I was shipped the wrong color, or the description lavender was just off. I have been looking for lavender chairs for years, and was super exited finding your lavender Deco chairs. To my great disappointment the color was grey. There may be more of a lavender hint to the grey than anything else, but it is grey never the less. I was getting more than one chair, but now I am hesitant. Could I have been shipped the grey chair by mistake. The box says lavender. Otherwise the Deco chair is a lovely little accent chair, and I highly recommend it if you get the color you want.", 
    "I bought two teal blue chairs, and they were very nice. The are a little smaller than other similar chairs that I had purchased before, but fits well into small rooms. They were more comfortable than I Though they'd be, given the size.", 
    "happy with the product,fast and free shipping is a plus ,loved it", 
    "The chairs arrived on time. There was no damage. They were very easy to put together.", 
    "I love this chair. I was looking for a smaller chair in my bedroom do I can sit down and put shoes on as I have a platform bed. This chair is perfect size all over plus my bedroom is on the smaller side. I also purchased the Whitman duvet lady month and put one if the pillows on the chair. It tied everything together and now my bedroom looks like a picture from A magazine. Very rich and classy looking. A must buy!", 
    "chairs are perfect for where I want to use them. Thought the fabric would be a velour type fabric but it is smooth. Assembly was not difficult but does take a little time. Can't wait to get my room put together to start using them.", 
    "I read the reviews first before I purchased and those were all very helpful. I was expecting to see a solid product which i did and was prepared to take extra time for assembly as the legs and back of the chair were required for assembly. In the end it took me about 20 minutes to put the legs and back of the chair on... For an inexpensive accent chair, it's built well and comfortable for occasional seating or extra seating in a living room, family room, or as I use it.. in my home office for others to use.", 
    "The quality of the fabric is average, but the irridescence made the chair look old", 
    "These chairs a re stylish and comfortable. I always get compliments on them. They are a lower than I thought they would be and that could be a deal breaker if you can't get up and down from low seats easily. They are low. But they are sturdy and good looking. Again, I have no kids or pets so I expect them to last me a long time. Not sure how long these stylish chairs could survive a bunch of kids though. Great for a formal room or adult only space. Not so much for a kid friendly family room.", 
    "Easy to assemble, but really small! I should have paid closer attention to the dimensions stated-it was my fault. The chair sits low so not good for a kitchen desk which is what I wanted and the back was not tall enough. It just is to small for my needs. Nothing wrong with the chair. I will pay closer attention next time. I will give the chair to someone else.", 
    "Product was what I wanted...wish it was a bit higher off floor, but would definately recommend again.", 
    "I bought this chair to use at a home office desk. I needed a chair with a seat height of 18 inches, as stated in this product's description. I just set this up and measured-the seat height is exactly 16 inches, so I cannot use it at all in this space. Also, 5 staples fell out of the seat cushion while I was putting it together. I may keep it as I am too lazy to disassemble and return it, but I don't think I'll buy furniture from this site again, as I won't be able to trust the description.", 
    "Perfect size for my little separate seating area within my livingroom", 
    "This Deco Chair is excellent quality, sturdy, comfortable, affordable & very easy to assemble.", 
    "I am very pleased with this purchase. I am considering purchasing another chair.", 
    "I was suprised at these chairs they are made of real wood and went together very well. I was not really looking for a comfy chair and did not expect it out of these for the price but they are very comfortable and look very nice in my living room.", 
    "This chair is much smaller than I had anticipated, but it works well in the bedroom. It's comparable to a Parson's Dining Chair except the back is much lower. Fine for den or bedroom as an accent or occasional use.", 
    "Was very pleased when chair arrived ahead of projected shipping/arrival date. Was very dissapointed to discovered chair color was charcoal and not gray as ordered. Not sure how this error was made being the label on the carton very stated Charcoal as the color! As for quality didn't expect it to be outstanding for the price being paid, but after assembly found the chair to be unlevel, had to place two chair leg pads beneath to level chair. The upside...the chair is extremely comfortable, and for the price do not think you will find better. Because of this factor, I will contact the seller to arrange for an return/exchange for the gray color that I thought I was getting. Providing the replacement chair do not have the same issue in workmanship, I will be satisfied with my purchase.", 
    "My husband put it together in no time . Just pay attention to the back legs ,there is definitely a right and a left . He got them on backwards and curved inward . Looked quite funny . Very happy with our purchase . Nice looking and very comfortable . Works well in bedroom .", 
    "I expected these chairs to be a little bigger, guess I should have followed measurements. Quality is fine, they are just super TINY", 
    "This is a great little accent chair. Other reviews said that it was small and it is. I guess it is all relative to a persons size and the size of your other furniture. This makes it work in small spots that need some furniture. It would work well in a bedroom or in my case, in the corner of a small living area. Great with a little table and cute lamp for extra seating and It would also be cute with two of them together in a visiting area. The backrest is shorter than the seat portion. I sat a cute pillow on the backrest and it looks great to add color to my room. It is sturdy and was easy to put together. At first I thought the legs were missing but they are inside the seat of the chair :) which opens with velcro. I would definitely buy another one of these chairs so if you need a nice little accent chair for that spot that needs something...this is a good pick. I can't believe that I bought a nice upholstered chair for less than I pay for shoes! Yea!", 
    "I ordered Charcoal color and what arrived was more Grey in color that's a negative. Material 7.5 our of a 10. the back legs could be a bit sturdier. I heard a lot of cracking when I was putting the chair together. (hopefully I won't fall when I sit on it ) I ordered a similar chair with Scrip/ linen a bit larger in size and the back legs with more wood. Constructed the same but the Script chair appears a bit more sturdier. Cute accent chair but the color is WAAAAAYYY! Off!", 
    "The holes for assembly weren't exactly right. It sits much lower than the picture would have you believe, and just doesn't seem really stable or sturdy. Should have gone to a furniture store so I could test it out first. Wouldn't recommend...especially if you'll have guests over 130 pounds.", 
    "My major complaints are that the seat height is slightly too low and the seat back is too far back to be a comfortable desk chair (which was why I purchased).", 
    "good chair for show. I do not think it will hold up if anyone weighing more than a certain weight sat on it. I like the chair though.", 
    "So far, I love the chair. The shipping was easy and fast.", 
    "Unless you are under 4 feet tall or a child who wants furniture for their doll house do not buy!!!!!!!!!! The front legs are a bit more than 9 inches long under the cushion. I am so dissapointed in this chair it makes me sick. The box says you can return any product before 30 days if unopened. You have to open the box to see if you like it. I am so mad I would give this negative 5 stars-***** if I could! unless you want childs furniture skip this chair all together.", 
    "Very sturdy chair, not hard to put together. Well made, fabric is actually nicer than what can be viewed online. Only complaint is they are kinda small, but actually work well in my small space. Would recommend to someone.", 
    "loved the chairs for the price of the money - however would have hoped it was slightly larger.", 
    "I needed a chair for our kitchen desk. This one worked perfectly. I have a built in display case in front of the desk work area and I wanted my display piece to be seen. I needed a chair with a short back and this chair was the perfect height. It arrived as scheduled, undamaged, was easy to put together and is comfortable to sit on. I am pleased with this purchase.", 
    "looks very nice in my bedroom; they are for accent only so I wasn't as concerned about the quality or sturdiness, but they are well made and were easy to put together", 
    "The chairs were amazing for the price. Assembly is required, and it is a pain to put all of the legs on. I would still buy these chairs again because they are great accent chairs and suit my room well", 
    "As others said, it was much smaller than I expected. It is good for children or petite ladies, but definitely not a large man. They look okay once they are put together however one of the two chairs I ordered was missing a washer and the instructions. Unfortunately that was the one I opened first so I had to figure out how to put it together on my own. All in all a good deal if you don't mind a very small chair.", 
    "I guess I shouldn't have expected much of these chairs. They are poor quality, pretty wobbly, even after reinforcing with extra screws. The back legs are very thin and I don't know how long they'll hold up (bought them for a church). But I only payed $****/chair so no surprise there.", 
    "item is small just what i wanted for a small living room. It very firm and easy to put together.", 
    "I bought these chairs as multi-purpose chairs for decorative and office usage. The chairs are very well made and are serving the purposes well.", 
    "Love these chairs - they're not too big and provide a nice conversational atmosphere in the living room. And they look great! The fabric is actually very detailed, which doesn't come through well in the pictured. I was very pleasantly surprised.", 
    "I ordered two of the Oyster colored chairs. I was plesently surprised by the fabric. Much nicer than I'd expected for such an affordable chair. It only took me about 30 minutes to assemble the legs. One thing I did not pay attention to were the dimensions of the chair. Although the seat is at a normal height, the back of the chair is quite low. They seem pretty comfortable, although they haven't been sat in much.", 
    "This was my first time purchasing a piece of furniture online and I must say that next time I will definitely take measurements. I didn't realize how small the chair was going to be so I wasn't able to use it as an accent chair to my main sofa which was my original intent. But it worked out well as an accent far wall right next to my Ikea bookshelf!", 
    "The chair is cute and will work well for an accent chair but the quality was not the best. Some of the seams were not great and the one leg is not straight and can't get it straight with force. Again it is cute for an accent chair just wish leg was straight.", 
    "I really like the way the chair looks and the fabric but the legs aren't the sturdiest and sometimes the screws become loose.", 
    "The chair is nice, strong and easy assembly.", 
    "you get what you pay for with this chair like everything else you buy-------came with no instructions---was missing a washer----and rear left leg and a front leg were damaged----------with that being said---customer service is excellent--they are very responsive to problems and resolve them-----not thrilled nor disappointed-------------------------it is what it is--------like other reviews state it does sit very low to floor and is not real comfortable-----this is ok for a chair that won't get much use", 
    "The piece was missing a shelf and rack. Twice the company mailed me additional pieces. Neither piece fit. I'm stuck with a bookcase missing the top shelf. What do I do with that? Don't waste your money or your time!!!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Deco-Solids-Accent-Chair/7310920/product.html?recset=3c5f00fb-ccae-4e4d-98c6-b3a95278a038&refccid=N7LCVM6BVCT3V62AH52IKAZBIE&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7310920/Deco-Solids-Accent-Chair-1e4c195a-3b6b-4457-b73b-b2e903f80864_600.jpeg"
  ], 
  "description": "This Deco Solids accent chair combines traditional and contemporary\nstyle, making it simple to incorporate into your existing home\ndecor. This upholstered accent chair features a kiln-dried hardwood\nframe, curved legs with an espresso-colored finish and a tufted\nback. The plush seat has been constructed with high-density foam.\nThis chair comes in several colors for added decorating ease. Kiln dried hardwood frameTufted backCurved legsMaterials: Upholstery grade fabric, high density foam\n  seatingFinish: Espresso finished wood legsUpholstery materials: Heavy upholstery grade fabric in bright\n  colorsUpholstery color: Green, blue, grey, brown, lavender,\n  charcoal, ivory, barkUpholstery fill: High density upholstery grade foamSeat dimensions: 18 inches high x 21 inches wide x 23 inches\n  deepDimensions: 30.7 inches high x 21 inches wide x 27.75 inches\n  deepStyleContemporary, TraditionalMaterialFabric, Foam, WoodFinishBlue, Brown, Charcoal, Espresso, Green, WoodPatternSolidChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightLow BackColorBlack, Blue, Brown, Green, Grey, Ivory, Multi, RedFurniture Frame MaterialWoodFurniture PatternSolid"
}