{
  "name": "Deco_Sunflower_Accent_Chair", 
  "price": "EUR 109.37", 
  "reviews": [
    "This is my first order of furnituret I had not seen in person or sat on. As a retired Interior Designer, I must say I am impressed. The color, style and quality pleased me. Even the assembly was easy for this 74 year old lady. What a clever design! It was the perfect size & design for my living room. I was also happy about all of the running around and shopping that I was saved. A satisfied customer, Karen M.", 
    "Loved the way this chair looked and felt to sit in...just don't sit in it. After a few months of minimal use this chair and a second I purchased later snapped where the seat meets the back of the chair. I tried adding additional screws, tightening things, etc. Just poorly designed for wear and tear.", 
    "I love the chairs, came in 25lb boxes and some assembly is required. The tool is included. With the tool setup takes about 10 min per chair, if you have a drill it's only about 5 minutes. Very easy. Once you build chair be sure to sit in it to even out the legs too.", 
    "Great chair, just pay attention to the size before ordering.", 
    "Beautiful chairs, however one of the two that I purchased gradually got looser and looser where the base connects to the back. thinking the screws needed to be tightened, I checked the bottom only to find that the screws were still tight. The wood portion of the back however that the screws attach to was separating from the rest of the back. The back is assembled largely with nails and staples, and it's not surprising that it didn't hold up for very long. I didn't expect it to be the highest quality chair for this price, but less than a year of light use is disappointing.", 
    "Great value for the money. Chair is truly an accent chair so do not expect for it to be large or extremely comfy. I purchased it as an accent chair for a bedroom so it worked out perfectly. I bought the red one, and it is beautiful! It was extremely easy to put together, and it was well worth it. I would buy it again, if needed.", 
    "good for a bedroom....they smelled at first..they wiggle and creak after assembly..and are very short legged...there ok..but don't really please with them", 
    "I love the color and subtlety of these chairs. However, the basic design is flawed. The seat screws flush to the back legs, not supported by them and given the fullness of the cushion, it's no wonder the first heavy person (170 lbs) that sat in one broke the weak support. We tried gluing the wood back together but the framework is shot. I bought two and keep the second one pushed back against the wall to give it adequate support. Not sure what the return policy is since this is my first real problem with quality. Think twice before purchasing this poorly designed chair!", 
    "The chair is adorable. It is small but adequate. I even assembled it without my husband's help.", 
    "The chair came unassembled but was easy to assemble. Seems sturdy. Color great. Really like it", 
    "I had been looking for weeks for 2 chairs to fill in my living room and when I found these I knew I found exactly what I was looking for. I placed my order and they were delivered in one week just as predicted on the shipping date. I was very happy with the shipping package and how easy they were to put together...we get compliments on our new chairs and how great they look in our room.", 
    "These are lovely occasional chairs. I needed them to fill a spot in my bedroom. They are OK for furniture but I certainly would not get them if I needed to sit on them often. You get what you pay for and these are nicely done.", 
    "This is a gorgeous little chair. I was imagining it a little larger, but it will serve its purpose. The fabric is really nice and of course the pictures do not do it justice, it's so much more attractive in person. I don't believe this is a good chair for a significant amount of use, but for the price you can always get another if something were to happen.", 
    "You will see this chair under two different item numbers with the same description. I ordered one last week and liked it, so I decided to order a second to have a matching set. The one I received last week was charcoal with beige flowers. The one I opened today was charcoal with white flowers. I've decided to return the beige flowers and Overstock was really nice about it since the description on both item numbers did not specify the color of the flowers and I'm not being charged for the return. I will now order the white flowered chair and will be happy. Now to the chair itself. It was easy to put together and has good lumbar support for a small chair. I don't think it's made for heavy use but will be nice as a guest chair and goes really well with the Charcoal Cape Sofa I just got from overstock and you can't beat the price. Just be aware that the two different item numbers are different colors.", 
    "the chairs are small and short, therefore they didnt work for me in a bigger space. true to color and really cute, just small", 
    "Chairs arrived quickly and were packed well. I bought 4 for an office setting. They are a little small for some clients to sit on, but they look good and will serve their purpose.", 
    "Very decent value for money spent. Chair is identical to web description in color and size. Rather easy to put together as nicely and compactly shipped. I was looking for a bedroom chair that was on the smaller side, and this fit the bill perfectly. Might have chosen a lighter color in retrospect but this chair goes well with my bedroom decor. Is comfortable to sit in as well. Satisfied with my choice but don't know if I would use it for every day sitting in family room, dining room, or living room. Would recommend this to others.", 
    "The lavender chair is so pretty. I put them at the end of our queen bed and they fit perfectly and look great. They are small though, I knew this going in but make sure that's really what you want. They were super easy to put together and are very sturdy. Great buy and great price!", 
    "We put six of these chairs in a grouping around our mallway at church. They compliment our current seating and matched perfectly the decorating scheme that we've used. Beautiful product for a good price and they arrived promptly and in perfect condition.", 
    "This chair is very expensive looking and quite comfortable. I use it as an accent piece in one of my offices.", 
    "I bought these chairs for my dining room seating area. they are the perfect complement to the dark walls and brighten up the room. They were easy to put together, and while they may have a sunflower design, it is very subtle. These chairs are amazing!", 
    "I was looking for two burgundy, small chairs and these are perfect. The description said \"red\" and was worried because I needed burgundy and it indeed has a burgundy background with redder sunflowers. Can't beat price and chairs were super easy to put together. Very happy with product.", 
    "This is a burgundy red chair. It was fairly easy to put together. The flower pattern gives it an elegant flair. The price is great.", 
    "Good quality and great value", 
    "The chair looks very nice in the bedroom I bought it for, however putting it together was quite laborious and fiddly, the chair is quite low to the floor too! But the color and the style is great very pleased with it", 
    "Much better than expected. This is a great accent piece for casual use. Quality is so, so - but very nice & decent for casual use. Love it!", 
    "Not what I expectedThought the back was a bit taller, does not look like the picture", 
    "the chair is beautiful but the color is a little off. It looks more grey than lavender.", 
    "Very Comfortable, I love the colors", 
    "Great little chair that went together easily & looks great!", 
    "We can only use these chairs for decorative purposes. Too low quality for use.", 
    "This is a nice chair, I am using it for staging so it won't get heavy duty usage, and I can not state that it would stand up to that. However, it was easy to put together and looks nice.", 
    "I bought two as accent chairs for my living room. They are nice enough for occasional use but one came with a leg that doesn't quite line up properly and on bare floor it wobbles a little.", 
    "This is smaller than I anticipated. Although it is a good sturdy chair.", 
    "The chair is very nice looking. It is on the smaller side, but the dimensions listed are accurate. The problem is that the bolts connecting the back to the base require constant tightening to prevent wiggling and squeaking. This is not the worse thing in the world, but is decidedly non-ideal.", 
    "pretty but not very sturdy - not good for much except to drape clothes on or maybe for a small child to use.", 
    "chair is not stable and the legs need to be retightened often", 
    "I bought this chair due to it's smaller size and the smaller bedroom space I needed it for. I ordered the brown color and couldn't be happier. It's a very soft brown and the flower accents are the true brown. I only sit in it long enough to put my socks and shoes on so I don't know how comfortable it is for real use. I would've given it 5 stars except: during assembly the back legs require you to get them under the chair's fabric (which is really tight) and under a very thin piece of foam. When trying to achieve this the foam moves and bunches causing the fabric to (which is visible once you're finished). To avoid this bunching I had to redo it and spent most of the assembly tune trying to address this issue.", 
    "The chair broke within a month of purchase. Very flimsy. Do not buy it.", 
    "liked it as accent chair in my office", 
    "I bought a few but they broke quickly. Put it in the corner for looks but don't expect it to last if anyone sits on it. I was very disappointed.", 
    "I bought two of these chairs to stage a home for sale and it looks great! It was well constructed and easy to assemble. LOVE it!", 
    "great chair it is a beautiful as a accent chair.", 
    "Lighter than in the picture, but I'm glad about that. It is also much smaller than it appears. However it is easily put together and feels sturdy to sit on. I'd buy another.", 
    "This chair is very cute but smaller than I expected. Also, not sure about the durability as the back legs are tiny and somewhat spindly. If rear legs were same size as front legs it would be much better...", 
    "Cute chair - a little smaller than I imagined but great for small space.", 
    "I bought two of these chairs for bedroom reading. They assemble easily and look great. These are not large but work perfectly in the space I have available. Great accent pieces for my room!", 
    "Really smaller than I thought", 
    "THESE CHAIRS ARE CERTAINLY DECORATIVE AND ARE GOOD FOR PLAYING CARDS OR A SHORT SIT BUT NOT FOR WATCHING TV.", 
    "The chair is fairly easy to put together and is adorable, but not the sturdiest piece of furniture. I use it as a decoration, but not something I would sit in on a daily basis.", 
    "Great chair. Very happy with it.", 
    "After receiving my first Deco Sunflower chair, a year later I ordered a 2nd chair. Although I loved it, the pattern was slightly different and I wasn't able to stand them side by side. I'm trying to convince myself that no one will notice. lol", 
    "Quality is OK for the price, happy", 
    "great for a guest room not to big fits in a corner perfectly.", 
    "The chair is a bit short for the original room intended for, but I ended up using it as an accent chair in my guest bedroom.", 
    "Cute but short! Comfy and easy to assemble!", 
    "At first look I was happy with the appearance but once I put it together I was shocked by the size. I bought this for the guest room but It will fit better in my 2 year old grandsons room. Pay attention to dimensions!!!", 
    "I needed a reception type chair for my office, and this one was reasonably priced and matched my color scheme. When it arrived, it was easy to put together (my high school child did it), super light weight, and is quite comfortable. Plus, it has a larger seating area so taller people are comfortable in it.", 
    "Fairly easy to put together, smaller than I thought...but colors look same as photo", 
    "I love this chair. I bought it in red. I'm a large person and this chair is very comfortable for me and is a perfect height from the floor. I use it alot. I recommend this chair for good comfort, easy to rise from and the nice decor.", 
    "Looks good, easy to put together. It's small but I wanted it for a small space so that works for me!", 
    "Beautiful. Great style. Perfect.", 
    "Like others I didn't pay much attention to the measurements. I have bought similar styled chairs from a well know brick and mortar store and thought these would be similar. They are only in assembly. This is well suited for a child's room, not for adults", 
    "Love this char, friends and family think its very comfortable", 
    "The chairs are pretty, but the legs to not fit tightly where they are supposed to and the chairs wobble like crazy. They ARE pretty, though.", 
    "A tidy small side chair. Charming rich colors that will enhance my seating area in the rec room.", 
    "Love them. Perfect in my waiting room. Have received many compliments.", 
    "Look very nice in my living room", 
    "Overall, this is a great decor chair but do not use for sitting. It is of poor quality and not functional. Very small.", 
    "Great Accent Chairs for our formal living room.", 
    "I love this chair EXCEPT, it sits VERY low and does not make a great dining chair as I had hoped. Measure is your key word here everyone", 
    "I wouldn't suggest using these as every day chairs, but they're comfortable, easy to assemble, and the fabric appears just as it is in the photo - very nice fabric - again, for the price.", 
    "My wife was skeptical due to the great price, however we're both pleased with the quality & ease of assembly.", 
    "color was much different that shown online,i should have sent it back.", 
    "Came in a small box but easy to assemble. Wouldn't recommend for high traffic areas with a lot of sitting, but a beautiful accent chair that goes nicely in our living room.", 
    "Nice chair, but not the look I was looking for.", 
    "We bought the red color, its beautiful although slightly darker red, comfortable", 
    "Cute chairs; however, very short chairs that fit in a lil brown box. I decided to put these in my daughter's room, because they're fit for children. Not very durable.", 
    "The chair did look great however Ivory is actually a light khaki", 
    "Comfy and nice fabric. Good value", 
    "This is such a nice accent chair. Comfy, at least for a little while - not like a puffy couch, of course. But perfect for what it was created for.", 
    "You get what you pay for, this is a lightly colored violet/gray chair we use in our bedroom and its nice, not super sturdy, I wouldn't stand on it but it serves our purpose.", 
    "Its ok. Shorter then expected.", 
    "This chair looks like it goes in a small child's room. I bought it for my bathroom but I am going to give it to my 6 year old granddaughter for her bedroom.", 
    "Beautiful! I haven't assembled, yet, but love the color and quality of the upholstry.", 
    "Just what I was looking for. Added some texture to the room, while keeping is neutral.", 
    "The chair belongs in the Alice in Wonderland story....big seat cushion but tiny back....which makes it, on appearance, seem odd. It was easy to assemble however there was one (1) washer missing (supposed to receive 12; 11 was the number in the plastic bag. Fortunately for me, this chair is going in a corner where there won't be a lot of traffic for a guest to sit. The price is excellent and the quality of materials is satisfactory.", 
    "love it in my living room!", 
    "I ordered this chair in the red and could not be happier with it. The color is a beautiful dark red that looks elegant. It is the perfect size for my small room, but does not look too small. It is really comfy to sit on although I am just using it as an accent chair. I was a little surprised at the style at first, as I had never seen \"Art Decco\" chairs. the seat part is a lot longer than the back, but I really liked it after realizing that was how it is supposed to be. Love this purchase!", 
    "They are little small in height...", 
    "excellent chair love the colors (it is exactly as shown) It is comfortable perfect addition to a bedroom or any room for that matter.", 
    "Very cute chair, especially considering the price. Can't comment on assembly as I had someone do that for me. Love the fabric.", 
    "Looks great as an accent piece in my bedroom", 
    "The fabric on this chair is beautiful. My only complaint is the size...this chair is much smaller than I was expecting, but if you are looking for a little accent piece this is perfect.", 
    "It's a perfect size for my small bedroom, very comfortable. It was easy to assemble. I think, it took me five minutes. It's seems quite sturdy.", 
    "I really love these chairs, they are beautiful and made well.", 
    "I like them. Fit well in my space and they were what i was looking for. The only down side is that the legs sometimes come loose, so I'll tighten them after I entertain... and they aren't the most comfortable chairs - stuffing is pretty stiff.", 
    "Chair was exactly as ordered! Super easy to put together and ddid not even need any tools to do so! Very happy with this purchase!", 
    "The chair is much smaller than I expected. It is very well made and very attractive. I am planning on getting another one. Because of its small size, I think it would look better as a pair.", 
    "The chair is a bit smaller than I expected. It was for my daughters room. It is sturdy. Holds my husband (300lbs) for reading time. And looks great!", 
    "This chair is hardly comfortable; You feel like you're sitting on plastic, however I'm using it primarily as an accent chair so it doesn't matter too much because it looks nice and will not be used often. Also it is very low.", 
    "Easy assembly and very sturdy!", 
    "Really love the color and just the right size if you have a small room and want something in the corner. Fairly comfortable for a small chair.", 
    "Loved this chair. Went perfect in the spare bedroom", 
    "The deco chairs are great. Didn't th they would be comfy but they are. Really easy to put together too.", 
    "Easy to assemble and perfect size for bedroom accent chair.", 
    "Used in my daughter's small apartment bedroom-very pleased. Exactly as pictured.", 
    "Love this chair and it was so easy to put together.", 
    "The chair is nice but it is very small and low to the ground. It looks like it needs to be in a child's room or a very small loft condo.", 
    "Easy to assemble and a great accent to my room", 
    "Great addition to our room t", 
    "I purchased this chair for my place of buisness and I love it. So easy to put together, and it looks great. If I had the space, I would purchase another one. I would also definately purchase this for my home. Great quality for the price!", 
    "These chairs needed some assembling but they were packaged and shipped with plenty of protection, easy to assemble and the quality is very nice. They have a lower back than typical accent chairs and are perfect to go in front of a window.", 
    "I have this chair in a corner of my bedroom to sit on when I am dressing or putting my shoes on/off. Just the right height and I am 5'6\". Fabric is really nice and looks good (I got red color which is really more of a claret or burgundy) and worked out perfectly. It was easy to put together. I am 70 and even I was able to able to quickly put it together and feels sturdy enough that I feel confident that I won't fall on my butt when I'm sitting on it. I also use it to throw my clothes over at night when I just want to get into bed and not worry about putting them away :-). The perfect chair for me and just what I wanted.", 
    "Bought the lavender chairs for our master suite. We wanted a light grey chair and this one appeared in the picture to be more grey than lavender. The picture was accurate, this chair does not have any lavender coloration, it is pretty much just shades of grey and fits perfectly with our master suite. The chair is short but fits perfectly in the space. They were very easy to assemble, and are super comfortable.", 
    "The chair is smaller than I thought it would be, but it is very cute.", 
    "very nice chair, takes some time to assemble but worth it", 
    "I love the look and style but was surprise to see how small it is, its easy to put together.", 
    "This chair is very easy to put together, but I was disappointed when I realized that the chair is too short. It is great for putting on shoes, butnot for a living or family room setting (with short legs). Perhaps the description should mention this detail somewhat better.", 
    "Perfect for bedroom for putting on shoes. My hubs loves it", 
    "I was looking for a smallish chair for the corner in my bedroom. ....just somewhere to sit and put on shoes/slippers, but not take up a lot of space.. This was the perfect answer.", 
    "I bought two chairs for my bedroom . They are functional. But little small. The quality is so so . But the price is right and the style is nice.", 
    "this chair is more for a tween ten an adult I would return it but not worth the hassel ! it is over priced ,not thrilled about it ! it is what it is ! lesson learned", 
    "Very comfy chair. We were looking for a smaller accent chair for our smaller living room and this fits perfect! We even got two! We got it tons of compliments already. Nice color choices too!", 
    "These were the finishing touch in two bedrooms. The were just the right size and I love the print", 
    "It is a nice chair and the colors are very vivid. It is very easy to assemble but as an accent chair it is very short. It looked like it belongs in a child's room but since we were using on a corner on its own, it worked great with the design of the spare bedroom in my client's home.", 
    "Waaaaaay small...looks like kid chair. I have to ship them back! The chair is just off the ground, soooo small. I don't think I shall purchase furniture online again.", 
    "Stylish comfortable chair. Sits a little lower than I expected. I bought the gray color and the color matches the online picture.", 
    "Pretty easy to assemble. Really cute design. Could use a but more support and cushion but overall it's a pretty good chair. Happy with the purchase.", 
    "We ordered 2 matching chairs for our office space. These were a great value & design and suited our purposes well. I would recommend them.", 
    "The chair was delivered in a timely manner. The price was affordable and FREE shipping. Easy to put together and looks great in my guest room. It is comfortable and is made well. I would recommend this chair for any one wanting extra seating that looks stylish and is a good value.", 
    "I was shocked at how SMALL this chair is. From the back it looks like it is meant for a child! I should have paid more attention to the measurements!! It is so small I cannot use it in my living room, so I put it in a corner in my bedroom, which works okay.", 
    "The chair was just what I expected I put it in the bedroom and it fit in with the decor perfectly and is still very comfortable. I would recommend this product to my friends", 
    "I bought this chair for my girlfriend for Christmas. She very much liked it. It was not difficult to put together, just be sure to tighten everything as much as you can. The chair itself is pretty comfortable. We use it mostly for decoration or if we happen to have more guests than usual. It seems as though it is decent quality but that it may wear down with heavy or consistent use (the chair legs seem like they would loosen with extensive use or abuse). Definitely looks nice and is comfortable. A great deal for the price.", 
    "poor craftsmanshiplegs need struts to stabilizenot sturdy", 
    "I ordered two of these chairs and they are awesome! The fit perfectly in the area I wanted them in. They are smaller sized chair with low backs which was perfect for my taste. Great color too!", 
    "I just remodeled my master bath and had a place to fill. Saw the accent chairs and decided to try one. It fits perfectly, and the color is just what I wanted. The chair is easy to put together and very comfortable. May be ordering some more in the future.", 
    "A little more assembly required than I had hoped but very satisfied with the product.", 
    "Really no complaint at all of this cute chair. Works great in my hallway. I ordered the \"bark\" color, not knowing if it would be exactly what I wanted, but was pleasantly surprised. love it. Not too dark. Rich blend of fabric, makes it an excellent focal point. Very good construction for a cheaper chair. Easy assembly.", 
    "I was looking for additional furniture to my couch and was hoping to find a confortable chair and I found it on this item, The color was a little different than expected and the size was smalller than what i expected, I almost 5' 7 so if you have long legs this may not be good, It is very confortable and works well in a small living room area, I think its an excellent price for the prouct, The 1st week of so i noticed one of the legs had become loose and i was surprised since the chair has not been moved but i took care of that by tightening the bolt that screws into the seat, Overall i am plleased with he purchase, I only hope the make this color for the Enzo arm chair model so that i can also get that one, The fabric is nice and i like the dcor, it is very confy, A big plus on that!", 
    "chair is very small and short looks odd, material is beautiful but it looks like a child's chair", 
    "The chairs are very stylish. They are very small. Would like a taller back and the seat could sit a bit higher. I have these in my home office. Would have used in our living room but they are not large enough.", 
    "I love it. Easy to put together! Wish I would have bought two", 
    "Don't let the price of this chair deter you from purchasing it. This chair is very nice and is decent quality. It's well worth the price. Remember though, this chair is an accent piece.", 
    "We needed new chairs for our office, ordered two, really liked them so ordered another one. Have had several compliments on them already. Went together easily color was just as shown. Probably not for every day hard wear but quite worth the money", 
    "What a great buy and they are gorgeous, I wanted to create a smaller conversation area in the living room with a couple side chairs and these fit the bill! Not only are they a match to my rug, couch, they are comfy to boot!! I wish I could post a pic, they took very little time to assemble and are very sturdy and beautiful.", 
    "Unless you are looking for a very small accent chair, this won't fit the bill.", 
    "My husband (88) put these chairs together...very easy. We are pleased with them for the 'extra seating' area we have planned in another house.", 
    "Don't expect a chair that will hug and support you. This is just for decor or occasional use, like wearing socks or shoes (only reason why we bought this). Depends on where you intend to put or use the chair, you get what you pay for the price. I would recommend the RED chair though. Really nice:)", 
    "I ordered red. it is beautiful burgundy color and sunflowers are lighter in color. Solid burgundy has black treads incorporated in material and flowers are bright burgundy. It was very easy to put together, took me less then 5 minutes. Chair is very comfortable and I love it. Great value for the $.", 
    "If you just want a chair that looks good, this one is very nice. However, I'm not sure about sitting on it. It makes a loud crinkly sound every time someone tries to sit down. It's not a normal sound furniture usually makes. It sounds almost like there's plastic right under the seat fabric. I've already told my husband and son not to sit on it because I don't think it will support them. Nevertheless, I like the way it looks.", 
    "Absolutely love this chair! The only change I would make higher back support but otherwise classy chair for a great price!", 
    "This chair looks great in person. It's true it is kind of small but it is perfect for where I needed it. I wanted a nice chair for my walk in closet to put on shoes, etc. It's decent quality but you don't want to use it for sitting all the time, it doesn't seem to be that durable but the red is truly nice looking in person.", 
    "It's a nice chair for small spaces. Comfortable . One of the two chairs I own makes some noise at a certain angle. But overall the product is good, look and feel wise.", 
    "a bit smaller than expected. still good for bedroom space. got at a good sale price!", 
    "Chair arrived and was fairly easy to assemble. However the legs are wobbly and I've tightened it as much as possible. I don't think these chairs will last that long and since there more for \"accent\" pieces I'm going to keep them. Price was good but again I hoped the quality would be better. I did notify Overstock and they offered me a credit to keep the chairs. I was very pleased by this and will remain a customer of Overstock.com. Also, I've never had a problem with previous purchases.", 
    "My interior decorator asked where I got this chair because it is so pretty!! I proudly told her Overstock!! The color and pattern give it a touch of sophistication. I am using it as a desk chair in my bedroom so it doesn't get as much use as in a family room.", 
    "Our spare bedroom is quite small so with a queen bed, a night stand, and a TV already in the room I needed a small but comfortable chair to fit the space. This chair was perfect! It has a small footprint and the fabric is ver rich looking. My latest guest said it was very comfortable.", 
    "The chairs are very well constructed. They are very firm so more of a display/quick seating option rather than something you would sit in for long term. I thought the ivory in the picture looked more like a washed out white which is what I wanted. The actual color falls along the tan/gold side.", 
    "Beautiful chair, but rather small. I should have paid more attention to the dimensions when I was ordering it. Very short chair. I am using it in my bedroom.", 
    "Bought as a side chair for living/reading area. Has already been used many times. Very comfortable. Blends with my other furniture. Takes up very little room. Kitty thinks it is hers.", 
    "I love these chairs. Only drawback is that they are not even when the whole chair is put together, so there is a slight wobble. I just use foam as extra padding to make the whole chair level.", 
    "This chair is only good for a child's room. It is extremely short and does not compare to similar chairs in size at all. Looks are very deceiving and I was purchasing it for a large bedroom to sit next to a nightstand against the wall. The nightstand is larger than the chair! Hate it!", 
    "I ordered this chair for my daughters apartment in NYC because it was small, It looks perfect and looks much more expensive than it was", 
    "I purchased the lavender chair to use in a guest bedroom that has lavender painted walls. It looks great and is very comfortable!", 
    "This Chair was great and fits it the small space I needed it for. It completes my living room!", 
    "The seat is a little bit stiff and the chair creaks a bit where the back and seat bolt together. Assembly was easy. It's not a chair you want to sit on to watch 2 movies in a row but it is great as an accent or conversation chair.", 
    "Like other reviews say, this chair is smaller than my other chairs in the same room but it looks great. The sunflower pattern is a good contrast and works well with my white rug and beige furniture. The subtle difference will pull in the colors if you don't exactly have matching furniture. It took a little effort to get the back legs on. You have to try to clear some space away from the hole to get the bolt in but, with the design, it covers up the bolts completely and looks great from all sides after dealing with this minor quibble. I'm thinking of buying another one for another room. Best of all, I weigh close to 300lbs and felt safe sitting in it for the short amount of time I did. Only con, if I call it that, is that I wish the back of the chair was higher (if not the same height as the depth of the seat cushion). That's a minor complaint. I'm happy with the product.", 
    "You get what you pay for. The color is accurate. The material is poor and craftsmanship is poor. I had to order several replacement parts, which took 1 1/2 weeks longer. It is much smaller than traditional accent chairs.", 
    "Nice accent chair in living room for extra seating! Nice chair!", 
    "Very please with the chairs; I ordered 2 in red. the color was as expected and they match my decor.", 
    "Love the product. My only complaint is it took a long time for the chair to get to us. Never had this problem before as normally all of the things we've bought from Overstock comes in a timely manner. However...I'd still buy the product from Overstock again.", 
    "Receiving the chair requiring assembling my have floored a non assembler. But building the chair was quite easy and all the tools were there. It really amazed me to see such a chair as this in a box. However, I was quite proud of myself to assemble such a wonderful beautiful accent chair. The words \"accent chair\" describes the chair, perfectly. I just recently moved into a new apartment and it fits the space I wanted it to most ideally. Thanks, I will continually come back to your web site and recommend it for others to do their online shopping.", 
    "You really cannot go wrong with these chairs. They are not tall chairs though so be sure to confirm your measurements. It is basically an accent chair and not a full scale chair. It is sturdy for a typical person to sit on it.", 
    "I was looking for an accent chair, I looked at many and finally.decided on this one on overstock, I'm so glad I did because it turned out to.be the best decision, it was perfect!", 
    "Every thing said in the description was true to the chair. Remember to look at the dimensions because it is short just as described. Only complaint I had was that putting it together was not very clear so the back legs ended up going the wrong direction. I would change them if I can work up the energy to redo them. Very cute chair though.", 
    "These chairs arrived exactly when stated, matched the color and description of the website, were easy to put together (although the nuts and bolts were a bit oily/greasy and thus repeated hand-washing throughout was necessary), took less than an hour to put 2 together and we are not handy. They are lovely, comfortable, elegant, and really perfected our seating area. We had a \"leftover\" room in our house that was unused. These chairs set the tone for a comfy reading space we created. I have seen very similar chairs for double, even triple the cost at Pier One Imports and other websites. These seem to be the same in quality from everything I've observed, felt, etc... highly recommend. We are very happy with them so far!", 
    "I decided to buy this chair because the price was much lower than accent chairs on other sites, or in the stores. I bought the Ivory chair, and the color looks the same as pictured, but there were 2 stains on the fabric when I opened the box. The chair is also much lower to the ground than I had anticipated, and it does not feel sturdy at all when you sit on it. One side of the cushion sinks lower than the other, and I was also missing one of the washers to put the chair together. Overall you get what you paid for since it was only ***. I would not purchase another.", 
    "Beautiful chair! Looks expensive and chic. As other reviewers have said, it is small, but that is what I was looking for. I'm using it in my salon in the facial room and I didn't want it to take up much room. Lovely accent piece.", 
    "This chair is a wonderful accent piece! It is small but comfortable and sturdy perfect for a bedroom. I love it :)", 
    "Easy to put together, and they fit perfectly in my living room... This is a nice inexpensive chair for those of us on budgets, that desire a splash of color and style. They are not overly comfortable, but sufficient enough for occasional use.", 
    "I love these chairs! I bought 6 of them for my guest waiting area and they are just what we needed. They are stylish & comfortable as well as easy to put together. We have had many compliments about them.", 
    "This chair is a nice value and comparable to may other much higher priced chairs on the market. It's exactly what I was looking for in terms of size, comfor, style and color.", 
    "Nice chair. Perfect for an office or bedroom. Too small for my living room.", 
    "I ordered 2 of these chairs in charcoal color .The fabric looks great. The chairs are comfortable, they are ideal for small conversation areas.", 
    "its is a lovely deco chair. the box it arrives in was small. easy enough for my 18 yr old to put together. best price I have seen for one, and does not look cheap in any way. very nice indeed"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Deco-Sunflower-Accent-Chair/7310917/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7310917/Deco-Sunflower-Accent-Chair-98488466-b407-42fa-b570-592970ce9f5c_600.jpeg"
  ], 
  "description": "The Deco sunflower contemporary accent chair allows you to add\nextra seating to any area of your home without compromising your\nstyle. Heavy upholstery-grade fabric adds both color and\ndurability, while the high density foam seating ensures exceptional\ncomfort. Purchase more than one upholstered accent chair to create\na cozy seating area, or place a chair by your desk and work\ncomfortably. Materials: Upholstery grade fabric, high density foam\n  seatingFinish: Espresso finished wood legsUpholstery materials: Heavy upholstery grade woven in bright\n  colorsUpholstery color: Ivory, red grey, brownUpholstery fill: High density upholstery grade foamKiln dried hardwood frameTufted backCurved legsSeat dimensions: 18 inches high x 21 inches wide x 23 inches\n  deepDimensions: 30.7 inches high x 21 inches wide x 27.75 inches\n  deepStyleContemporaryMaterialFabric, Foam, WoodFinishBrown, Espresso, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorGrey, Ivory, Multi, RedFurniture PatternPolka Dots"
}