{
  "name": "Donatello_Urban_Style_Solid_Wood_Leatherette_Padded_Parson_Chair_(Set_of_2)", 
  "price": "EUR 135.35", 
  "reviews": [
    "The chairs look good for the price and the material seems durable.", 
    "These don't assemble easily. The screw holes do not line up and you have to remove and replace the lining and it never lines up right.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Donatello-Urban-Style-Solid-Wood-Leatherette-Padded-Parson-Chair-Set-of-2/10878976/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10878976/Donatello-Urban-Style-Solid-Wood-Leatherette-Padded-Parson-Chair-Set-of-2-1fbe33f1-a69b-4ffb-835f-0f9143858335_600.jpg"
  ], 
  "description": "Get the rich look of leather without worrying about cleaning and\nconditioning with these Donatello dining chairs. Beautiful high\nback and set features a stunning design with deep comfort\nseating.The faux leather recreates the look of real leather. To\ncoordinate with the faux leather, the frame and legs are\nconstructed of solid wood finished in espresso. These chairs work\nwell as compact dining chairs or as game chairs for any room. This\nset of two armless side chairs feature contemporary faux leather\nfor comfort and a high back height for support. The seat and back\nare padded with high-density foam for great comfortable feeling. Furniture Pattern: SolidChair Type: Dining Chairs, Parson ChairsMaterial: Wood, Faux LeatherStyle: Casual, Contemporary, TransitionalAssembly: Assembly RequiredSet Size: Set of 2Chair Back Height: StandardExact Color: White, Red, Black, BrownColor: White, Red, Black, Brown          Set up: 18.75 inches wide x 22.5 inches deep x 39 inches\n  highSeat dimensions: 19 inches wide x 16.5 inches deep x 19.38\n  inches highApron height: 5 inchesApron to floor: 14.38 inchesChair back dimensions: 21 inches high x 14.5 inches widePhoto may be slightly different from actual item in terms of\n  color due to the lighting during photo shooting or the monitor's\n  display.StyleCasual, Contemporary, TransitionalMaterialFaux Leather, WoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlack, Brown, Red, WhiteFurniture PatternSolid"
}