{
  "name": "Easy_Comfort_LC-200_Lift_Chair", 
  "price": "EUR 594.54", 
  "reviews": [
    "My mother is 86 years old and wanted a new recliner that she could easily get in and out of, with no assistance. Many of the recliners that have the lever on the side to raise and lower the foot rest, have gotten too difficult for her to operate. She lives alone and this chair was just the ticket. The upholstery was comfortable and attractive, and the mechanism is easy for her to use. In a matter of seconds, she is comfortably reclined, and when she needs to get up, the remote control gradually raises her to position where she can come to a standing postion. Can't beat the price. The same manufacturer had the same chair for $200.00 more. The delivery was much faster than any other place we inquired. The quality is extremely nice. My mother is very picky and she just loves it.", 
    "After comparing similar products, I was very pleased with the LV-200 Easy Comfort Lift Chair. I purchased one for each of my parents, and being that they are compact in style, two fit very well in a small TV area. The lifts work well and almost silently. The back up battery unit is a great safety feature.", 
    "I AND MY FAMILY ARE VERY PLEASED WITH THIS ITEM WE PURCHASED FOR OUR DAD WHO IS ELDERLY AND NEEDS ASSISTANCE GETTING UP AND AROUND, IT IS SERVING US WELL AND ATTRACTIVE PIECE OF FURNITURE AS WELL. NICE QUALITY I PURCHASED THE LEATHER-LIKE UPHOLSTRY, \"PERFECT\"!", 
    "I purchased the chair for my father. He loves the chair. He said that it is actually more comfortable than his bed. Someone put the chair together for him, since he lives in a retirement community. He is visually impaired, but he can easily operate the lift because it only has one button. The only two things I didn't like about the chair are:1. The seat area is not that wide and 2. The foot rest and the back do not operate independently. He needs his feet elevated without having to recline the chair all the way back. I would definitely recommend this chair because it is very attractive and functional.", 
    "My mother 92 years old was having trouble getting out of a chair this is perfect, she now can get right to her walker and get around. I would recommend this chair to any elderly person", 
    "Like the chair but the seat is a little to firm. Would like if the chair reclined a little more but over all very happy with the chair!! Husband has had a hip replacement so the chair is good for him but I also enjoy using it. I like the fact that it looks like a regular recliner and not some \"medical\" device.", 
    "I ordered two identical lift chairs. One came broken and the other was okay. It took me nearly a month to get another lift chair for the one that was broken. I had to make several phone calls to Overstock.com and they made several calls to me. The technician from the company who made the lift chairs also came out to my house and could not fix the broken chair. Overstock finally sent me a chair that worked. There should have been an easier way of dealing with this whole matter. Barbara S", 
    "This chair is top notch for the selling price. It was delivered extremely fast; less than two weeks. It was purchased for my 93 year old disabled mother. She has had no problems using it. The arm covers tend to fall of easily and it does not recline quite as far as I would like. However, these critiques are very minor. I would recommend it to anyone that has a need for unaided assistance getting in and out of chairs.", 
    "Shopped around and this was a great deal the chair arrived in 3 days!!!! Tan is not a light color but definitely not dark a nice neutral color not all one shade.The delivery was outstanding and the chair comfortable and does what is promised. It was purchased for my Mom who has limited mobility. Great value don't hesitate you won't be disappointed. Make sure you know the correct dimensions of the chair you need the depth of the seat is important this is for someone who is petite to small I would say as the depth is 18 inches.", 
    "I have purchased two of these lift chairs and have found them to be excellent. One was purchased for my 94 year old father who uses it every day in his Assisted Living apartment. He has had it for one years now. He does not have mobility issues, but often takes naps in his chair with it elevated. He needs to keep his feet elevated to ward off water retention. It's battery component was especially helpful when the power went off and he was able to get himself out of the chair through the battery operation. When he broke his right arm he had to sleep in his chair for a couple of weeks and he found it comfortable through out this ordeal.The second one was purchased for my 91 year old mother-in-law who has mobility issues. Her daughter was having to lift her out of her chair many times during the day and it was causing her problems with her back. With the lift chair she can simply push the button and get her into a standing position with no effort. It has saved them from many physical problems. All in all these lift chairs have been invaluable for these seniors! I highly recommend this product!", 
    "My mother is not able to walk or get up out of a chair w/out assistance. This lift chair/recliner not only is fashionable as a nice piece of furniture, it has a small footprint and does not require much space. The chair is very confortable and my mother gets in and out of it without too much difficulty. It fully relcines and reclines to any angle without the need for a handle or release mechanism. The lift portion works smoothly as well. I would highly recommend this lift chair!", 
    "The chiar arrived in excellent condition and was assenbled easily. It changes position quietly and gently. The fabric and cushions are soft and do not get caught in the chair's mechanism. We are very pleased with the chair, its delivery, assenbly and use. It is just what we wanted, at an excellent price.", 
    "I found this chair in stores for about $300 more. The delivery was scheduled as promised. The mauve is really a pink, rather than the burgundy the picture shows. I purchased this chair for my 95 year old mother who was very happy.", 
    "I bought this chair for my wife who always had a problem with the manual lever kind of recliner. Unfortunately the chair is much smaller than expected both in width & reclined position. She found her feet extended beyond the foot pad causing her feet to fall asleep, making it uncomfortable for her. She gave the chair to me which I find very comfortable. However it does get a little hard on the bum after awhile. I found if you take your shoes off to recline, your feet will not fall asleep. The mechanism to raise, lower & lift off works great. Funny thing though, getting up quick say to answer the phone or doorbell proves to be a challenge. You have to wait for the chair to lower you or else you'd break your neck or back trying to get off of it otherwise. Be warned. Both my daughter & son-in-law love the chair & steal it every chance they get. I felt from the get-go, the chair was well worth the low price.", 
    "I ordered this for my 83 year old mother. She loves it - very comfortable. Delivery was great - very fast.", 
    "We got this for my 90 year old dad and he loves it!", 
    "After recieving one for our 94 yr old stepfather, we ordered another for his 91 yr old wife who spend a lot of time in an assisted living home. They're very happy with the comfort, soft fabric and pretty blue color. Was very easy to pop the back of the chair onto the bottom, no tools required. Great price, too. We're happy!", 
    "Just what I was looking for for my parents. They love their new lift chairs. Shipping was especially prompt.", 
    "Bought for my mom. She seems to like it. It is smaller then we thought it would be ....but worked out for the better for her cause she seems to be able to able to push herself up off the chair with the arms of the chair closer to her body then the old one she had. She loves it.", 
    "My siblings & I bought this in green for our mom who is 80 yrs old. She didn't think she'd use the lift part but she has & likes it a lot. We know it will help as she gets older. Great value for the money! The only thing she didn't like at first is that there's no way to raise just the feet without the back going back, too, but she's gotten used to it.", 
    "I bought this chair for my 90 year old mother as she was having problems getting up and down from a regular chair/couch. It is wonderful and comfortable - when she goes into bed - I sit in it!! Definetly a good buy", 
    "BROUGHT FOR MY MOTHER, COULD HAVE BEEN A LITTLE LONGER IN A RECLINING POSITION, OVERALL PLEASED.", 
    "Had knee replacement surgery. I slept on this chair for two months (3 bedrooms UPSTAIRS ). Very comfortable chair. I'm 5'2\",if you are very tall your feet will hang off the end.", 
    "I purchased this chair for my mom who has issues getting up. She loves this chair, told me it is very comfortable.", 
    "The chair is just fine, but the delivery service and overall customer service was horrible. I was never offered the white glove home set up and deliver service. Why would I pay over 500 dollars and get set up / delivery service? When they literally dropped off this 200lb chair at my 85 year father's house they left it on the porch. My dad had no way of bringing the chair inside. It 20 degrees outside snowing. When I called to complain I was told I didn't include the extra service. If I knew there was this service I would have gladly paid for it. I will think long and hard before I order again with overstock.", 
    "This chair works well for my father-in-law. Even though he is over 6' talland 220 pounds, he needed a chair that was not deep seated. His legs do come out past the foot rest, a little , but he says it is very comfortable and he is happy with the chair. The remote is easy to use.", 
    "My mom is 83 mobility issues, including balancing when she stands up. We took care to make sure she was acclimated before she soloed. It took about a day for her to get comfortable with holding the controller in her hand while the chair lifted, balancing herself with her walker and having her feet feel firmly planted on the ground. The lift is just what she needed. The size and design of the chair fit beautifully in her decor and it's comfortable enough to sleep in.", 
    "I got this chair as a gift for my father. He was having trouble getting up from his chair. He was also no longer using a foot stool to elevate his legs, due to his difficulty on rising. He loves this chair and even uses the lift to help him stand up and sit back down. Really has been a great chair for him.", 
    "it works quit well do wish the foot rest wasn't tied in to the back of the chair", 
    "My children ordered the chair for us while my husband was in hospital. It came on time and has been a god send to us. It even matched my other furniture", 
    "My 93 year old mom was practically living on the recliner. The only time she was separated from it for long was when she had to go to bed. The recliner was the perfect length for her at 5 ft. tall. I wouldn't recommend it for anyone much taller.", 
    "we purchased 2 power lift chairs. delivery was fast, so was set. no damage, they arrived in very good condition. too bad they are so darn uncomfortable. can only sit in them for short amount of time, then have to get up. we bought them specifically for my husband as he has 5 bad discs in lower back. i so hoped this chair would help him be more comfortable, but it doesn't. so sorry i would not recommend these chairs to anyone. this is the first time i have been dissappointed in any purchase from your company. sincerely ron roth", 
    "this chair arrived in perfect condition, with no trouble got it together and it worked perfectly, for a small lady in a small area, she liked it very much and it was very helpful. This was a great chair and was a wonderful price, in addition it was delivered to our door and we didn't have to worry about going shopping and leaving mother at home alone. Very nice chair, can't say enough good things about the chair, it was purchased some time ago and never had a moments trouble with it.", 
    "My mother-in-law, who is in her late 80's, loves the chair. It has made it much easier on her knees and even naps in it during the day. She can't say enough about it. The operation is very smooth and quiet.", 
    ". service and delivery was prompt this is the place to buy everything", 
    "Chair works as advertised. Promptly and carefully delivered. Excellent overstock transaction. Thanks much.", 
    "This chair is comfortable and very simple to operate. It doesn't seem expensive, but you cannot expect to much for the price. It is serving it's purpose of making life easier for me.", 
    "Great product, great experience. Product was delivered within 3 days of purchase. Driver was great ...helped with getting the new chair set up....Stayed until made sure it was operational. We are very pleased with the quality and operation of the lift chair. Highly recommend the product and buying experience.", 
    "I am very pleased with this chair. As another poster stated it is for a small to petite person. The seat depth is short for me as I am 5 9\". But... all you have to do is raise the foot rest and problem solved. It is very comfortable overall. I like the cloth covering as opposed to leather due to our climate here. I must say that delivery was exceptional. I ordered it right at Christmas and it arrived the first week of January. I must note that the chair is an inside delivery and not curb. However the trucking company used by Overstock is exceptional. The driver, Richard, went beyond service to get it inside. All in all I am very pleased with this purchase.", 
    "I ordered this chair after coming to the conclusion that my spouse needed it. I was not expecting the quick delivery but there it was, less than a week later! The shipper will not bring the chair into your house so you will have to do that, he will wait for you to plug it in and run it to make sure it works. The chair is somewhat short in the seat and very firm but it does what was promised and is comfortable. The factory smell was irritating at first but that has gone away with time and several sprayings of Febreeze. It sounds strong and does not take up as much room as I expected.We have only had it for a month now but so far it has held up well and looks good with our other furniture.", 
    "Got this for my mom who was having trouble getting up from regular recliner...she loves it and it saves my back", 
    "Had LC200 chair since 1997, motor gave out so I decided to order another.Well the new one arrived this week and got it together today. Not as comfortable as the first one. The back goes back to soon when lifting the leg rest. You can't sit comfortably straight up with legs reclined. Your in a laying position before sitting up. Disappointed.", 
    "Great chair. Does what it's supposed to do. Mom loves it.", 
    "Recently received this chair was easy to put together didn't need any tools. Only problem was ordered evergreen got spuce", 
    "Nice case quick shipping. Would buy again", 
    "Bought this item as a gift for my dad after he broke his hip. It has really helped him in maintaining his mobility. He has a really difficult time getting out of normal chairs.", 
    "My mother is 89 years old and need a chair to lift her up. This chair works beautifully. It is also very comfortable. She falls asleep in it a lot!", 
    "A gift for my mom, she loves it. Much needed.", 
    "We have not had this chair for very long (about a month), but it has given us great service so far. The mechanism works perfectly. It was easy to assemble. The upholstery is very nice. It is quite comfortable and my mother-in-law loves it! It isn't a La-Z-Boy, but for the price I think this is a very worthwhile purchase.", 
    "Purchased this chair for my mom who was having surgery. She can't live without even after recovering- so comfortable. Excellent condition - we have had for 2 years now and still in great condition", 
    "great feel and look better than i expected nicely padded truck delivered to my front door. the color was a little off with the green but its all good", 
    "This chair is a nice as any we saw at the high end furniture stores at half the price!", 
    "bought two these we have been using them for over a year I sleep in mine nightly as I need help getting up great chair an very affordable", 
    "Bought for elderly dad, he loves his new chair!", 
    "the chair is very easy to use for people with weakness, though it would be nice to have a clip so the remote can have easier access", 
    "I'm still shaking my head over the price. Very reasonable. The color and fabric are great. Very comfortable for my bony frame.", 
    "We were concerned that this chair might not work as well as a 360 because it does not lay flat. As it turns out, my mother in law cannot tolerate laying on a flat surface. This chair was a lifesaver for us all! I would buy this exact chair again and again!", 
    "It works great .I bought this for my mom, she has a hard time getting out of \"Reclining Chairs\".This chair brings you right up to standing height.Well worth it.", 
    "Working wonderfully for my 96 year old Mom. The old one we had was made for a larger person and her legs were too short for her to get all the way back in it so that it hurt her back.", 
    "it does what is suppose to do. Wish however separate controls for foot rest and back.", 
    "You can lay it back to where you can sleep in it, and it's very quiet when it raises up to lift my mom out of it. It's very nice looking also and comfortable. So much more reasonably priced than anywhere else I've compared.", 
    "Good padding for maximum comfort. Upholstery is sturdy and attractive. Lift is smooth. Only problem is that the cord is not long enough to keep up top. It is a little hard to reach over all the time.", 
    "Comfortable and easy to use. It elevates to assist to an upright position which helps anyone who has any physical disability with back or legs!", 
    "It is great for a small person but not so good for men", 
    "Just ordered 2 days ago, and it was delivered today. My husband likes it very much. Thanks for the quick delivery.", 
    "I purchased this for a family friend and he loves it. He is in need of assistance getting up and down and this chair allowed him to do so effortlessly. He just wanted everyone to know that it is working for him without any problems.", 
    "This chair is not just for those who need the help. It is so awsome, all of us love sitting on it and reclining. So Love this Chair! My daughter says she wants one too! Not too big and and too small, just the right size too. LOVE IT!", 
    "I have now purchased 5 of these lift chairs for parents, in-laws, aunt/uncles and they are fantastic. The look nice and are so comfortable and practical at all angles/elevations. Even if you don't need the 'lift' help, the recline options and ability to elevate feet are great fro anyone. I highly recommend this brand/model after researching many other options", 
    "Purchased this instead of renting one for recover from surgery. Now, I can't seem to take it out of the bedroom where I had it to another location (where I expected to keep it after I was healed). It is really handy and a nice small recliner that fits in small places. I'm definitely glad we ordered this.", 
    "Bought this chair for my aging mother in law. She was really struggling to get up from a traditional reclining chair. It was painful to watch. Now she just relaxes as the \"Easy Chair\" does most of the work for her. She just loves the chair. The Easy Chair has relieved much of the stress and pain on her knees, back and wrists. She just looks so happy these days. Now her husband wants one.", 
    "Looked at a lot of chairs, these seemed to combine everything we were looking for along with a good price. Dad (82) just had heart surgery and would need something comfortable yet helpful for him. He came home from the hospital and hasn't slept in his bed since.He loves his chair!", 
    "In looking for a \"lift chair\" for my mother I found this to be the least expensive and less than half the cost of buying locally. I ordered on a Thursday and had the chair in my mom's living room by Tuesday of the following week. It was easy to connect the back to the seat of the chair and works perfectly. So I would say that this was a great buy and great service on the part of Overstock.Com", 
    "I ordered this for my 80+ mother who lives 4 states away. She was very happy with the chair, loved the fabric and color, the online representations were very good. The product was delivered in far less then the time they promised. I am very happy with the product and service received. Good Job!", 
    "This was a purchase for my elderly mother who is in a nursing home. This review is primarily for the service we received from the delivery company. The driver called me prior to the delivery to verify all the information, which allowed me to explain my mother's situation. I was amazed when the driver called me AFTER the delivery to tell me the details of the delivery. He explained how he had had a nursing home staff member carefully look over the chair for any possible damage from delivery and that he had set the chair in front of my mother's television for her, assuming that would be the best location. His caring, concern and thoughtfulness went way beyond my expectations. It warms my heart to know that there are still such nice people in this world. Central Freight Lines has a good employee in that guy. I hope Overstock will keep using them for delivery because it also contributes to Overstock's good image by making it an overall good experience. I have not seen the chair yet but we have not received any calls from the nursing home so I assume it is fine. I will write a review on it after I've seen it.", 
    "This chair fits my stepmom's 5'5\" frame very well. The seat is a little small for my 6' dad.", 
    "if you are on a budget, this chair fits the bill. I compared at various local shops - very similar quality. Easy delivery, easy setup.", 
    "None of u like the way the arm rest is constructed they are Extremely unconfortable. I'm also concerned with the quality of the fabric. I can feel the board on the leg part. Worried it WILL eventually tear.", 
    "I ordered this chair for my elderly father-in-law. The order was placed on a Wednesday and the chair was delivered the following Monday(5 days total). He was able to use it with ease. The delivery man was professional and very helpful.", 
    "This chair is attractive (in blue) yet quite functional; my 98-year-old dad is very satisfied with this purchase! Highly recommended!", 
    "My 74 year old mom suffers from Paget's disease of the bone, drop foot (both feet), vasculitis, on top of having 8 broken ribs that will not heal. She has had to sleep in an old recliner as she can longer lift herself out of her bed (combination of problems with the drop foot exacerabated by broken ribs). She has been sleeping in her recliner for nearly a year, which is much of her problem. My brother and I purchased this chair for her to see if it could help \"propel\" (for lack of a better word) her forward, using a bit of her own momentum. Not only has it helped, but because she doesn't have to struggle as much to get out of the seated position, she is able to get up with less difficulty and avoid fewer \"bathroom\" issues. Her home health care agency also sent a hospital bed at the same time in a joint effot to heal the ribs, unfortunately, the bed was too high and too stiff to help, so it went back, but the chair stayed. She's managing to sleep a few more hours a night all because of this chair - and she is not as petite as she was at one time.The delivery company was absolutely awesome - calling both me (the buyer) and my mom (the recipient) to confirm purchase and delivery address with me, and set up an appropriate time with my mom. The shipping information said something like ten days, etc. - it was there in 3 days!!!!This was one of the best online purchases I have ever made.", 
    "I bought this as a Christmas present for my mother who is 82 years old. She absolutely loves it. It seems well built and not too overly big. It fits in her bedroom.", 
    "My father-in-law is unable to stand up on his own. This chair is great. He has a new sense of independence.", 
    "The chair is short seated and sits very upright, but by tilting it back it is comfortable to sit in. it does exactly what is needed, but my 83 year old mother is still unaccustomed to being lifted out of the sitting position. Delivery was very quick.", 
    "Very easy for my 87 year old mother to use. She used to struggle getting in and out of her chair. Controls are very easy for her to use and accessible. The chair is not \"oversized\" and fits nicely. My mother would only have \"pink\" so she was thrilled with the color choices. Good value for the price.", 
    "This chair was for my elderly parents. They have a similar chair that cost over $1000. This chair was half the price but two times better. They love it."
  ], 
  "link": "http://www.overstock.com/Health-Beauty/Easy-Comfort-LC-200-Lift-Chair/2859453/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/2859453/Easy-Comfort-LC-200-Lift-Chair-1291b659-4b01-405d-bb75-a3bd163782e9_600.jpg"
  ], 
  "description": "Assert your independence around the house with this incredibly comfortable lift chair. It is designed to support you during sitting and standing up, maintaining your mobility and decreasing the need for additional assistance. The wide variety of classic colors for the upholstery ensures that it is easily blended with the decor of any room.Contains a fully electrical lift-and-recline mechanism for support during sitting and standingAble to recline at 45 degrees for relaxed readingAvailable in mauve, blue, evergreen, chestnut vinyl, cocoa and tan colorsAble to carry up to 325lbsBackrest measures 21 inches high x 28.5 inches wide Seat measures 18 inches high x 20 inches wide x 20 inches deep FSA eligible with a physician's letter"
}