{
  "name": "Enzo_Solid-colored_Accent_Chair", 
  "price": "EUR 210.08", 
  "reviews": [
    "It looks nothing like the picture on overstock. I ordered the light blue, but the color has a lot of brown mixed into it. They are significantly darker then I imagined. The picture makes it look like it is some kind of corduroy fabric, but it is really just a solid fabric with a heavy influence of brown streaks. The chair arrived and smelled like paint. They were easy to put together and are the right size. The chairs are fairly comfortable for what they are. I just wish the color was what I was expecting. If you're looking for a \"baby blue\" or \"spa blue\" this is not it.", 
    "Ok... I shop a lot on overstock (really have purchased A LOT) but these chairs were such a disappointment that I am wondering what to do with them. The boxes were all ready tossed before I could stop my staff or I would have sent back. To begin with, I purchased the green that I thought looked a bit brighter on the computer but they are very, very bland. Sort of like pea soup. The worst part is the stitching on the whole part of the chair that you lean on. It is so ripply that it cannot be straightened out and that is on both! Maybe if one was bad I might have thought that it was just an error. Unfortunately I bought two and both are stitched the exact same way! And now I am stuck with them. The also look dirty! Strange, very very strange. I was under the impression that they were more contemporary but in fact they look as if they came out of an old antique shop....", 
    "This chair is very easy to assemble. I ordered 2 and both chairs went together well. The legs all matched and screwed in correctly. The color is a little darker than I thought it would be. I had a dark brown throw pillow that I was trying to match it to before I purchased the chairs and now that I actually have them in person they are darker than my pillow. The sitting area is very firm and comfortable for my formal sitting room. It is a little smaller than I thought (height wise) but all in all they should work just fine in the corner of my room with a small table in between.", 
    "Buyers beware. This is not a quality product. The chair is quite small, comes with unupholstered spots on the chair and the legs are packaged and damaged and marred in the bag when you receive them. There are long threads sewn in the seams, looks like the product came from a third world country. My chair has a spot that wasn't even covered with upholstry. The fabric is thin and rubbery.", 
    "This chair fits perfectly in my living room where I needed something that was not too big. The chair is good for conversation, and short term tv watching. It is sturdy since my husband sits in it and he is a good size man. If you need a small, but chic chair, this one will do the job.", 
    "The chairs work really well in my master bedroom, they arrived in only a few days and are comfortable to sit in. The price was so amazing I would have kept them if the color hadn't worked. I've sat in them, put my feet up and read a magazine - really comfortable, too! Just a terrific buy.", 
    "I needed to find chairs for a small space but to accomodate an adult - these are great. The color is perfect and the chairs were easy to assemble. The shipping was free - doesn't get much better than that. II've recommended them to friends and neighbors.", 
    "I underestimated the color contrast to my other furniture. Made me sick because the chairs were perfect otherwise. When I returned them I used the wrong labels and was charged shipping and extracted from my refund. When I contacted Overstock about my mistake, they refunded my full amount. I love Overstock. I can never find prices to match their prices, and their care for their customers supercedes their care for profits, which translates to more profit as customers become loyal clients in return for their loyalty to us.My only regret is that those beautiful chairs didn't come in light blue!Thanks Overstock.", 
    "I switched my living room around and needed some chairs to fill the empty space. I chose this chair based on the colors available and comfort. While the color was a little different than expected, the chair is surprisingly comfortable. I'm 6' tall, 255# and the chair fully supports my weight. The seat could be a little softer, but overall I'm happy with my purchase. Good quality for someone with or without a budget.", 
    "Ordered this chair to compliment a room full of beige furniture, it is a very nice pop of color. Chair is small but comfortable.", 
    "This chair is exactly what I thought it would be. The color is identical to the internet photo. The size was as described. The fabric is nice and appears to be durable. The chair is firm, nice height. Took 2 minutes to put it together. The price is excellent, and I am happy with my purchase.", 
    "We were looking for some contemporary accent chairs that weren't over priced. These chairs are super comfortable, easy to assemble and a great price.", 
    "Chairs bring ambiance to the room. However the color was different from the actual display. I thought the chairs' color was neon or lime green. Instead it was olive green.", 
    "They have an elegant profile. They are very comfortable. The feet were easy to install. They provide comfortable additional seating without taking up too much space in a small living room.", 
    "I bought this chair and at first sight out of the box, I knew it was too small.It was very easy to assemble but it was too small. Then I realized it's not too small it's an accent chair and it is to accent. When I put those things in perspective, I realized I purchased this chair under a comfy sit back and watch a movie type of chair frame of mind and not under accent chair frame of mind. Once I worked those two things out in my head and realized I'd purchased a very nice looking chair that needs a friend to help keep the accent in perspective. I will be purchasing another one to complete the look I'm going for and yes the color is perfect! The chair is pretty durable and sits well.", 
    "I bought the green Enzo Accent Chair. First of all, I phoned and talked to your customer service representative. Brooke, who was so polite and knowledgeable. She is so nice, and you are lucky you have such good people working for you. The chair arrived on the appointed day, and I am really happy with the purchase. A minor problem is that the shade changes slightly when you rub over the grain, but it is not a great problem. All I can say is that I am very pleased with the purchase and the reasonable price, and I would not hesitate to make future purchases from you.", 
    "This chair was as I thought, it is firm which I like. The color described as charcoal may not be accurate. It is a gray but with a hint of blue which I like. Some of the chair colors are not too close to actual color. I had to return another chair because of color, described as dark blue when it was actually dark teal., but Overstock was great about the return to give me a credit because I was going to buy his oneand am happy with it.", 
    "I ordered this chair in charcoal. In the picture it is solid gray. In real life it is black with white flecks and is not at all something that I would want in my home. Very disappointed.", 
    "I ordered this chair in Ivory. It is just okay. Good enough to keep and I won't be returning it, but the Ivory color is not accurately displayed. It's more of a light tan. Still neutral, so it works, but definitely not ivory. Also, the \"striping\" apparent in the photos is not really present in the actual fabric to the degree I was hoping. The fabric is generic looking, and not as pretty as pictured in the photos. The fabric also pulls/ripples on the arms, as other reviews have mentioned. The worst part, though, is the unevenness of the legs. One leg was fully an inch shorter than the others when screwed in, indicating that the body of the chair is crooked somehow. Not a big deal and nothing a little shimming can't fix, but still, it speaks to the overall low quality. The dimensions listed are accurate and it's a perfect size for a cozy corner. Overall okay deal for the price, but don't think Ivory is actually going to be ivory and be prepared for the leg unevenness.", 
    "I decided to go with the charcoal grey chairs based on the negative reviews of the color discrepancy in the blue chairs. I made the right choice. The chairs are a bit darker than pictured with a slight silvery hue to them, which I think looks better than the picture. There's not much cushioning and they're quite firm, but still cozy enough to curl up and read a book. They seem small once unboxed and put together, but once you sit in them, they feel a good size and worked perfectly for the space I needed them for. They feel solid and sturdy and took all of 5 minutes to put 2 chairs together.The only reason I did not give these chairs 5 stars is because when ordered, you are not given any options for expedited shipping, but they are advertised as Standard 3-5 day shipping. I ordered on a Monday, hoping to have them in time for the weekend as I was redoing my livingroom. It took the chairs 2 days to ship and another 7 days to arrive. I was not a happy camper, and even though I notified customer service, they have still not updated the shipping time on these chairs.", 
    "I like it and it works for the space it is in. It's definitely on the small side.", 
    "I got this chair for my birthday because I wanted to improve the look of my room. I am very happy with the way the chair looks, and it is very comfortable too, and the price was very reasonable. I LOVE THIS CHAIR!!!!!!!!", 
    "I invited my neighbor over for tea. He truly was comfortable sitting and talking. The color is a bit darker than I expected but does not fight with the rest of the room.", 
    "Lovely chair and easy to put together. Very comfortable to sit on. Fast shipping. Will buy form Overstocked again.", 
    "The color of this chair in real life when it was delivered and what it is shown online are two totally different colors. The quality is shoddy and the fabric looks already worn and cheap.", 
    "I am very disappointed in the color of this product . . .I expected blue almost a country blue and instead have something blue with a lot of brown? maybe running through it. It actually makes the fabric look worn? Unfortunately I can return this because it is for an office that is opening and I have nothing to put in its place.Very disappointing", 
    "I ordered 2 green chairs for my living room, the size is actually not bad. The comfort is so so but for the price I not complaining. The color is darker than the picture online. It almost looks like chenille but its not. Have had them for 3 weeks and so far so good!", 
    "I was a bit worried when I ordered these chairs, as some reviews said they were small and kid-like. I got them in the mail (all in one piece!) and put them together (it took me just about 15 minutes to assemble two!). I love them! I bought Ivory, and the color is a perfect linen color, no yellows. They fit perfectly in my small living room, are comfortable, and make our place look like we wanted! These would definitely be small for a living room that is spacey, though. We have a small living room, and have two chairs and a loveseat.", 
    "I bought the blue and green chairs. Though they are darker than the picture, I preferred it. They are comfy but not plush, good for sitting chairs as opposed to a \"curl up with a book for the day\" type of chair. Easy to assemble. Screw in the legs, slide the back into its slot and you are done. The back does not attach but does stay secure. I think they are spot on for the price.", 
    "The color is NOT EVEN CLOSE to what it appears to be online. I read a lot of reviews and don't usually take other people's opinions about colors of items too seriously because it's so subjective. In this case I felt it necessary to say that the color is WAY off (at least on the Charcoal). It's more of a dark gray with white mixed in. Also, the feel of fabric is somewhat scratchy. The chairs are OK. Not sure whether I'll be returning or not.", 
    "I purchased 2 brown Enzo chairs for my teenage sons to play video games in my finished basement. They are a compact style but well-suited for my needs. They have clean, somewhat contemporary lines, were extremely easy to set up and are perfect for our needs. Hoping they hold up reasonably well but time will tell. All in all, very happy with my purchase. Delivery was prompt and packaging was substantial.", 
    "Although I'm pleased with the chair itself, It is not even close to the 'Blue' as pictured in the ad. It's much darker - I was hoping for more of a skye blue.", 
    "I took a chance on this chair as I just wanted a little sitting chair for my office. I put it together myself - no problem (63yo) and I love the darn thing. May have to come back and get another so someone else can sit!", 
    "I absolutely love my chair. It is perfect. The size is just right for a small space in my bedroom. The quality is wonderful. It is comfortable. So easy to assemble. Only four legs to screw in. I couldn't ask for better. And the price is the icing on the cake. I am totally totally satisfied. An easy five star.", 
    "Bought this for myself for my bedroom. Then my Mom went into a nursing home and she needed a chair for her room so I gave it to her. It is so nice. It fit in the back of my car and yet feels like a 'big' chair.", 
    "The chair was a bit smaller than I had hoped for, but is a good chair for the price. Easy to put together in no time. No complaints.", 
    "was bought for birthday present it was liked very well .the chair was sturdy and comfortable Iwould purchase form them again", 
    "A little smaller than I thought but nice accent chair for my bedroom", 
    "The chair was a bit smaller than I had hoped for, but is a good chair for the price. No complaints.", 
    "Had just a very small corner for 'something' in a relatively small bedroom. It was either a plant or something quite useful. This chair was perfect. It's well made, comfortable and looks great.", 
    "This is a nice addition to any living room or bedroom. I wonder how the back will hold up with regular use, but only time will tell.", 
    "Not worth it to buy, mine is in trash , wood is not real, break easy", 
    "Most uncomfortable chair on the planet. This is why you don't buy furniture online...", 
    "Good chair for the price. Easy to assemble.", 
    "It was exactly how you described it, is perfect in my bedroom...Love it", 
    "Definitely not the most comfortable chair we have, but as an accent chair and for extra seating, it is great. Looks just like the picture, and has held up during our last move. Would definitely recommend this to anyone who doesn't have $300+ for a chair.", 
    "This is a nice item for the price. It certainly is an accent piece, and not an everyday piece of furniture. The color is very cool with a lot of gray undertones. It is on the smaller side and would not support a large frame comfortably.", 
    "Ok chairs for price. Cheap looking. Bought the blue. Looks NOTHING like the color on the pic", 
    "It is sturdy and comfortable. It is still going strong after being moved a number of times. It also cleans well.", 
    "this was easy to put together", 
    "easy enough to assemble , but very disappointed with the quality ! I bought 2 of them in the off white color ...one is almost passable but the second one has one side that almost doesn't match the other . the foam padding and the stitching are so bad ...it looks all wrinkly from the front as if a child did the sewing job ! and also the back parts just slide in ...nothing locks them in so you can't hold that part as you try to move the chair around ...it makes it difficult to maneuver ...as they're heavier than they look ! they were too cheap to be good i guess !", 
    "Clean look I was looking for. Also comfortable to sit in.", 
    "I just love the color. Its much different from the picture and so easy to put together.", 
    "These are amazing chairs ... easy to assemble and quite beautiful we use both with a table in the middle as a reading area .. completely gorgeous and we purchased a pair of the green one's", 
    "I like these chairs. Ordered the charcoal which is a lighter gray with white running through it. Like a textured fabric but soft. The chairs are short, but comfortable. They are deep and not shallow but low to the ground. They are not the best quality, but for the low price, I did not expect them to be. I am using them as casual extra seating for my living room.", 
    "I ordered the blue chair and it is not even close to the color shown on the site- other then that it was easy to assemble and comfortable; I'm returning it due to wrong color.", 
    "We ordered the light blue chair (so we thought). In the photo, it looks like a lovely robin's egg blue with a smooth texture, almost like velveteen. WRONG. The chair we received was an odd dark speckled green--sort of teal, and the texture was like a medium corduroy. Needless to say, we had to send it back, which put our project behind by about two weeks.", 
    "Neutral, small scale, very easy to set up", 
    "I bought this chair for my son's room and he likes it very much. The reason why I rated 3 stars is because when it arrived one of the legs was broken, but I received a replacement right away!", 
    "Bought a gray version of this chair for our front guest room - love it! Will probably buy another soon. Comes in 2 pieces; the back slides right in to the seat and you're ready to go. Comfortable and affordable. It is a smaller size, which is what we wanted.", 
    "This was the perfect, small chair for my bedroom. The grey is true to color as shown. Very comfortable, would buy again.", 
    "Very pleased with these chairs. The grey is a little darker than the picture but they are good quality!!", 
    "I bought this chair for my parents' bedroom so they won't have to sit on their bed. It's a nice chair, comfortable, easy to assemble and good quality for the price.", 
    "From the picture I though this was a solid blue plush chair. It is not. I decided to keep it but the fabric is a blue/brown texture. I did not like it at first but it picks up the brown hardwood floors nicely so I decided to keep the chair. If you are looking for a solid chair it is NOT that.", 
    "Great small chairs for an entry way.", 
    "I bought the blue chairs thinking they would be a lighter blue tone, perhaps a teal. They are more brown/dark blue.", 
    "Blue was not blue-returned immediately", 
    "I love the chair, but is very small. Thank God I am only 5'1\".", 
    "This chair is easy to put together , contemporary/ stylish...looks great! It's a small chair, which worked perfectly for me. It's not extremely sturdy, but for the price, I don't expect it to last 10 years. Really happy!", 
    "Great little chair. Love the comfort and design. Great price compared to other stores of six hundred and up.For the price, it's great!!!!", 
    "good for bedroom furniture", 
    "The green is not the lime green like you see in the photo it is more of a hunter green so it did not match my decor. The fabric is kind of cheap how ever it is comfy. I'm keeping it because it would be a pain to send back.", 
    "We needed a small scale accent chair for a guest bedroom and this chair fit our needs beautifully. Extremely easy to assemble.", 
    "Love this chair the color was a little darker than on the website but after reading the reviews I expected that the color was just what I was looming for. I have recommended this site to friends . I love that the shipping is free and I get my order in about a week gerat", 
    "We were searching for a small accent chair for our living room (without having to spend $500 or more). We already have a couch and a love seat but needed extra seating for guests. This chair works perfectly. It's not huge and oversized but it is even comfortable for my husband who is 6'3\". The fabric looks more like a linen (which was hard to tell in the picture on-line). I wanted to buy an extra, matching chair and have now discovered it is sold out (very disappointing).", 
    "I'm pretty picky about the fabrics on my furniture, so I wasn't sure about buying a chair like this online. It's actually a really great texture! I'm very pleased with the chair. It's just what I wanted.", 
    "I bought the grey color, and I love it! It arrived very fast and assembly was so easy. It is a nice sturdy chair and comfy to sit in. Works perfectly for the space I bought it for (alcove/window area in my bedroom). Reasonably priced.", 
    "I ordered the blue on and its not even close to the blue in the picture. You could argue that its grey. Also had one of the legs fall off on the second day of using it...", 
    "This chair is a great quality chair. It came very fast. It is very easy to assemble and looks great. I ordered the blue chair and it looks a lot more light blue in the pictures online but it is a darker blue and not the shade I was hoping for. I decided to keep it because I like the style and quality but was a bit disappointed the color was what I expected from the views online.", 
    "Love them, color is great, I bought the green! very pleased!", 
    "We bought this for our daughter as a reading chair. Quality good for price. We got the green and it was not bright and had some brown undertones to it. We needed the color to be more lime green to match our daughters room. Overstock was amazing with returning it and we ordered another chair from them because of the excellent customer service!", 
    "what a comfy chair for the price. I just wish the back was higher for more head support.", 
    "I needed an accent chair to fill up a small corner in my living room and this chair works so perfectly. I made sure to measure the area first and the dimensions are true to size.I purchased the chair in Ivory and although it IS in fact an ivory color, the color shown online doesn't really depict it the same way. I was also expecting more of a chenille fabric which it is not. The fabric does look nice. It's just when you get up close to sit down, it feels like it is fitted loosely and is not thick. However, you wouldn't notice this unless you pinched and pulled at the fabric. Overall it looks more expensive than it feels. It's comfortable to sit in and is exactly what it says it is... an \"accent chair\" and I didn't expect to be able to lounge around in it. Since some of the reviewers complained about the size...I want to mention that for it's purpose, I don't think it's too small at all. Compared to most chairs, it is considered small, but that's because it's an ACCENT chair.If you are looking for a big comfy chair to relax in, this chair isn't for you. If you need a stylish accent chair to add to a room, then this is it!It's a good addition for empty spaces that need a little something, and it looks great!", 
    "PERFECT. COULD NOT BE MORE PLEASED. ONLY PROBLEM IS WE NEED TWO MORE BUT NEED BURGENDY!", 
    "The chair was packaged well - went together well, was delivered quickly- looks great and a lot of people comment on it!", 
    "Loved the color choices and the green is perfect for our house. Assembled easily and we are happy with the chair.", 
    "I should have read the prior reviews, then I would not have been shocked at the actual color. It works but not what I had in mind.", 
    "This is exactly what I was looking for. I needed a tan/neutral color chair to fill my bedroom. Its not too big but still is big enough to lounge and throw my legs over the side :) The color is exactly what it looks like on line.... Beige. I was very impressed with how quickly it came and how EASY it was to put together. Literally took me 3 minutes. Highly recommend if you are looking for something simple and on the cheaper end price wise.", 
    "I bought the blue and it is closer to turquoise than the slate blue in the photo.The color still works so I am keeping it but just wanted everyone to know it is NOT the color in the pic", 
    "As other reviewers mentioned, the color of the blue chair is not as pictured. It has a shiny sheen to it, and sort of a brownish green hue. But it coordinates with the decor of our living room. The product arrived with a spot the size of an orange on the back portion of the seat, but it was not noticable enough to reorder. Happy with this chair.", 
    "My company ordered 2 of these for our reception area and they are totally off in color. We ordered blue and they were more of a turquoise green. Also, they smelled very bad when we opened them, like they were preserved with formaldehyde or some horrible chemical. We didn't end up putting these together because of how disappointed we were with the color and smell. Shipped back and would not order again!", 
    "The chair was delivered in a very good time frame and is a good chair it could use a good deal more paddeing down the front of the arms and the color is not cream at all but more the color of light barley wheat but I use it in my bedroom and it worked for me so I am pleased with it . It is light weight and small so it fits perfect in my third floor walk up all in all it is a very good chair for the money in fact my husband loves this chair .", 
    "The chair is smaller than it looks on the screen, but it is comfortable.", 
    "This is my second Enzo accent chair. The first one is in my son's room that I used as a nursing chair with an ottoman, and now we sit in it together to read books. This second chair is for my new son's room that will serve the same purpose. I like the design of the chair, both in style and comfort. I also like the smaller size of the chair compared to other airchairs because (1) I am using the chairs in children's bedrooms; and (2) because I am thin and tall so the size is perfect for me. I did not rate the quality as excellent because the chair is light (does not weigh much) and the fabric although perfectly fine for my uses, is not the highest quality. I do get compliments on the look of the chairs, and assembly is EASY!", 
    "The color of these chairs is not represented well. I thought I ordered a blue chair and it is actually turquoise and brown. Not even close to the color on my computer screen.", 
    "I bought these chairs for my RV and they are PERFECT! They are super easy to assemble and are very solid. Not only did they arrive very quickly after ordering, but they couldn't be anymore perfect. These chairs far exceeded my expectations. I ordered Chocolate and they are a bit darker than the photo, but I expected that from reading the other reviews.", 
    "Chair is very close to what I thought it would be quality wise and it's a good price. It's beyond easy to put together and for the most part I am happy with it. I got the green chair which I believed to be a light green. It was not; it was about 5 shades darker and more of a olive color heavy on the yellow and with a dark under base. I wish I had purchased the blue chairs now but did not as I thought they were too light for what I was looking for in the blue department.", 
    "ordered 2 of these . Both chairs had the same defect.", 
    "So easy to put together. Screw on 4 legs, slip back into seat portion...Done! Ordered gray and it's a beautiful silvery gray shade. Perfect for corner in my bedroom. Very pleased with this product. Material is of good quality and looks great!", 
    "I ordered the blue chair knowing the color was not what the picture showed. The reviews are ACCURATE, the blue is not a baby blue. It is a blue/green metallic color. It actually matches my living room decor perfectly, but if you're looking for a light blue, this is not the chair for you! I'd say they are a small to medium size. Good quality for the price.", 
    "Chairs are great and match the color in the photo. Not super comfy but great for the price. Very sturdy!", 
    "We needed some new chairs for our Motor home, and deplore RV furniture. These are the perfect size (and I am a plus size woman) for both my husband and I. They are comfortable, sturdy, and stylish. We ordered green for a little contrast to the browns and tans in the motor home and they are perfect. They are lightweight enough to be moved around easily when necessary. I highly recommend them for home or RV use. For RV use, they come in pieces that are the right size to take through the door, then easily assembled without tools.", 
    "Excellent purchase and easy to assemble. Great price for a small chair for our bedroom Color of the blue is very grey and not quit as blue as I expected. But overall a nice fabric and style. .", 
    "The colors are much different than pictured, ordered the light blue bad it is a dark blue/green, material looks cheaply made. Seems comfortable to sit in.", 
    "The chair had a strong chemical odor. The color was odd and not what it appeared to be in the picture. There were threads showing. I returned this item.", 
    "Very stylish and I love the softness and ergonomic design. Very comfortable chair and the color selection is nice. I bought two of the lime green color. A no brainer to put together. Looks absolutely lovely complementing by black leather sectional sofa and dark grey 8x12 shag area rug.", 
    "We returned this product. We ordered 3 chairs. One of them had several places where the fabric was not woven properly, creating a weak spot. Also, there is a definite sheen and nap to the fabric and at least the charcoal item when rubbed against the nap looked worn or soiled. They came on time and were easy to put together, but we were concerned about them looking \"well worn\" when they were brand new. Overstock.com's on-line live chat person helped us to return the flawed item at no charge, but we paid shipping on the other two chairs.", 
    "The chair is nice but it is not a large chair at all. It doesn't overwhelm my living room. The color was real close to what it looked like in the picture. It works great in my living room because of the size. If you are looking for a small chair then this is it.", 
    "I purchased two of the blue chairs nearly one year ago (March 2013) and am still thrilled with them. Based on other reviews I knew that these are smallish chairs and to expect that the color would not likely match what is shown in the photo. SIZE. I find the size to be perfectly adequate for conversation and reading, but not for curling up to watch a movie. They are not child-size, but they are also not big easy chairs. COLOR. I ordered blue chairs, which in the photo then and a year later is a light powder blue. The chairs that arrived would best be described as a deep denim teal. As luck would have it, they perfectly match the dominant blue in the area rug I have in my living room. Just beware and watch current reviews for the color of your choice. ASSEMBLY. This chair is a snap to put together. It could not have been easier. BOTTOM LINE. I would definitely purchase again.", 
    "Underwhelmed with quality of the fabric, quality of the framework and comfort of the chair.", 
    "This chair was a much darker blue than appeared in pic. Brown undertone to it. It is also very firm, and not that comfortable to sit in for a long period. There was also some thread/string hanging from the seat which I needed to cut. I hope it doesnt fray. Price was good though", 
    "Got the brown, and it's a dark brown. Getting a second chair for our sitting area. Happy with the purchase.", 
    "I am thrilled with this chair and wish I had ordered 2 when it was on sale before Christmas. I got the brown and it is exactly the color it shows in the picture. And the assembly is literally...you screw in the 4 legs with you hand and slide the back in. NO tools needed. Just great!", 
    "Super cozy, easy assembly. Perfect fit. People just want to sleep in the livingroom chairs.", 
    "Great chair for a child's bedroom from which Daddy may read.", 
    "These sure don't look like they were as inexpensive as they were (on sale). Very easy to put together too. The color and fabric are really different than they looked on line. I actually love it. Kind of a dark teal blue textured fabric with a bronzy background. Together with the classic lines, they look very nice!", 
    "Perfect chair for our bedroom. We have double window, french doors, door to Master Bath and then of course the Entry door from the hall. I have been frustrated with have a nice size room with little wall space. This chair fits perfectly in one corner giving us a nice place to relax without sitting on the bed. I ordered the off white and I am very pleased with the way it looks. Easy to start using, just screw the legs on and you are ready to go!", 
    "I ordered cream and green color. green is lighter and darker treads so it looks very interesting. cream is cream color. I noticed a slight imperfection in material color, but was not that much noticeable. It took me about 2 minutes to put chair together (screw in legs, and push back in the slot).", 
    "I ordered this chair to match an ottoman that I bought else where, and the color is perfect. Shipping was fast. The quality and comfort is beyond my expectations. Would definitely recommend this chair to everyone.", 
    "Looked nice at first then started tearing after 4 months. Cheap quality/Poorly made", 
    "I was a little disappointed in the color. I ordered two chairs for my small living room and they are completely different than what I was expecting. The color I ordered was the blue chairs. They are more turquoise with brown and dark green streaks throughout the fabric. They will work for the time being, but if you are looking for a light blue or spa color stay away from this chair because they are not like this at all.", 
    "I really like the chair but the blue I expected is totally different. Its darker and has some dark undertones. If you want a sea color blue, this is not the chair. Its very nice though for family room.", 
    "These chairs are exactly what we wanted. It took about 5 minutes each to put the legs in and pop the back in. They are comfortable and will fit the bill. Good for the price.", 
    "So easy to put together. Just the right size for my small apartment. Darker than picture.", 
    "This is a nice chair for the money. That being said, it is small, but that is what I wanted. Don't ever think you will put this chair in a large room and think it will look good. It is too small for that. In a large room this chair will look like a child's chair or a toy chair. But in my very limited space, it did exactly what I wanted. It fit there, and has a somewhat short seat, so shorter people will be happy to have their feet on the floor compared to today's trend of all the big overstuffed chairs. It was very easy to assemble. Just screw in 4 legs and place the back of the chair on the base. It is a good chair for a smaller bedroom, or a limited area, and at that price, if you don't like it in 2-3 years, just give it away, and buy something else without feeling guilty.", 
    "For the price, I expected higher quality and the color was NOT as depicted in the picture. Color was actually much darker than shown on the website. I ordered the chair for my basement/rec room so I'm going to keep it, but if it was for any other room in the house, I would definitely be sending it back. Not sure how the chair will hold up, but am hoping that it will serve it's purpose.", 
    "Chair was much smaller than expected. It looked a bit like a kids chair. Returned it. Wasn't what I had hoped it would be.", 
    "we got the green accent chair today in green, the color is a little funky but I am pretty happy with the chair for the price. It is the perfect size and style and it is very comfortable to sit in. So yeah, a good buy.", 
    "Need better instructions . Had to put together multiple times before I got it right.", 
    "Needed a chair for my small home office, and didn't want to spend a lot, I am thrilled with this chair. The color is spot on...a nice ecru white, the fabric is soft, yes I said soft! The chair itself is a bit stiff but I've sat in worse. I would highly recommend.", 
    "I bought these chairs for a small home office and they are just perfect. Fit well in my space and are very comfortable.", 
    "I ordered two of these chairs in green and love them. They are a little on the light side, but the ease of putting them together and the color of them completely outweighs any negatives. They are good quality for the price and perfect for an accent chair. I think they would even hold up to daily, heavier use. However, for us, these chairs are in our more formal living room with light, weekly use. I highly recommend!", 
    "I bought this for my home office. It is the perfect size and looks great as a comfy reading spot!", 
    "The delivery has not been made yet. Please expidite the delivery asap. I need those chairs."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Enzo-Solid-colored-Accent-Chair/7310921/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7310921/Enzo-Solid-colored-Accent-Chair-7b31088e-3ee5-47ca-9bfc-e7572c4b441e_600.jpg"
  ], 
  "description": "Complete your bedroom or living room design with this lovely\nfabricaccent chair from Enzo. With its graceful lines,\ngeneroushigh-density foam padding and cozy upholstery fabric, this\nfabricaccent chair adds a soft, welcoming feeling to your decor.\nAsturdy, kiln-dried hardwood frame ensures stability and\nincreasesthe lifetime of the chair. Materials: Upholstery grade fabric, high density foam\n  seatingFinish: Espresso finished wood legsUpholstery materials: Heavy-grade, wovenColor options: Ivory, charcoal, green, blue, brownUpholstery fill: High-density foamKiln-dried hardwood frameSeat dimensions: 16 inches high x 22 inches wide x 23 inches\n  deepDimensions: 33.9 inches high x 31.5 inches wide x 31.9 inches\n  deepStyleContemporaryMaterialFabric, Foam, WoodFinishBlue, Brown, Charcoal, Espresso, Green, WoodPatternSolidChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Brown, Green, Grey, WhiteFurniture PatternSolid"
}