{
  "name": "Espresso_Magazine_Snack_Table", 
  "price": "EUR 39.52", 
  "reviews": [
    "I bought this because I NEVER eat dinner at my table, but instead plunk down and watch the news and eat. This assembles very easily, and it's attractive. It's a piece of furniture, rather than a tray or something flimsy looking. The wood is warm; the piece is glossy. I've had it now for 10 months, and it is probably one of the most useful items in my home. Really recommend.", 
    "This is great quality and a great deal. It was easy to put together and looks very nice next to the couch. Im typing on it now. I have had to re-tighten the screws, but probably my fault for not doing it correctly in the first place. U will need a TINY (length wise) phillips screwdriver to start.", 
    "Nice finish- poor construction need extra braceing for every day use. Price good for the quality", 
    "Easy to assemble (I am a very mechanical person, though), would like it even better if it was a little bigger overall - taller and with a larger table. All in all, a good buy and very usable.", 
    "This is a pretty good stand. It doesn't wobble or anything and seems pretty solid. My only complaint is the height. Its on me I guess but it is too low for my use. I ended up giving it to my mom. I wanted to use it for my laptop but may need to get an adjustable one.", 
    "An excellent little table for a drink and a book anywhere a regular table won't go. I assembled it easily myself and it looks really neat with my $4000 couch. Its quality won't embarrass you and it's a really good looking little table.", 
    "I would not recommend the table for families with children as it is too light-weight and could be easily broken. It also requires too much assemblying. Too many small parts.", 
    "Had a problem with screws to put it together. Some of them would not go in all the way and stick out.", 
    "These are inexpensive, cheaply made tables, and clearly meant for infrequent use. I bought two about a year ago to use temporarily as \"side tables\" while I searched for something I liked better, thinking that I would then store them to use as tray tables when friends came over to watch a game. Unfortunately, the table tops on both units have come loose from the screws, and the screw holes are now too big to tighten them up. They can probably be repaired with wood glue and drilling new holes for new screws, but you would expect a wood table to last longer than a year before such repair work is needed. In addition, one table didn't assemble tightly from the get go. All of this considered, they are attractive and cheaply priced, and if you don't plan on using them on a daily basis, they would probably last longer and result in a better value.", 
    "Great little table. Do not expect to put 20 magazines in the magazine rack because it is small. Nice bedside or chair side table.", 
    "Small table that fits just where we needed it, and top is big enough to hold drinks, tissues, remote, etc. Great little table & very easy to put together.", 
    "A bit small for a TV tray, but works for a night stand.", 
    "Not as big or as dark as I expected, but suits its purpose.", 
    "I was very pleased with my purchase and would not be afraid to order furniture again.", 
    "This table is exactly as described and very handy. Easy to assemble.", 
    "The table is exactly what we needed! It was easy to assemble and very sturdy. A very good item for the cost.", 
    "Easy to assemble and sturdy once it was. I love the little side pocket for tv guides and papers. Small 5 lb chihuahuas who can climb about like a cat can't reach them there!", 
    "I was happy with it & use it daily The color & size is fine for my needs. I'd recommend it to anyone needing such a table.", 
    "Our bedside tables that matched our slatted sleigh bed did not fit a new small space. These tables were a perfect match and they look like they were made for the set. I searched a long time and was glad I found these. They are handy, convenient and sturdy under normal use.", 
    "This table is exactly as shown. Color is pretty right on. It does what it's stated as doing and my hub and I will thrash it in time. The only thing lacking from this is plugs for the screw holes. The silver screw shows. Looks tacky and cheap. It could be painted probably. Dab a bit of a rustic red color? Something to contemplate while I use it, abuse it, and love it. Thanks Overstock!", 
    "This is a very well made, easy to assemble side table. Since the bottom slides under a couch or chair, it saves space and it always handy when you need a stable surface. Just the right size for a laptop, or afternoon tea for one, or your embroidery. Solid wood with a nice finish. And the magazine rack is large enough for a newspaper, etc, and too small to become a \"catch-all\" for junk mail and weeks woth of newspapers or magazines. A major plus in most living rooms.", 
    "This snack table is the perfect size and height for an added little space to put your water bottle, magazine, or remote! I love it, it matches the decor of my home seamlessly, slides under the sofa easily, and even when it's not being used, it gives a nice, cozy feeling to the room. I am actually considering getting one more for my guest bedroom too! Very practical, lightweight, and cute...I love it!", 
    "These are excellent small footprint snack tables. They are sturdy and don't get in the way, I have 2 recliner,1 couch, and 2 loveseats in my family room with 3 end tables, Just wasn't when gangs all here, These snack tables are the perfect addition and match the decor, this number #3. Another great product, I've found on OVERSTOCK.COM. Go ahead Buy Some Get Some They'll look great in your room, I personally guarantee it. Home Owner with flair.", 
    "Absolutely love this product just the right size for my living room.", 
    "We needed a small table next to our sofa and this was the perfect size. This is a solid wood piece that requires assembly, which was relatively easy. Just perfect for my coffee and tissues!", 
    "Good quality, looks nice, sturdy. Ordered a second one!", 
    "I didn't want to spend a fortune, but I wanted a small table for when I'm sitting in the chaise portion of my couch. This was perfect for that, and for the price you really can't beat it.", 
    "I have limited space in my living room, so I thought this table would fit the bill...and it does! It can be used as a side table, snack or eating table. It's sturdy but lightweight and has a very nice finish. My only complaint is that the magazine holder holds only a few magazines and they must be curled to fit. However, I am very happy with my purchase.", 
    "good quality wood , easy to put together, but the stickers that marked what number the piece was in the diagram left sticker goo on the wood... bummer", 
    "stand is perfect for what i needed, also price was great", 
    "Just what I needed next to my chair to set a coffee cup on.", 
    "Great size n color , price", 
    "Table is not very tall and is smaller than I envisioned. Finish isn't great, either. But for the price, not unexpected quality.", 
    "good quality for the price meets our needs as our sofa has no arm on one end its just the right height", 
    "Very satisfied and good price", 
    "Looks nice but don't lean on it, ours broke when my husband leaned on the shelf. This isn't a high quality product, but then we didn't expect it to be for the price.", 
    "It arrived in a very timely manner and was easy to assemble. The quality of the wood is great and it fits right in with my living room furniture.", 
    "Was easy to assemble, looks good, good quality.", 
    "Very nice. Glad to find a wooden table to match my traditional furniture.", 
    "A beautiful table. Nice color. Very pleased !", 
    "Just what I needed for bedside to keep my laptop upon! Perfect size for a tight place (small bedrooms in this small community!).", 
    "Works great for all the things you need by your side when sitting on the couch.", 
    "This side table is a wonderful space saver and the concept is great. However, the construction of the material is not the greatest and the holes are not pre-drilled well, leading to the stripping of screws. This will not last us a full year as it is already falling apart.", 
    "Looks rich, easy to put together, works great where I put it in my bedroom next to my reading chair.", 
    "Love it. Us it all the time!!!", 
    "Assembly looked daunting...but once I started, it went pretty smoothly. I do, however, believe there was a page/step missing. Although not directed, buttons that cover hardware need to be glued in place. I expected it to be the height of a TV Traytable, but it's a few inches shorter...and the table surface is quite a bit smaller...my mistake in not paying attention to the measurements in the listing. It's good for a snack, but a bit small for a meal with dinner plate and a drink. It is very stylish, however, and handy as an end table beside the lounge section of our sectional, where there is no outlet nor need for a lamp.", 
    "top of table is not sturdy and has moved after putting it together", 
    "Assembly wasn't really difficult but took a little creativity balancing the parts. The table is attractive but completely impractical since there is absolutely no support for the table surface. Very poor design - the top broke off within a few days of gentle use exposing the crumbly pressboard inside so there was no way to repair it. A disappointing waste of money and effort!", 
    "We bought this piece, along with the Simple Living Ethan End Tables to be used with our sectional. The color matched and the quality was much better than I thought it would be, especially for the great price. I would highly recommend.", 
    "quick shipping, easy to put together, good quality", 
    "Great table table Fits my needs. Easy to assemble. Solid wood.", 
    "Easy to put together and I love the way it looks!!!", 
    "Great size and very handy", 
    "This table shipped super fast, I received it within two days of ordering it. It was super easy to put together maybe 15min tops. It is the perfect height for my couch and fits perfect int he narrow area I needed it for. All the pieces were in the package and it was wrapped for protection, and the instructions are very easy to read, I would def buy this table again.", 
    "I was looking for a thin, sturdy table to hold a drink or the remote. This table does just that. Small enough to place in the tight spots on the side of the couch and not big enough to \"draw\" clutter attention. Very pleased with purchase. Highly recommend.", 
    "Bought this table for use as a snack table and drink holder. It is very sturdy and the color is very nice.", 
    "This thing serves its purpose.... just don't accidentally set anything heavy on it. Also requires periodic tightening of bolts that hold it together...", 
    "Functionally, this worked out well and looked great. But it had that formaldehyde smell for about 2 days. My husband didn't notice it but it drove me crazy at first.", 
    "good for tv dinners, not lamps lol.", 
    "Using this little table as a bedside. Just needed something small for my phone and iPad chargers. It works great. I have a couple of journals that I make notes in from time to time and they fit perfect in the magazine rack. I added a small basket on the base for foot lotion nail file and cuticle sissors. My hubby assembled it in just a few mins. Well pleased with price and quality", 
    "Exactly as it was pictured. Easy to put together too.", 
    "Pretty unstable, but it does fit in a snug place.", 
    "My husband and I used these all the time. They are the perfect little table for a drink or a small plate ect. However my husband would always put his legs on them as a leg rest and one of them broke. I know this is not the intended use however if you have kids/husband ect who are hard on the furniture, get something a little sturdier.", 
    "Not sturdy N.", 
    "neutral about my decision", 
    "Easy to assemble, sturdy and attractive. Good value", 
    "It's just the right size table for a small area. There's enough room to place a drink, snack, and remote control on, and I love the extra space to put magazines and catalogs.", 
    "Very attractive unit for the price, and it fit perfectly in a small space next to my chair. Assembly went together well until the last two bolts- they were too short to thread into the pressed fittings on the table top; I had to go to the hardware store and buy 2 longer bolts, which was a pain.", 
    "Great little table. Sturdy and a great size for using near the couch or chair. Fits in a tight spot too.", 
    "Nice piece of furniture for the price. Not hard at all to put together.", 
    "I bought this to use next to a stressless chair and it is perfect......just the right size and height. The table was super easy to put together. I am delighted with the purchase.", 
    "This table worked well for the space we had, was easy to put togetherand my husband is happy with it by his recliner.", 
    "Nice addition to my living room. Item is sturdy and very easy to assemble.", 
    "I love this snack table beside my recliner. Holds a couple magazines, TV remote, and other things. It was so easy to assemble, even I assembled it, and I am a bit mechanically challenged!", 
    "This table is the perfect size for the spot my husband needed it.He gets home from work and sits in his oversized chair with hisfeet on his ottoman and puts his remotes, drink and dinner on thetable and he never has to move until he is ready. Sports freak thatwatches intensely...perfect little table for him!!!", 
    "we didn't have much space next to the sofa but this little table works like a charm. It is so light so you can move it around to eat, work on a laptop or just hold your drink. Warm brown color too!", 
    "Great little table works great as my lamp table!!", 
    "I wanted a C-table to put next to a queen size bed that has 12 drawers under it. I t was hard to open the drawers without moving the bedside table every time I wanted something . My husband put it together with a minimum of swearing . Had to plug the too loose holes and used Elmer's glue every where to make it more solid. It turned out ok. The magazine holder is very small. The wood looks okay.", 
    "Easy to put together. Very stable.", 
    "We had 4 of these for several years. Needed new ones so we bought 4 more. We have a huge sectional couch and we slip these under the couch for company and for us. These tables were priced quite a bit less then our other ones and they are much better quality.", 
    "I purchased two of this. One for my living room and the other for the guest room. Just what I needed. I have been looking for a cozy little table for my cozy place. And found it in this Espresso Magazine Snack Table. It doesn't occupy much space and very easy to assemble.", 
    "This table is so good, and comes in very handy by the sofa. It has a compartment where you can store things on the side, and is very stable.Easy to put together, and well worth the price. I have been very happy with all of my purchases from Overstock.com", 
    "Awesome table for small spaces. Has magazine rack and back side storage rack. I have bought several. Perfect fit.", 
    "This is just as it looks in the picture. If I were designing it, I would make it a couple of inches higher. It is relatively easy to assemble but does take a little time. Also, I'm not yet quite sure about this, but I think w'll take them apart again and put them back together using carpenter's glue in spots (and perhaps retrofitting a brace of some kind) to make them stiffer.", 
    "THIS PIECE IS PERFECT FOR THE RECLINER I BOUGHT FOR MY HOME IN FLORIDA, THIS TABLE FITS ON THE SIDE OF THAT CHAIR JUST RIGHT. GREAT BUY FOR THE MONEY.", 
    "This nice, compact snack table is a real help when it comes to taking up less space and doing a great job for those that love to eat or read in that favorite chair or on the couch., Fits nicely next to almost any piece of furniture. Excellent finish on the wood. Good color. You'll love it! A bit pricey but the quality will give it a long life in our home.", 
    "The color picture is more dark brown. However, the product arrived is much lighter (medium oak).", 
    "Was exactly what I need worked great in the space. Only concern was shorted two screws to put it together.", 
    "Looks good. But can't put items too heavy on the outer edge as it becomes unstable.", 
    "Perfect size next to my new recliner. A place to have coffee and a donut while watching the 6AM news.", 
    "just what I was looking forrrrrrrrrrrrrrrrrrrrrrrrrrrrr", 
    "Although the table top is smaller than I thought, the table is very handy and decorative,", 
    "This table was so cheap we were a bit hesitant, but it turned out to be perfect for my need. Easy to assemble.", 
    "This little table is perfect. We have a large sectional sofa and this is perfect for the seats in the middle where it's hard to find a place to set down your drink.", 
    "Cute, very little snack table. We like it. Holds a cup and small plate.", 
    "We have a small living room, and not enough space tor a coffee table, so this makes an excellent table for sitting a drink on in the middle of the couch. It is a beautiful color and matches our other furniture to a tee. It was easy to assemble, and is a great quality product. Thanks again Overstock for another great product", 
    "I needed a small table beside my recliner in the office and this was perfect to hold the phone, a few magazines, a snack. It looks just like the picture they show.", 
    "The snack table is just what I needed - a small table on the side of a chair to put a few things on. It was easy to put together and, although small, is sturdy. It isn't very wide, so the magazine pocket will not hold a regular magazine, but would be fine for a folded newspaper or book. The color of the wood seems a bit darker than the picture. I have no complaints about it and would have rated it excellent if it had been high quality solid wood. As it is, it's a good value for the cost.", 
    "magazine holder much smaller then appears in pictures . color is off, product looks cheap", 
    "These are nice for a \"screw together\". I like that the top doesnt have a layer of that paper like stuff that when it gets wet it bubbles up. Im going to buy more. Sturdy.My efficiency lacks room for a table any bigger than for two people. These can be used to eat off of while sitting at any chair. The price is a steal. Saw the same ones on other sites for ****.", 
    "Nice convenient table. easy to put together. Makes it much more convenient to have a cold or hot drink while reading or watching TV. Sturdy", 
    "Not sure how you can use a product when you don't get hardware... not returnable? Seriously? I am out money for something I can't use...", 
    "I purchased this table to put at the side of my husband's recliner chair. It works well there, is attractive and gives him a place for his coffee and to store his newspaper. It was easy to assemble and although not a stand-out piece of furniture, it is fine for our use and a good value.", 
    "This table was my second choice, but I think it's better than I the metal table I originally tried to purchase. I was looking for a small table to put next to the couch for the many remotes we have. This table is smaller than a side table, but big enough for the remotes and a snack...perfect! It is made of solid wood, and it assembled in about 20 minutes or so. It's also great because it can be moved around the room easily. It seems to be very sturdy, so it should last. Compared to other tables in this price range, it's a great value. Love it!", 
    "I bought the stand to use with a new chair. However, it is not tall enough to over the arm. I should have read the dimensions closer before I ordered it.", 
    "Just the right size to hold a cup of coffee and rest my laptop! Easy to assemble and very attractive.", 
    "I love this little perfect little couch side table.", 
    "I bought this for my husband to go in between us on our lazy boy sofa ... It works perfect holds a glass of wine and snacks and looks very nice , it's also perfect to set our iPads on , the lazy boy sofa has two recliners on either end the table works perfect !!!", 
    "This is actually solid wood, which was a pleasant surprise. I've seen this described as a 'laptop table' on another site, and believe that to be accurate - this is perfect for a drink & snack or laptop (I actual use it for both, not at the same time though), though a larger laptop my extend past the surface area of the table. Given that it has a single, fairly thin vertical support, it is surprisingly sturdy and wobble-free. The wood is fairly thin, but plenty thick for its intended purpose, this is a small accent table and not a chair. The remote caddy is a nice extra, and the table is simple and stylish enough to fit in with a wide variety of decor without standing out. I put it together in less than 20 minutes (maybe 10, actually).", 
    "This little table is constructed well and of good quality. I screwed in my own brackets underneath to further support it since we placemultiple cups and items on it. Well made, sturdy and easy to assemble, we own two now.", 
    "I am disappointed with this item due to the fact that the top is not secured. It needs to be glued, as the screws stripped the moment the slightest amount of tightening was attempted. Aside from that, it is a nice looking piece and was easy to assemble. Also, the metal screw tops are fully visible -- in other words, there are no caps for them and the screw's metal color really stands out against the dark wood.", 
    "The table was easy to but together, it is a little small, not the best for a laptop, but ok for drink and remote.", 
    "For the price, it is exactly what I wanted. I needed a very small table for my Travel trailer and it works great there. I have purchased one of these before for the house and it works great there also.", 
    "This little table is exactly what I was look for and fits perfectly under my chaise lounge.", 
    "This little table works great for small places and very convenient for just about anything, lao top, magazines, declutter, TV tray or remotes.", 
    "My dog has knocked it over and it held together well. Easy to assemble and fits in with my other furniture well. Might buy another soon.", 
    "I needed a small table to set our remotes on in the middle of the couch. We have a recliner sofa and my husband and I were always having to pass the remotes. Now the remotes are between us and we both can reach them. The only thing I wish was different is the magazine rack. It's not wide enough to store a magazine without folding it in half. The color matched our other end tables and it looks like a set!", 
    "neat and inexpensive little table. solid and sturdy.", 
    "Husband put together in matter of minutes. I wanted for bedside to put my laptop on, and it works just fine. Sturdy, good quality.", 
    "I am currently living in a small rental unit which has little space in the living room for a coffee table. One sits on the sofa and does not have easy access for a place to place a cup of coffee, etc. While I have never had a table like this, I searched the local furniture store to see if they had something like this. Of course nothing like this was available, but Overstock.com had more than one. It is perfect, as it is very portable and slides securely under the sofa frame for stability. Currently my coffee cup and the TV remotes are on the table and easily accessible. It arrived packed well and was easy for this old dolly to assemble. Good choice, good price!", 
    "These tables are the perfect size an of excellent quality.", 
    "Overall this is not a bad looking product. I bought it to match the many other items I have purchased through overstock for my living room. It just did not seem the same quality as the others.", 
    "This product was terrible. I would have sent it back, but had started assembly. Would not recommend this product.", 
    "I purchased this for my daughter and she loves it. It works perfectly fr what she wanted.", 
    "I have added 1-1/4\" OD 4 castors to make it mobile. It is about $10 extra.", 
    "Perfect size table to keep next to my chair. Looks good and is not in the way like the tv tray that use to sit there.", 
    "Was impressed with the wood quality. But, I was expecting a darker color, espresso. Did not assemble, since I will probably return it. Waiting on remaining order to compare colors. Really liked the size.", 
    "A nice solid side table that is easy to put together. You won't be disappointed.", 
    "I bought this to set in front of me to use as a table for my laptop. It is a little too tall for that, but it is the perfect height to be used as a side table. It is very easy to maneuvre, as well.", 
    "We purchased two of these tables to accompany our new couches. They arrived quickly and were well packaged. We were surprised to find they only were tall enough to clear the seating surface of the sofas by an inch or so; we would have done well to measure prior to ordering. Our bad. Once these were assembled, they were wobbly. We had to disassemble them and add wood glue to the screws to make them sturdy; we have now had them for several months, and they're holding up beautifully.", 
    "I was very satisfied. I put it together myself and it was easy. It is just the right size for what I wanted, the table top. The magazine rack part was not quite The size of magazines I take..", 
    "Product was easy to put together and looks like a quality piece of furniture.", 
    "LOVE THESE TABLES. GOOD QUALITY WOOD WITH A NICE FINISH", 
    "Don't waste your money on this table. The screw holes didn't fit the supplied screws. The table was wobbly. The look of it is deceiving. It's very pretty, but it doesn't serve any purpose because of the poor construction. A real disappointment.", 
    "Not well made. When trying to assemble, some of the predrilled screw holes seemed to be already stripped. My husband had to go buy larger screws to assemble without it being wobbly.", 
    "Easy to put together. Purchased 2 of these and they're very handy since they slide right under the sectional anywhere along the way giving everyone places for drinks and snacks. I've gotten several compliments on these and people asking where I purchased them.", 
    "I wanted an extra table for the end of a couch that is right on the edge of the traffic pattern so it needed to be small and this one fits the bill perfectly. I can also tuck an edge of the table under the couch permanently just in case someone bumps it going around the corner they won't knock it over. This table is VERY sturdy for its size. The espresso color is really more of a mahogany finish,", 
    "I have a 15 1/2 inch space between a sofa and the wall, and wanted a table small enough to fit there that we could use to put a drink on mainly. This table fit just right. The only thing is that a wooden peg was missing, so I had to get one to finish assembling it. That was really annoying because it took alot of extra time. Happy with the table overall.", 
    "This is a great little table. Perfect for small spaces. I needed something in my office for students to write on and it worked out great.", 
    "Wow, what a great little table. Just perfect for a small space to hold a cup of coffee and a book. This table is well made, not flimsy. The materials are sold and the parts easy to assemble. All the pieces are grooved to help provide an easy and tight fit. The design is nice and the quality much better than the price indicates.. I am very pleased with this purchase.", 
    "I think it's very nice side/ snak table. You can put your laptop on it too. There is no big space for magazines/newspaper but I think it is very nice table.", 
    "Great little table and fits right under my chair. Even has the magazine rack.", 
    "This snack table is inexpensive and of good quality. No, it's not a high-end, solid wood table meant to hold tons of items - but it is sturdy and great for sitting drinks, small bowls / plates, and maybe a remote or two on. It's also lightweight so it's very easy to move around the couch. The rack on the side of the table would work well for a t.v. guide (do they even make these anymore?) or a remote but not much else. Easy to clean and care for, and worth the price.", 
    "good stand, may end up getting another one, not sure yet", 
    "Have wanted a table like this for a long time. Finally purchased this one and it is just what I wanted. I have been a customer with Overstock for many years and have always been satisfied with the products. Most reliable.", 
    "My only complaint was the screw holes were either too big or stripped for many of the holes. Made for a whobbly table top.", 
    "Nice little table for a chair or sofa that won't easily take a side table. The screws that came with the assembly for the table top weren't quite long enough to suit my husband, so he put longer ones in. It's nice and sturdy and I don't worry about it tipping over. The little magazine slot is a nice bonus. All in all, very functional.", 
    "I saw many pricier end tables, but was drawn by the price of this one. It was easy to put together, and relatively sturdy. It is quite small, but I guess I expected that. It fits really nicely on the end of my sectional. Wouldn't hold anything especially heavy, but my laptop or glass/magazines, other small things it works nicely.", 
    "The table was well made, easy to assemble and a lovely addition to the family room.", 
    "Perfect piece of furniture for limited space or you don't want a big end table. Easy to put together. Nice finish. Ideal to put beside a recliner, a bed or if you have limited space in an apartment and need somewhere to put the remote or a drink. Just the right height. Good quality for the price. Would buy again!", 
    "I received this table last week. I was immediately surprised and pleased at the look - lovely. However, as I put it together I found a defective piece where the pegs and holes did not line up correctly. I was immediately dismayed - should I just return and forget assuming one cannot order furniture online and expect much? Surely it would be such a hassle to get it replace. I was WRONG - Overstock.com had emailed me a return label and delivered a duplicate table before I even got the first one returned. This morning I happily put it together. I am pleased with the table but even more pleased with Overstock. com. I would never hesitate to order from them again and will let my friends know that there is a company that does things right!", 
    "Exactly what we needed for around the sectional in our living room, a sectional that leaves no room for a coffee table or end tables. As mentioned elsewhere the \"magazine holders\" are small, but we use them for smaller things than magazines, remotes etc, for which they work perfectly. We bought 2....Easy enough that I assembled them each in about 5 minutes, without my boyfriend's help. However, be warned: it was very easy when assembling to strip the screws on the tops, probably because of the quality of the wood used, so assemble carefully. Fortunately, that's easily fixed with a toothpick.", 
    "Great little table. The magazine holder is a little small but we use it to hold our remote controls. It is tall enough to stand just over the seat of the couch which works for us.", 
    "Decent little table. Easy to assemble - but use this only in a hiden corner as it has some color flaws, and looks somewhat cheaply made. Because it is so small don't expect it to hold very much!!!! We have a standing floor lamp behind this table.", 
    "Purchased for our kids in our game room. Perfect size for a small room when there's no room for end tables or coffee table.", 
    "The price was right but the reality not so good. I bought two, returned one and the other broke. The screw holes were pre-drilled and too big so the screws didn't tighten down. I had to use extra glue and things to tighten it down, but when I tried to use it for my laptop it broke. I guess it was made for a cup of tea. Also due to the struggles getting it to stay together it wasn't level.", 
    "able to get good use, can be recommended to others.", 
    "It was a pleasure to deal with SEI. They immediately corrected a minor problem. The two staff people I spoke to were patient, courteous and extremely helpful. Talking to \"real people\" was an added plus. I was not given the usual runaround. Their knowledge of the product made my lack of same negligible. It was a pleasure to do business with them.", 
    "This snack table arrived today, and I when I opened the box, I was pleasantly surprised at the quality and the assembly was a cinch. Unlike some other pieces I have purchased in this $$ range it doesn't look cheap, and the predrilled holes actually match up to the dowels, and it seems quite sturdy!! The Espresso finish is very close to the Cherry finish of my other furniture. I don't know how it will hold up, but I am happy with my purchase today!", 
    "I love this sofa table. It's perfect for my use, ie, snacks, doing paperwork, sorting mail. It has a host of uses. Thinking of ordering one for my sister.", 
    "I was looking for a slim end table to be able to rest drinks, books, laptop, etc on while sitting on my couch. This is perfect! I can pull it over the arm of my couch to use the lap top, or just leave it next to the couch as an end table of sorts. Easy to assemble and the quality if pretty good.", 
    "This table is sturdy and easy to assemble. This is a great value for the price.", 
    "This is the first time I have been disaapointed in my purchase. Everything other than the assembly was fine. Quality of wood, appearance etc. I cannot say this would be on everyone of these snack tables but the one I received more than half of the pre-drilled holes were too large and the screw would not tighten. It was not worth it to me to send back and I was able to add wedges to these holes to get the screw to grip and tighten down.", 
    "Upon assembly I stripped the screws and I had to go get some wood glue and longer screws, But after that it was fine. Maybe manufacturer could send longer screws for the table top.", 
    "This is not in any way near espresso coloured. It's a reddish brown and the finish is really rough. It's too short to fit over any chair arm. stay away from this product.", 
    "Had a problem with shipping.but very helpful. Everything was great", 
    "I was looking for something for my husband (who is very hard to buy for) for Valentine's Day. He has a favorite chair, but no place to put his few things that he likes handy while sitting in the chair. I saw this snack table and knew it would fit the need perfectly. It arrived timely and was very easy to put together. It is very sturdy and looks very nice. My husband loved it and now his things sit on it and not on the floor.", 
    "What we were looking for. The only thing I was disappointed in was the size of the slot to put possibly magazines (what I was hoping to use it for), it is narrow and not even the width of a mag. However, everything else is great. Can still use it for books or remotes.", 
    "This is a good little table, very functional. The color was a little lighter. Would recommend.", 
    "I wasn't certain how this would go with the decor of my room. It's perfect, add's conversation. Remarks such as, \"I'ver seen anything like that before, where did you get it?\" Perfect fit... I have to add, my husband always, always has problems putting things together. Not this! Easy to follow directions....", 
    "This table was not as big as I thought it to be, but I look mostly at pictures to see how things can be used as opposed to the size. Was not quite big enough for what I wanted but all in all still pretty good. Our son came over and wanted it to sit beside his chair. Gave it to him and it looks nice in their living room.", 
    "nice quality wood, seems sturdy - was not difficult to put together. I would of liked one a little lighter in color but this one works.", 
    "I am pretty impressed with this table. I received it in a timely manner and it was relatively simple to put together, although you will need a screwdriver. One negative component of the table was the deep holes where the screws fit into. They are very noticeable and the screws themselves are gold so they stick out quite a bit. All in all, it is a great little table to keep drinks and munchies on while sitting on the couch and it is a very sturdy piece of furniture. Can't beat it for the price I paid!", 
    "These are great little side tables for the money, I don't see how anyone could beat them, my wife and I went to several furniture stores looking for two small side tables to go with a new couch we had purchased. After looking at all the riduculous priced tables in stores and online, I stumbled on to Overstock.com where I found these tables. Yes at first I questioned the low price and figured the tables would be inferior in quality and craftsmanship, BOY was I wrong, purchased two of them for less than half the price of what other tables sell for.", 
    "Excellent little magazine stand. Very useful for handily storing magazines", 
    "This is actually a very nice little table; however, it turned out not to serve my purpose because it is too short. Be sure to measure how high you need it to be & do not simply gauge it by the picture like I mistakenly did. It does not sit higher than the arm rest of my chair thus it will not move inward to serve as a lap-table. Also, it may not be high enough for your knees / legs to slide under when place in front of a chair unless you have a lower than average chair. I may try to find some caster wheels to mount onto the bottom so as to give it more height. If you do not mind it in front of your chair and having to lean over versus sitting back erect & comfortably in your chair, then it should be fine for you.", 
    "Fast, efficient service. Never had a problem. Table is perfect for our use.", 
    "Very good table for the price. Shipped very fast! Good service!", 
    "A perfect table top for a small room. A definite upgrade in appearance from \"TV trays\" from years past..", 
    "The table is nice looking but it is not very sturdy - you cannot put anything too heavy on it. It slides under my sofa perfectly and is a handy place to set the remote and a drink. Not much less. I could not get the top to tightened down properly but going to see if I can buy a more slender screwdrive to make it work - apparently my screwdrivers are all too thick. For the money, its a decent buy.", 
    "If you have only a small area for a side table, this is your table. Excellent quality especially for the price. My only negative would be that it is a \"little\" smaller than what I would have preferred - but all in all, a great purchase. It has been very difficult to find side tables for a small area.", 
    "I love everything about this table, except it doesn't actually fit magazines. The width is too small, so it nearly makes that component unnecessary. The size is small, but that's good because I didn't want it to take up a lot of space, just big enough to hold a few glasses while people watched TV on our sectional.", 
    "A great price for this product. My only regret is not having bought more as I was suspicious of the quality for the price charged. The wood appears to be solid, the finish is smooth and the balance is good. Thge only minor complaint is that the surface is a bit smaller than I thought it would be. Adequate for a computer or for drinks, but wiould be tight were one to inclkude a full course meal.", 
    "Nice side table for a little bit of storage for magazines/papers. Took less than 5 minutes to assemble", 
    "I bought it to put at the end of the couch to put a drink and TV remote on. It serves its purpose. It's not very sturdy and had to use wood glue to keep it together. But it was 20 bucks and I was not expecting a high quality product.", 
    "This may last for you if you are very careful with it. It broke when my 3 year old granddaughter leaned on it.", 
    "This was wonderful quality and excellent price. Easy to put together and arrival time excellent.", 
    "coupl of holes stripped out easily ..................", 
    "I fine this table to be very convienent to use. It keeps me from having to jump up to get things. Magazines are now by my side.", 
    "I was pleased at the finish and quallity of the wood. It's a very nice little addition to my chair grouping. Very well done, especially for the price. It does take some assembling, but the instructions are pretty clear. I may order another....", 
    "was a type table I was looking for an because of the price I thought maby I wouldnt be getting the quality, but I was wrong...was good quality an sturdy, very pleased with it", 
    "I love the table! It was easy to put together, with every screw lining up perfectly. This will be the perfet snack table for my travel trailer!", 
    "Purchased this as a gift which was sent directly to my sister to replace a broken one, so I can't comment on the color, but she seemed very pleased with it. It went together easily since her 10-yer-old grandson assembled it.", 
    "Great little table for the money. Sturdy and attractive, and very handy when watching TV while eating, or for someone who is elderly and needs to keep their things nearby. Fits under a chair or sofa, so can be brought close for easy reach. Am pleased. Would make a nice, as well as inexpensive little Christmas gift !", 
    "Awesome product, easy to assemble and fast shipping..! Love this snack table which also can be used as a laptop desk.", 
    "Perfect size for our RV! I bought 2! Small yet sturdy and the quality of the table looks expensive!", 
    "color is not as pictured.have it on the side of my couch for my laptop to sit on. it works well there. magazine rack is more for menus, no magazine will fit.overall table is smaller than expected and i wouldnt put anything heavy on it, although it was pretty sturdy compared to what other people wrote. easy to put together and def worth $$$", 
    "I was looking for tables this size. They are very hard to find and yet they are super handy to use at the end of your sofa or next to a chair. They are narrow so they don't take up too much space, but they are wide enough for a glass and a book sitting on top. I ordered three of them and am very pleased with them. They also have space at the bottom to put your book when your not reading it to keep it close, but get it off the top of the table.", 
    "This table was slightly higher than others and fits perfectly over the overstuffed arm of my sofa. The wood finish is beautiful!", 
    "This stand is perfect for the entertainment room couch as it perfectly matches the \"Mission \" style furniture in the room and the storage is perfect for game controls or remotes. Great value for the price.", 
    "Price was great for how well this was made. Quite sturdy and very pleased with purchase.", 
    "Makes a good gift for any age; useful for all. Probably something they wouldn't buy for themselves.", 
    "Great little piece....such a convenience and doesn't get in the way. Very pretty as well!", 
    "Table is small as expected, but assembled easily and fits between two chairs I have in front of my TV perfectly. So others don't have to guess on size, the top measures 11\" by 15\". It is 24\" high. It works out well for remote controls plus two coasters for drinks. However, the so called magazine rack below is too small to actually accommodate more than one or two magazines at most. If you are concerned that the table may be a little wobbly, you can always place a book on the base. FYI, \"Bartletts Familiar Quotations\" works perfectly for this.", 
    "We use these little tables almost daily. They are SO GREAT! Better than all other TV tables. They move easily, can slide right up close, and are just great!", 
    "I wanted a little writing table that I could use next to my computer keyboard. This table is just perfect. It was easy to put together and it looks nice. The price was also excellent. I saw the identical table on Walmart's internet store and it was more than twice as expensive. I also appreciate the fact that shipping is only $2.99.", 
    "This product is excellent for the price and it's intended use. Looks good and is very functional. You don't have to feel ashamed that you have a cheap looking piece of furniture.", 
    "Good quality, easy to assemble, I like it a lot. Also purchased one for a relative that has a 1 room home.", 
    "Cannot hold a dinner plate weight! Would not purchase again. Description needs to warn you about want it can hold.", 
    "Nice snack table ,easy to assemble. 2 screws striped i had to put in 2 larger screws . Makers of table should correct that problem!!!!!!", 
    "The good news is the table goes together very easily. The bad news is the top snaps of completely just as easily. I had it only a few days when I applied minor pressure and down it went, along with my 'snacks' onto the brand new wall to wall Berber carpeting. What a mess! Looking at the table with a more critical eye, I realize this was bound to occur with any kind of weight at all, as there is far too little support. I wouldn't recommend this to my worst enemy. No, I take that back... I would.... just not to anyone else!", 
    "I LOVE THE TABLE WISHED I ORDER MORE. WAITING FOR THE TABLE COMES BACK IN STOCK", 
    "I needed to find a small table to fit in between my bed and my nightstand where my wastebasket was. When this table popped up, I read the reviews and decided to give it a try. In other reviews, some people complained it was too small--it is exactly as described. Some complained it was too hard to put together. I put it together while sitting on the couch watching a TV program with 1 screwdriver (the tool, not the drink!) The instructions were clear and it was incredibly easy to assemble. It took about a half hour--probably because I was distracted by my TV program or it wouldn't have taken so long. I was very impressed with the sturdy shipping carton that allowed it to arrive undamaged. The table is sturdy enough--I don't lean on it or try to sit on it, but it holds my sleep machine without issue. The design still allows me to put my wastebasket in the space (on the base) and use it unimpeded. For me the \"magazine rack\" is a non-issue (it's butted up against the wall out of the way), but it would only hold a TV guide or a paperback. And the color...well, it matches my cherry nightstand perfectly! \"Expresso\" might be a name but, thank goodness for me, it's not a color description! In short, this table was EXACTLY what I needed and at a good price. Lucky ME!!!", 
    "I needed a small table next to the couch in my RV and this was the perfect fit.", 
    "The table was easy to assemble and is a sturdy little piece. We were looking for something small to put in between a love seat and recliner for drinks, etc. This has worked out perfectly.", 
    "This product is just Excellent!! I was so surprised at the high quality of the wood. Very sturdy and fits perfectly with my couch! I love it!", 
    "I like the table, however I was expecting (and hoping for) a black table to match other occasional tables I own. The color isn't even dark brown; it is a medium oak color. That said, it serves its purpose well enough. I wanted a small piece that visually wouldn't take up much space in my smallish room and it assembled easily. DO believe other reviewers when they say you WILL need a small diameter, long shaft small phillip's head screwdriver. Although I have many screwdrivers, I had to purchase another to specifically meet the assembly needs for this table. Over all, a nice table, just wish it were black as described.", 
    "Just what I was looking for. Great quality and easy to assemble", 
    "I liked these snack tables and had high hopes for them until my kids broke them! I wanted something to hold a drink or snack for a sick child who might be lying on the sofa watching T.V. Good purchase if you don't abuse your furniture.", 
    "I wasn't expecting too much based on price, but the piece is very attractive and I find myself using it nearly every day when watching TV.", 
    "The color of this table is cherry wood, ligth brown, not espresso. It doesn't match my furniture, if you are looking something on the darker side, you will have to order a black one, becuase this one is not espresso, which is supposed to be a dark brown.", 
    "Instructions easy to follow. The hardware (screws) are counted exactly...no extras. Don't over torque the screws...just snug. My opinion...", 
    "I ordered to go beside my couch but it is too short for that. I tried it under a small arm chair that I have and it's even too short for that. Don't know what size furniture it is made to fit under unless you have items that are very low to the floor. I can use it facing the chair but it does not store nicely out of the way. Glad I waited to see how it fit before ordering another one.", 
    "Was very pleased.Easy to put together,slides perfectly under my leather sectional.Plan on ordering another.", 
    "I'm very pleased with this purchase. This piece was easy to put together and shipping was fast. Thanks!", 
    "We just bought a double-reclining sofa for our basement and needed a small end table to set drinks on. This works fine for what we needed, but we had to use different screws than what came with the table as the ones supplied were not big enough to hold it together firmly. It seems to be holding up so far.", 
    "This little table is just perfect next to the sofa for my morning coffee. It holds a couple of magazines and phone and is the perfect height. We did have one slight problem. Upon inspecting the pieces to assemble, two pieces were duplicated and another omitted. It wasn't really a problem though as we called the 800 number included in the directions, told them we needed another piece and within a few days it was delivered and the table was assembled. We are quite satisfied.", 
    "The quality is so so, but I am ok since it didn't cost a lot. First I ran into a missing part (a bar). That took about a week to arrive. In the last step of putting together, I found out there is a crack on the last piece of parts - the top board, half way through the center. So here we go again to parts department. The design wasn't great, either. It is hard for one person to put together, also hard without a power tool. With 2 issues for one product, I'd think Overstock rep feels sorry and offers me a coupon or something just for nice gesture - but nothing. Anyway, I'd stay away from this manufacture in the future.", 
    "I have wrestled with this and cannot get the notches to line up in order to screw the screws in. I finally improvised, and now the table does not lay level. It doesn't do me much good to put a glass or anything I don't want sliding off. I think you can do better.", 
    "Very easy to put together. Made from solid wood,no veneers, with a rich finish. I think I might buy another.My first \"O\" purchase, and won't be my last.", 
    "This table was quite hard to assemble and has proven even harder to reassemble after my kid leaned on it and it broke apart.. Also, the magazine holder on this only fits Readers-Digest-sized magazines, and not more than one or two.", 
    "This table is well suited for my purposes. It did, however, require some additional tools in order to make the connections sufficiently tight and prevent wobbling. I would recommend it.", 
    "The bad: Screws show. There are pre-drilled holes and the screw heads are fairly visible after screwing them in. You could probably buy some wood filler to go over it? I don't mind them showing, so it's not a big deal to me. Other than that, it is a nice table, good quality, solid. I bought two. They feel fairly stable, I have a lamp on one, and the other is for snacks in the tv room. I don't know what the weight capacity on them is, but I'd be willing to bet it would safely hold 12 pounds maybe up to 20lbs. Perfect for what I was looking for, in real life it looks just like the picture. It is also a good little tray table for your laptop while you're on the couch. Overall, I like it, gave it a 5 and would recommend it to a friend...I may even have to buy a third.", 
    "I like the table is great to munch a sanwich of snacks. Open drill holes are not very attactive but, all in all, it is a fine \"little\" end table. It could be better , but I don't think you could beat the price. Defietly friend worthy.", 
    "Nice but kinda wobbly...wood is nice quality...but I expected it to be taller to fit over my couch arm and under the side.", 
    "After reading reviews was concerned about assembly. Piece of cake, am 61 year old female and the snack table assembled perfectly. Very Sturdy, The price is certainly why I was first attracted to this table. Has more then met my needs. Beats the over $200 price local furniture stores are asking. The pieces were very well identified for assembly. At first thought would have trouble with some of the screws, but after continuing to twist the screwdriver, Voila, the screw as set and held to a snug hold. Which there were more colors available. Would highly recommend to anyone that is looking to save money and still get a good quality piece.", 
    "So it is not the best piece of furniture I have ever purchased, but it does what I want it to....hold my drink at my end of the sectional couch:) It has very simple instructions, but I did use wood glue and a power screw driver to tighten the screws that wouldn't go in all the way due to the pre-drilled holes not being deep enough. My husband probably would not have had any problems with it since he has more strength, but I didn't want to wait for him! All in all, not too bad if you are just looking for a very small side table to hold a few things. Oh, I'm not even sure what the \"magazine\" rack at the bottom is there for....might hold some mail, or a folded magazine, or small book.", 
    "This was a good buy for the price, it fits in a small place & seems to be sturdy for it's use. It's a nice looking piece of furniure & would match most any dark wood. It was easy to put together & was exactly what we were looking for.", 
    "This table is the perfect size for my room. I'm using it to hold a little flat screen tv in a corner of the room. I was able to assemble in just a few minutes. I'd definitely reccommend this table", 
    "While I look and size of the piece, it is really cheap. The screws don't fit well in the drilled holes, so you either have to drill deeper holes or accept that it is really wobbly. I don't think it would hold a book, let alone a laptop. Also, just now I went to move it and I lifted from the top of the base and the entire table part came off. I think we are going to freecycle this in the morning. I recommend you spend more and get a better side table.", 
    "Overall, I found this snack table 'good'. I did put it together myself but it would have been easier with a helper. I found that the table top part did not tighten all the way. It is attached but is loose. I think I'll use some wood glue to secure better. It is a nice size for a small snack but really not that big. I would recommend it tho.", 
    "The wood looks good. It is cute. I am using it as an accent table to hold books and magazines. It is small so not a lot of space if you want to use it for your plate and rest your book as well. I had a difficult time assembling it. I am normally patient and good at putting things together but this one stressed me out (lol). It is still wobbly, I have to wait for my hubby to tighten the screws. Nothing special with this product.", 
    "I purchased two snack tables for a sitting area in our bedroom. They were fairly easy to put together and fit our space nicely.", 
    "Once assembled and put to use, I found the product to be attractive looking, useful and sturdy. However, I thought the assemblage was more involved than I anticipated given the relative small size of the snack table. In addition, it took many trial and errors to find just the right size screwdriver to fit the screws. Without the right size screwdriver, your time may be doubled!", 
    "The snack table fits the area needed. Just the right size and color. It was easy to assemble. I'm glad I purchased it.", 
    "The table was easy enough to assemble, but the top is too heavy for the supports beneath and it \"droops\". It is also fairly wobbly. If I had paid more, I would have returned it, but was already committed once I completed the assembly.", 
    "I bought this table to hold my laptop. Within a week of assembly it was already starting to fall apart. Now, a couple weeks later, I am looking for a new table to do the same job. Unfortunate because I was initially very happy to find this table, but I have been disappointed with it.", 
    "I would have given this 5 stars, but table didn't come with cover-ups for drill holes for screws. Otherwise, very nice table, looks far more expensive than Overstock.com price.", 
    "Sturdy, heavy, works and looks as advertised. Had a problem in that one of the wholes was drilled improperly and as a result the supplied screw head pushed too far into the wood and I couldn't complete the \"easy assembly\". The screw wouldn't easily come. It took me about 30 minutes of additional work and borrowing some tools from a neighbor to get it assembled.", 
    "We were looking for a small table to fit our RV. This is great!! We use it as a writing table; for our snacks and the netbook. While traveling from place to place, it stays nicely when the table bottom stand is under the couch bottom lip. Sturdy construction and a nice finish. I would recommend this to other RVers.", 
    "The magazine rack is not as wide as the table top. A folded newspaper is shown in the picture and that is all it will hold.This is not a huge deal, just don't plan on putting any real magazines in it.", 
    "These are very nice tables. I purchased two of them. They arrived in 2 days and assembled in 45 min for both. The color is nearly a dark cherry color, very beautiful. The only reason i didnt give 5 stars is that the magazine holder does not hold full size magazines straight, you have to curl them, but it is great for smaller reading materials including a fat novel or several skinny ones. These units are also well balanced. I have them on carpet and they dont even try to tip as i place objects on it anywhere. This is a good buy for the price.", 
    "I needed a small table to support a lamp and a drink coaster in a narrow space, and this fit the bill very well. Finish is good, assembly was easy with screws and locating dowels. It's a couple of inches taller than the height of the futon arm it's adjacent to, but it will be simple enough to cut the back down on a table saw.", 
    "We purchased this product as a bedside table to place our remotes and phones on. It arrived quickly and in perfect condition. It was easy to assemble and is sturdy for its size.", 
    "I received two(2) OF the snack tables and am also using them as a set of cocktail tables since I;have a small apartment and needed something smaller yet \"classy\" . They are quite sturdy and really suit my need perfectly. They were easy to assemble and I am all thumbs when I need touse tools. But the instructions and parts made it very easy and I am now using them while I eatmy dinners in front of the T.V. They go well with my new furniture . They really look more expensivethan the price I paid. Once again a real bargin."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Espresso-Magazine-Snack-Table/4851730/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4851730/Espresso-Magazine-Snack-Table-93a15432-aa0c-4376-adf9-2e129b5888ef_600.jpg"
  ], 
  "description": "This handy snack table makes an ideal accent piece for any room in your home.  Designed with a 'C' shape, this table can nestle against the couch to hold your snacks while the back side hosts a clever magazine holder. Crafted of solid Asian hardwoodsRich espresso finishDimensions: 24 inches high x 15 inches wide x 11 inches deepStyleTraditionalMaterialWoodTypeSnack TablesFinishEspresso FinishShapeRectangleAssemblyAssembly RequiredColorBrownFurniture Frame MaterialWoodFurniture PatternSolid"
}