{
  "name": "Furniture_of_America_Tepekiie_Two-side_Open_Coffee_Table", 
  "price": "EUR 175.97", 
  "reviews": [
    "I believe the secret of being a happy consumer is by reading about products, doing research, and then taking the plunge. Henceforth, my review of the Tepekiie Two-side Open Coffee Table. After looking around a bit and doing some research online I really wanted something that would be a bit different. I looked at several styles and, ultimately, chose this table. Overall, I am very happy with it. However, keep in mind, this piece of furniture is not going to last that lxong, it will get banged up and scratched and the finish willcome off. However, it is exceptionally sturdy and quite easy to build. It is even forgiving if you mess up. Now, this table looks uitra cool and utra modern. It livens up a dull room and really opens up a space. It is an inexpensive way to change a few things around. I bught this table on other recommendations by Overstock customers and I was not disappointed! Write reviews folks! People read them!", 
    "The coffee table was shipped to me in great condition. After an easy assembly process I had the coffee table sitting in the middle of my living room. The feel of the whole table is pretty solid and not cheap. Having the drawer space in the table was a huge plus for me. Just a bit of information about the drawer, it can only open in one direction at a time since it's one solid drawer. This is in no way a problem but I just thought that it was interesting once I finished assembling it and found that out. Still loving this thing.", 
    "This is a great coffee table for anyone. It's a bit dark, but I like dark wood. The table is really solid and should last a while. I'm very happy with this purchase.", 
    "We loved this coffee table online. The price was fantastic and the styling was so unique, but we were concerned about the reviews that indicated the product arrived damaged. We were right to be concerned. The first time it arrived, nearly half the pieces were significantly scratched or damaged. Aside from big scratches the other major damage was crumpled corners. The product is MDF. Overstock was very helpful though and offered to ship out replacement parts immediately. So many were damaged they just sent a whole new table. Unfortunately this one ALSO arrived with nearly half the pieces damaged. At this point I was becoming very frustrated. Overstock offered to refund us, but we needed a coffee table and wanted this one. I kept stressing that a lot of the damage didn't look like it happened in transit, but was defective from the factory. The boxes were not damaged in any way, but the interior pieces were. Finally, a third complete table arrived. Even with extra, extra, extra care given to the packaging (it was bubble wrapped 3 in thick all around the outside of the original packaging) some of the pieces inside were damaged! But, with three complete tables we were able to mix and match enough pieces to construct 1 complete coffee table. What was doubly frustrating about this was that they would not expedite shipping on any of the replacement orders, so each replacement round took 7-10 days. The entire process took just over a month. We're happy with the finished product, and dealing with Overstock's customer support was, if not pleasant, reasonable and mostly helpful. This experience made us very wary of ordering from Overstock, but the purchase we made directly after this one (a rug) went smoothly and more than exceeded our expectations. Bottom line, I think the product itself is defective. You might get lucky and get one that's fine, or you might have to do what we did and scrounge from three separate shipments to put together 1 complete table. You have to decide whether or not it's worth it to you to to invest that much time and effort to get a great deal on a unique piece.", 
    "It is particle board. Has scratches and is easily scratcheds. This is the first item that I have been disappointed with as far as Overstock is concerned. It is easy to put together but it is very very poor quality. I guess I should have figured that out with the price. But it still was not worth what I paid.", 
    "I had two of my guy friends put the table together or else I would've been lost. It's absolutely beautiful and stylish, everyone compliments it when they see it. Definitely a great purchase.", 
    "This is a high class quality coffee table, but actually not paying for the price. My friend can't believe that I paid such a low price for a very nice coffee table and of course with quality. I had to show them my receipt from my computer so they can believe me. Even some of them are planning to shop online now with Overstock for some of their furniture thanks to my coffee table. My very good quality coffee table, and it's great! It looks so nice in my livingroom, so high class.", 
    "This is a great table, very sturdy. Assembly was easy. The pre-drilled holes matched up perfectly. The directions, which were a series of drawings, were clear and easy to follow. The parts were clearly labeled, and small parts were sorted and sealed. It was easy to tell if you had everything you needed.", 
    "Excellent product for a good price. Nice quality, easy to assemble.", 
    "I was very pleased with the finished product. I didn't realize it needed to be assembled - but I was able to assemble with no problems following the directions. This coffee table was just what I wanted.", 
    "I bought this table for my living room. I really like the drawer affect and put all the remotes .game controller, lap tops in it. This was real easy to assemble, it took me about an hour with a little help from my son. I absolutely Love it.", 
    "Solid, heavy, beautiful. Love the 2-directional door, which makes both sides of table usable. Rich looking and easy to put together. Quick 4 day delivery, too!", 
    "Great coffee table and very sturdy. Overstock delivery service was great as well, i got my order before the week was over and I bought on on a Mon. or Tue Overstock performs excellent service and their table like this one also has a excellent quality. Overstock#1", 
    "I have this coffee table in my therapy office and received rave reviews from my clients! It is a gorgeous table. It took less than an hour to put together with a drill and it is very functional.", 
    "The table goes perfect in my home. Had many compliments.", 
    "This table is very beautiful, with a different style and suits my decor perfectly.I love it and have no regrets buying it,if you are thinking of buying same go for it you won't regret it and assembly is very easy.", 
    "This table, once assembled, looks just like the picture. The drawer opens from either side and is easily large enough to hold a pillow or blanket. It is relatively easy to assemble and is a one-man job. A power screw-driver is helpful but not required. It is actually heavier and sturdier than many other unassembled products such as desks or bookcases. Mine has a slight warp on the top which is cosmetic and hardly noticeable and doesn't interfere with the function.", 
    "This coffee was a great addition to our living room set. Great quality and stylish looking.", 
    "Great coffee table if you're looking for something that looks decent and not too pricey. The wood is not the best quality, but you get what you pay for. Table was not too difficult to assemble. Looks very nice and modern. Love the pull out drawer too!", 
    "I'm very impressed with the fast delivery. I received our coffee table only two days after placing our order. It arrived with a few scratches which thankfully was on the interior side so it wasn't visible upon assembly. I doubt that the scratches occurred in transit because there were generous layers of Styrofoam. My husband did all the assembly work of course and it took him about 2 hours (with the occasional distractions) and according to him, it was very easy and the visual guides helped tremendously. There was one piece that was of plywood quality and the rest of the pieces were akin to manufactured wood with sawdust fillers. However, for the price, the quality was above par. (Real oak, for example, would cost hundreds of dollars more). It does not look like a generic coffee table and the unique design is an attention-grabber in our living room. The drawer is spacious and opens on both sides. It matches the Parke 10-Shelf Bookcase/Display Stand and the Valenciara Cofee Bean Entertainment Table perfectly! Overall, it's an impressive, affordable piece that won't disappoint.", 
    "I was looking for a \"different\" coffee table and this one hit the spot on price and in my living room.", 
    "This table was pretty difficult to put together. It took about 45 minutes. But it looks GREAT and the drawer is the coolest thing. Thanks Overstock!", 
    "This is a great coffee table.We love it! Easy to assemble and looks very classy.", 
    "It took a long time to put together even though I am a handy girl, but once I finished I was definitely pleased with the outcome. I love that the drawer pushes out from either side! I love that I can stuff magazines and newspapers on the sides for reading. I've gotten many compliments on this piece, and I must say I am very impressed with it!", 
    "Love this PERFECT coffee table. Just the right length & width for my space. Really heavy package but Fedex Guy was great help. Had friend to assemble & he had no problems but said would be nice to have had instruction sheet. I LOVE IT !! Especially side drawers. Would recommend for anyone with small spaces .", 
    "My table looks great with my sofa and the color finish is perfect and I love how its design and careful crafted. it took me a good 30 minutes to put it all the pieces together and I can tell how nice the quality is. I'm glad i bought it.", 
    "The table top has ripples at the edges and lines where the supports are to hold up the top. We have purchased end tables, lamps, a chair, and an armoire from Overstock and been very satisfied, but not with this item", 
    "Nice table, exactly how it appeared on the site and quality fits all the other reviews. Dark coffee/espresso color w/ faux wood finish. Basically the whole table is wood veneer, not real wood, but what do you expect at this price? From 1ft away it looks high quality, up close you can tell it isn't real wood. I love the way it looks but I don't see it lasting more than a year or two before the veneer starts peeling. Super easy assembly, the drawer just slides in, no tracks.", 
    "Perfect coffee table for our contemporary living room. Easy to put together with detailed instructions. Arrived before scheduled arrival date and the box was well protected to ensure no breakage. The only possible downside is durability - material is very light, so it's okay for us now as we don't have kids; but, not sure how well it will hold up with little ones around.", 
    "Great table for a nice modern look, and you cant beat the price. it will really set off your space if you are going for a modern/contemporary look. It goes great with dark brown or even black furniture.", 
    "Purchased this table for a new apt. This table is excellent, especially for the price. The table is very modern drawer slides out on both sides. The material is not wood however it is a pretty dark wood like appearance. It cleans easily with a damp cloth. I would definately recommend this table.", 
    "Strong, handsome piece. Nice rich color and easy to put together approximately one hour.", 
    "Very nice drawer, so useful. Nice design and easy functional drawer that opens smoothly and it has a great amount of room inside for storage space. Easy maintanance and easy to assemble. It's also very sturdy and attractive just like the rest of my furniture.", 
    "Easy to put together, great looking table with a modern edge. I like the storage of the drawer, and that its accessible from both sides, VERY convinent. I use the two sides for displaying books and magazines. Love this table. great value.", 
    "I've had it for months now and I'm so happy. Very good in quality, not sure if it's real wood but good enough for me since the quality is very sturdy and each panel is very solid and heavy. It was easy to assemble, and I really like the drawer in the middle, a really good idea for a coffee table. I'm impress.", 
    "I'm very happy with my purchase of this coffee table, it's very nice especially in the way it's design and the quality is also great! Easy to assemble and the it was shipped to me by UPS in just 3 days, faster than any package I've ever ordered online. Love my coffee table, it's very nice to look at and it stands out from all my furniture. Highly recommend it of course, it's great!", 
    "I love the design of the table and how there's a drawer and room on the side of the table underneath the table top, it looksg reat. Very modern and the quality of the wood and color is great. My husband was very impress when he saw and usually he never notice anything i buy. I love overstock great furnitures and and fast shipping.", 
    "Easy to assemble and true to color and size and very sturdy table.", 
    "I got this table as a gift from my father, and I have to admit that I am very impressed. It was easy to assemble once I figured out which slat was what (some of them weren't properly labeled), and the wood's finish is absolutely gorgeous. It's the perfect size and height, and fits the decor in the room perfectly. It's easily worth the money and I would highly recommend it to anyone who wishes to purchase it. But, be warned that it is very heavy, so be careful when hauling the box into the room where you want to assemble it.", 
    "Such a reasonable price for a sturdy and stylish table. Really adds character to our living room space.", 
    "Nice Table. Easily Assembled. Heavier material than expected but that's a good thing.", 
    "After looking around locally for a coffee table and not finding anything (or wanting $$$$) we looked at a few on Overstock and decided on this one. It arrived yesterday; it is \"double-box\" packed, the parts are very well packed inside another box inside the shipping one. Assembly was a breeze, though, being a bit pedantic, the parts are not labeled so if you are unfamiliar with this kind of stuff it might cause some pause. It's not horrible, you'll be able to figure it out. A notable point; they use plastic inserts in the components to screw the interlocking pins into. This is exceptional; I have seen very few pieces of furniture (at any price) in which the manufacturer did this. It reinforces the hole so that the pin does not \"strip out\" in the wood. Good thinking by the manufacturer. The component wood pieces are hollow, so the table is much lighter weight than it looks. The ability to slide the drawer open from either side is nice, however, it is a little too long. By this I mean, if you try to \"flush\" one face or the other with the edge of the table, it will stick out one side or the other. IMO, it would have been a bit better if the drawer was about an inch shorter such that the handles do not stick out. Minor point and detracts from nothing about the table. For the price, this table cannot be beat. Very happy with our purchase.", 
    "Table is great. Only had it for a for weeks, but it seems very sturdy. It is actually as it says \"dark cherry.\" The whole time I was building it I thought it was black, and matched my tv stand, then it finally got nice enough to open up the blinds and window and I realized it is a very dark cherry. Drawer is huge, opens on both sides, just went to office max to buy an organizer for it so everything isn't just flying around when you open it. Over all I think it's a great table.", 
    "A Great Product From Overstock. My Grandma Recommended This Site! What Can I Say Grandmothers Are Always Right! The Table Is Darker Then The Pictures I Saw Online, Which Works Out Perfectly. The Table A Great Size! Awesome Buy!", 
    "IT IS GREAT...LOOKS EXPENSIVE BUT WAS VERY REASONABLE!!! IT IS FUNCTIONAL AND FITS WITH THE OTHER FURNITURE IN OUR MEDIA ROOM. VERY HAPPY WITH DELIVERY AND SET UP WAS A LITTLE DIFFICULT. WORTH WHILE PURCHASE!!!! ENJOY FINDING THESE GREAT ITEMS ON LINE INSTEAD OF HUNTING AROUND STORES!!", 
    "The table looks exactly how it's pictured online. I read the reviews before I decided to purchase it. My boyfriend put it together and it fits perfectly with my living room. It has a moderen feel and goes well with my chaise and loveseat.", 
    "This table came in the mail within a few days, took 10 minutes to set up and looks great! The only minor thing that I do not like is that water ( other liquids) seem to smear it very quickly. They go away with a cleaner though.", 
    "This table came right away and it did take some time to put together. We were two people and it took us about 1/2 hour from start to finish. It is beautiful. It looks like we spent so much more than we actually did. I love the the drawer feature and that it can be accessed from both sides of the table. It is very sleek looking and modern looking. It gets a lot of compliments from friends and neighbors. If your decor is trendy/modern and colors are in the espresso brown family, then this is for you!", 
    "Took about 2 hrs to assemble it by one person. Feels sturdy. Not all straight lines. The drawer moves fine, but don't allign on the outside on both sides.", 
    "This is a very good coffee table for the price. It was easy to assemble, even though the instructions said it would take 4 hours my husband and I had it done in an hour. Its not amazing quality but its well worth the price and it looks great.", 
    "Great color (matches my shelves perfectly), cool style. Only thing is it scratches easily, upon putting it together I didn't follow the directions and put it together without putting a sheet or something down to protect it then of course scratched it. Overall though its mad cool, everyone that comes into my home comments on how much they like the style.", 
    "I love this table. I bought it as a coffee table for my living room and it looks very good. I love the side storage for magazines, remote control and etc. Assembly was fast and easy also.", 
    "Loved the coffee table. The drawer pushes through so it opens both ways. Great size. Very good quality and lovely color. Highly recommend it. Super good price for this product.", 
    "I bought the table because I liked its design and it delivers on that front. I didn't expect its quality would be as low though, but then again, the price tag should've been an indicator. The finishing on this product is poor....rough edges, wood is easily scratched and the biggest turnoff - if you touch the table with your bare hands/ put your bare feet up on it, then expect your hand and foot prints to be clearly visible on its surface. It's like a body oil magnet!! Very disappointed in its overall quality", 
    "I was sooooo pleased when I finished putting my table together BY MYSELF in about an hour or so (would have been shorter if the hubby would have helped but it was late and night and he refused and I just couldnt wait until morning) Love it, so easy to set up, just follow the directions and be organized. is not hard at all. I will purchase a side table if available from the same vendor. Thank you overstock! i did not have any issues w/ my delivery and assembly!", 
    "I'm always skeptical of shipped furniture but overstock did an excellent job of making sure that my item shipped safely, I didn't find a single nick or scratch. The table took 2 people to assemble, if you're confident about using those circular metal things that you use to hold screws in place then you can easily assemble the thing on your own. The picture gave me the impression that the drawer was slightly off center but it isn't. I'm very happy with the purchase.", 
    "Great Table. Fairly easy to assemble. Nice size. Moves easily on the hardwood floor. I did not not assemble the drawer. I prefer the open space. Looks more expensive than it is.", 
    "The packaging of this table was absolutely excellent. Each piece was covered in foam, then foam between the wood and double boxed in cardboard! It took about an hour to build as with most flat packed furniture. Just follow the instructions, which are better than most, and you will be fine. This table is much more slid so far than the one I replaced, the drawer opening from either side is a good thing too as sometimes you are not on the \"couch side\" of the table and want to get something out of it. I would recommend this table to anyone looking for something that looks good and is functional.", 
    "This is excellent coffee table,good quality and color.", 
    "I saw the table online and read the reviews. I was very pleased with the product. It weighs about 45lbs so it has a good weight to it. It did not come damaged or with any peices missing and was as close as the picture shown for color. I am getting a lot of compliments on this table and its perfect for a big or small room. and the drawer is also very spacious. Putting together the peice was fairly easy and did not take much time. I am really happy with this purchase. Oh and the Delivery was exactly on time!", 
    "looks nice coffee table. be nice in your living room.", 
    "Arrived in about 3 days, perfect condition, and it was quick to set up. Teh quality is better than what I expected for such a cheap price, it's better. I highly recommend it.", 
    "We love this table, it's a lovely deep, rich wood, easy to put together and very easy to clean. I have 2 kids and tons of guests with their own children and they love to climb on it and put fingerprints all over it but a bit of wood cleaner and it all comes right out. I'm satisfied with the purchase", 
    "I looked at 100's of coffee tables and when I saw this one I knew just from the looks of it I had to have it. When I checked the price I was shocked at the value I could get for such a good price. It matched perfectly with my 2 end tables in color and style. I will defiantly recommend this site to all my friends.", 
    "I've had this coffee for over a year and finally decided to get rid of it. Very poorly made, cheap materials, and very hard to put together. There are far better coffee tables out there and I actually purchased another one on overstock that I love.", 
    "If you are looking for some taste and a cheap price tag, this is what we went for. The only bad thing is it's not real wood. But you get what you pay for!", 
    "takes about an hour to put together but well worth it! Very attractive!!!!", 
    "The box was left at my door engulfed in bubble wrap, which was comforting since I remember seeing some reviews that mentioned dings on the box/product. Upon opening the box, all the pieces were there, packed compactly. There was one small dent on an edge, which was disappointing. However, it wasn't big enough to make a fuss about. Assembly was straightforward, with all the pieces labeled or stamped, which made it easy to keep track of what I needed at each step. The drawer worked just fine (didn't feel flimsy like some other drawers), probably because it's not resting on rails, but actually rests flat on the bottom piece. No one's going to mistake this for a high-end solid wood table, but the quality is good for what it is and the appearance is as-shown.", 
    "Nice coffee table to buy, good price and the quality is great. The assembly took about an hour but easy to assemble, and I no trouble at all. The shipping is great, didn't wait too long for my table.", 
    "Good coffee table to have which features good quality, sturdy materials, and it's gorgeous. And oh yes the drawer is a bonus!", 
    "ARRIVED IN LESS THAN A WEEK, EASY MANUAL TO FOLLOW WHEN ASSEMBLING THE TABLE, AND IMPORTANT OF ALL THE QUALITY IS GOOD AND THE DESIGN, AND THE DRAWER ALSO MAKES THE COFFEE TABLE OVER THE TOP. IT'S ONE OF THE BEST COFFEE TABLE THAT I'VE EVER SEEN, SO GLAD THAT I BOUGHT IT, IT EVEN GOES WITH ALL OF THE FURNITURE IN THE HOUSE.", 
    "this is made of pressboard and laminent. It looks like crap. Don't forget you get what you pay for.", 
    "There was so manu coffee table online and took me a very long time to choose but I decided to get this one, and I'm glad I did. Buy it and you'll see the sturdiness and the quality it provides and the drawer in the middle is such a great idea. It's the new version of all coffee table", 
    "Bought this for a Christmas gift for my son and his wife. They had picked it out, loving the style. It arrived the day before Christmas promptly. After taking it home, my son put it together and it now graces their living room. It was the perfect gift for them.", 
    "Love, love, love this table. I had to pay someone to put it together for me, but after it was fully assembled it looks AWESOME in my family room and the color of the wood goes perfect with the rest of the decor. Although the table was just a little over **** bucks, it looks like it cost much more.", 
    "the quality of the pieces of wood is toatlly unbelieable, there are scratches and paint chipping off all peices of product, one peice actually had a huge indentidation that someone actually painted over to try to hide it, i can not believe that a vendor would ship out this kind of quality of product, DO NOT PURCHASE THIS PRODUCT. it is not even worthy of using as firewood", 
    "I bought this table and read all of the reviews and was hoping that I liked the table once I received it.To my pleasant surprise, the table was delivered within 3 days. I opened it up and put it together in about an hour. Once it was complete and everything was cleaned up the table looked great. It looks nice and more expensive that it really is. Great value. If you are looking for a nice looking furniture and not spend a lot $$$ this is the table for you.", 
    "This coffee table is perfect and looks exactly as it does in the photo. It is solid wood with clean, simple design. The table came assembled and well packaged. The table looks great and it is very stylish. The wood is very sturdy, not flimsy at all. Absolutely love it.", 
    "I thought the table would be a bit higher but it's perfect for my living room with my new couch. it looks just like the picture and had a lot of room in the drawer that pulls out on both sides.", 
    "The dark finish and overall weight of this table make it pretty nice for in front of a couch.", 
    "easy assembly, shipped fast, looks great", 
    "Love it! easy to put together and looks very elegant!", 
    "I should not have wasted my money.", 
    "Though the assembling is little hard and the screwing mechanism is tough, the final look and feel is good.", 
    "Fits perfectly in my living room, has ample storage space and I like that the drawer is two way!", 
    "I just got the table! Excellent color. Very easy to assemble. Love it!", 
    "Easy to put together, looks just like the picture and is very sturdy.", 
    "This table is a great ad to living room decor. Very stylish. Easy to put together.", 
    "Top shelf piece of furniture.. easy to put together", 
    "I've had this item now for 2 years I absolutely love it!", 
    "The fact I put together myself doesn't mean it is an easy assembly. I'm 32, very girly, and dont consider myself handy at all. But both helpers flaked on me and if I want something done, I get it done. Took mt like 2 hours, my back is killiing me, but the end result is beautiful. Its a large table, great for a big sectional, which I have... There are no words on the instructions, but if I can do it, 2 people will get it done in a breeze. If you're considering this table, go for it.", 
    "Good table....just lower and not as wide as I would like...but all in all its a good table...sturdy", 
    "The table was easy to assemble and has a roomy drawer for storage!", 
    "Great table for the price. It is heavier and looks like good quality. So far so good", 
    "This item had quite a bend and curve in after it was assembled. Like a rocking chair. For a very heavy item I would expect the pieces to fit together better. The bottom certainly was not flush with the floor.....", 
    "Looks great; worth the money. Drawer slides on wood veneer against veneer (no ball bearings), but is functional and attractive.", 
    "Found it rather big for my purposes but I donated it due to its size....", 
    "I love it! I cannot believe how good the price was. Its huge and heavy. There are a couple of flaws. One in the handle and one paint scuff on the finish. Both are small but noticable however I can easily turn it around so I do not have to see it. I got the Coffee finish which is basically black with a red undertone. Easy to assemble only took me about an hour. Very satisfied", 
    "Man when I saw this table I had to get it. As I wait for it to be delivered I decided to read some reviews on it which I should've done before purchasing it and everyone had positive things to say about it but 2 or 3 people but when it finally came it took me like 45 minutes to put it together and I'm very proud to say I'm happy with my purchased.", 
    "...I wanted the color shown in the picture, the item sent was an almost black finish...pretty but not what was asked for in the order...if seething other than what is ordered is being sent, the customer should hear that from you...,", 
    "unfortunately we were not happy with this purchase, wasn't constructed well, assembly was difficult", 
    "When remodeling I wanted a coffee table that would add a contemporary touch and this one is it! Even after coffee cups and spills, it's still like new! I love the drawer because I keep extra coffee, cups and napkins for our Keurig along with coloring books and crayons for kids. I love it!!", 
    "It is a nice piece of furniture. There is a warning on the furniture about some kind of chemical being used. Be careful when purchasing. I wasn't aware of it, and its too much hassle to return the furniture. On the top of it there were shoe marks all over the board. took me days to get the stain off of it.", 
    "This table is exactly what I was looking for. It's modern and unique looking and is the perfect size to go with my sectional sofa.", 
    "We love our coffee table. It looks gorgeous, but it's not super heavy and it's very easy to assemble. If you're used to putting together furniture, this shouldn't take you too long to put together. It looks sleek, modern, and stylish.", 
    "I have to frequently wipe this down since the wood isn't real but my guests think it looks great", 
    "The table is very sturdy & attractive, however, the color is off. The color is an grayish rather than light oak.", 
    "Gift for my daughter. She loved it.", 
    "Was not expecting it to be so solid for the price was pleasantly surprised at the quality. I didn't realize the drawer has no rails, it just fits snugly in between the frame and opens in either direction, but it works out as i like that system better. Overall great table.", 
    "Big and convenient table,quality ok for price.", 
    "Its great for a beginner piece in a livingroom..nothing fancy", 
    "It's a very heavy table and was a challenge for my thin-framed self to put together on my own, but I was able to get it done on my own and it looks really nice. It is not cheap looking at all. Also love that it has a pretty spacious drawer as well.", 
    "I ordered one of these tables for my son and he loved it so much I order one for myself. Great table for the price.", 
    "Lovely table just thought it would have been bigger than it is. The table was ok for my space but if you have a huge couch or a lot of floor space, you may want to see something larger.", 
    "ease to assemble. and fit my room. i like it", 
    "Cute coffee table. Fast shipping", 
    "The table looks great, but is flimsy and comparable tables are out there with better quality for the price.", 
    "This table was exactly what I needed. I was looking for something with sufficient storage, the drawer is very roomy, and there is no back to this table since it swings out from both sides. The metallic handles go perfect with my dark gray leather furniture.", 
    "We bought this to match up a Furniture of America TV Stand. The quality is excellent and took less than an hour to build. We ordered it on a Sunday and it shipped on Monday and we got it on Tuesday. Love Overstock. Thank you.", 
    "Neat design & good quality. I'm constantly getting compliments on it!", 
    "very nice table, looks great and easy to put together. I like that you can open the drawer from either side, which I didn't realize before I bought it.", 
    "This table is unique in look and it holds up very well. The quality is very high for such an inexpensive product; the finish looks great and unlike another reviewer, I haven't had any issues when cleaning the finished product (such as stain being removed). I use this table daily and move items around on it (such as books and my laptop) and have not noticed any scratching or marking up of the finish. I did put the drawer bars on upside down, but I like the way they look like that, so I kept them that way. The drawer does close flush on both sides of the coffee table. I'd definitely order again. The color really is close to black, for those wondering about color.", 
    "I love the look and it's pretty sturdy. I with it looked a little more high-end when it comes to the drawer... but overall... I'd buy it all over again.", 
    "I absolutely love my coffee table. It goes very well with my furniture and I can guarantee you that I won't see anyone else with it. Love it!!", 
    "dont make the mistake of tripping over it. I cut myself pretty badly on the drawer handle. The edges are quite sharp.", 
    "modern, attractive, and practical.", 
    "love it, great look with big storage", 
    "The table is ok and I kept it, but you can tell it is not real wood or even the laminate at all, it almost seems hollow. Also, the top tips if you us on the one of the sides where the gap is, I've done this multiple times sitting on floor and then leaning on the table to get up, strongly dislike that. Good value, but you get what you pay for quality wise. You wouldn't know those things looking at it though.", 
    "Two years later, looks like new.", 
    "enhanced the living room and neatened it up!", 
    "I have had this table for some time and have to admit that I do love it. It is very sturdy and holds up well. I do enjoy how unique the design is. Would recommend to anyone.", 
    "I am happy with it no doubt. I hate putting stuff together this was easy enough. good instructions in box.", 
    "Easy to assemble and double draw makes it comfortable to use from either side. Look great", 
    "Love this. Stylish and Good quality", 
    "Got lot of praises for this coffee table. Recommend it highly", 
    "Great product. Not too difficult to assemble.", 
    "very elegant affordable cofee table gives that touch of modernism and beauty to the room . I highly recommend it . the construction however is slightly weak and not so solid but as long as you dont abuse it or slide it around it will be fine .", 
    "Fast Shipping! 2 days from order to delivery! Assembly was easy -- took me about an hour by myself. Table looks good, no complaints. This coffee table is also structurally sturdy. Be advised that it is made of pressed particle board covered by a cheap finish. You will need coasters. For the price point -- a reasonable product that looks good. If you want real wood though, find something else.", 
    "This is exactly as described.", 
    "Every one should have.....watch the edges of the table...... They hurt..yikes!!!", 
    "Holds up well in house of ruffians", 
    "This coffee table is very easy to assemble and unlike some of the other reviewers I received all of the parts and pieces. When I first assembled it I was disappointed, it just wasn't that great, kind of boring. Since then I added a nice center piece and contrasting wood tray as decorative items and I love it!", 
    "Both functional and gorgeous", 
    "This table really added a nice touch to my basement. I love the drawer that opens from either side. My guests are always impressed.", 
    "Very well built and sturdy", 
    "Have had this for about a year now and still looks nice and holding up nicely.", 
    "Love this table. It really adds flair to our living area. Very Modern and Sleek.", 
    "This coffee table has been amazing and looks great", 
    "I really like this coffee table. Easy to assemble and not too bad for the price!", 
    "Very nice and practical coffee table. Plenty of storage room. Easy to assemble but need some time.", 
    "Very sturdy. Just as pictured. Great buy.", 
    "Great product. Sturdy. Useful.", 
    "I can't seem to make it sturdy. When I move it, the top comes off.", 
    "looks good, and cleans well", 
    "Helps to improve our household everyday and we're very pleased with it.", 
    "Lovely coffee table with fun features. Easy to put together and great quality for the price.", 
    "Just as the title states this so-called table comes apart at the seams after owning it for three months. I opened the drawer and it literally fell apart into its original pieces. For this price I almost want to file a complaint with the Better Business Bureau for this nonsense. Furthermore the edges and corners are already fading. I am more than angry for paying this much for something that is this much garbage.", 
    "The table is beautiful and perfect. It was well packaged and came in excellent condition. It was easy to put together (took me about an hour) and is very sturdy. I'm so happy I bought this.", 
    "This coffee table looks beautiful and fits perfectly in my living room. There were some damaged pieces that had chips from shipping but nothing visible once the table was put together. This table is great because the drawer opens from both sides. It took me about an hour to put together with 0 issues. You will need a screwdriver but there were not many difficult assembly parts. Easier than ****. I also consider myself to be good at putting together furniture, so if you aren't good at that type of thing bring a buddy. I also bought a center place mat and coasters because the surface looks like it could scratch easily. So far so good, looks beautiful in my living room.", 
    "Table came well packaged. No dents or scratches noticed. Serves well with the sofa that we purchased also through Overstock. The drawer in the middle can be pulled from either end and is fairly deep to place miscellaneous items in it.", 
    "Nice Detail, Great Product!", 
    "Looks just like the picture. Was pretty easy to assemble, despite the instructions only being drawings. Something to note: the drawer opens from either side of the table. It doesn't roll on wheels or a track so the wood drawer is sliding back and forth on the wood of the table. Makes me wonder if this will eventually lead to wear and scratches.", 
    "I ordered the coffee table and received it within just a few days. The box is large and heavy, so make sure you have some help. Everything was labled very well and the directions were very understandable. I had the table fully assembles within an hour. Only thing I'm not a huge fan of is that the drawer in the center is accessible from both sides, so it can be pushes through since there are no stoppers.", 
    "While not high end, it looks nicer than the average components with which it is constructed, and the price was very good.", 
    "Exactly as pictured. Takes 2 to assemble. Very nice. I recommend to anyone that likes oriental style.", 
    "Great price. Looks great and assembly was easy. Would definitely recommend this product.", 
    "I read several reviews prior to ordering where people complained that the parts were incomplete or damaged. I received my package in excellent condition and everything was there. I even misplaced a few pieces of hardware and the company immediately sent them to me. I am a women in my 50 and I had no trouble putting it together in an hour or two by myself (while watching a football game-lol). I am very pleased with the results as it is sturdy and looks lovely in my living room .The drawer even works smoothly. Overall I am very pleased and would definitely order from them again.", 
    "Very nice table. Easy to put together. Worth the money.", 
    "I love this coffee table! It definitely took two people to put it together but it was easy to do. For the price, it's an awesome coffee table and accent piece to a modern room. The quality is average - but that is to be expected at that great price. I highly recommend.", 
    "I really like this table, was easy to put together and everything lined up correctly. Looks great in my Livingroom.", 
    "I love this coffee table. The price is perfect and it can be put together in an our. I will say the pieces are heavy, but I wanted a sturdy coffee table. I have no complaints about it. Love that the draw opens from either side and there enough room in it to store magazine, note pads, pencils and remote controls. That isn't nearly filling the draw at all.", 
    "First, the material is pretty good quality compressed wood with a surface I can't quite identify... it looks like veneer but can't be sure, but if it looks like wood who cares? Assembly takes a bit of patience, but \"wordless\" instructions are pretty good. Color is a bit misleading; it looked more like dark stained wood in the pix but in reality it's nearly black! I bought the \"modern leveled end tables\" and they are clearly the same manufacturer and from the same batch of materials, even thought they are not sold as matching. I do wish they had put some sort of detent for the drawer in the middle to hep you find the \"closed\" position because it's sort of unforgiving. If it's pushed just a bit beyond flush from one side it protrudes out the other and looks untidy. Not a fatal flaw, but a design miss. What do you expect for ***? Still, a spring-loaded bar on the top with a ball and detent would not have been difficult or expensive, and would really add to the impression of quality.", 
    "Table was easy to install and the packaging was sturdy enough to keep the item from getting damaged. Overall the table looks good. The only thing that could be better is if the drawer was on a track of some sort, right now it just kind of sits within the table and is not the most user friendly at times.", 
    "I was pleasantly surprised that the item was delivered to my door, in excellent shape. All the parts were included and none of the pieces were damaged. The instructions were easy and it took me about 2 1/2 hours to put it together alone (with a few breaks). Very nice quality and design. My first OCO purchase and it was an excellent transaction.", 
    "Furniture arrived packed nicely and with no damages. Easy assembly and it is beautiful and it changes the appearance of the living room.Love it!", 
    "The table was delivered in less than in week. It was packaged very well with all pieces and instructions included. It was so easy to assemble and the finish product looks great! I love the modern look and I like how the drawer opens on both sides. You will not be disappointed with this purchase.", 
    "The table has a modern and sleek look all while having room for storage which is a huge bonus. It is easy to clean and I would recommend this table.", 
    "Very easy to assemble from clearly illustrated instructions. Well built product for the price. We love it and it looks great.", 
    "I put this product together myself and I'm a woman,,love love love my table, it was delivered very fast, my friends give me compliments, very good quality.", 
    "I love the table. I may have over tightened one of the screws causing a small crack but I've had it for over a year and everyone who visits loves it. Thanks overstock", 
    "I have no complaints, and i love my new table!! I would definitely recommend it to people.", 
    "Easily put together and seems really sturdy! Shipped very quickly too! Excellent service!", 
    "Excellent quality and really sharp looking. The draw opens from either side and is very spacious a real convenience. I was really surprised at the size of the table and I was also please with the price.", 
    "Very nice looking. Easy to put together! Drawer was not. Did not use. I used as TV stand. I put VCR and cable box on shelf. Looks great!", 
    "I used to have a glass coffee table. I used to bump on it all the time. This coffee table is not only stylish it is also very functional. I have magazines and remote controls in the drawer so I can put candles and candy on top of the table.", 
    "Sturdy. Nice design. drawer is a bit stiff but I'm sure it will work out with time. Note - laminate not solid wood, if that makes a difference to folks.", 
    "Went together easily, Excellent overall value for the price that was paid.", 
    "Matched my tv stand perfectly. Chipped a little at the corner when i got it. Very nice looking table though.", 
    "This coffee table is the perfect combination of style and practicality. I love it.", 
    "easy assembly-- very sturdy-- drawer opens both to front and back-- pretty cool-", 
    "This table was so easy to put together by myself even though it is quite heavy and sturdy. I love the look of it.", 
    "Love this table. Easy to put together (don't let the first page of the instructions scare you). The drawer underneath is great for storage and the best part is that you can access from both sides. Great value for the money.", 
    "easy to put together, perfect height for a coffee table, this is a really great table and looks very nice.", 
    "Looks very classy in the living , finish is good quality and and table is very firm and easy to put together. Looks amazing in my living room", 
    "This coffee table is great. I love the storage drawer, its basically my office desk.", 
    "By far one of the best coffee tables I ever bought, just can't beat this for the price.", 
    "It looks OK but it didn't go together perfectly. But it was on the bottom so it still looks good.", 
    "I liked the delivery service. It was really fast. The table match my new living room by the color and design. The size is just right what we needed. No too small and not too big. I like its drawer, you can find it very useful. I put their my new tablecloths and set of glasses. You can put magazines into two openings on a side too. It requires time to assemble. I'm more then happy with this purchase.", 
    "Looks awesome in our small living room, arrived with very slight dents but nothing too noticeable. Build out wasnt super complicated, need a multi-head screwdriver and that's it. The drawer is one long one with two handles so it opens to both sides but can also be pulled out completely and leaves a block area to fill if needed with books/magazines. Overall great value for the money!", 
    "Does its job as a coffee table. Easy to assemble.(this is one of the good pieces that all the pre-drilled holes align well with each other) Open-side design looks nice but might be a design flaw, making it not a very sturdy piece - Only 4 screws holding the top panel with rest of the table, I am afraid people might accidentally dismantle this table when moving it if grabbing just the top panel .", 
    "I realize that when you pay *** for a piece of furniture that it is not going to be wood especially if buying a new product. This table was awful to put together; the design/shape is good, but it is the absolute cheapest looking thing I have ever seen. By the time I got home from work my husband had already sweated getting it put together so I decided I would try it. You can't put anything on this table unless it shows some sort of discoloration. I am not talking about beverage containers but anything besides a magazine. I am giving it away as no one will buy it. I have already bought a solid wood table.", 
    "seems to be solid enough to sit on, easy to assembly, easy website, easy delivery", 
    "Assembly was easy, no damage from shipping. But the quality is very poor. We removed it from our great room and put it in the basement. The surface scratches easily and it looked awful within weeks. Very disappointed!", 
    "The product looks nice in the picture. When you get it, it's made of a fake wood material. It chips super easy and is much darker than pictured.", 
    "Nice table for the cost. It is sturdy and adds a nice touch to the room. The drawer is two-sided meaning there aren't any rails, it just slides back and forth in a slot and can open from each direction. The laminate on the wood is a little cheap but I've seen worse. This wont be a long lasting table by any means.. expect scratches to appear after a few months and to prob. have to buy a new one in a few years.", 
    "Excellent product for the price. Fairly easy to assemble.", 
    "You'll be pleased if you buy this. Can be picked up and moved about the room without becoming loose from handling. Good and sturdy. Builds easily from instructions (not hard to build at all). I honestly figured I'd have trouble when I built the sliding draw. Those things never quite fit right. In my case, fit like a glove. And most importantly looks great.", 
    "Is a wonderful table. Had to put ut together and the instructions were so easy. Love it!", 
    "purchased this table after reading the reviews. Product does not match up to reviews. The wood looks very cheap. Serves its purpose as a coffee table but not worth it.", 
    "Elegant table, clean lines, very functional - both sides have space for laptops, books, magazines. Central drawer is convenient to keep the paper work or other items needed in the lounge.", 
    "Just like the product description- no issues with quality", 
    "For this being my first online furniture order I was very impressed. It was very easy to put together, took me less than an hour. I've gotten compliments on it already.", 
    "This table is gorgeous. It feels extremely sturdy. It takes some time to build, but it is not difficult. The drawer does not have a track but slides smoothly regardless. Overall I'm extremely happy with this purchase. I suggest finding a glass for the top of the table to protect it.", 
    "First off- the \"espresso\" in the photo is brown. The \"espresso\" on my table is black. This company that makes this furniture is bad at naming colors. If you don't mind a dark table - go for it. I really could care less. But for you nitpickers - be warned. On to the quality. It's not real wood. Remember, you're paying the price of what you're going to get. Be honest with yourself. This is great starter furniture for a recent grad (me), not forever furniture. I had no trouble putting it together (less than an hour for a scrawny little girl like me), all the holes were lined up, and it went together super easy. But when something comes with wood glue, you know it's not the best of the best. Just saying. It also comes with wood colored stickers to put over the holes and screws. Classy. I was a little disappointed the next day when I wanted to nudge the table over just a little bit. But when I tried to lift it from the top, the table top part just completely came off. I can't remember how I attached it to the bottom to begin with, so I don't know if I should be bashing this so much, but I'm pretty sure I screwed that in at multiple locations and it still popped off super easy... I don't care that much, though, because gravity is holding it down most of the time (unless I turn my anti-gravity machine on that, you know, exists), and how often will people come into my house trying to lift my coffee table up from that part? So it's not that big of a deal until I move again, and who knows when that will be. Other than that, it's looks classy. Looks great! Fits into my room perfectly. And I like the modular design and the drawer that opens from both sides.", 
    "If you are looking for a sturdy piece of furniture look no further. Make sure you spend time reading the assembly instructions. We didn't start quite right and had to redo midway. Excellent! Excellent! Excellent!", 
    "Looks nice, got it today, well packed. classy. easy assembly.", 
    "Its good. But the only con I see is that, the draw is opened on the both sides. I was expecting 2 drawers on each side.And also the drawer is not stopped after a point when pulling out. It comes out completely. Otherwise its good for the price.", 
    "it was fairly easy to put together and i absolutely love the drawer!", 
    "Once fully assembled it looks exactly like photo. Its not a bad purchase for the price.", 
    "Shipping was fast and packaging was great. Table was easily put together. Looks amazing. Table looks exactly like picture. It was inexpensive and overall I am extremely satisfied!!!", 
    "Wrong color was ordered. Do not need black, it does not coincide with my living room furniture. I plan to reorder another one, but different style from overstock.", 
    "We love our new coffee table. It was easy to assemblle and only took an hour or so. The instructions were easy to follow. The look is perfect we love it.", 
    "This table is beautiful once assembled. It has a very expensive look for an inexpensive table. The assembly went fairly quickly however not all the bolts fit or would screw in, also some parts around the whole crumbled from the pressure of nails being screwed in. I also gave up on installing the slide in shelve because the wholes were way too small for the nails and the area around the holes crumbled. Also, when you touch the table, it leaves hand prints that are hard to clean. Having said all that, its a great product for the cost. Bargain deal!", 
    "Smaller than what I believed. This table would have been perfect if it was a bit larger. As it is, we made do instead of returning the item.", 
    "I'm very satisfied with my purchase.It's exactly what I wanted.", 
    "Drawer was tough to install but nice piece overall", 
    "I LOVE this item!!! I fell in love with the picture on Overstock an it is a perfect match for an entertainment center that we bought at American Signature. It is completely Modern, Sleek and Stylish. It is the perfect height if you have Modern furniture. The quality is amazing. Heavier that I thought it would be. That goes to show this truly is a quality item. Extremely easy to assemble and didn't take long at all. I am 100% satisfied with this item and with Overstock's service. I give this a 2 thumbs up!!!", 
    "Everything to say has already been said above. Except for needing assembly everything was fine.", 
    "its big in size than i thought it would be... has space to have fruit platter and many other stuff. the drawer in it is a good asset.", 
    "Unbeatable price .. easy to assemble (similar to IKEA). Love the functionality of it and looks great. Great for short term and apartment living. Not best quality but still great.", 
    "This table was very easy to put together, it's a great size for our space and the color is a rich dark espresso which looks modern, but still has character. You can't beat the price anywhere, believe me I looked at about 500 coffee tables online and in stores, and for the size and quality there was not a better price out there. I HIGHLY RECOMMEND THIS COFFEE TABLE!!!!!", 
    "I like the table. Went together easy enough. The color is just a little darker than I expected but still goes very well with my decor. It is pretty sturdy and the drawer in the center is pretty cool.", 
    "Looked at alot of coffee tables before deciding on this one, im a sucker for reviews, and since it had great reviews and was in my budget i took the plunge. Let me tell you this takes 2 people to assemble with alot of patience and i suggest taking breaks so you dont kill your partner. Once it was finished I loved the way it looked, the box when we first got it was very large and I was afraid would take up to much space but ended up being a good size. It shows finger prints really easy due to the finish on the table which would be my only complaint. Overall a good buy for the price. Overstock is so quick with their shipping btw!!", 
    "Got the table but didn't realize how heavy it was for me (a girl) to carry and install. One i managed to put it together i really love it..", 
    "I see why most thought this was worth the money. IMO this table is even better then expected. It went together really easy and looks really sharp! It was packed very well and everything was in perfect condition.", 
    "I wanted a modern looking table that also served as storage. I love the dark color of this table and the fact that the drawer can be accessed from either side. If you don't like dark wood this is not the table for you. It is very sturdy and I would definitely recommend this table.", 
    "I was super nervous about purchasing furniture online. I am glad I started here because this did not disappoint! Its exactly as described - took approximately 40 minutes to assemble. Looks exactly as pictured - feels sturdy - no scratches - amazing color. Super happy with this purchase!", 
    "We love this table! The very large drawer is great for storing all kinds of things and it can be accessed from either side of the table, which is very convenient. It has such a sleek and modern look, which is exactly what we were looking for. The only problem that we did have was that the table top arrived with 2 sort of noticeable scratches that we didn't see until the table was fully assembled (it was the evening and we don't have the brightest lighting in our living room). I wasn't sure how we'd return it since it was already assembled so we kept it and planned to find one of those wood fixer upper markers to try to correct the problem. I contacted Overstock about another issue about 2 months later and decided to mention the problem with the coffee table and they were gracious enough to give me a credit towards the purchase for the damaged table top, which I was pleased with since it was past the time frame they will replace parts or accept returns. Had I known that they would have replaced the table top I would have called right away, but I am still happy with the end result and how they handlted the situation.", 
    "Pretty good product, color matches what is shown on the site. The only thing not happy about is the sliding drawer, it is not very smooth.", 
    "I had to assemble this table as well. But after it was completed, I was impressed with its function and appearance. Nice piece", 
    "Easy assembly, looks just like the picture, sleek and modern, dual sided drawer.", 
    "I bought this table for my living room but I didn't like the textured look of the wood. I thought was smooth in the picture. I kept it because I could use it in my son's room as an entrainment center for his tv. The two open sides were a perfect fit for his cable box and Xbox. It's sturdy and doesn't scratch easily.", 
    "this coffee table is beautiful. very satisfied with the purchase.", 
    "Took a 26yr old male about an hour and a half to assemble... A little frustrating following the picture directions, but once assembled it looks very nice.", 
    "Read all of the reviews before I purchased this table. Let me say I'm happier than I thought I would be. It's the perfect size color and style I was looking for. It's the perfect addition to my living room!!! I had a coworker put it together and it took him less than 30 minutes!! This table is phenomenal!!! I love it. Best purchase of the year", 
    "different - drawer slides right on through. Plenty of space in drawer to hold remotes, DVDs, etc.", 
    "the shipping was really quick and the delivery person was very nice. the item color was peferct and size was great.. i wil order from overstock again", 
    "Although the paint is a little bit clipped off, this coffee table is beautiful. Good for this price.", 
    "Very satisfied with this table. Its exactly what I ordered and it was easy to assemble (drill needed). Recommend to others!", 
    "Looks very good in my family room. Matching other espresso furniture very well.", 
    "It looks same as the picture. Easy to assemble and great size.", 
    "Love it, love the drawer that opens up on either side. For the price walmarts didn't have close to it. Have saved money shopping Overstock, i'd buy another one if I needed it.", 
    "I received the table on time, assembly took some time with help. Overall though I like the table.", 
    "Only one minor issue, which is to make sure that all part such as this product have the number of the pieces are placed on all the parts for proper assembling and maybe a few extra nuts and bolts in case one may break during screwing.", 
    "This is a very nice coffee table. I have been looking for about a year for a coffee table in my price range for a smallish space (150$ was my top) and looked on all the other online stores as well as the big box stores and chain stores. For a while I thought I had found one on another store known for its cheap prices but unfortunately it sold out. I am actually thrilled that it did sell out and that I purchased this one from Overstock instead because I love this coffee table. It came inside THREE boxes and Styrofoam so it was very well protected in shipping (be warned it is REALLY heavy when it arrives but once put together not too bad) and was in perfect condition. I put it together alone and it took 2 hours and 20 minutes. It comes with glue which the directions do not mention and which I didn't use and so far I see no reason that I needed it. The directions are all in picture form and seem a little confusing but actually were easy to follow. The hardest part was putting together the drawer because of tightening screws in small areas. The end product is very professional looking and very solid. It is VERY dark colored, almost black rather than brown so be warned, but I like the color so I am happy. I give this a 100% recommendation.", 
    "If you are looking for a compact and non cumbersome cofee table, this is the one for you!", 
    "Great table! Very modern design and the color fits well with the rest of my furniture. It was easy to assemble and I had no issues with the delivery. The table was received in great condition and very quickly.", 
    "I really like this table it looks very nice in my living room. There was a minor discoloration on one small corner of the wood on the side where there is space for books etc...it wasn't big enough for me to want to return it. I would have given the product 5 stars if that had not been the case. I think this coffee table will last and considering the price point I think it was a very good buy.", 
    "I love this table, very easy to put together took me about 45 minutes. def great for the price!", 
    "Better than I expected to be. The whole family LOVEs it. Thank u", 
    "love the table fit perfect tne only thing was the bottom drawer was a lilllte off .had too sand down too make it fit. but love it. i recommend.", 
    "I am very satisfied with this item. Exactly as described.", 
    "Very sturdy. only one part of the imitation wood is sticking out. Most likely it will break off because of the location.", 
    "Poor quality. Chips easily. Looks like a typical Ikea table.", 
    "1. The shipping was very good and received the item n about 5 business days. 2. After completing about 90% of the assembly, found out that there are a couple of L20 screws which are missing because of which I couldn't complete the assembly. I suggest you all to please count the parts. 3. Called up customer service to order for the spare part and it took about 15 mins to place the order :-( 4. The table has sharp corners so if you are planning to keep the table in a heavy traffic area, be careful", 
    "The product is as shown on the web. Easy to assemble. Looks good and feels sturdy its a bit heavy, so lifting it is a 2 persons job.", 
    "I just bought my first hous and needed a coffee table. Since there were a few black friday sales, and the color of the table was exactly what I needed I decided to purchase it. I didn't put it together but I did see the final product which was great. Actually it was better than excpected. I notcied the draw is on both sides and you can push it in and out on both sides (one drawer.) I noticed it does smudge pretty quickly and it's a little toucher to get the smudge out but with a little elbow greese your golden.", 
    "I rarely buy furniture online, but this table was one of my best purchases. For the price I paid I couldn't be happier.", 
    "I had read some good reviews about this table, and I'm glad I decided to order it. My 15 year old son put together in about 2 hours - everything went together well, he's just very meticulous! We just love the drawer which is very roomy and deep. All in all, I'm very happy with this purchase!", 
    "I decided to buy this coffee table for two reasons: A-Design, B-Price. Some reviewers said that parts of the table had scratches and they were not happy with the purchase. So I was a little apprehensive and didn't expect much. To my surprise the packaging was incredible, almost imposible for this table to get scratched, I almost spent 5 minutes taking all the pieces out of the box. It took me around 30 or 40 minutes to assemble the coffe table, and I'm very happy with it. I also read somewhere that the drawer opens only to one side. Well, that's not true it opens to both sides. For the price this is a great coffee table, practical with a great design.", 
    "very fast delivery. easy to assemble. very pleased with purchase.", 
    "Just a steal! beautiful and will transform all your living room in \"as seen in a magazine!\" The assembly is quite long but it is worth all the sweat!", 
    "You get what you pay for. Sorry!!!!! But the designs fits my ultra modern look.", 
    "This table is a steal for the price. You are getting what you pay for- it's flat packed MDF and you'll need either a lot of patience or a partner who views furniture assembly as Legos for grownups to put it together (I'm lucky enough to have the latter). But once together it looks vastly better than similar quality assembly-required furniture available at the big box stores- at a glance this doesn't scream \"flat pack\" or \"MDF\" the way so many inexpensive pieces of furniture do. Once together it feels sturdy and the style is clean and modern. I love the drawer for keeping things organized- what's the point of clean lines if your furniture is buried under controllers and remotes? And I like that it can be opened from both sides. The finish seems a little fragile- we haven't scratched it yet but I immediately got coasters for it and we're treating it carefully. In short, this is a nice-looking, practical piece for a great price. It's probably not going to last forever, but at this price, it really doesn't have to.", 
    "Very easy to assemble, very sturdy, perfect color & style for me.", 
    "After looking many many places, finally came across this table on overstock and the table was a great value for money. We were looking for a transitional coffee table for our family room and the color goes exactly with our room. Took me less than an hour to assemble and is solves the purpose that is stuff all the remotes in the little drawer. I wish that it was mentioned clearly that the table has only ONE drawer that opens from both sides. i understood it as having two drawers.", 
    "I love this coffee table so easy to put together. Has a modern feel to it and looks more expensive then the price", 
    "The table looks fantastic and it was very easy to assemble, although the directions were not very clear about which lock screws and minifix fasteners to use - in the directions they gave a part number but there were no part numbers on the bag of bolts and screws. I actually decided to leave out the central drawer so I could use the space as a computer shelf, as both my girlfriend and I constantly use our laptops in the living room. The table looks great but my only concern is that is it made out of particle board with a laminate. I am not sure how it will hold up over time but for now it looks fantastic. .", 
    "This coffee table was easy to assemble, but should be assembled over a rug or blanket (which is recommened in the instructions). I made the mistake of putting the drawer together on my hardwood floors and they instantly scratched the material. I've had this coffee table for 4 months and it has several scratched all over it due to the senative material. Also, when you clean, your best bet is water or a disenfecting lysol cloth. Do not use lysol. It just makes the table greasy. I do not recommend this product for anyone with kids because of the many sharp edges, or anyone with cats that like to jump on top of tables because their nails will probably scratch the material. Overall, I really like to design so I deal with the cheap material and try to keep it maintained; however I will not buy anymore main furtniture made with this material.", 
    "Very elegant piece and offers a classy contemporary look to the living room. The Silver on the drawers are very classy looking and give a very rich look to the set. It is a worthy buy if you are looking to compliment your expensive sofa-set.", 
    "I was a bit disappointed the table was not made of a more heavier wood but it's a nice table for the price. The color was pretty darn accurate as shown on website. Only to about 30 minutes to assemble", 
    "Looks great, easy to set up, fits nicely in my Living Room.", 
    "Very chic and great quality for price. Fast shipping and little time to put together.", 
    "Easy to assemble, looks good with my furniture. Great buy for the price would recommend this to my friends.", 
    "I love the look, but the top was scratched, the drawer slides both sides which makes it convenient, however, it does not close proper on either side. The gap is very noticeable. For the price the table is alright for a busy family or rec room. Only time will tell how long it will last. It certainly is not family heirloom.", 
    "After receiving it, it took about 2 weeks for me to open the box due to working out of town. When I finally opened it, there were no instructions included, which is weird. So I called Overstock and luckily, since this has happened so many times before, the customer service guy was able to email me the instructions. The table is smaller than I thought it would be, but overall I still like it.", 
    "I am very happy with my coffee table! It is very unique and classy. The product is easy to clean and can hold a lot of dvds.", 
    "I usually feel very lazy to write reviews. But this item totally deserves my 5mins. I will keep it short, Looks beautiful, classy and expensive. Very good quality. Was very easy to assemble. Functions very well. Adds a character to my living room and I love seeing it everyday!", 
    "You need this coffee table. The price is good, assembly is a breeze, and it looks awesome! It arrived with zero damages.", 
    "Feels like a sturdy piece of furniture. Love the drawer. Looks great.", 
    "Great buy. The style is modern and the drawer serves to store remotes among other things", 
    "I love this table very much, very clean lines and the design is very modern, lots of storage space to store stuff, looks great in my living room", 
    "Table came well packaged and in a short period of time. Assembly instructions were easy to follow. Took approx. 60 minutes to unpack and put together. I get nice complements.", 
    "Came home and my BF had it all put together for me, I love it", 
    "I love this coffee table! It was very easy to put together (took me about 1 1/2 hours), and looks great in my living room! I love that the drawer slides through both ways! It is a lot larger than I thought it would be and holds all my daughter's coloring books, crayons, and games. The top of the table is pretty sturdy and the table itself is very modern and clean looking. Great price too!", 
    "Table is great,I wanted something like this for long time.Shipping was very fast.", 
    "Great table with a classy look. I love it in my sitting room.", 
    "Like the center table. It was easy to assemble. However, the drawer could have been a lot more sturdier. The fact that it opens on both sides, you have to be careful while pulling and pushing to open and close. Overall like it.", 
    "Unfortunately, when the light catches this table the top shows marks where it has been glued. Still a fine table, but this flaw just shows the cheaply made aspect of the table. If not for that it would get 5 stars.", 
    "I'm really enjoying my coffee table. I was happy to see that the assembly instructions were easy to read and the assembly itself was easy. It's sturdy and very unique.", 
    "love my coffe table always dream and got what i wanted", 
    "My only issue with this coffee table is the sliding drawer. It's great, holds lots of things, but it's not on any kind of slider or rail, so it's basically riding on the frame of the coffee table. You wouldn't think this is an issue, but when the drawer is open you can see the scrape marks from where is it is sliding back and fourth. Unless the drawer is closed, and perfectly at that , you can see the internal scratches. Maybe a couple nylon sliders would have fixed this, but they aren't included.. Otherwise, perfect.", 
    "I love this coffee table. It is very stylish and functional. The look of the table snapped our living room into a more modern look in the time that it took us to put it together. Last night we commented on the fact that we have had no missing remotes since getting the table because of the great drawer in the middle. Would recommend this table highly but the corners are sharp so I wouldn't get it if you have toddlers.", 
    "We love this table. It is very sturdy, and looks exactly as it does in the picture. It's a great value. We are quite happy with it.", 
    "This is a nice table for the money I payed for. It's not hard to assemble given the fact that I have assembled many IKEA pieces before. This one is very similar. The build is good, it was delivered without any damage to the table and in time. The only thing I'm a little afraid is of it easily scratching, but I can't know that yet since I only have it for one day. In summary, it's a nice table for the price you pay.", 
    "Assembly was easy, directions could have been more clear, and I am pretty mechanically inclined. The finish scratches very easily and fingerprints or hand marks appear very visually, surface does not clean all that great, I have tried different products. Would recommend if you are a single person like me who wants to just add a piece of furniture, 3 out of 5.", 
    "It was pretty easy to put together. Be careful moving the pieces around because like I said, they scratch very easily. You'll want to get a table runner because little lines will start showing up. I'm careful of what I put in there so I'm not sure where they're from.", 
    "This table looks fantastic in our living room. So far it's holding up just fine. It took my husband about an hour to assemble and it wasn't terribly difficult. I think it was a great value - beautful, modern design at a great price.", 
    "this is a nice piece .overstock would probably sell lots more of these if they indicated that the top of table and base of piece is actually almost 1 1/2 inch thick cause you really cant tell by the pic .i was shocked because i wasnt expecting it to be as nice BUT the top of piece did have some imperfections couple of scratches that were not from shipping .ive worked for a company 12yrs making partical board cabinets and some of the scratches on table top were filed with a Permanent marker with a very close color i might add so i know it was factory errors.i also used these markers a cabinet company for small scratches so its not so bad for me BUT there was a small lift in center of table that i was not happy with .when it does get older thats going to be an issue but i know how to fill it in when time comes that it peels. drawers have another small issue anchor screws have a 1/16 of an inch lip at the bottom which stops the drawer sides to become completely flush small problem not very noticeable", 
    "I looked for months for a coffee table for our small living room. I wanted a table with style and good quality that was small enough to not overpower the room. This is perfect. great price, good quality. the drawer that opens on both sides is awesome. it's steardy and holds alot. i would recommend.", 
    "I was skeptical to purchase this table because of some of the reviews that I read. I thought that it was going to arrive chipped and that I was quickly going to have trouble with the quality. I went for it because I really liked the design of the table and I didn't want to spend hundreds. All I can say is that I was pleasantly surprised! The quality is better than I expected for the price. It looks great in my living room and I received it in great condition. I put it together myself and the visuals on the instructions were very helpful. I do recommend setting all the pieces out and labeling the baggies that the screws come in because it made the building process faster for me. It took me about an hour to put together by myself. I placed it on top of a rug I purchased on overstock as well. My house is really coming together thanks for overstock! Can I say that the shipping was super fast! I purchased it on a Tuesday and by Thursday it arrived!", 
    "Love it! Only complaint is smudgy and can see fingerprints badly. Its not wood really so you can't use that type of cleaner.", 
    "Please read the description carefully because if you're looking for sturdy and good quality this is NOT IT! For $70 maybe and in a pinch for something fast but definitely not for anything more than that. I should have read the description a little closer because if I had known it was made of particle board with a wooden glaze kinda thing I would never have bought it but again it was my fault for not reading thoroughly enough. It's not worth the price or the wait.", 
    "I like the functional drawer and its unque style, however, I cann't move the table around as much or less it could come apart easily.", 
    "Learned from the TV stand experience, I knew where components go and the assembly took less time to complete. The price reflects the real quality of the wood. Not solid wood but it will last as long as it is not taken apart. It is a good buy.", 
    "This is a nice table, but not a really nice table. Good quality for the price. Scratches easily though.", 
    "The directions/instructions were at first danting and I didn't think I would be able to put the table together by myself but it was easier than it appeared. I was very pleased with the results. My table is beautiful", 
    "It does scratch easily as other reviews said. See above for other info. For the price it's a cool looking table.", 
    "The only hitch with this is that it is not wood but rather a veneer almost like a kitchen counter which is hard to see fromt the pictures. Well built, easy to clean, easy to assemble, came in perfect condition. The drawer slides in both directions.", 
    "This is a nice coffee table, I got it in no time!! I think it was 3 days from clicking \"order\" to getting it at home which is really good. The instructions were a little tricky but not too bad. The quality of the table is good but not great, almost like an I*ke@ table with a better design, but overall it's a good purchase", 
    "Its a great looking modern product for a very inexpensive price point. This is much more slicker looking then anything Ikea has. Note- the drawer you see in the middle is actually two sided which I thought was fantastic! You can hide remotes and other stuff in there and access if from both sides. It also took away the decision of which way to have the drawer face.", 
    "We like the table and are very satisfied. We did not assemblethe drawer and prefer the open look without it.", 
    "I really am happy with this. Took an hour to put together. LOVE the drawer slides from both sides! one side remotes and PS3 tools and the other side blu rays. The under shelves great for books and Ipad. An incredible deal for just over 100 bucks!", 
    "great quality great price absolutely no complaints!!", 
    "I like the table a lot. it's pretty. the color goes great with my tobo tv stand from iKEA. The first one we got had a small scratch on the surface. I covered it up with a wood pen but i still wasn't satisfied so i contacted overstock. they sent me a new one free of charge. The quality of the table obviously isn't the best. It's equivalent or a little better than ikea furniture. I like the drawer in the middle. it's huge and you can open it from both sides. Overall, it's a great and i love it.", 
    "This product is all that we hoped it would be being able to access the drawer from both sides is a very handy feature the product is very well built and was easy to assemble.very good value for the money!", 
    "This is my first purchase from overstock and I can't describe how satisfied I am with this one. This table is very stylish and of decent strength. This is easy to assemble if you follow the instructions manual. Only issue though a minor one, I got was with assembling the drawer part of it. One of the part was not fiting correctly. Overstock customer service was very prompt and extremely helpful in sending me a replacement part. My wife loves this table. I am glad that I made a wise decision after searching for many similar items online.", 
    "I hope you know that for this price you are not getting solid wood. It is \"particle board\" but it is very sturdy. You can't tell from the outside. Everyone compliments the nice looking piece of furniture that is is. It is easy to clean as nothing stick to it. The only flaw is that it does scratch a little easy but some pledge makes it virtually unnoticeable. HIGHLY recommended. Be as careful as possible with the scratches!", 
    "I like the size, color and style. I especially like the 2 way drawer", 
    "I wasn't expecting too much given how inexpensive this table was but I was really pleasantly surprised. The quality is good, not the finest but still sturdy. It took about 20min to build (don't forget the glue for the wood pegs, missed that initially). The look is great, modern, unique. I display my travel magazines and books and store all the remotes in the drawer :) Very happy with the purchase!", 
    "It's a nice table. It wasn't too difficult to put together -- but in the end we wound up having to use the flathead screwdriver to secure the phillips head screws -- I'm not sure why, but it's very sturdy. Also the drawer moves smoothly, and looks really nice.", 
    "at first I was upset that the description never mentioned that it needed to be put together. After finishing I realized it was not so hard after all and I saved a lot of money and got a darn good piece of furniture. Thanks", 
    "This table is just for me, affordable price, like the drawer in the middle so modern and nice. It goes well with the furniture that I already have. Easy to maintain and easy to assemble. I would realyl recommend it..", 
    "Just got my table I love it. It was easly to put together and I had no problems with it. Looks great in my front room.", 
    "Love the Tepekiie two-side Open coffee table. It looks even better in person. I got alot of compliments on it. It looks so Elegant in my living rm.", 
    "While this is definitely a pressed board table (so not high qualtiy), it definitely looks WAY more expensive once it's put together. I've received a ton of compliments on it and i bet no one knows it's pressed board and only costs $***. I have some crate and barrel items in the room and it matches so well. the color is also really nice- dark, but still looks like espresso and not black. Plus it's not too shiny. Love it!", 
    "Ok, the coffe table looks good, but is a poor quality wood, and is ver easy to scratch, is too cheap but too low quality.... In 2 months i will have to buy a new one, so if ur looking for somethIng last do not buy this table...", 
    "I had been stalling on buying this coffee table and eventually was out of stock. pulled the trigger when O got a few more in, and couldn't be happier about it. Was concerned given some of the other reviews about the packaging but had no probs. table came double boxed, so even the dings on the outside box didnt impact or damage the inner box or the table. easy to assemble for anyone who has put together furniture from Ikea or similar. Looks great. the drawer is great for hiding junk and the lower level shelves are perfect for those extra remotes that you don't want to see but want to have access to. overall, very happy.", 
    "This table is a bit big in size and pretty easy to put together. Mine came with a tiny dent in the top corner, but it is not too noticeable. All in all I really like it. It could be a bit sturdier.", 
    "it table is great except that the top of it is made of a soft material so it marks really easily, not great for something you want to put stuff on", 
    "It looks exactly as the picture and is nice quality and design.", 
    "My fiance and I put this table together in a little under 2 hours. All parts were well package, there were basically three padded boxes that enclosed the table. Each piece was in perfect condition. When we finished putting the table together my fiance was very please with how \"clean\" it looked (he does not like the frilly stuff), I loved that it made our living room look very modern and matched the leather that accented our microfiber sectional. Highly recommend this table if you are trying to update your living room, it looks more expensive than it really is.", 
    "Like the table because it has a modern design. Don't like the bottom because it's not that smooth so becareful when you slide it on the carpet. It will peel off the liminate.", 
    "I thought it was a sale when I saw this online but the price is just normally great. Plus shipping which arrived in the same week I week or I think within that 5 days after I bought it, but it's still pretty quick. With great prices, also comes good quality so I'm very happy with my coffee table.", 
    "Devote an hour to put it together and you got yourself a great coffee table.", 
    "This table was a great finish to my furniture, i have a smaller apartment and just needed a couple pieces to make my place complete, this is a beautiful table, and it didn't take long to assemble", 
    "I like it because it's simple and cute at the same time. The drawer in the middle and how it was designed is very thought through idea, I love it very much. It looks nice with the rest of the furniture in the house and the color finish was perfectly done. All quality cofffee table, and I highly recommend it.", 
    "I love the size and the design of the table, is woderful. I can't argue with the price, and shipping it was great! plus it was easy to assemble and the quality of every piece that comes with this coffee table comes from good quality and sturdy materials. I love it, it's worth buying.", 
    "The style of the table that arrived on my door step 3 days after I purchased it is awesome! the style is amazing and plus the drawer that comes with the coffee table is very impressive. The dark brown color goes well with the style and it goes well with the other furniture that i bought from Overstock.", 
    "I love the design and it provides the right amount room when guest comes over. The table is easy to work on and very sturdy with real solid wood quality. You can't go wrong with this coffee table, it's great.", 
    "I got it awhile back and even now it looks great. Good quality and sturdy wood material and like others have mentioned, setting it up is easy especially with easy instruction with pictures to follow.", 
    "I can't believe I bought a furniture piece online I said to myself when I purchased this. At first when I saw this I was really attracted in the way it looks so I went to different department stores to find something like this, but couldn't find it but I really wanted something just like it. So I decided to just buy it online and when it arrived, it came in perfect, well packaged condition. Now i\"m not so scared in purchasing furnitures online. The quality is even better than the ones I saw at the department store and it's very sturdy with all sides made evenly and perfect. My coffee table is so perfect.", 
    "What can I say good quality and very sturdy table. It's heavy so you know the wood comes from top quality wood that was used for this table. Look at it! Is what I see everytime I sit on the couch, it looks very nice and I love the detailed design that the coffee table has. It is one of the greatest!", 
    "I absolutely love this Coffee Table. I was able to put it together by myself in about 1 hour. Some of the pieces didn't quite fit flush against the boards but I was able to get around it. It is just what I was looking for :)", 
    "First, this was left on my door in the rain when it was delivered, but was packed so well that it never got wet. I am always cautious with RTA furniture, but this looks amazing. The wood grain looks awesome and authentic. The unit is solid and sturdy. It's not too heavy to move without help. The only thing I didn't realize was the drawer doesn\u0092t have rails; it just sits in the middle and rests on the bottom shelf. The upside is you could do away with it and nobody would ever know. Overall, for the money this is right on. No regrets with this purchase at all.", 
    "my coffee table is such a great buy, it came fast, the quality and the price that I bought for doesn't compare to each other. I paid less and more quality. The table looks better in person that in the picture and the picture is what caught my interest. I like the design, the color, and the various spaces all around, and it's very sturdy. It only took me and my cousin 30 minutes to assemble.", 
    "We love this table in our bedroom. It was the perfect addition to a very adult room. We use it to store bills, a printer, a cable box and other items we dont want out in the open. The color is a dark expresso, unit was easy to assemble and well constructed.", 
    "This table was easy to put together after my brother carved out the rest of the tracks for the middle drawer. I was prepared to have some sort of issue after reading the rest of the reviews on the assembly of this table. However, after a couple of tweaks, the table came together quickly and I like how it looks in my living room. I didn\u0092t have any scratches in the table and am very pleased with the finished result.", 
    "It came fast ready to place on its special spot in my livingroom. Hardly any assembly done to it, practically ready right out of the box. I'm liking the slots on the side, I can place a little decor in there and I love the drawer, this coffee table is so functional and good quality.", 
    "I got this coffee table, because I thought it would match my kitchen cabinets (I have an open floor plan, so the kitchen and living room are on the same floor/space). It does match, and surprisingly, goes with a bedroom set I bought on Overstock.com, too! Overall, this is a fantastic table. I have received compliments on it already. The item shipped surprisingly quickly (i.e. I was surprised to see it sitting outside my house when I came home from work - I believe it had only been a couple of days since I had ordered it). The table was not particularly easy to put together, but that is because I did it by myself - it was not difficult to put together either, since I was able to put it together myself. I agree with another reviewer that it sometimes does not seem very sturdy, so I just need to be mindful, e.g. when I need to push it over to another part of the room. Oh, and the item was packaged well! It was not only wrapped thoroughly in bubble wrap, but there was also padding taped to each corner. I appreciated the thoughtful manner in which the item was packaged, and would certainly buy furniture from Overstock again.", 
    "It's a nice table for the price. I recieved it quickly and the color is exactly what is pictured. It is also easy to assemble. It's just not very sturdy. Overall I'm happy with my purchase.", 
    "This table is VERY well made. Nice heavy wood and very beautiful. Well worth the money!", 
    "This table is so BEAUTIFUL in person. I was a little worried, but so happily surprised~ Love it love it love it. Great style, nice dark wood and wonderful finish!!!!", 
    "This table is the perfect height, shape, and sturdiness for a multitude of uses and decors. Definitely think that it'll hold up for quite some time. For the price - it is definitely worth the buy. I don't feel like I've wasted the time and money at all with this piece. I am very happy.", 
    "Everything lined up nicely and was pretty easy to construct. Pretty design and finish. The product was shipped so fast and I would definitely order from Overstock again!", 
    "Almost purchased similar product from another source at 5+ times the price. You can't go wrong with this design. Roomy top, roomy drawer, lovely finish, easy to assemble and great shipping price!", 
    "This product was well worth the money. Sturdy, solid, beautiful finish and last but not least easy to put together. I highly recommend this coffee table. That drawer is roomy too!! Nice and affordable!", 
    "Overstock does it again with a great quality coffee table at a very low price and shipping cost. Shipment was prompt and hassle free. Assembly took about 15 minute. If you are looking for strong, affordable, and attractive coffee table, then I believe this will be it for you. I love it!", 
    "This is the first time that I have ever felt the need to write about a product. This is not a good piece . Assembly was by pictures and the last picture was of the drawer. I put it together and then had to take it apart again to get it into place. No glides just a funky piece of particle board provides the surface for the drawer to move. Once the piece was assembled I tried to move it into place and the top just came off! It is a very \"thick\" piece and does chip easily. I am very disappointed overall...very disappointed.", 
    "I really like color, shape, and size of the table. the disappointing part, which another reviewer also mentioned, is that there were a few pieces in which the \"wood grain\" finish was missing, and they clearly just used a black marker to cover those spots. It wouldn't bother me if those spots were in hidden places, or were small, but they are not. the largest one is the whole length of the vertical board next to the drawer. i stare at it everyday because it IS very noticeable. I didn't pay alot so i guess thats what i get. but be warned! I also did not realize the drawer opens from both sides. Overstock shipped it quickly and wrapped the outside of the box with bubble wrap and padding to protect the corners, which i appreciate. unfortunately it is the product itself that lacks quality.", 
    "I love this table. It looks exactly as shown on the picture. Absolutely beautiful!!! My boyfriend put it together in about 40 minutes.", 
    "i'm spatially challenged--so i expected putting this together to be pret-ty difficult. But it wasn't. I'd never seen channel locks before- very handy! and the glue...glue? ah. i realized several pieces in--glue the wooden pegs. it was a learn-as-i-go project, but the end result is great--except for one little square inch dent/wrinkle in left corner. that's why i gave it 4 stars instead of five. bummer, but, no way i'd return the whole shebang for that. the table is dark brown w/ grains of black. shelves and drawer are great and then surface can be kept clear and i like that.", 
    "This product was simple to put together and the material is well made. For an inexpensive table it is extremely durable. Nothing more to ask from it. Happy is the word to describe my mood!", 
    "It was quick shipping. Had to parts with the numbers reversed, but I figured it out. Not the best quality, but it looks pretty good.", 
    "I loooooove the look of this table. Absolutely love it. The style and the size is perfect for our apartment. Assembly wasn't difficult at all. I honestly have nothing but compliments for this coffee table. Everyone should definitely get one for their home.", 
    "Was really well packaged. Took 30 minutes or less to put it together. It fits perfectly in the space, the stain color is great and I have had many compliments already. Such a fun, nice looking piece!!", 
    "I looked high and low for a coffee table since I don't really want to pay outrageous prices for a coffee table that my kid will be banging his car toys on and I stumbled upon this one. I loved everything about it when I saw it. The looks, the color and the PRICE! I got it, put it together myself and you know what? After 6 months, it still looks very GOOD! Of course, I tried very hard to keep my son from playing car chasing on top of it but the fact is that this table is durable and excellent for family use. I would recommend it.", 
    "This Tepekiie Coffee Table has a sleek and modern edges to it. Although it's a bit darker than in the picture, but it's super solid construction and still is a very beautiful coffee table. It will definitely last. If you like it and it fits your look, get it.", 
    "I was looking to pick up a unique accent table for my guest bedroom and this was it! Well proportioned, ample room, unique leveled design. I love it very much and think I got my money's worth.", 
    "This table assembled in minutes and the best part is that all parts fitted together nicely that the table once done does not look self-assembled. Definitely adds texture to a modern space and could probably blend well with a more traditional. Terrific value as well...and it definitely does not look or feel like a \"value\" table - sturdy and balanced. What else could you ask for from a coffee table? :)", 
    "This is a very attractive and modern table that has made our living room look amazing. Easy assembly with substantial room for storage. Hard to find around our area, definitely a good buy.", 
    "I was looking for a dark colored table with both closed/covered storage as well as some open shelves. This one fit the bill. Mine has a small bump under the laminate layer on the top, but decided it wasn't worth the trouble of exchanging it. Other than that, it is a very solid piece of furniture, with a decent style.", 
    "I'm very pleased with this table, happy that I decided to purchase it, its expensive looking, no one will believe the price I paid, shipped within 3 days, no damages. It looks rich/great in my space. The wood grain is awsome, its unbelievable how good this table really is...looks like a million bucks! love it", 
    "Love this table. We wanted a coffee that is nice looking and this one fit the bill. The stain is even and displays the grain of the wood nicely. Originally this was a second choice for me while browsing Overstock for a coffee table, but now it is for sure the first choice and I am glad I picked it at the end. Nice overall appearance.", 
    "I am very pleased with this online purchase. Package arrived without damages. Assembly is very easy and the final product is very beautiful. I love the middle drawer accent, makes the table looks very unique and soothing to the eyes. Very nice table. I am glad I purchase this.", 
    "This is a very nice an sturdy table. Love the design! Very chic and contemporary but doesn't lack that traditional feel to it. Which means that it'll make a great coffee table for a very long time. I am very thrilled and excited when I received it and after putting it together, I am in awe. Assembly was a piece of cake, nothing has never been easier. I love my new coffee table!", 
    "I had a really ugly thrift store table that I was dying to get rid of. In the next few months I will be ordering a new sofa and didn't want to spend a ton of money on a table that may not be what I want once the sofa is here. The construction is solid but the finish scratches easily. Assembly was easy too and I received the package only two days after ordering!", 
    "The design is one of a kind, the table top is wide and spacious and yet the size is so compact that it doesn't overpower our living room area. The drawer is a definite plus for me because it is deep and roomy. I load so much stuff in there and still have space for more. Love the non-traditional design but it doesn't look awkward or unusual. Wood color and quality looks great. Nothing to complaints about this purchase, only compliments.", 
    "Assembling the product wasn't too bad for a picture only assembly instructions. Could've been better with text along with it. And the hardware could've used stickers labeling what they are as well. Overall the product is great and my family likes it.", 
    "we did have a bit of damage (chunks broken out) on a couple of the pieces. It was very well wrapped but it is a particle-board product so that does happen. It looks great. Is really sturdy. And is bigger than I thought but I really like it.", 
    "the table is the same as it appears on the picture, it really looks nice.the only thing that i don't like is the top: it is not like the wood, it is very sleeky so if you look closer it looks cheap;it also shows finger stains easily.overall, for this money, excellent table, but if you like real wood, it is not for you.", 
    "These tables are so pretty, they warm up the whole room.Great quality and solid construction.They were so easy to put togeather and arrived very quickly! I looked a long time for these sweet tables,I am so pleased with them!", 
    "It is compact, extremly sturdy, much heavier than other furniture in this price range and the wood is very pretty. I am very very pleased with this a table both in appearance and in value for the price. Love the deep, rich color. As usual, Overstock's packaging was perfect and delivery was swift .", 
    "Nice but for the parents with toddlers..", 
    "I was very disappointed in this table. It is one of the few purchases that I have returned. The picture makes it look of much higher quality than it is. I would not have this piece in my house.", 
    "An easy item to assemble but it has a cheap Ikea feeling to it. I don't really dig the double pull drawers that has no slide to catch the item. So if you pull too hard the drawer will crash and fall.", 
    "I wanted a coffee table that was modern and easy to care for. This is both. Husband didn't have any trouble putting it together.", 
    "Overall I'm happy with this table but I was disappointed with the drawer. It was very difficult to put together because the parts did not fit correctly. I had to use a drill and purchase some replacement parts to finally put it together. It is a shame because otherwise the table was very good value for money.", 
    "We Ordered this coffee table through overstock. Shipping was fast, assembly was easy, and the table looks great.", 
    "I bought this table about a week ago and love the construction and style of it...its simple yet stylish, I love the overall look of it...BUT...two of the table pieces did had some scratches on it and it was missing a couple of hardware pieces to put the drawer together but turns out I love it better without the drawer, the table itself is complete without the drawer so you really don't need it unless you need it to hide or store things in it...but its a coffee table, anything you put on a coffee table is meant to be seen and since it has two openings on the sides and one big opening in the middle (since you're skipping the drawer) it works out perfect for magazines, coasters, candles, etc...and the scratches, those were on two of the pieces that were not noticeable once the table was put together, just touch it up with a furniture marker and you won't even seen it....so if it wasn't for the scratches I would've given this product five stars!!! and you can't beat that price either!", 
    "when I got the box, there was a big whole in it, we told the ups and they made a note of it. sure enough when we opened the box, one of the shelves has a big hole almost all the way thru, we couldn't put the table up and had to contact customer service. it was my first time buying on overstock.com... very disappointing", 
    "I ordered this coffee table because it looked just like a $3,000.00 coffee table that I saw on HGTV that I liked because it had a drawer and great style . I returned it unopened, because I realized that it wouldn't match my other furniture in color or style.", 
    "The only reason I purchased this table was because it matched another one of the coffee tables they had and I was purchasing them both. It looks much better online. I understand that when you buy things that aren't 100% wood your quality isn't going to be \"GREAT\", but I must say I was hoping for at least better. Honestly...for the price....not worth it. I found nicer coffee tables at xxxx that I actually wish I would have purchased instead.", 
    "The moment we opened this package, we knew we paid too much for a poor quality furniture. The picture was very deceiving. The nails started coming off and the wood started chipping. We will not recommend it.", 
    "Having bought 3 furniture pieces from the O prior to this, I was confident buying this. Boy, was I disappointed! The quality is terrible. The manufacturer didn't even provide enough hardware pieces, so I had to improvise from the garage (and, no, I didn't loose any). I don't see this lasting very long given the cheap fiberboard it's made of.", 
    "I have had this table for about a year. It seemed ok when I first put it together- some of the holes didn't line up quite right but I made it work. The finish started to peel off within the first month and the scratches left by seemingly innocent items are a very pale particleboard color-very noticable because the table is so dark. I don't have much in the drawers because the legs are wobbling and I'm afraid it's going to fall apart if any amount of weight is placed on it. I am looking for another table to replace it - it's in such bad shape I can't even give it to someone for a rec room or college dorm. Buy something else!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Tepekiie-Two-side-Open-Coffee-Table/4079436/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4079436/Furniture-of-America-Tepekiie-Two-side-Open-Coffee-Table-7371e686-2dd9-4a6a-b838-291df352569f_600.jpg"
  ], 
  "description": "This gorgeous Tepekiie coffee table offers three rich finish\noptions and an accessible drawer on both sides. The coffee table\nfeatures a unique design and would be an beautiful accent piece in\nany living space. A high-quality table constructed using proven and\ntested materials. This offering is inexpensive, elegant and\ndurable. It is designed to be used by a busy, modern family. Its\nsturdy and simple design will complement any living room, family\nroom or den. The stylish design is eye catching, practical,\ntimeless and sure to be enjoyed for many years. This fabulously\nmodern coffee table from Furniture of America is the ideal\nfinishing touch for your contemporary living room. A two-sided open\ndesign gives storage options where most coffee tables have none,\nallowing you to stash books or display decorative pieces in a\nprotected spot.Color: Black, coffee bean or light oakInfuse your home decor with this two-side open coffee\n  tableLiving room furniture features a drawer that is accessible on\n  both sizesFully equipped with metal handlesMade with veneer and medium density fiberboardMeasures 47 inches wide x 24 inches deep x 16 inches\n  highOpenings on sides: 10.5 inches wide x 24 inches deepStyleContemporary, TransitionalMaterialMetal, Veneer, WoodTypeCocktail Tables, Coffee TablesFinishBlack Finish, Brown Finish, Oak FinishShapeRectangleAssemblyAssembly RequiredColorBlack, BrownFurniture Frame MaterialWood"
}