{
  "name": "Furniture_of_America_Duarte_Modern_Leatherette_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 136.45", 
  "reviews": [
    "Quality - Excellent value; delivered for 63 bucks a chair. Don't expect a $250 chair, but expect a good value for price range. Dimensions listed in product specs are true, back is about 13.5\" wide. Chair is very comfortable for intended purpose; no one in house is over 175 lbs or 6' tall.. I can see where some would think chair is hard, seat pad about 3/4\" thick but feels like it is made of good quality foam with acceptable density. Don't expect leather. Leatherette description holds true to fabric on chair. Soft, thin, what i believe is PVC coated fiber is acceptable and should be durable for normal wear and cleaning, but would puncture easy. I did not notice an odor associated with leatherette cover. Stainless, yea maybe the low quality stuff, but shiny like chrome plated. Frame is of acceptable quality for weight rating of chair which can be referenced in product.Q&A. Chair is light, back is thin. Not a 1970 chair your kids can jump on. We are happy with purchase and aesthetically the chairs fit well with our modern table that cost 10x as much until we find what we really want. Also expect fair return on craigslist resale. Assembly - Follow the poor instructions. Do not tighten all fasteners until you have assembled. The seat does not have holes started, but I put the seat in position, leaned chair on front which held seat in place and allowed me to align and install screws easily with hand screwdriver. You only need to install screws enough to hold in place the frame does the rest of the job. If you manage to poke screw through the seat, wow. Assembly was easy except as noted below (moderate for some). Allen wrench supplied. OVERSTOCK - I CANNOT SAY ENOUGH ABOUT YOUR CUSTOMER SERVICE!! We had a problem with one chair. When assembled the chair wobbled; one foot about 5mm off floor. Problem was an incorrect bend in left side support. Chat session opened within a minute, customer service rep gathered info and started the process within ten minutes. Email with RMA number received and another rep requested picture of problem. Reply with pictures sent within two hours. Another customer service rep picked up the process on following day and replacement part shipped within two business days of complaint. I was not hassled with product return (although i understand this policy would be dependent on problem/product). Three different reps, everyone efficient and on the same page. If (insert 90% of other companies out there) was anywhere near this efficient and customer oriented my life would be better. I have ordered from Overstock before, but this experience will make future decisions of to buy online or not an easy decision. If available on Overstock, I'll buy ;-)", 
    "Looks and feels like real leather. Sturdy, easy to assemble. We bought them for the conference room at our business and they have a clean, contemporary feel that suits the style of the room perfectly.", 
    "assembly was simply, however the frame was a little tough. I had to use a little force to assembly the back of the chair. the chairs looked great after they were all assembled. I bought 8 chairs and assembly was faster each time. great addition to a glass table", 
    "Love these chairs. They are a true whitel", 
    "EVERYBODY LOVES HOW SLEEK AND STLISH THIS CHAIR ,BOUGHT 6 !!!", 
    "Perfect around the dining table we bought that is modern and sleek. Holds up well to some big men!!!", 
    "Very low quality--very disappointed, returned same day. First, the chair was extremely uncomfortable--cannot imagine sitting on it for more than 30 minutes.Secondly, the white one shows every single fingerprint--and then you cannot even wipe it off--had to use Mr. Clean Magic Eraser to take out the fingerprints.Finally, these were very difficult to assemble because the holes on the seat did not match the frame.", 
    "very modern. very nice, brightens up my very small kitchen. Not too easy but not too hard to assemble them, either. very comfortable to sit on. just love it. Bought them to replace my also white chairs. The chairs came so quickly.", 
    "Aside from the fact that it takes some effort and time to assemble, the chairs are exactly what I was looking for - pure white (not cream colored) faux leather dining chairs.", 
    "These chairs are well designed and very solid frame once assembled. Good style and value for the price!", 
    "I had my neighbor assemble them for me. They are sturdy, sleek, comfortable and look expensive. Excellent deal on all levels. I bought the white and am glad I did.", 
    "I am very happy with my purchase. It was very easy to assemble and they look like I spent a mint for these chairs. It gives my dining table a whole new look. I would recommend this site to friends and family. This was my first purchase and I am happy it was for this product.", 
    "These chairs are very well made and sturdy materials. Should be no reason they don't last for years to come. very stylish and elegant and comfortable to sit in. I had one that the hole were drilled wrong and overstock sent me a replacement. They are a bit expensive especially when you buy ten of them but I liked them so that is what I went with. Maybe they should have a bundle price, if you buy so many you get a discount.", 
    "Just received these fab chairs today! The packaging was great. I love how they made sure the chairs where protected with layers of safe wrapping. The quality of the chairs are great, they seem to look more than they cost. I love how white they are, adding a contemporary feel to my dinning area. I would highly recommend these chairs. I love them!", 
    "The chairs are modern and beautiful. They are comfortable to sit in. The assembling part did take a bit of time, as the others have commented on. But well worth the money!!!! Our guest loves the look of the chairs as well.", 
    "For the price, why not. Took some time to put them together but are comfy and I will find out how durable they are!", 
    "Got 4 chairs and they meet my expectations for the price. Good quality metal with strong welds. No parts missing. Easy to assemble. Would recommend to others.", 
    "chairs are not easy to put together. However, they look really good once they are assembled. I paired them with two chairs that are white and they do look very nice. Not the best quality but more than I expected for the price. If you are looking for good looks at a low price these are probably going to be what you want.", 
    "Wished the white was offered when I purchased them, but the black is fine - I used them in my kitchen with my white table I wished they were alittle more substantial, but I very much liked the stainless steel legs. Took a while to assembly the chairs, would have preferred if only alittle needed to assembly - but every piece had to be assembled - second chair went much quicker in assembly them.", 
    "These are gorgeous chairs & after buying 8 & assembling, we went back & ordered 6 more. They look great. They are not pain free to put together & there was 1 screw that was wonky as well as a few holes that didn't line up perfectly, in 3 of the 14 chairs. So assembly was some work & sometimes frustrating. But in the end we have lovely chairs for a great price & they are comfortable & perfect for our decor.", 
    "I love these chairs very classy", 
    "Worked with the table I purchased but screws come loose over time", 
    "Product arrived on time!!!", 
    "It's good fro the price; however, very difficult to assemble, And not a of a very superior quality.", 
    "We have the dining sets and excellent modern furniture although we did not buy it here. but we used it for 8 years till now. What i can say wow!!! indeed. plan to buy 2 more chairs in here.", 
    "No complaints. Looks as it is shown. Have been using them for over 2 years now. No breaks/ faults. One of the two was a little hard to put together due to misplacement of nuts and bolt places in it, but despite that, it worked out ok,", 
    "Great product and easy to assemble", 
    "Nice product, recommended.", 
    "I like the design and quality", 
    "Looks nice , but the leather got twisted against the metal", 
    "the material is not totally as expected but they are comfortable and they look nice", 
    "I don't like them as much as the CK Home Kensington chairs but they are not bad at all! Still very reasonable price though!", 
    "very light, modern looking, great quality... very happy with this purchase...", 
    "Chair is light, look very nice and comfortable!", 
    "I have been asked numerous times where I got these fantastic chairs! They make the glass table with chrome legs look great.", 
    "Looks great in the dining hall, bought 2 sets. Happy to have got them..", 
    "These are inexpensive chairs. They are just OK. They fit in a small space.", 
    "sturdy, well made chair. stands up to my busy kitchen computer station use. purchased over a year ago and still look great.", 
    "I bought these chairs and did not assemble them until recently. My husband is a mechanical engineer and had a such a hard time assembling these chairs. The holes on the bottom frame do not match so he had to use his own tools to dig holes in order to put top cushion on. It took us over 3 hours to assemble them. Anyways, after sitting on them for few months once a day to have dinner, the back padding/plastic behind the fake leather is popping in and out as you sit and makes the noise. The other chair is doing the same but in the seat cushion. This is a horrible item that did not even last us few months. Also, this fake leather is soooo hard to clean. There is nothing that will take fingerprints off from assembling it. I would NEVER, NEVER EVER, purchase this item. Very cheap.", 
    "I Was worried these would not be sturdy enough for my family BUT they are and so comfortable!! So glad I decided to purchase them. They look beautiful in my kitchen!", 
    "I had someone put them together for me...too difficult. they look a bit thin but have served their purpose. the whit are pretty. wouldn't get them again.", 
    "Unfortunately, the chairs were not easy to put together because the holes did not match up.", 
    "Very easy to put them together. Look great in the living room. Very happy with quality and looks.", 
    "I recieved the chairs fairly quick - they were packaged very diligently so that there wasn't opportunity for them to ruin while being shipped. The chairs look great and modern - not 5 star quality but still good quality and good price", 
    "Very happy with this purchase. Arrived on time and in perfect condition. No complaints. The chairs look great. Thank you!", 
    "Legs were uneven had to get", 
    "Absolutely adore these chairs, great quality, very sturdy & perfect modern look for my dining room. Easy to assemble!", 
    "You get what you pay for. I like the look of these a lot and they're reasonably comfortable, too. They're sleek and modern and nicely designed. Putting them together was easy, but two out of the six I bought were wobbly, and one came with no hardware (but Overstock were quick to replace).Durability is where I'm marking these down, however. Despite being easy to keep clean, the vinyl covering is not that thick and easily pock-marked or pierced. Recommended, perhaps, for occasional use. For every day use with homes for kids and pets, perhaps not so good, but I think that's pretty obvious from the price point.", 
    "Love these chairs. They are super modern. We actually installed them a little different than the picture described but they still look amazing. We love that they are the type of chairs that you can not just walk in any store and buy. Very unique.", 
    "Assembly could have been easier. but the price is unbeatable", 
    "Not very comfortable but we don't sit in them that much anyway, they look very modern and expensive and compliment are dark wood and chrome dining table well.", 
    "I really like these chairs, but I will agree with the other viewers that I was sometimes a bit frustrating to assemble due to misalignment of screw holes. discovered (by the fourth chair) that by keep the crossbar VERY loose in the beginning, you get enough wiggle room to finally align the back screws. I ordered a pair of white an a pair of black and love the contrast around my glass and chrome table. If it weren't for the screw issue, I would give them 5 stars.", 
    "I ordered four for a kitchenette space on a tile surface; the chairs can also double as \"extra\" dining room chairs since I also use black wooden, high backed curved slatted chairs there. The rubber cups at the bottom of each leg appear to be soft and can protect my wood floor in the dining room as well. I am satisfied with this purchase. The assembly is not hard but it was strange to screw in the bottom seat of the chair without a starter hole...we used a screw driver manually to start, then switched over to a power drill. The screws do go in very easily.", 
    "a good buy. been using these for over an year & have no issues.", 
    "It's look nice but they are simple. Compare to the prize it's ok.", 
    "These are some of the most comfortable chairs I own, I spend most of my time at work on my feet, so at the end of the day I just want to sit down on a comfy chair and play video games until I have to fall a sleep.", 
    "I wouldn\u0092t recommend buying this chair if you are not a handy-man or are not willing to spend some more money to hire someone to assemble it for you. The instruction seems to be simple, but the amount of time it takes is much more than you think. The major problem with this chair is the holes on the metal frame that was supposed to be fastened to the back of the chair doesn\u0092t align with the hole (with thread) on the back. So, you have no choice but expand the frame\u0092s hole with special drill (or something else you find useful) so that the screw can go into the hole on the back of the chair. This definitely takes some time and if you are not careful, you may cause some damage considering that you will be using some sharp tools. You don\u0092t want to make that hole bigger than needed; otherwise the chair may be loose. Out of 8 chairs I bought, only one of them had matching holes! The second problem is that some screw holes on the back of the chair had some tiny metal particles in it that made it harder to insert screws and sometimes screws didn\u0092t flush in completely. I had to vacuum and then clean these holes with oil to make it easier to insert screws. Also, after you complete assembling (if you are lucky), you may notice that one or more legs are shorter, but in reality they are all the same size. To avoid this, I would recommend loosening all screws until all four legs on the same level (or have someone sit on it to see it works) and then start tightening them. The design of these chairs is great, but I am not sure about quality and how long they will last considering they are made in China and already caused enough trouble and headache with assembly.", 
    "Overall the price is fair and the quality is good.The leather covers could have better labor at stitches and same for the holes for installation.I had to enlarge the metal part to fix one.Still half price when compared with stores.", 
    "A beautiful and very comfortable chairs, my wife and I are very happy with the purchase and delivery was fast and in perfect order.", 
    "The chair looks great for the locating we are using it in -- it is light weight, so very easy to move around. The only minus is that the fabric crinkles/pulls a bit on the back sides, so you need to pull on it a bit to smooth it out - which doesn't solve the problem entirely. The cover is bright white (not cream) which is what I was looking for. It looks great, but just know you have to work a bit to get the backs of them looking crinkle free.", 
    "for someone who has back problems with any chair, these chairs have been happily, quite comfortable.", 
    "They are not the sturdiest chairs, but they look great and are perfect for my kids to sit on around the table.", 
    "One chair was easily constructed. The other chair didn't align very well. In fact, we opted NOT to put in one of the screws because it threw everything else off. Not sure how sturdy the chair is, as a result, but we haven't had any issues sitting on it, thus far. Chairs look great, but poorly constructed.", 
    "Super comfortable chairs with a nice modern/sleek design. My friends put the chairs together for me but they did tell me they weren't the easiest to put together, so good to have handy friends and a good set of tools to assemble. Delivery was quick as well, no issues.", 
    "Love the sleek looks of these chairs. The slim chairs allow for six chairs to go around a table that possibly would only fit four. The legs are extremely slim. I tried putting on felt pads with super glue, but even these have fallen off. On the hardwood this is a difficult task.", 
    "I love this modern simple look. Very easy to assemble. Perfect for small condo or patio space. Only wish they had it in my color choice when I went back for more !", 
    "Looks just like picture. Not real strong but fills my need to look good, match my old table and works with my dining benches.", 
    "These are adorable dining pieces but they are not durable. The get easily scuffed after 2 days of using them.", 
    "Love the modern look and clean lines of these chairs--purchased 4 in white. It would have been easier to assemble with pre-drilled holes. So, 4 starts instead of 5.", 
    "Easy to assemble, very modern, priced well. I bought 4 black chairs To match a glass and chrome table. It looks fantastic.", 
    "The faux leather seat is stapled to the ply wood and the screws that are suppose to attach to the plywood seat threat right through. I ended up having to crazy glue the day in place the chair feels like it will only last a few years and if it breaks there seems to be no way to repair since it's so cheaply made. The chairs do have a nice look to them but not worth the price.", 
    "Chairs are very modern and go well with my decor. They are sturdy and also very high quality. Great chairs for the price!!", 
    "Chose these chairs to go with a white table I bought. Putting them together was east but you can tell they are cheaply made so I wouldn't recommend anyone large in size to plop down on them as I will see them breaking.", 
    "I fell for the comments. Do not buy! Save yourself a trouble. Quality is far from the item pictures listed in product page. I ordered set of 2. First set is fine, second set is completely terrible. Cushions damaged and worn out. Most importantly there are 2 different tone of white. Can you believe that?? I spent my hard earned money for this chairs. I feel like I got scammed. Once again, do not buy!", 
    "The chairs are nice looking but they all wobble. Had to buy pads to even them out. They only wobble when you're not sitting on them but it's annoying but I didn't want to deal with sending them back.", 
    "after a week of using paint from the chairs legs is coming out"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Duarte-Modern-Leatherette-Dining-Chairs-Set-of-2/6521238/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6521238/Furniture-of-America-Duarte-Modern-Leatherette-Dining-Chairs-Set-of-2-7670795a-49ed-4e89-a85c-ef3fb8e52845_600.jpg"
  ], 
  "description": "Add a contemporary touch to your furnishings with these modern\ndining chairs, which pair a neat design with a sleek chrome-finish\nframe. Available in black or white for a dramatic look, these\nleatherette dining chairs feature tough stainless steel frames for\nstrength and durability and practical, easy-to-clean upholstery for\nlow-maintenance use. Set includes: Two (2) chairsFrame materials: Stainless steelFinish: Chrome-plated finishUpholstery materials: LeatheretteCushion type: TightUpholstery color: Black and white color optionsStreamlined back leatherette dining chair seats all\n  sizesPadded seat and back with easy-to care leatherette\n  upholsteryLegs stand slender and sturdy in chrome-plated finishFelt pads recommendedDimensions: 40 inches high x 17.25 inches wide x 22.38 inches\n  deepSeat height: 18 inchesStyleModernMaterialFaux Leather, Leather, SteelFinishBlack Finish, White FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorBlack, WhiteFurniture Frame MaterialMetalFurniture PatternSolidGallery RoomGrey Matter, Lights on LemonSeat StyleUpholstered"
}