{
  "name": "Grain_Wood_Furniture_Valerie_63-inch_Solid_Wood_Dining_Table", 
  "price": "EUR 426.13", 
  "reviews": [
    "I bought the lighter color- the top of the one I received has a lot of white in the distressing but I quickly grew to love it. I have 2 kids that do HW, eat, roll cars and everything else on this table and it is standing up to the wear. Paired it with 4 tabouret dark steel chairs and 2 of the Lexi Parisian smoke grey chairs and the whole look really came together.", 
    "Loved the distressed wood grain on this table, was easy to assemble and is strong construction. :)", 
    "Table arrived and it was packed very nicely - the table is made in Brazil the top is made of pine (seems like) there's some sort of coating on the top that gives it a slight sheen but not shiny, kinda like plastic coating. The planks on the top are made to give it a farm house rustic look- uneven boards with indentations but with a soften finish. The legs are very heavy might be a different wood but they are nicely done - they are more rustic than the table top. If you wipe them with a paper towel pieces of the paper will get snagged. Just wipe them down with a soft cloth and it will be fine. The table had a broken piece on the underside b/c the screws to hold that piece in place were not put in and the wooden dowels that held it snapped during shipping. I was able to fix with wood screws and wood glue - no problem. Other than that I would of given it 5 stars - I didn't bother contacting overstock for a return b/c it was an easy fix.", 
    "Amazing quality for the price. Easy to assemble. We're a family of 5 and this table will be used for all our meals and homework etc., so I'm having a custom glass ($**) placed on top to preserve wear and tear. Overall, I'm very pleased.", 
    "The color of ours is rich and rustic. Arrived damaged underneath. Looks like the wood split where some screws were drilled at the factory. We decided it wouldn't effect the durability or looks of the table and didn't return it.Arrived in 5 pieces. Assembly was simple, you just have to attach the legs. Although assembly was simple it came with a very whimpy tool (I think it's called an Allen wrench) that you can only make a very small turn each time and the tool stripped make it worthless. We have other allen wrenches that fit but still it was taking forever to get the legs attached. My husband bought an inexpensive attachment for our electric screw driver which made it MUCH easier.Overall a nice piece", 
    "I have had compliments on the look of this table but was a little disappointed with the immediate chipping on the top. It arrived with wear on the corners from shipping/rubbing on Styrofoam and after 2 weeks there are small obvious chips in the finish from normal wear. Also, the boards that are glued for the top of the table are also uneven. I have tried embracing it as part of the barnwood look but it is pretty obvious.", 
    "This item is solid construction but it looks like fake wood. It will work for my uses but it does not look like real wood which really takes away from how much I like it.", 
    "Thrilled with this table, Its solid and in my opinion better than the pictures show. Love it! And a steel at this price!", 
    "Great Quality and great purchase.", 
    "Thick, sturdy table...great in farm house themed dining area. Warning, the bench does not match the table well. Table is more cream colored, bench (of same color 'name' is more light grey).", 
    "Great quality. Easy to assemble. No complaints.", 
    "The table is not perfect, there are uneven boards - not crazy uneven, uneven as in charming. All the little imperfections make the table more endearing to me!!", 
    "This table is well built and very sturdy. I Ordered the bar wood color and then ordered furniture of America Jolson Tradional natural wood grain side chairs and it matches the barn wood table perfectly. I am very happy with my selection.", 
    "Good quality, love the color, love how solid it is!! I plan to have thesis table forever. So impressed with quality and affordability.", 
    "Over all it is a very nice table. Assembly was easy aside from the fact the L shape screw driver did not fit any of the screw that came with the table. Luckily I had one that did.", 
    "The table was damaged when delivered but nice finish", 
    "Table is awesome and very sturdy!", 
    "This is a nice sturdy and good looking table for the money. It is nicely stained and has a durable finish. All the holiday guest provided compliments!", 
    "I bought this table for my apartment dining room. It's the perfect size and even prettier in person. It was easy to assemble and was packed securely for shipping. .", 
    "Distressed finish looks great. Table seems extremely sturdy, however; there was some damage to one of the supports underneath the main body. This damage looks to have been done during shipping. I determined that it was not critical to the structure and not visible during normal use. I was able to repair it with a couple of screws. I didn't want to deal with the nightmare of repackaging it for return.", 
    "so it arrived.....i put it together but is is so rough that it will snag any soft clothing you have on----as well as give you splinters. I got 3 splinters while putting it together. i do not like it. it i getting returned.", 
    "There was a couple of flaws with the table top when I received it, but I called overstock and within a few days they had a new one sent to me. The second table was perfect, just what I wanted!", 
    "The distressing on the top of this table is engineered into the finish, not the actual wool. It looks machine distressed, not natural at all. The distressing grooves and marks are so deep that there is literally no way I can feed a child at this table without having to use a toothpick to clean out all the little spots unreachable with a damp cloth. Also arrived with a rough, unfinished patch on the top, several chips, slivers of wood missing, and a huge piece of tape on the underside that was painted right over. The tape is peeling off to reveal a long strip of unfinished wood. Piece seems solidly built. Wish it arrived in better condition.", 
    "This is a really solid wood table, which is fantastic for the price. I purchased the Driftwood color, which was much pinker/redder than the photo shows. I initially hated the color but have gotten used to it by now, the table is otherwise really nice and it's the perfect size for my kitchen. As other reviewers note, it takes FOREVER to attach the legs with the bolts and is very difficult. Be prepared for a sore hand.", 
    "I like this table in driftwood. I wish the legs were a little slimmer. I'm a bit annoyed that the driftwood bench has been out of stock everywhere. I even contacted the manufacturer, and I never heard from them. Haven't found chairs to go with this table yet. Otherwise it is a pretty table. The driftwood finish gives it a lot of character and charm.", 
    "This table had to remain boxed until my studio was finished, so I only got a peek when it arrived, and was thrilled when I saw it. The table was so easy to assemble and all of my friends who have seen this table, ask me where I got it, and comment on how much they love the look. It's a fabulous find! I couldn't be happier with my purchase.", 
    "This is beautiful table. The reviews before mine are correct - it's not an even surface but since I knew that going in - it's not a big deal. It took me and my hubby about an hour to put it all together. The barnwood color is a dark dark color - and it looks lovely in our home.", 
    "Arrived quickly and packed well with plenty of protection. Assembly is simple, as it is only screwing in the four legs, but the allen wrench they supply to do the job is a joke, and if you used it it would probably take 2 hours to screw in those 5\" long bolts. A. Quarter. Turn. At. A. Time... (and your finger tips would be raw). I had some different wrenches and was able to get the job done much quicker using my own tools.As I was screwing in the first bolt I realized the holes in the legs were really too small and ended up stripping out the screw trying to get it in. I was able to back the screw out and drilled all 8 of the holes larger. Screwing in the bolts still took some elbow grease, but was able to get them all in without stripping the bolt heads.The table is a beautiful dark color and has a nice (although slightly fake looking) grain. Has a nice protective finish on the table top giving it a nice sheen, but not making it shiny. Perfect as a dining table, but would not be smooth enough to use for homework or paying bills unless you put a pad under your paper.Overall, a great value for the money. Got the two matching benches and two off-white distressed metal chairs for the ends. Makes a beautiful set!", 
    "Great product. Just as described, love the finish. Only disappointment is the photo does not show the uneven table top boards. Difficult dining with drinkware as the uneven board ridges are quite pronounced. Other than that, it is a beautiful farm style table and the family loves it as much as I.", 
    "Works perfect for the table", 
    "Expected the rustic grey to have more of a darker tone but it is white washed.", 
    "Exactly the look I was looking for. Easy to put together", 
    "Excellent for the price! Sturdy and beautiful.", 
    "This table easily seats six comfortably. I also love the distressed look!!!! Very heavy table, so unless you have brut strength like me, then you're in for a surprise!", 
    "my wife really loves this table", 
    "I love this table. I ordered it on a Monday and it was delivered on Wednesday. It was packaged very nicely and nothing was broken or scratched. Very easy to assemble. The table it heavy and sturdy. It will hold up against the roughness of my two kids. It is a great price for the quality of this table. I couldn't be happier with by decision to buy it.", 
    "I purchased this table for my new home. The first one we rec'd started to split and separate. We live in a dry climate, so that may be the reason why. Overstock replaced it no questions asked. The second table came damaged, so now we are on number 3. It is a great little table. There are spots here and there that received the final clear coat, but the stain didn't penetrate it, so you can see what looks like raw wood, but it is at least sealed. If I had paid a ton of money for this, I would be disappointed, but the style fits my home and a little mark on it fits right it with my rustic farmhouse decor.", 
    "Gorgeous. Very solid construction. As nice as it is pictured, much more beautiful when delivered. No problems as in other reviews with any type of odd lacquer on top of table, distressed wood chips, or odor. It is simply beautiful and great price. Just what I was looking for.", 
    "This table looks so amazing online....but when you get it you will realize that is a piece of &*(^. I am so disappointed! Is going back!", 
    "Again, too much white in the coloring. Thought it was somewhat darker. I did have a board damaged under the table that my husband was able to reinforce. This must have happened in shipping. The product is sturdy and structurally as I hoped it would be. Just wish I knew it was so light colored. Maybe with some age it will darken.", 
    "I had to order this table three times due to it being damaged in transit. No issue on Overstock. I finally received this table undamaged. It was super easy to assemble, took maybe five minutes, it also came with pads to put under the legs. I grouped this table with the Geneva Grey Floral wingback chairs, and some cream ones I already had. LOVE!", 
    "My husband loves this table! Was fairly easy to put together, although it arrived with a few wooden dowels broken. We purchased replacements and also had to wood glue a support board underneath the table top. We love the finished product.", 
    "I love the table. It is made well heavy study and easy to put together. The color was gray but looked blue. I don't think the color was accurate. I put a black glaze over it and like it much better.", 
    "distressing is a bit overdone, and will probably make cleaning more difficult than necessary... But a very handsome and very solid table.", 
    "This table looks exactly like the picture. I paired it with some off white colored distressed looking chairs. I couldn't be happier with this purchase.", 
    "Table is beautiful. Good quality. Only problem was that it was missing a screw. ;( Aside from that great purchase.", 
    "Love! I debated for awhile about buying a table online and am so happy I did!! Great price, well worth it!", 
    "Love this table, however, even with such a secure package, the table came broken underneath. One of the supporting boards was cracked. And both supporting boards was shift oout of place. During shipping, the small box containing the table legs moved and hit against the table supporting boards and break one and moved both out of place . That box needs better packaging support around it to keep is from moving.", 
    "great value and i love the look of the barn wood finish. i am very pleased with the table.", 
    "This table is beautiful, but it is as light as the lightest picture that is displayed in it's description. It arrived with a large crack on the top. I would have loved it if it did not arrive damaged.", 
    "Easy to put together hard to clean.", 
    "Things you should know before purchasing: 1. The table top is not smooth - to protect its details or for a smooth top, place a glass on top. 2. Sand down a little and color in with wood marker if you get a chip in it. Otherwise, nice table.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Grain-Wood-Furniture-Valerie-63-inch-Solid-Wood-Dining-Table/10238677/product.html?recset=e83d4c1b-9dde-4e46-b88d-eae8a2104121&refccid=M647KYMPX5MLGFKLRIOXHFHZAY&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10238677/Grain-Wood-Furniture-Valerie-63-inch-Solid-Wood-Dining-Table-7bc87120-b3c9-440f-9486-30eb36d9a08f_600.jpg"
  ], 
  "description": "Accentuate your home with a touch of traditional beauty with this\nValerie dining table. The elegant piece features four spindled legs\nand a plank top for a classic appeal. Four different finishes are\navailable, allowing you to select the one that coordinates well\nwith your existing space.Includes one table to accent your spaceRectangular shape easily fits into most standard dining\n  roomsMade from durable pine and other woodsChoose between barnwood, driftwood, rustic gray or off-white\n  finishesSeats six people comfortablyMeasures 31'H x 36'W x 63'LStyleCountry, Farmhouse, Rustic, VintageMaterialPine, WoodFinishDistressedShapeRectangleAssemblyAssembly RequiredSeats Up To6"
}