{
  "name": "Greyson_Living_Monoco_Microsuede_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 174.34", 
  "reviews": [
    "These four chairs said some assembly required It took two people three hours to put together Had I known this I never would have ordered them Also they are wobbly and no amount of reassembling helped Probably will give these to Goodwill as a donation Please do not order these chairs", 
    "I've had these chairs in chocolate brown for about 4 months now. They took a little time to put together. Getting the screws to catch the threaded inserts was a bit of a pain at times, but once finished, they were sturdy and looked great. Very happy with my purchase.", 
    "I will be buying another set of these chairs.... excellent quality... excellent price.", 
    "Nicer than I expected! Chair is both attractive and comfortable- and great price!", 
    "very sturdy and comfortable!", 
    "Third time was a charm! I ordered two others chairs before this one that I sent back. This chair is very nice & sturdy. My husband had it put together in 15 minutes. However, he will be using a screw gun for the rest of the 11 so that it will be much quicker. The beige color is truly greige.", 
    "Perfect for use by my window with a small drop leaf table.", 
    "Very well made, the color is pretty and the quality is better than expected. Loved this chairs.", 
    "These chairs are beautiful. A little difficult to put together.", 
    "Very nice looking chairs that were easy to put together. Look much more expensive than they really were. The microsuede is very soft and easy to clean. Most importantly, my cats don't scratch these chairs!", 
    "I have only opened one set so far and have not yet assembled them but the quality does seem very nice for this price point. Truly better than I expected. I was mainly concerned with the color. While I wish it was a little more on the ivory side it is a very light sand color and I think it will blend very nicely with the other furnishings.", 
    "These chairs look wonderful, and feel great. They were pretty easy to put together, and they look like real quality. A great value for the money.", 
    "This chair is beautiful and very soft to touch. It was a bit of a nuisance to put together lining up the screws for the holes but worth the hassle because it looks and feels very well made and is sturdy.", 
    "Easy to assemble. I like the material (suede-like). Color is a nice cream color and easy to assemble. I use it as a desk chair.", 
    "Really like the color and quality of the chairs. Not too bad to assemble once you get the hang of it."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Greyson-Living-Monoco-Microsuede-Dining-Chairs-Set-of-2/9396676/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9396676/Monoco-Dining-Chair-Set-of-2-3aee2d44-77fc-4739-a1b5-cd9b84113860_600.jpg"
  ], 
  "description": "Enjoy dining in superior comfort with this set of two microsuede\ndining chairs. A gently contoured back offers ideal comfort while\nthe soft microsuede and thick foam provides a luxurious feel. Its\nwelted seams and button tufting radiate elegance. Available in\nbeige, chocolate and camel, these dining chairs are suitable for\ncontemporary and classic color schemes.Contoured back provides superior comfortAvailable in beige, chocolate and camel microsuede upholstery\n  with black finish to complement all decorMade with hardwood, microsuede and foam cushioning for\n  ultimate relaxationFeatures classy welted seams on seat backsFeatures floor glides to prevent damage to your floorIncludes two dining chairsSeat dimensions measure 18\"H x 19\"W x 17\"DOverall dimensions measure 38\"H x 18\"W x 25\"DStyleContemporary, Modern, Transitional, UrbanMaterialMicrofiber Blend, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrown, Off-WhiteFurniture PatternSolid"
}