{
  "name": "Greyson_Living_Monoco_Leather_Chairs_(Set_of_2)", 
  "price": "EUR 201.42", 
  "reviews": [
    "I ordered two boxes of these chairs, 4 chairs in all on a Sunday afternoon. They came late Tuesday. I was so excited. I opened the first box of the Aqua chairs I ordered. They were nothing like the picture. I opened the second box. They were brown. I spent a long time on the phone with customer service. They issued a return number. UPS brought the label and left both boxes on the front porch. I affixed the labels and left the boxes on the porch. No pickup. I spent more time on the phone with a customer service rep. They issued a new number and *** picked up both boxes. Six days after 1 box has arrived at Overstock one box is sitting in Texas somewhere. Overstock won't refund payment for 2 chairs until the other two arrive. I give up. One box is sitting somewhere in Texas. I WILL NEVER ORDER ANYTHING FROM OVERSTOCK EVER AGAIN.", 
    "pro:Great quality easy to assemble beautiful con: The seats were not teal they are turquoise. Worked out for me because my home is all shades of turquoise, teal, aqua, sea foam etc. But if someone was matching them exactly they would possibly be disatisfied", 
    "Excellent quality with best possible price.", 
    "Great chairs for the price. Beautiful color and great quality, has an amazing feel. I highly recommend these chairs.", 
    "Sharp looking comfortable chairs add a nice new look to our conference room!", 
    "They say \"you get what you pay for\" so, we were a little nervous about these chairs. We specifically looked for gray leather for our remodeled kitchen area and had a hard time finding modern looking chairs. And if you have shopped around you know that just one chair can cost a lot. We were really surprised- they were easy to assemble and they look really great. The leather is real and they are decently made and sturdy to sit on. The legs are a dark mahogany black color. I don't know about the other colors but these look modern and elegant and went perfectly with our new kitchen. The price was amazing. They arrived really fast. We couldn't be more pleased.", 
    "Beautiful chairs. Exceeded my expectations.", 
    "We really like the chairs. Solid, quality chairs for the price.", 
    "NOT WHITE as indicated, sent them back immediately- VERY TAN", 
    "Easy to assemble, great looking chairs. Sturdy."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Greyson-Living-Monoco-Leather-Chairs-Set-of-2/10639670/product.html?recset=46972b2c-5cef-4292-a3c1-4a2b2738f603&refccid=QKLDIC7TSWG2ELKKAHAJ7FREUY&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10639670/Greyson-Living-Monoco-Leather-Chairs-Set-of-2-4815e0d5-8092-463b-a5e4-c0b70ddc6dd5_600.jpg"
  ], 
  "description": "The Monoco leather dining chairs are upholstered in sleek bonded\nleather in a variety of colors to match your current decor. The\ncontemporary design will add pizazz to your dining area, while the\ncontoured back and padded seat ensures your comfort. Material: Hardwood, Bonded Leather, FoamFinish: BlackUpholstery Color: Aqua, Gray, Black, Red, or WhiteIncludes (2) dining chairsAvailable in your choice of Aqua, Gray, Black, Red, or\n  WhiteBlack finished legs with sleek bonded leather seat and\n  backGently contoured back adds comfortStylish welted seams on the chair backCrafted of hardwood using sturdy construction to ensure\n  lasting durabilityFeatures floor glides to help protect your floorsSeat height: 18 inchesSeat width: 19 inches wide x 17 inches deepDimensions: 39 inches high x 19 inches wide x 26 inches\n  deepFurniture Pattern: SolidChair Type: Dining ChairsStyle: Contemporary, Modern, UrbanMaterial: Wood, Bonded LeatherAssembly: Assembly RequiredSet Size: Set of 2Chair Back Height: StandardExact Color: White, Red, Black, Grey, AquaColor: White, Blue, Red, Black, GreyFurniture Pattern: SolidChair Type: Dining ChairsStyle: Contemporary, Modern, UrbanMaterial: Wood, Bonded LeatherAssembly: Assembly RequiredSet Size: Set of 2Chair Back Height: StandardExact Color: White, Red, Black, Grey, AquaColor: White, Blue, Red, Black, GreyStyleContemporary, Modern, UrbanMaterialBonded Leather, WoodFinishBlack Finish, Grey Finish, White FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlack, Blue, Grey, Red, WhiteFurniture PatternSolid"
}