{
  "name": "Hodedah_Kitchen_Island", 
  "price": "EUR 146.73", 
  "reviews": [
    "The good news: we needed a narrow piece to fit our galley kitchen, and this was the only one I could find. It's 15\" deep, and most of the others were at least 17-18. So I was happy to find something worked. If you don't look too closely, it looks fine. And we're in a temporary rental, so if/when it falls apart, I won't be too upset. And it was cheap.NOTE: This is not an island!! The back is unfinished and looks it. The box actually said \"Microwave Cart\" which is more accurate. The bad news: boy, is this thing poorly made. It makes **** look like fine furniture. Any edge that isn't visible is raw particle board, and it's the really rough kind. The white foil is ragged at some edges, and two pieces arrived a bit crushed at the corners. The doors don't even have hinges, just four plastic spring things. And assembly. Well, I've assembled a lot of ** furniture, and this was just about the worst. You get a big bag of mixed hardware, including about 5 different screw types, several of which are very similar. (Suggestion: sort out the various types, count them, and label them with the key letters form the supply list.) There are few pilot holes for the screws, just vague dimples (fortunately the particle board is so cheap you can pretty much just ram the screws in) The instructions are tiny and inscrutable. By step 9 I was just winging it. It took about 2.5 hours to assemble. Do not try this if you are tired or cranky!", 
    "I bought this microwave cart/kitchen island and I regret it. Not only did it come in a ton of pieces, but it is extremely cheap and poorly made. After finally putting it all together, I stood it up and immediately the wheels snapped off. The drawers don't open/close properly and get stuck. It has space to store things, however, that is the only thing it has going for it. The product is extremely cheap and flimsy. I'm extraordinarily disappointed with this product.", 
    "Perfect size for microwave and the extra storage was a plus", 
    "When we got product, it was damaged in shipping. They replaced both items that were damaged, it just took a little while for all parts to arrive. It is a good product and has helped organize our small kitchen. I would recommend this product to all my friends.", 
    "heavy and ugly and flimsy", 
    "I received this item and realized I ordered the wrong color. It's okay. Too heavy to send back. I am 59 years old and put this together myself. Directions are hard to read. I had screws left over and I know I used the wrong screws for certain pieces. I could not make out which one went where. It took 4 hours for me; some pieces faster than others. In the end, it is a beautiful piece of furniture. I wish I would have ordered the white as I wanted but the beech color is still pretty. I was actually surprised that I made all the pieces fit. Everything is sturdy and I really like it. Hopefully, if you order this item, you will have someone to assist you.", 
    "This looks better in person, than in this picture. Got the cherrywood one and it is just the size I needed. The price was better than everywhere I had looked. It was delivered in about 4 days. Love it", 
    "This is a nice kitchen island, my only regret was i ordered the wrong color.", 
    "Nice and well constructed. The side add on should be flexible to fit on either side", 
    "Had 2 of the same pieces for the outter shelf. Even after contacting the company they tried to tell me it would work. It didn't so I don't have the outter shelf.", 
    "Took a long time to put together and was cheap. Finished product looks good but had to superglue some wood pieces back together as they fell apart.", 
    "Putting this together to quite a bit of time, it has a zillion pieces & the instructions are just pictures that leave a bit to be desired. If you don't have patience this product isn't for you. I ended up having my son come over with one of his friends after I was about a 1/3 of the way through & they were able to finish most of it in a couple of hours. Once together I was quite happy with the end product. Looks nice, has plenty of room for all of my tupperware, a large drawer & is very sturdy.", 
    "This is perfect for the kitchen that does not have much cabinet space. And looks very nice in my kitchen. Very well built and sturdy.", 
    "It was a perfect fit to my kitchen. Very roomy. A bit hard to put together but nice fit"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Hodedah-Kitchen-Island/10454212/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10454212/Hodedah-Kitchen-Island-d53e6411-2065-4f97-9dd8-daada20d036f_600.jpg"
  ], 
  "description": "Conquer storage challenges with this kitchen island from Hodedah. Enjoy the convenience of tabletop space for your microwave or toaster, while a single gliding drawer provides a place for utensils such as knives and spatulas. Store towels and condiments on the handy side shelves. The two-door, enclosed cabinet organizes and keeps accessories, dry goods, plates and baking dishes out of sight, but within easy reach.Kitchen island with sturdy MDF construction, available in a variety of finishes, provides long-lasting performance and enduring beautyEasy-slide center drawer keeps small utensils neatly at your fingertipsConceal pots, pans, baking dishes and small appliances in the two-door cabinet for a tidy appearanceHooded, dual-wheel casters let you move this 64-pound, multipurpose cart from room to room to meet your needsCart dimensions measure 35.23 inches high x 44.88 inches wide x 15.55 inches deep Material: MDFAssembly: Assembly RequiredCart Type: Kitchen CartExact Color: WhiteFinish: SatinColor: White, Red, TanMaterialMDFFinishSatinAssemblyAssembly RequiredCart TypeKitchen CartColorRed, Tan, White"
}