{
  "name": "HomePop_Parsons_Dining_Chair_(Set_of_2)", 
  "price": "EUR 151.06", 
  "reviews": [
    "I bought six of these chairs because I liked the simple classic styling. The price was too good to be true. In the past I had very positive experiences with everything I had purchased from Overstock. However, when I received these chairs, I sent them promptly back. The craftsmanship was extremely poor. The backs of the chairs had wavy fabric with no stuffing inside. The fabric was poorly attached to the frame. The shoddy workmanship was surprising and disappointing. It was a huge pain packing up the chairs again and hauling them back to UPS, but I did so on the same day I received them.", 
    "Ordered these and they are just perfect. Color was spot on. They are very durable and the quality was great for the price.", 
    "Great purple dining chairs that fit around my table for extra guests.", 
    "Love it. My Housr look great with these chair", 
    "We got these for my mom for Christmas and they are gorgeous. Beautiful fabric and very sturdy and comfortable.", 
    "Chairs are beautiful & add lots of color to our dining room! Well made & easy to assemble!!!", 
    "Ordering more very soon!!", 
    "These are my favorite color. They are perfect - comfy and plush. Make sure when putting together you screw the screws in evenly on each side and keep turning the chair round, otherwise will not be balanced. Once I got that right - oh occasionally I have to tighten the screws. Who knows maybe I'm not strong enough but I am one of those do it yourself gals; can't afford to pay anyone and kinda' self sufficient. Also the tiny screws on the floor which keep from scratching and make it slide easy have to be tightened sometimes too. I have cats so I cover with cloth placemats and vacuum every week or so. Works for me and is a shade darker than my table but no one notices and the comfort. Did I mention that these are really comfortable. I happen to like sitting at my table to read in the morning and do other things, like sewing or crafts and I can sit hours in one of these. Yes they are quite nice!", 
    "Bought these chairs to match my decor but the quality of the cloth is very bad. After 2 to 3 weeks of use I noticed the fabric/cotton knots.....", 
    "The chairs look really good once put together. Some of the tacking could have been more precise, but it's not noticeable when the chairs are assembled. One chair's legs are not balanced, however, which is why I rated this item a 4 opposed to 5.", 
    "Now have all the chairs for my small formal dining area. Still in love with chairs- have treated them with scotch guard -and I am very proud of my new dining area. Even after many uses the chairs are holding up very well - Cannot tell the difference between the two that are brand new and the two I have had for a month and used almost every day.", 
    "Looked around for a long time for upholstered dining chairs - and I was pretty amazed at the price when I found these - and the fact that it was for both chairs! I honestly was waiting for them to arrive and have them be super cheap - but they are actually REALLY nice and I've already gotten multiple compliments on them. They were fairly easy to assemble (and I did it myself) and they are comfortable to sit in. I would definitely recommend to a friend.", 
    "These 2 chairs are just what I had in mind-the Merlot wine color is beautiful and matches my other furniture-very easy to assem ble and I have gotten several compliments on them already!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Parsons-Dining-Chair-Set-of-2/8530409/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8530409/Rich-tan-mocha-velvet-Parsons-Dining-Chair-Set-of-2-89048ec6-1590-4777-b1e8-01822c2fef90_600.jpg"
  ], 
  "description": "Bring an element of class to your dining room with these Parsons dining chairs from HomePop. The classic styling fits well with traditional decor schemes, while the minimalist look blends seamlessly with contemporary decorative furnishings. Choose from a wide variety of available color choices and pattern options to complement your existing color palette.Constructed from mid-tone brown solid wood for durabilityVariety of available color and pattern choices to suit your existing decorUpholstery is easy to spot cleanSet includes two chairsWeight capacity is 250 poundsMeasures 38\"H x 19\"W x 23.5\"DStyleTransitionalMaterialVelvet, WoodFinishBlack Finish, Textured, Yellow FinishChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBlack, Blue, Brown, Green, Purple, Red, Tan, YellowFurniture PatternFloral"
}