{
  "name": "Home_Styles_Naples_White_Student_Desk", 
  "price": "EUR 225.16", 
  "reviews": [
    "Pros -- very easy to assemble, looks like the picture and looks good in the room we needed it forCons -- get what you paid for, the first desk we ordered had a huge gash in the corner and one drawer was literally a centimeter smaller than the other one (seriously I measured because it just looked off)I will say customer service was excellent and very receptive, they sent another desk out right away.but this one still has something off with the second drawer, but we are keeping it.overall it looks nice and for the money it gets the job done.", 
    "typical made in china product. very cheap material...", 
    "Desk is perfect for my needs: great size, easy to put together and doesn't weigh too much. The only problem was the manufacturer had mislabeled some of the pieces which required extra time to put desk together. So take heed. ;-)", 
    "I first noticed this desk on another retailer's website, but before I placed the order I checked Overstock. I'm glad I did as this desk was more than $100 less than the one I spotted on the other website. The desk arrived quickly and it was very well packaged and protected. It was an easy setup and my daughter loves her new desk!", 
    "I gave it four stars because it is a little on the soft side for wood and marks easy.", 
    "this desk is as advertised and described. It was easily assembled and is strong. My only issue was that a corner was damaged in shipping. I did not want to deal with the hassles of returns and replacements so I got out a sander and white paint to deal with the slight damage. It looks ok and my 8 year old daughter hasn't even noticed."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Home-Styles-Naples-White-Student-Desk/10898537/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10898537/Naples-White-Student-Desk-f08c053c-f28b-45f4-a59c-8a3e0b22c88e_600.jpg"
  ], 
  "description": "Home Styles Naples Student Desk features a construction of wood\r\nsolids and veneers in a white finish. Two drawers on easy open\r\nglides; only assembly is attaching legs Furniture Room: Office, BedroomProduct Features: Includes Hardware, Keyboard TrayMaterial: WoodStyle: Traditional, TransitionalAssembly: Assembly RequiredDesk Type: Student Desks, Writing DesksFurniture Frame Material: WoodExact Color: WhiteFinish: White FinishColor: WhiteDimensions: 30 inches high x 42 inches wide x 24 inches deepStyleTraditional, TransitionalMaterialWoodFinishWhite FinishDesk TypeStudent Desks, Writing DesksAssemblyAssembly RequiredColorWhiteFurniture Frame MaterialWoodProduct FeaturesIncludes Hardware, Keyboard Tray"
}