{
  "name": "HomePop_Blue_Slate_Large_Accent_Chair_", 
  "price": "EUR 259.90", 
  "reviews": [
    "chair a little hard. but it has become more comfortable for time. love the pattern and price", 
    "The chair is very attractive but very uncomfortable. It is just for looks, the blue is a little tough to find coordinating pillows but after much searching, found some to match.", 
    "Nice looking chair and quite comfy. Got 2 of these for an office reception area. They look nice and contemporary with the pattern and colors. Small Scale slipper chair. Thanks for the great price and fast ship Overstock!!", 
    "The color is just as depicted, gray with some teal. The cushion is extremely stiff. I don't think this is a chair made for comfort, but it looks nice. I wouldn't have bought it if I had sat in it first.", 
    "Love the design! Had to get rid of this chair as the blue is way lighter than it appears on the website. Was very disappointed! Also is fairly small..not what I was expecting from an accent chair", 
    "I have searched for chairs for more than 6 months, store after store and online. When I saw this chair the colors were exactly what I wanted. I was a little scared to order furniture online, simply because I didn't want to send back incase I didn't like it. Lets just say I was so impressed. They were very easy to put together, and very, very nice. They are gorgeous in my living room. Thanks overstock.", 
    "This is a great looking blue slate accent chair. Love the pattern!!", 
    "If you are looking for a white and grey chair with a hint of a beautiful blue, this is your chair. Gorgeous. Not so comfy, as the seat is hard, but as an accent chair it is great. Saw the same chair, only with arms at a high end furniture store for $995.!!!!! Came home and loved it even more.", 
    "Very nice, well made chair. I would recommend", 
    "The fabric colors are true to the picture online so it fits the color scheme in our bedroom. My objection is the firmness of the seat. It will take some breaking in to get to the point of saying it's comfortable. Right now it serves its purpose for putting my socks and shoes on. At some point I'll be able to sit and read. Blessings!", 
    "Love it, nice for any room.", 
    "Easy to put together. Great for price", 
    "These chairs are really pretty. They are very firm which is okay since they are more accent chairs that will not be used very often. They make a great addition to a more formal living room.", 
    "Very pleased with these chairs. Firstly, they were packaged very well. Easy to assemble. The pattern is lovely, and the lumbar pillow that comes with each chair is better than I expected for the price. They are plumply filled, so they should support someone nicely. Another excellent value from Overstock.", 
    "The chair is very pretty but the seat is very hard. It is not a comfortable chair to sit in. The construction is nice and the fabric is beautiful. The chair comes in two big pieces, and you screw them together. Then you screw on the legs.", 
    "Beautiful chair but hard as a rock to sit on! Would not recommend.", 
    "These chairs are beautiful. They are firm and sturdy. Assembly was required however it was easy to put together. These are great accent chairs. I would definitely recommend if you are looking for a piece to spruce up your place.", 
    "Nice for the price. Not at all disappointed!", 
    "This chair is awesome. The colors are vivid and exactly as they appear. The chair is sturdy and easy to put together. Love it!", 
    "Great little chair for the guest bedroom! Combined with the matching bench, they are exactly what I was looking for!", 
    "This chair is very pretty. Looks good in my living room.", 
    "This is a really nice looking chair. If you are wanting a comfy chair, though, this isn't it. The seat is extremely hard. I was expecting it to be more squishy.", 
    "Great design, great colors, and comfy! I am using this chair as an accent to a charcoal gray sofa. I am so happy with it! Delivery was prompt ( as always with Overatock.com)."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Blue-Slate-Large-Accent-Chair/10295476/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10295476/HomePop-Blue-Slate-Large-Accent-Chair-d50a30f5-3463-4d51-bb52-5529d46578e6_600.jpg"
  ], 
  "description": "This elegant accent chair features a grey floral design on a white\nbackground. Welt piping adds durabiltiy and comfort. Large accent chair with coordinating pillowBeautiful trendTonal grey linen-like background with a large slate grey and\n  light blue damask patternFabric has soft grey vintage backgroundModern slipper chair design with welt pipingSoild wood legs in warm patina grey finishAdd a decorative accent chair anywhere in the homeBedroom, living room, family room, home officeDimensions: 27 inches wide x 35 inches high x 30 inches\n  deepEasy asemblyOther items available in the same fabricCare instructions: Spot cleanChair Type: Accent Chairs, SleepersMaterial: Foam, Fabric, WoodStyle: Modern, TransitionalAssembly: Assembly RequiredColor: Blue, GreyStyleModern, TransitionalMaterialFabric, Foam, WoodChair TypeAccent Chairs, SleepersAssemblyAssembly RequiredChair Back HeightStandardColorBlue, GreyFurniture PatternIkat"
}