{
  "name": "HomePop_Tan_Nail_Head_Parsons_Chairs_(Set_of_2)", 
  "price": "EUR 160.32", 
  "reviews": [
    "I have never bought anything online prior to this purchase and could not be happier for a first tiem experience! Chairs are exactly as described, colors are just as pictured. The chairs took about an hour to assemble (4 of them) and are very sturdy and comfortable. Very pleased and satisfied not to mention the great price for the pair!", 
    "These chairs are great! I suggest that when putting them together to use a little wood glue, don't tighten the screws all the way, just tight enough to sit on the chair and wiggle around a little bit, tighten and repeat until screws are tightened. These chairs look amazing!", 
    "Love the chairs, especially for the price! The color was the only surprise, otherwise they are exactly as advertised. They are sold as 'tan' in color, but actually, when the box arrived it said 'sand', and that is much more accurate. At first I was a little disappointed by that, but it wasn't worth the hassle of sending them back. Now I like the lighter color anyway, so it all worked out well for me.", 
    "I bought these chairs to go around my kitchen table and I absolutley love them. The fabric closley resembles the color of burlap and this is what I was looking for. These chairs can be used to dress up any table. They are very comfortable and sturdy for chairs that are delivered disassembled. Great purchase.", 
    "I use them in a conference room with a reclaimed wood table- they dont get a ton of use, so I think they're fine. They're a bit small but fine for short periods of time.", 
    "One of the chairs is great, put together easily, no problems. The other one...holes did not line up so unable to get two of the screws in but doesn't affect stability I don't think. The worst thing about this chair though, it sounds like you are sitting on paper when you sit on it, both the seat cushion and back cushion. It's awful, the crumpling paper sound. I think they didn't remove some sort of cover before sewing the fabric over it. The other chair doesn't sound like this at all so I know something is wrong with this one. But now that they're both assembled, and its a huge box, not sure how to return. Very unhappy. Would not purchase again, even though I like the appearance of them.", 
    "We returned these chairs. They are not upholstered very well and just do not seem sturdy enough for regular use.", 
    "These chairs are not worth what you pay and are very hard to put together and if you get one that is broken they will not or could not send the replacement part. This the worst thing I have ever had to deal with. I am being told that I will have to take all the other five chairs apart and pack them in boxes that I do not have any longer to send back. Do put these together until you know you have all the parts and they work.", 
    "This pair of chairs is very nice. They look much nicer in person than on the site. They are not the most comfortable chairs or the highest quality, but very nice for the price. I purchased these chairs as accent chairs. They will not be sat in most of the time, but are comfortable enough for the occasional use.", 
    "Really difficult to put together, and nail heads are all falling off. The seat has this strange bubble in it when u sit. They look good and will do for now considering the price. Not sure how long they will hold up.", 
    "There are a lot of great things about these chairs.. the fabric is a good neutral color and can go with gray or brown/tan, they're a good size and simple design. But the website doesn't show a photo of the back, which I assumed was simple and clean, but there's a rectangle in the middle and the fabric kindof folds over to it, which wasn't simple enough for what I was looking for. So I'm returning them for that reason. If that doesn't bother you then I'd recommend them!", 
    "A little difficult to put together at first. One chair wobbles on my wood floor if you are not sitting on it but they are beautiful.", 
    "I had bought a pedestal round table, these chairs was an addition hoping all would match well with the color of the wood. I was pleasantly surprised at how nice these chairs are. They are \"light weight\" if you are looking for a heavier quality keep this in mind. I put them together myself (yes, I'm female) with no problems. The \"nail heads\" makes these chairs standout.", 
    "If you bought this identical chair at Pottery Barn it would be at least double the price. This is a beautiful color with the studs on the side and nice legs. Only reason its not a 5-star is the seat isn't very soft - cushionY, but its not hard or uncomfortable either.", 
    "I purchased 4 of these and then bought 2 more. They look very good for the price paid. We do not sit daily at the dining table so its ok. They are a little flimsy and when you sit down on them the stuffing feels cheap. I think if you sat on them daily or you were a heavy person they would break down. Happy with my purchase.", 
    "Chairs are a pain to put together, the connections aren't threaded properly and overall the chairs aren't sturdy.", 
    "I love the look of these chairs. They match great with my solid wood table. They however, can be a bit wobbly if not put together properly. I was worried about stains. They appear to have some type of resistance, have been able to wipe up some spills. I purchased 6 for my kitchenette, which is used on a daily basis. so far so good. I would have like the cushions to be thicker.", 
    "I love those chairs. Initially I bought 2 and as soon they arrived I ordered the rest to complete my set. Color is a bit darker than in the pic.", 
    "These are a darker tan than the photo.", 
    "As a newly married couple, we didn't want to splurge on anything too extravagant. These chairs DO have great style and will suffice for a while. The fabric and leg color is lighter in person. The fabric is more of a \"sand\" color than an olivey-tan as pictured. The legs are a medium shade as opposed to the dark color portrayed. Comfort wise, these chairs are awkwardly bouncy and you can feel the bar across your lower back, however they okay.", 
    "The chairs were a snap to put together, maybe an hour or so of time for 4 chairs. As other have said, don't tighten until all the legs are in place. I also agree that the color is extremely light. The box does say sand and I although I love it, I am planning on a buying fabric protector. All in all, a great, stylish chair for not a lot of money.", 
    "Nice Set of the Dinning Chairs. I've been shopping around for Dinning Chairs for sometimes. Compare the similar chair to local retailers and their price was 99-120 a piece. We weren't sure how shopping furniture online without looking at the actual product would be. Thankfully there are product reviews from other customers provided the positive reviews and the accurate pictures provided on the Overstock. Fits nicely in my dinning room with other dinning furniture.", 
    "These chairs look great with my new antique dining room table! I purchased the tan color, but when they arrived, the boxes said \"Sand\" on them and they were much lighter than the picture. Sand doesn't even appear to be an option on the website. I would have returned them and been very disappointed, but I actually ended up liking how the Sand color matched with my dining room better. They are kind of a pain to put together properly so that they are good and sturdy, but with the help of my husband all went swimmingly. Overall, very happy with the product, but buyer beware of color switch-ups.", 
    "These chairs are great for the money. They are definitely tan and a burlap type fabric. They were easy to put the legs on, it just takes a little time to get them leveled. The legs are a reddish color as shown. The nail heads add a lot to the look. They are a good choice for going with different styles of furniture since they are neutral in both color and style.They came packaged very well in the time I was told. I'm glad I made the purchase after looking for this type of chair at a reasonable price.", 
    "These look great - and much more expensive than they actually are. Only two issues: they were more difficult to put together than assumed, and they aren't 100% sturdy. Still, for what I paid.....", 
    "Bought these because the table I purchased didn't come with chairs. These matched perfectly. These chairs are very sturdy and were great for the price.", 
    "these chairs are comfortable and sturdy", 
    "Have had these chairs for a while. They look nice, and have a cool Industrial/Rustic thing going on but are not really very comfortable for a social dinner.", 
    "great looking chairs. Just a little hard to put together.", 
    "Had these for a \\while and they are certainly holding up and they look expensive and good quality", 
    "Im using these chairs in my vacation home at a rustic dining table. They are a great price, easy to assemble and fit my decor. I couldnt beat the price. They are the right height to sit at a dining table but Im not sure how long they would last if used daily. Im happy with them", 
    "Chairs look better than I could have imagined, love the textured fabric!", 
    "While these chairs were a job to put together, in the end they are just lovely and I am ordering two more to complete the look we wanted around the dining room table without having to add bridge chairs when we have company. I would definitely recommend them.", 
    "I bought these chairs as end chairs for my farm house dining room table. They are perfect! They were super easy to put together and are extremely comfortable! Perfect addition to our home! I plan to buy more.", 
    "Good for the price. Comfortable, neutral and easy to assemble.", 
    "Very easy to put together.", 
    "These chairs arrived quickly! they were easy to assemble and look great!", 
    "Great for the price. Color and quality were surprisingly pleasing but cushion was a little bouncy but I am sure they will become more comfortable with use.", 
    "Great addition to my dinning room.", 
    "I ordered 4 chairs, they came on time and were fairly easy to put together. They look better than the picture...they are a nice quality and I would highly recommend this to anyone looking for a high quality chair and a budget price. Love them!!", 
    "easy to put together, great looking, seem pretty solid, had them for about 3 weeks and nothing to complain about. everyone compliment them", 
    "I bought 2 sets of these (4 chairs) to go with my newly refinished dining table & bench. Torally transformed the look of the dining area - very \" Rustic Chic\". They were incredibly easy to assemble (although the included instructions were pretty much useless - but it's easy to figure out on your own). Surprisingly comfortable & sturdy. The wood legs have an orange-ish honey shade to them, but the total package is so awesome, I barely notice.", 
    "We wanted some classy rustic comfortable chairs to lighten up our industrial dining table and these fit the bill. Easy to assemble and they look amazing. We ordered two to make sure they were what we were looking for and immediately ordered two more after we saw them with the table. Great chairs", 
    "Fabric is a good quality. The color is as pictured. They were easy to assemble. Overall a very good value.", 
    "Perfect for our dining table.", 
    "The chairs were packed in a tiny box, when we opened the box the legs were broken.", 
    "For the money these chairs are an excellent value. Very classic, comfortable and look just as pictured. I purchased 4 and the only reason I didn't give this a 5 star was because the very last chair I put together has an issue with the screws going all the way into the pre-drilled holes. They are about 3/4 in so it remains to be seen if they hold up.", 
    "Nice looking chair for the price! Easy to assemble", 
    "I am very impressed with these chairs. You do have to assemble them.", 
    "Great looking chair for a great price. Assembly directions left something to be desired. But I would purchase again", 
    "good quality and easy to put together", 
    "Bought 6 for glass dining table at beach house. Chairs completed the look I was hoping for. Putting chairs 2-5 together was easy after figuring out the tricks on chair 1. Tip: it is important to wait till the end to tighten connectors!", 
    "These aren't heavy, fine furniture. They are lightweight but of solid construction and they look amazing. You are getting a great looking, stylish chair for the price. The assembly was fairly easy to do with very clear directions. I mixed these chairs with wooden ones at my dining room table and I simply adore them. They are a great value!!", 
    "So far so good. Chairs are comfortable and look exactly like the picture.", 
    "I placed these chairs with four chairs and a table from the Aspen Collection (purchased from O.co). These two chairs soften the wood table and chairs and make for an elegant and classy dining table. The chairs were a trifle difficult to put together because you kind of put four of the screws in blindly. These chairs came packaged very securely with minimal styrofoam and lots of cardboard, which means 95% of the packaging is recyclable! The chair seat padding it quite puffy, my kids like sitting on these chairs because it gives them more height at the table. The color is more sand than tan -goes well with a darker table. There are adjustable pegs on the bottom of the legs so you adjust for unevenness. All in all another great purchase from O.co!!!!!", 
    "Love my chairs! Just what I wanted! The fabric is burlap like and the nail heads are great!", 
    "Chairs are lovely....easy to put together and very stylish and well made", 
    "We love these chairs. Looked far and wide and these were what we wanted to dress up our rustic dining room table. We're not using for every day chairs. Easy to put together, all parts were included, no scratches, no tears. Color was what we expected. Great price compared to what we were looking at in retail stores. Bought 6.", 
    "The wide weave linen reminds cats of sisal, so they get scratched and pulled a lot! The bottom seat cushions are a bit stiff, but overall these chairs look great. I bought one set, would like to get another, but have to think hard about it since the cat wants to destroy them.", 
    "I bought these chairs to match my new kitcken table and I am in LOVE with them. To start I just ordered one set to see how I liked them. Shipping was very timely and assembly was quick and easy. I will order another set to finish out my kitchen. I love the fabric on the chairs and the nail details on the side are beautiful. They are very comfortable to sit in and the perfect high for a normal table.", 
    "great chairs for the price. I decided to slip cover them which was my plan to begin with-but I like them without cover too. not sure how well the fabric would hold up without slipcovers. very easy to assemble! great chairs", 
    "Beautiful chairs! Easy to put together and seem quite sturdy. They are less of a sand color than a light oatmeal burlap, which I gathered from reading other reviews. Chairs of this material and quality often go for over twice the price. Very happy with the purchase!", 
    "Really great chairs! I ordered these prior to Thanksgiving because we knew we wouldn't have enough seating! They're super nice. In fact, planning to order two more to go with the four I already ordered. Very comfy...not super wide seats so you can fit several.", 
    "Other than having to put them together(luckily with the help of my daughter) I love these chairs!!! They are exactly what I wanted :)I would highly recommend them to anyone that needs a dining chair in a neutral color palette and for a smaller space. And they are real wood!!! Great value.", 
    "A little assembly but great looking chairs for a great price", 
    "They are what I expected for the price. I knew I wasn't purchasing high end chairs and didn't expect high end product. They were easy to put together, I did it myself. The fabric has some pretty deep wrinkles in it that I am still trying to steam out and some frayed edges, but like I said I knew what I was purchasing. Overall good for the money.", 
    "The chairs look beautiful. However, they don't seem to have enough foam on the backs, can feel the supports. The cording looks good but not sure how it will hold up when pulling chairs in and out. The nail head trim looks nice on the seats but indents on the chair back sides. Just afraid these chairs won't hold up.", 
    "I purchased these chairs for my rustic dining table as the side chairs. I LOVE them!!! What a value these chairs are. They are well made, very rustic looking, and the cushioning is very firm and super comfortable. These were fairly easy to put together. They slide well on our floor and the color is true to the picture. The fabric is a tan burlap-like linen. For the price these chairs can't be beat. I wasn't expecting to like them so much. I was pleasantly surprised. I would recommend these to anyone. These chairs could go either rustic, traditional or modern. Really just a nice chair.", 
    "We are very pleased with these chairs. We received them quickly. They required some assembly, but it wasn't difficult. The chairs look more expensive than they actually are. The nailhead trim is attractive, & we really like the fabric. Would absolutely recommend them. Thanks Overstock!", 
    "The chairs look great in our little dining room. Assembly required patience, like other reviewers noted. You really do have to finesse the screws...tightening here, loosening there, in order to get the legs sturdy and grounded. Well worth the time required though. For the money it was an awesome value! Highly recommended.", 
    "I really didn't expect to love these chairs. The style, design, quality, ease of assembly, color & fabric all exceeded my expectations. They are a tremendous value as they truly look & feel like a high quality chair. I purchased 5 sets (10 chairs total) and didn't find that 1 chair was \"funky\"- they were all consistent in finish (fabric, wood stain, etc).", 
    "I received these chairs about a week ago. I ordered four to pair with an antique dining table I recently refinished. I must say, the style of the chairs makes them a great compliment to the table, and I found them very straight forward to assemble. Without any assistance, I assembled the four chairs in about 1.5 hours. These chairs are a fantastic value considering the reasonable price and great quality. I found the color a little lighter than it appeared on my computer, and the chair cushions quite firm/sturdy. I will definitely order more products from Overstock.", 
    "These are really pretty chairs that nicely dress up and update our dining room. Because they can be seen from the living room, I needed them to coordinate with that furniture, too. The fabric has a tweedy linen look that blends a few different shades of beige that changes with the light. I think that's why so many people have commented on the differences in color. The details make the chairs seem more expensive than they are. Like a good pair of khakis, you could dress them up or dress them down with what you put with them. These are really a good value for the money. It took a few hours for my (not so handy) husband to put six chairs together but much of that time was spent unpacking and getting the parts together. They were well packaged and protected from transit damage. I am very happy with this purchase and am thinking of buying a couple more!", 
    "These chairs are much nicer looking in person. The color online doesn't even compare to how they really look. much lighter and more prone to stains than what is shown. I had a baby shower and a few kids were there, and got some chocolate on my chairs before I was able to put on a protection spray. They cleaned really well. But would still recommend a cover or treat them before use if you have small children or husbands that tend to spill :)", 
    "Good deal for the price. We are using them in an area that does not see daily use so they should be fine.", 
    "Not the most comfortable chairs but great value, look great and do the job. Wouldn't purchase for everyday chairs. We use them as end chairs and they work great?", 
    "These chairs blend very well with my existing dining room chairs and the quality is good, especially for the price. I am very happy with my new chairs.", 
    "I was suprised... I've searched high and low.. these are a great price... the color perfect... pretty sturdy once assembled These are used a a rarely used dining table...", 
    "My 12 yr old daughter and I put these chairs together. It was easy and sturdy when done. The seat is plush. I was expecting a lower quality product but this has been an excellent purchase. The color is a nice beach mix of sand and tan. They have turned my very conservative dinning room into a chic, modern and warm room. Now my dinning table looks ellegant and trendy, I recommend these chairs, highly, especially for the price. I do not buy site unseen, this was my first purchase and I was pleasantly surprised.", 
    "for the price...we are very pleased with the product.", 
    "Chairs were a good deal for a medium quality chair! good price!", 
    "Nice chairs. Fairly easy assembly. Love the nail-head design. Probably better suited for smaller bottoms.", 
    "Hello, these chairs were a great purchase and a reasonable price. They are very comfy and would definitely recommend them to a friend. The only thing is the chairs are not Tan in color, they are more like a cream, but they are still perfect for my kitchen decor.", 
    "The styling of the chairs is really nice. The added nailhead accent makes them look like expensive chairs and the fabric is quite pretty. The chairs are pretty well made, but I don't know if heavy use would be tolerable for the long haul. They work perfectly for my use, that is, in a formal dining room where they are used about 7-8 times a year. They look really great with the long antique (kind of funky) table I am using them with. It's about 11 feet long and I purchases 8 chairs, and they fit perfectly four to a side. Shipping was very fast and assembly was quick and easy. I would suggest using some wood glue during the assembly process to make them a bit more secure. For the price, you can't go wrong!!", 
    "Nice chairs for the price! The color matches completely the color on the site.", 
    "I'm impressed with quality of wood and fabric. Good price too. Putting it together was easy, too.", 
    "I was really impressed by the quality of these chairs. My expectations were not too high in spite of other glowing reviews so I was so happy when my husband put them together and they looked great!", 
    "These chairs are beautiful. The nailhead detail really adds a lot to the looks. The roll trim on the back really gives them a very polished look. They look great from the back, front or any angle. The padding is perfect. We were very amazed at the quality for the low price. I highly recommend these chairs. Be aware however that they come 2 to the box so they take muscle to move while still packaged. My husband would have liked a delivery Genie to carry them up the stairs to our 2nd floor apartment. :)", 
    "These chairs are gorgeous! I would buy again and recommend to anyone. I have been very pleased with them.", 
    "Very happy with this purchase. Hubby had no trouble putting then together.", 
    "These chairs are a great deal. Installation took about one hour, and while it was helpful to have another person assisting, it wasn't absolutely necessary. Having your own hex key / alan wrench makes the installation a bit faster than using the one provided. We've sat in these chairs several times and they are comfortable while providing good support.", 
    "Very good chairs and good for the price. It matches our dining perfectly and we got a lot of good comments from friends and family. Highly recommended.", 
    "These chairs are great. We needed an inexpensive set of chairs to replace our existing dining room chairs. These not only worked with our hand-me-down table, but the nailhead trim matched our living room furniture. The color is lighter than the picture indicates, but it's a nice neutral, so the color still works.", 
    "Great quality for the price. Had some trouble with assembly but had some advise from previous buyer.", 
    "These chairs look very similar to chairs sold at high end stores. I bought four for the price of one at one of those high end stores. They were not difficult for my husband to put together and I am very pleased with them.", 
    "The chairs came with fairly good drawings for assembly; all of the screws, rings, etc. were there including the Allen wrench to install them. The covering is good but probably will not hold up too well--kind of rough and will show wear, but I am planning on doing a slipcover for them anyway. All in all, a good price for chairs that will not be used too often."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Tan-Nail-Head-Parsons-Chairs-Set-of-2/6559824/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6559824/Tan-Nail-Head-Parsons-Chairs-Set-of-2-8691cc4c-75bb-40cc-bac4-0d80a479a3a8_600.jpg"
  ], 
  "description": "Introduce a statement piece to your home with this set of tan\nparsons chairs by HomePop. The nail head trim adds personality\nwithout sacrificing elegance and sophistication. The plush linen\ncushions offer comfortable place to sit, while the sturdy wooden\nlegs provide reliable durability.This set of two Parsons chairs can be paired with a dining\n  room table or as extra seatingTan linen upholstery adds style and eleganceChair legs are solid wood for sturdiness and durabilityDark wood finish fits in nicely with most room decorSeats are cushioned for extra comfortNail head trim adds personality and flairChair dimensions are 38\" by 19\" by 23.5\"The seat height is 19.5\"StyleContemporary, NauticalMaterialLinen, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorTanFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleUpholstered"
}