{
  "name": "HomePop_Blue_and_Brown_Paisley_Parson_Chairs_(Set_of_2)", 
  "price": "EUR 143.26", 
  "reviews": [
    "They were shipped in record time. Arrived in good condition. I'm a female and over 60 and had all 4 put together in less than 3 hours! Easy to follow instructions. I read reviews and was afraid I would have to get someone to help but it was so easy. The color was great. The only thing I wish would have been different was on back of the chairs, the fabric was not lined up with the main design in the center. I'm probely the only one that will notice it. I have ordered other things from \"Overstock.com\" and have been pleased with it all.", 
    "We love the chairs, they match our dining decor perfectly. We could hardly wait to received them and they were fairly easy to assemble. My husband put all 6 chairs together in less than and hour. The chairs have complemented the elegant/comtempary look in our home. The price for the chairs was very afforable, we are happy with the purchase.", 
    "I read the reviews of the others prior to ordering the chairs. I knew that the coloring would not be bright, more muted, but I decided to order them anyhow. They are great chairs! Very comfortable, according to my therapy clients (I put them in the waiting area). I think the coloring is subtle but very beautiful. My office is blue and chocolate brown and they look wonderful. Very pleased with the purchase!", 
    "I was so looking forward to getting these chairs for my dining room, which was just redone. when I opened the carton, i took out just the first piece: the chair seat. what a shock! it was truly ugly. The colors were puky and so dull looking that it did not even look like the chair online. it was made so badly, it looked like a child covered the seat, it was that bad, And it ws so flimsy i could not believe it. i ordered 3 different styles from 3 different web sites. I can tell you that the other styles were well made and truly matched the pictures online. To make matters worse, i have to pay to return these horrors. Shipping was free, and i did not know that i would be charged to return them, or i would NEVER have ordered them. On top of that, i have to take them to a UPS center to return, that it the only way. What a crock!", 
    "I ordered a few of these for our dining room. Looks really good. Seat is very stuffed and firm but comfortable. One chair was just not right - wobbly and the back didn't attach to seat correctly. Overstock.com got me a new chair without any hesitation. Great customer service. I would recommend chair - good for what you pay. Our intention is not to keep these forever though - I don't think they will last more than a few years with regular use.", 
    "I bought 3 of these chairs from another company some time ago. That company stopped stocking them. I have been on a quest to fine more and was delighted to find them at Overstock.com.", 
    "Love the chairs. They were easy to assemble and very comfortable. I wanted something with a blue pattern. These were perfect.", 
    "I read all the reviews & took a chance...wish I hadn't! The color is mentioned in almost all previous reviews & that was the only thing that seemed accurate. They are more of a sea green color w/a blue tint. Don't expect a true blue...I didn't, so the color was perfect when I opened the box. I assembled the first chair, easy enough..but after sitting it upright, I realized how horrible the quality was. It was NOT comfortable, felt rickety, I couldn't get the chair to level (even adjusting the bottom) & worst of all, the fabric (on the back) was so misaligned, I think my 8 year old could have done a better job at making these. I wanted to write this review so others would know what to expect. I value reviews & most people mentioned color on these, only a few mentioned quality & it's bad. So, buyer beware...\"made in China\" & clearly no pride went into these! It's a shame because they could have been cute chairs w/a little more attention to detail.", 
    "We ordered 14 of these chairs and received them within 5 days. After we sprayed them with Scotchguard, three of us put them together. It took us less than 2 hours to get them all done. Very easy to put together! Quality is very nice. The colors are perfect for our dining room. We put a couple of chairs in other rooms and the colors blend very well and match up to the wall colors in any room. We are very pleased with these chairs.", 
    "Good product for the price...LOVE IT....colour is nice and they're well built !", 
    "The chairs are pretty and sturdy. Very good quality especially when compairing with the price of other places.", 
    "I ordered these chairs for my kitchen, which I recently remodeled. I wanted something elegant yet modern, and these seemed to fit the bill. However, the colors were much more dull than in the picture. What is called \"blue\" is really more of a dull grey. I'm definitely disappointed in the color, but I still think they'll look OK in my kitchen so I'm keeping them.", 
    "be carefull in ordering quanity. I needed 4 chairs which i thought i ordered not realizing that by ordering 4 i got \"8\" as there were two in each box. They are lovely and rich looking and great with sofa and chair in my living room.", 
    "I love the design and the fabric of this chair. it's super easy to assemble. I did both chairs in less than half an hour. the seat is not very soft and your bottom sinks into it easily (i'm 135 lbs). if it wasn't for that, these would be the perfect chairs.", 
    "I ordered 4 of these chairs...I got them in a couple of days, they were fairly easy to assemble and look great. They are just have a little less color - more of the faded look - than what it appears like in the pictures...all in all - very happy with purchase", 
    "I was pleased with the look of the chairs. Color matched my dining room perfectly. Shipping was punctual. Assembly was relatively easy. One chair had a screw that wouldn't align properly & has since fallen out.", 
    "Absolutely gorgeous! Love my new chairs. Great price.", 
    "The chairs were easy to assemble and are quite elegant looking ... will fit in with our other chairs", 
    "Beautiful. However I have to send 3 carton back. Not because they are defective but because the price was so good I assumed the cost was per each and not a pair so I ended up with 12 chairs instead of six. My mistake.", 
    "These chairs are well made and the design fits many different decors.", 
    "Just got six of these chair and they seem to be good...like the design as well as the colors.", 
    "These chairs are beautiful, more so in person than the pictures show", 
    "I love these chairs. The blue is a little different than what is shown, but it still looks great with my decor.", 
    "The chairs are very nice addition to the dining room. Sturdy, nice fabric and can't beat the price. Very happy with this purchase.", 
    "Beautiful. Sturdy. Time involved to assemble was worth it.", 
    "Great chair... Looks exactly like picture.", 
    "Was perfect to bring together my grey table top with the brown in my living room.", 
    "Nice fabric, thick, busy brocade won't show too much dirt. Easy assembly, 2 more screws than other brands makes for a stronger chair. The legs are pretty uneven, they do have levelers which is a great idea, but they still wobble. I have thick carpet so it's not noticeable. I would rethink it if you are going to put them on bare floors.", 
    "The chairs were delivered quickly and they were exactly what we wanted. The colors are very muted and lean towards a pale green rather than blue. It does take about 30 minutes to assemble each and takes a little strength to tighten the screws, but we did all 6 and are very happy with the result. The fabric seems sturdy, although since this is for a dining room, haven't sat in them much.", 
    "Very beautiful and elegant, a little hard to put together so be prepared to spend some time. Completely worth it.", 
    "Very attractive and comfortable!", 
    "Im not in LOVE with these but Im in like. They look good and match my decor.", 
    "Purchased 3 set of these chairs. They are true to the color shown in the picture. They look much more expensive then they are. Great buy!", 
    "I found the colors to be true to what I was looking at on the monitor, and what I was expecting. They do look greenish rather than bluish on my monitor, but I see why the description says blue. It's sort of a blue/green color. There is a texture to the fabric which I like and they were not hard to assemble though I was missing a washer but did alright without it. Compared to other dining chairs I own, these are quite small (narrow especially) so check your measurements carefully. Sometimes small chairs are exactly what you are looking for since many chairs these days are oversized. The reason for taking off stars: they are very overstuffed, it's like sitting on a mound. I expect this will soften over time but for now I feel like I'm sitting on an exercise ball. Also, a lot of loose threads. After trimming them it's okay, no actual damage to chairs. And even though dimensions are given some indication that these are the on the smaller side would be nice. I'm not sending these back, and I don't feel like I wasted my money really, the price is fair and they are what they said they were. But they are not really what I was going for. If you can afford to pay a little more, you can probably find a better chair.", 
    "As soon as I opened the box, I immediately understood what the other reviewers were talking about. The color is faded, chair cushion looks old and cheap. If you are looking for a blue and chocolate brown chair this is not it… Its is more mint green and faded brown. They are going back immediately and stinks that i have to pay for return.", 
    "Pretty colors very classy", 
    "We moved and had a much larger dining room, which dwarfed our old dining room set. Bought a large dining table and these chairs are perfect! Can now seat 10 people around our table! Nice quality and were easy to assemble. Pretty pattern and material is very good quality! Love them!", 
    "Purchased for client. Price was perfect for chairs. Quality was very good, no problems. Color was true to picture.", 
    "Chairs arrived in a week, and although I am 80 years young, was able to assemble them with no trouble at all. They look very nice in my dining room and go well with my pine country furniture.", 
    "This chair is excellent quality very sturdy fabric looks very expensive great value for the price!", 
    "Nice durable material. Better then expected! Love them.", 
    "Comfortable and nice looking love them", 
    "The look expensive,even though the cost is low. Easy to Assemble and sturdy. I couldn't be happier with them", 
    "Beautiful chairs and very comfortable. The legs are a little hard to get tightened, but once that is accomplished, they are very nice and I'm happy with the purchase.", 
    "These chairs have no blue in them. They photograph much differently than they look in person. The part that looks blue in the photo is a seafoam green in person.", 
    "I was searching for 3 chairs to complete my mid century walnut dining room table. I wanted to introduce a warm shade of blue to the dining room without being overbearing. These chairs fit the bill! Not only are they comfortable, but they're sturdy. The fabric, pattern and colors are a lovely addition to my dining set. Prompt delivery without damage added to my more than satisfied purchase!", 
    "design is too light./ better at night than with light. looks faded", 
    "Ordered them for my sister and we both think they look great in her dining area.", 
    "Very pleased with the chairs; colors are as expected and they go well with my farmhouse table.", 
    "These chairs look nice online, but don't look the same in person. As stated in other reviews, it is much darker. More of a sea green and dark olive brown than the light teal and chocolate brown as it looks in my photo. Also, the fabric is more of a raised texture, almost felted. It looks like something my grandmother would love...but not what I was hoping for.", 
    "Perfect for the room I have available. Very sturdy.", 
    "Love the chairs but the colors are not quite as they look on line. The blue is much less bright and the brown more prominent .", 
    "First let me say the quality, comfort, and appearance of this chair is very good!!! I got them for my grandmother and they are also surprisingly light weight - huge plus for my elderly grandmother. Here's the negative: I spent hours looking online for chairs with my grandmother and she chose them for the light, pastel appearance online. They were much darker, mostly light/medium brown. It was obvious and several people noticed. We had to go through the return process, AND help grandma reselect!! Delivery was fast and even the return was very easy.", 
    "Came well packaged. Easy to put together. Color is great. In my blue dining room color looks blue, in my light green living room it looks green, love that!", 
    "I purchased 2 chairs first just to make sure they were what I really wanted because it was really hard to tell what color the \"blue\" was. They arrived within a week. The colors were beautiful chocolate brown, blue/green , and a cream/ yellow. Very easy to put together and sturdy! I love them and will be ordering 2 more. They were packaged very well but one leg had a small crack- I applied some wood glue and a small vice over night and it was untraceable in the morning! Overall fantastic for the price.", 
    "Beautiful fabric great detailing very comfortable", 
    "Looks good in a transitional dining space.", 
    "and pattern fit my style but cheaply made. was very disappointed with it. Falls over very easily.", 
    "One of the chairs came in broken, Overstock was wonderful about helping to get this resolved - very pleased with the entire experience", 
    "shipped on time and easy to buildthey match perfectly with my living room", 
    "I have been shopping online and in the stores looking for chairs that were comfortable and beautiful. When I saw these chairs and the price, I did not hesitate to purchase them. Only drawback, it does take someone with a lot of patience and strength to assemble them.", 
    "Several years ago I purchased the blue/brown paisley curtains from Target. I wanted to redo the dining area of my living/dining combo room and these chairs matched PERFECTLY! I was hesitant with people saying they were green and not blue, and when I first unboxed them in natural daylight they did look greenish ... however when I got them inside (Light green painted room) they looked just as blue as my drapes. Couldn't be happier!", 
    "These chairs were easy to put together and we use them every day. Very strong and great color", 
    "Did not add to the richness of my décor. Colors were muted and not vibrant. Otherwise it was a great chair, I did return but it is a good chair for those who like the paisley print.", 
    "When I read some of the reviews, I was a little skeptical about purchasing these but the price just could not be beat so... I jumped in and bought them anyway. I was not disappointed! They arrived promptly when they were scheduled to and I was able to put them together (all 4 of them!) by myself that evening before my husband got home from work. The colors are muted, but I could see that from the pictures and it was exactly like I wanted. The chairs seem very sturdy and the cushions are very comfortable. I would not hesitate to purchase these chairs, they are the best that could be found ESPECIALLY for the price!!!", 
    "The color is not at all what the picture shows. The blue is definitely green. Seats are made of foam and not very comfortable. The back of one of the chairs was extremely poor construction...fabric was pulled tight so there was rippling. Sent these back the day after I received them.", 
    "I like the way these chairs look and they feel very sturdy. They are holding up well.", 
    "Chairs are nice enough. Not extremely durable but they fit the bill.", 
    "These chairs I am using as 2 of my dining room chairs, and they are perfect. The colors are muted and elegant. I love them.", 
    "The chairs arrived in a timely manor ( in fact I believe they came a day early). My husband put them together in about an hour to an hour and a half. All the parts were there and they looked as good (if not better) as they do online and they are very comfortable. We are extremely pleased with our purchase!", 
    "Came in timely manner, easy to assemble, very comfortable! My whole family loves them!", 
    "The chairs have some type of plastic in the seat stuffing that makes a noise when you set down and also they are not as comfortable as the first two chairs that I purchased from ********** 2 years ago.", 
    "The chairs look very cheap. The faded material does not match the picture shown on the website. The pattern is so faded that they look worn and old. The backside of the chair has a weird style also. I do not recommend these chairs", 
    "The chairs are very pretty. The color is muted, more brown than blue or green.The quality is meh, but they are so inexpensive that it's okay for us. You will not be leaving these chairs to your grandchildren.They look much nicer and they are much more comfortable than the wooden chairs I repainted every time I redecorated.", 
    "I originally purchased these as accent chairs but when I received them I fell in love with them and ordered two more for a small table in my kitchen. LOVE THEM!", 
    "The chairs are great. Very sturdy, fabric is nice. The one drawback is the fabric isn't exactly lined up but if you can live with that they are a great value.", 
    "These chairs are awesome! I was a little skeptical after reading a couple poor reviews but the majority of people seemed to like them so I figured I would give them a shot! I am so glad I did! The picture of the chairs does not do them justice, they are really beautiful in person! I wish I could post a picture! They are comfy, gorgeous and warm/inviting and the assembly was easy even with an almost two year old running around! Ha! These chairs are sure to be a well loved addition, I ASSURE YOU! If you have any doubts, I hope this helps!", 
    "I love the look and color of these chairs. I was so impressed that I just placed an order for two more. I couldn't be happier with the color, and the price.", 
    "I actually received my chairs before I thought they would be here, they were easy to put together, missing only one screw, but was able to find one at my local hardware store. They are beautiful and comfortable. I love them!", 
    "I rarely read/write reviews about products because I think they are kind of bogus. However, I decided to write one on these chairs because they are way better quality than I expected. Lets just say I made the wife very happy. These are high quality chairs with beautiful fabric, good construction and with lightning fast shipping. I received the package within two days. Wow!!", 
    "Excellent product for outstanding price. Colors very rich and subdued, prettier than in the picture. Sturdy, easy assembly. Definitely would order again!", 
    "These are nice accent pieces. I really only needed one, but they come in a two pack. Wish you could buy just one. They are not very sturdy, but if they are in an area where they just need to look pretty and not get much actual use they will be fine.", 
    "I got these for my office and they look great. They were easy to assemble and the seats are very firm if you like that, which I do. The colors are a beige, brown and teal blue which is a nice splash of color. I am very happy with this product.", 
    "Chairs come flat packed. You'll have to assemble the backs to the seats and the legs. The fabric is very nice. I rated this 4 stars because the instructions are sub-par. It's much easier to build with a drill bit because the allen key sucks. The cushions are bit stiff. I have small kids and they tend to spill and drop their food so the pattern is helpful in covering up stains. :)", 
    "The chairs were easy to assemble. The are comfortable and cushion is firm. The colors are not as bright as they appear in the picture but other reviews had mentioned that. I had hoped for a more blue color. The colors on one of the chairs is slightly darker than the other but once I am going to keep them. I based my purchase primarily on the price so for the price the chairs are worth it.", 
    "Love these chairs. Bought 4. Easy to assemble and they look beautiful. Nice thick fabric. Colors are lovely and soft.", 
    "The colors in the chairs were not quite as expected but we do not love them anyway. The chairs look great paired with a small bistro style table. The price was really good!", 
    "Chairs arrived quickly and were easy to assemble. They look beautiful and are quite comfortable. The only negative was that the pattern of the fabric could have been more carefully matched. Have only had them a while so don't know how they will hold up, but great look for a great price.", 
    "These chairs are very good. They look good and have be told by mini people how good they look", 
    "I love paisley so when I saw these chairs it was an easy decision. I bought two paisley and 4 brown faux leather. They look beautiful together around my dark wood dining room table. One negative thing. The color is not as blue as the picture looks, Mine had more of a greenish. I think fabric color varies. I didn't mind because I bought them thinking I would have to replace my light green Levelor Verticle Blind but they blend perfectly! Great add to my dining room", 
    "I purchased this pair of chairs for my office space. They shipped quickly and arrived well packed. Although I don't normally put furniture together (my husband's job) I was able to follow the instructions....OK a male coworker took over and finished much faster than I, but the point is I could even do it! The quality and style is perfect and completes my office look. Great value!!", 
    "We were trying to make our kitchen table take on a new look. We had just moved in to our new apartment were there was only one large room which was to accommodate our eating and living area. To save some money we decided to purchase 4 new chairs to add to our kitchen table. We found 4 chairs that served that purpose. The appearance and color of the chairs seemed perfect. And they are. The assemble was easy, the quality is excellent, and they are very comfortable. I put a nice tablecloth on the table and with the new chairs I have the look of a chic dining room in a living room.", 
    "This is the second set of chairs I've purchased on Overstock. The value can't be beat. I get tons of compliments and they look more expensive than they are. The colors are more muted than in the online photo, however they match perfectly with my color scheme in my french country dining room. They are very comfortable and I put them together myself in 20 minutes.", 
    "These chairs are a perfect addition to our newly renovated dinning room. Just perfect . Makes the dinning so warm feeling. easy to put together. And they came aday early. I thinking about getting another set. Thanks for get product.also for my first time using overstock.com.... so easy thank you my wife loves them too.", 
    "Beautiful quality chairs with beautiful fabric at an amazing price!", 
    "I bought a farm house table a while back and have been using the chairs I had with my original dinning set. When shopping around I was amazed at the prices of chairs until I looked on overstock and found sets of chairs for a reasonable price. The chairs are really nice land easy to put together.", 
    "These chairs are beautiful! I ordered 4 to and they match the table I painted perfectly! They are so pretty that my friend wanted 4 just like them for Christmas. Sturdy and easy to put together. They were also delivered very quickly!", 
    "Beautiful set of chairs, made of strong wood products that have held up well so far. The price and service on delivery has been excellent.", 
    "I was not disappointed when I saw the chairs. The color was exactly what I was expecting and very easy to assemble.", 
    "I got these as a gift- love love the pattern. This is not the most comfy chair, but for occasional use-the are great", 
    "The chairs are beautiful and assembled easily. I am very pleased with how they look and the fabric is lovely. That being said, the seat cushions are very bouncy and would not be comfortable to sit in for any length of time. I purchased them to put on the ends of my kitchen table (the sides have benches).", 
    "we love the chairs they matched perfectly. we are very excited about all of the products from u guys thank you", 
    "My chairs are beautiful, and of very good quality. Diane S.", 
    "Comfortable and looks rich. Was easy to assemble. Completely satisfied with this product.", 
    "I have received several compliment on the chairs. That are well made and very attractive. The color was the same as your website showed. We purchased two chairs and my Mother gave us the other two for our anniversary. My husband and I are very pleased with our purchase.", 
    "My only real complaint is I didn't see assembly was required. The chair is the exact same as photoed. Overall I am happy.", 
    "I order 2 sets of the chairs. I was reluctant at first because of the design but after seeing them for real, they are quite nice. They look better than the picture and look quite elegant. Very easy to put together and they arrived 3days after I hit order confirmation button.", 
    "We purchased 16 of these chairs, there were some delivery issues, due to weather 1 set was delivered to us wet and 2 chairs had to be taken back and the carrier didn't notify us so that was a bit frustrating. One chair leg was shipped cracked to us, that was a packaging issue since there was no damage to the box and 1 chair was missing hardware. OS was super helpful in rectifying my issues. Overall the chairs are very comfortable", 
    "the pattern of the chairs are pretty, but the color is much more dull in person.. Seats are uncomfortable, the fabric has sort of a rough corduroy feel to it. They are not awful, but not quite what i was expecting.", 
    "Purchased 6 of these chairs to updtate my dining room using an antique table. Although modern and strong in quality, the chair design goes perfectly with an antique table. The cushion provides a lot of comfort and is has a much hgher depthh than expected. Great purchase!", 
    "Love these chairs. Definitely not dissatisfied .they look fabulous in my dining room.", 
    "Beautiful chair, very nicely made and very, very cushioning.", 
    "Great Chairs! These were extra chairs for the dinning room, and the were easy to put together and soft and cushion was comfortable. Would buy again in needed.", 
    "They went together perfectly. I love them! They are not $200 dollar chairs, but hey are very good quality. They will be used at my dining room table. I don't think they would be durable to be used daily and last very long. But for my use, they are perfect!", 
    "The chairs are great. They look good and are comfortable. I would recommend the chairs. Can't wait for our next dinner party."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Blue-and-Brown-Paisley-Parson-Chairs-Set-of-2/6541498/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6541498/Blue-and-Brown-Paisley-Parson-Chairs-Set-of-2-49025e3a-84bf-43db-845d-96ed13aeaf4f_600.jpg"
  ], 
  "description": "Enhance the look of your dining room with these elegant parsons\nchairs. This set of two features quality upholstery in a lovely\nblue-and-brown paisley damask pattern that easily complements your\nexisting table. A contoured back and plush padding offers hours of\ncomfortable sitting, either in a dining room or other part of your\nhome.Includes two chairsFeatures sturdy constructionBeautiful blue-and-brown paisley damask upholsteryIdeal to add color to any roomDense foam padding and a contoured back for added\n  comfortSolid wood feet for added stabilityElegant mahogany finishSeat height of 19\"Chair dimensions are 38\"H x 19\"W x 23.5\"DMaterialMahogany, WoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrownFurniture PatternSolid"
}