{
  "name": "HomePop_Geo_Brights_Parson_Chairs_(Set_of_2)", 
  "price": "EUR 181.28", 
  "reviews": [
    "I like these chairs for the price and great pop of color. The padding and fabric are nice and chairs are sturdy once assembled. The assembly is ridiculous, like a puzzle.I found all the parts but didnt have the strength to hold in place and use the TEENIE wrench that was provided. Definitely not easy for a 65 yr old . I had to bribe my wonderful son into doing it.", 
    "These chairs were perfect for our newly remodeled dining room. The color is beautiful, the fabric is nice and they are pretty comfy. They are not the fanciest and highest quality but since I like to change things up every few years ... they are perfect and do the trick for an affordable price!", 
    "The fabric is a nice quality. The chairs feel solid underneath you. Thick cushion.", 
    "Very stylish, comfortable and fit perfectly under our table. Our dog loves to jump up and eat off the table. Finally I can slide these perfectly under the table so the dog has no access to the table plus they are so pretty look great with the table.", 
    "Was surprised how inexepensive these chairs were, but after reading the reviews, I decided to give them a shot. Was not disappointed. Color is great! Some assembly was required, but they were easy enough to put together. They are not a heavy chair, very lightweight. I mention this in case it's a concern. I am using for a sitting area in my massage room, so they work great for me :)"
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Geo-Brights-Parson-Chairs-Set-of-2/10297072/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10297072/HomePop-Geo-Brights-Parson-Chairs-Set-of-2-5848ca39-cea7-4a95-bb08-73f796691fe3_600.jpg"
  ], 
  "description": "Liven up an existing table with some fun new chairs. This\nbest-selling chair style comes in an elegant geometric pattern. Number of pieces: Two (2)Transitional chair style that works in most homesTrend right colors for the homeGeometric design in quatrefoil lattice pattern in cream\n  whiteColor: Teal blue (fresh surf aqua blue)Mid tone brown solid wood frameBuy this set of two (2) chairs to enhance existing dining\n  setBuy multiple sets to create a whole new dining ensembleUse as fun accent chairs throughout the homeSpot clean fabricEasy assemblyPremium woven fabric with 78-percent polyester/ 22-percent\n  rayon constructionDimension: 19 inches wide x 23.5 inches deep x 38 inches\n  highWeight capacity: 250 pounds           StyleTransitional, UrbanMaterialPolyester, WoodChair TypeAccent Chairs, Dining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlueFurniture PatternGeometric"
}