{
  "name": "Home_Styles_Bedford_Queen_Canopy_Bed_and_Night_Stand", 
  "price": "EUR 838.19", 
  "reviews": [
    "Very sturdy frame once put together, but definitely clear out your afternoon! It took a few hours to get it all set up (Maybe it won't take you that long if you know what you're doing...). Overall great frame and true to pics.", 
    "I am so happy with the weight, quality and look if this furniture. It arrived in multiple boxes in perfect condition. Although pretty challenging to assemble, the end result made the effort worthwhile! When I found the same set at another retailer for more than double the price, I felt even more satisfied about the decision to order through Overstock."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Home-Styles-Bedford-Queen-Canopy-Bed-and-Night-Stand/7683986/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7683986/Bedford-Queen-Canopy-Bed-and-Night-Stand-d529c0bb-b693-4d2e-90eb-4253225e53d5_600.jpg"
  ], 
  "description": "Relax in resort-inspired beauty when you add this queen canopy bed and nightstand set to your room. Showcasing a raised panel design on the headboard and footboard, this bed delivers modern style to your master bedroom suite. The framed canopy creates a bold silhouette, and the matching nightstand perfectly complements the bed for a seamless look. Add a sheer canopy or fabric drape to amp up the romance factor for this handsome set.Set includes one nightstand and one queen-size canopy bedRaised panels on the headboard and footboard deliver contemporary styleSlightly flared legs provide added stabilityBrushed nickel hardware accents the rich black finish of this setCrafted from hardwood solids and engineered wood for enduring qualityBed measures 81.25\" H x 63.5\" W x 88\" DNightstand measures 24\" H x 18\" W x 16\" DNightstand includes one drawer and one shelf to store your nighttime necessitiesModel number is 5531-5102StyleContemporaryMaterialWoodFinishBlack FinishSet Include2 PieceBed StyleCanopy BedAssemblyAssembly RequiredColorBlackFurniture PatternSolid"
}