{
  "name": "HomePop_Suzani_Parson_Dining_Chair_(Set_of_2)", 
  "price": "EUR 167.63", 
  "reviews": [
    "I was very sceptical at first. It is hard to order online. I was overjoyed when they arrived. I am sad that when I went to order the ottoman they were sold out.", 
    "These chairs are not quite as bright in color as depicted in the photos, but regardless look great ;and are comfortable.The back of the chairs has a rolled border that looks quite expensive.The only negative is when you lean back, you can hear a paper crackle type sound coming from the inside back/", 
    "These chairs are exactly ad they look in the pictures. The backs have a nice detail and they are a wonderful way to add some color to a room without being overpowering. I bought four of these chairs to go with my farm table and I couldn't be happier!", 
    "good chair to add color to any room, sturdy and nice", 
    "Aesthetically, they are beautiful. They are not super sturdy and it can take a little bit of work to get them level. Unscrewing the little floor protectors; this one a little, that one a little, it's annoying. They wouldn't be good for anyone who won't be gentle with them, but in my opinion, they are well worth their low price. Everyone I've told how much I paid has been surprised I was able to get them for such a good price.", 
    "I ordered two of these parson dining chairs to anchor each end of my nine foot long farm table (aka dining table) The other six chairs were antique wooden chairs, so these two just added a \"pop\" of color. They were well made, easy assembly, and very sturdy. They look very expensive. I love them and all the colors in the fabric.", 
    "Easy to put together even if the directions were not so good.quality of the chairs is very good", 
    "Bright, cherry chairs that are super comfortable!", 
    "The chairs were easy to assemble. The quality is great! Great price for two! Would recommend to all my family and friends!", 
    "Love these!! I didn't give it a 5 since there's space between where the two pieces connect.", 
    "Chairs are easy to assemble and are just beautiful in person. Love them!", 
    "Great chairs, not hard to assemblbe but you do need to check the stability as one or two were a bit uneven so had to be tweaked,once that was done they were great!! Strong fabric too!!", 
    "The color is gorgeous and for the price you pay these chairs are great.", 
    "The chair is lightweight which makes it feel a little cheap. But it's not rickety--it holds together nicely, and the fabric is good quality.", 
    "I love these chairs!!! They add the perfect pop of color I needed. They were easy to assemble and are very sturdy! Get lots of compliments on these chairs!", 
    "So far, I'm extremely happy with the chair. No one has used it yet so I don't know how durable it will be, but it is beautiful.", 
    "Love the colors. Chair could be more sturdy.", 
    "I love patterns and bright colors and this chair didn't disappoint in both areas. The color is just like the one from the pic which is great. We ordered 2 to complete our dining room and the fit perfectly with the table we had and benches we ordered. My only drawback is that the cushion is a bit on the hard side. I'm guessing with time, it'll soften up but I absolutely love them.", 
    "Loved the material, colors not quite as bright as pictured, material and detailing looks expensive for price. Agree that you have to level the chairs with adjusting screwed on pads on bottom of legs. Fairly easy to put together. I bought for extra seating at dining table and for my living room when I have a crowd.", 
    "These are a wonderful addition if you want to add charm into your dining area. Very well made and comfortable. They were easy to assemble and looks better in person!", 
    "Beautiful, comfortable, easy to put together", 
    "Was nervous about ordering something I had not seen but was thrilled when they arrived. Color was as displayed. Very sturdy.", 
    "I love these chairs! Very classy and pristine. They are in the entrance to my office for customers to enjoy.", 
    "These chairs are a great addition to my dinning room set. One of the chairs had a broken leg and Overstock sent a replacement right away.", 
    "The color is exactly as shown and matched the ottomans that we had already purchased. However, the seat is so much more curved on the top than then picture and the legs were not even at all. To keep the chairs from shaking, we had to unscrew a couple of levelers to the point that they look ridiculous. Would not purchase again.", 
    "I ordered these chairs to use with my round glass dining table and solid rust colored chairs. I have a mix of two solid chairs and two of the HomePop Suzani chairs. I was hesitant to order online but caught them during a Cyber Monday sale and I couldn't pass them up due to price. The colors in the chair are more subtle than I thought they would be, I was hoping for something a bit brighter. But, for the price and the quality I'll be keeping them.", 
    "Colors are vibrant..very nicely constructed..so comfortable.Great chairs", 
    "Purchased the set of two to add to my dining room table. Colors are represented exactly as pictured! They add a nice touch of color to my dining room and compliment the farmhouse table and chairs that I have! I thought they might look cheap because of the low price, but the don't.", 
    "I bought 8 of these chairs to change out the cheap dining room chairs that I bought years ago. They are beautiful and add a great pop of color to my dining room. They are comfortable. I can envision having friends over for dinner and feeling comfortable enough to sit for hours for comfortable conversation. The only downside is that I wish they were a little wider. Overall, I am very pleased with my purchase. Great product for great price.", 
    "I read the reviews and purchased these chairs for our desk area. The colors are better than pictured, and they are well made. Good buy!", 
    "Looks exactly like the picture. Easy to assemble. I love the pattern.", 
    "The chairs are beautiful, light and functional. The legs get loose. I have to tighten Them once a week. Also the legs pegs also loosen up.", 
    "A great touch with great pops of color!", 
    "cute, sturdy, have matching ottoman", 
    "The color on these add just enough pop to your breakfast/dining area. I bought four of these to go between four plain beige ones and everyone loves the contrast from pattern to plain without being too bold or too boring. Chair comes nicely boxed but you must assemble. Back, seat, and four legs all come separate but there are only about 10 screws in each chair so assembly is not bad.", 
    "Purchased these, and they are exactly as shown online. The fabric is sturdy, colors and patterm are beautiful. Have received many compliments.", 
    "Match the ottoman i bought. Can't wait to use them.", 
    "They match my newly remodeled Arizona room perfectly!", 
    "Look great! (Putting together make sure your legs are put on exactly the same or you'll wobble)", 
    "Look good, sturdy for the $ this was a great value", 
    "I am very, very happy with these dining chairs. The fabric is just as pictured and the quality is awesome. I liked them so much I just ordered two more!! Very easy to put together and well made.", 
    "We will enjoy these for a long time.", 
    "My husband and I really like these chairs. We wanted a chair to go with a downstairs desk/vanity, much like the one pictured. The chair looks great with the desk and just adds some color to our living room/dining room area. The chairs are sturdy and well-cushioned. I would've easily given these chairs 5 stars had we received all the parts to put them together when they arrived. There were only enough screws, etc, included to put together one chair along with a few random parts left over, but not enough to put together the second chair. When I called customer service, they were friendly and helpful, but it took almost 10 days for the additional parts to arrive, so we had one chair put together and the other sitting in pieces in the corner of the living room. However, I do highly recommend these chairs!", 
    "fabric was beautiful and even better than portrayed in pic! very nice chair", 
    "We bought 4 of these chairs for our farmhouse style dining table and couldn't be happier. They are comfortable, with high quality fabric, and were easy to assemble. Unbeatable quality for the price!", 
    "It's perfect for the design in my home office. I couldn't be more pleased. love it!!", 
    "These chairs are beautiful and make nice accent chairs in my living room. The price was awesome", 
    "I love these chairs. I bought them to go on my sun porch with a glass top table. The colors are true to the picture showing the background more beige/cream. The assembly instructions could be better. Just separate everything out and it's not too bad. The fumes were quite strong and made my eyes water as I was putting the chairs together. They are not smelling up the room so I believe this is just due to being closed up in the box. The comfort is decent for the price. They will get light use for my purpose. I am happy with them.", 
    "I bought these as accent chairs for either end of my dining table. They are solid and the fabric is beautiful. Easy assembly...", 
    "The fabric is beautiful and the chairs are easy to put together. I don't recommend these chairs if what you're looking for is soft, \"cushy\" seating as these are a little on the hard side. But we are using the two of them for each end of our dining room table and they look good and suit that purpose very well.", 
    "love these chairs. they were easy for my husband to assemble and they are the perfect accent in our dining room. have lots of pretty hues to pick up on for accesories", 
    "They are cheap chairs so you get what you pay for. The \"cushion\" feels more like balled up plastic bags than an actual cushion and they're pretty stiff. But overall they are beautiful to look at and the fabric is really pretty. They were pretty easy to put together but I don't think they would stand up to heavy duty use. If you're looking for a really well made chair you will have to pay more than what these are going for.", 
    "These chairs are everything I had hoped for, and more - true to the picture colors - fairly easy to assemble (make sure you sort the screws and follow the directions for use) - solid and sturdy = very plush and comfortable - in short, everything you could want in an accent chair. They sit in front of my sliding glass door with a repurposed table and make an ideal conversation area. You can't go wrong here...bob", 
    "The colors are just as shown making them perfect for blending with my other chairs. They were easy to assemble and are very sturdy. I will order again from Overstock.", 
    "These are very pretty chairs and exactly as pictured. The directions to put them together were lousy, but it was simple enough to figure out on my own (and I am definitely not one that love putting things together!!). Very well padded seats and back and the detail is great, especially for the price. Totally happy with my purchase!!!", 
    "I really love this product. They are so beautiful. I really love them and would like to order more from you in the future.", 
    "The chairs were exactly what I had hoped for, sturdy, good quality and comfortable dining chairs.", 
    "Sturdy and high quality. Very easy to assemble. Really comfortable seating. Using them in our formal dining room, and the pattern gives an elegant look to the dark wood set.", 
    "We LOVE these chairs! We bought 6 of them. They were well packed, easily assembled and very sturdy. They are also beautiful and sit well. I would happily buy more if I had a place to put them.", 
    "I ordered four chairs (two boxes). I'm very satisfied with the look and quality. My assembly took longer because I didn't keep the individual chair parts together. If you keep the chairs separated with the components, life is easier. I also added scotchgard due to the light coloring.", 
    "These chairs are wonderful! I wanted some color in my dining room, and these were the perfect choice. I purchased a set to use as the end chairs. The quality is excellent and they are very comfortable.", 
    "Service from overstock is excellent. I received chairs on time. Chairs are ok, they worth the price.", 
    "These look great! I feel like a really got a bargain, getting two for less than I would normally pay for one.", 
    "Even though I had to put them together they are built sturdy and in actuality were easy to assemble. The fabric is very nice and they look very well in my dining room", 
    "I was looking for an inexpensive way to refresh my kitchen and decided to purchase 1 set to see if I like it. Both seats came in damaged. I called customer service to see if I could just get the seats instead of shipping all the parts back. It took about 10 days for this to happen before the replacement seats shipped out from the manufacturer. Although Overstock customer service was really great and stayed in communication with me, I was a little disappointed that it took that long to resolve. Both replacement seats came in ok and it took me about 10 minutes to put 1 chair together. I read dozens of reviews on different Parson chairs and a lot of the complaints were that the holes didn't line up properly on the pieces which made it a nightmare to put together. Thank God I didn't have that problem. The chair is smaller and more narrow than my existing kitchen chairs and the seats are firm (which is what I wanted). The colors of the chair are gorgeous. I haven't put the other one together yet as I want to check out the first one for a few days to see if I really like it and to make sure it matches with my existing furniture in which case I will buy more to complete my set. I don't see them lasting years if used for hours every day. It's just my husband and I so then will maybe get used 1/2 hour a day or when we have company.", 
    "I use these chairs to flank by buffet in the dining room and then put them at the table when I need extra chairs for dining. The colors are as they appear online and I also got the matching bench to use in the hall foyer. You can see both for a nice match. My husband put them together easily, and the chairs are sturdy.", 
    "The parson dining chairs are beautiful. I am totally pleased with the fabric, color scheme, and construction of the chair. I have been shopping at the local stores and online for over a year now for print, fabric parson chairs in these exact colors. I purchased two chairs to add to my dining/kitchen table, primarily to add a pop of color. My kitchen is painted green, and these chairs made all the difference in the world with a fresh new look that says \"happy\". I love these chairs. Now I am tempted to purchase a few other pieces from the collection for my den. I rated every category with excellent marks, as I truly believe my purchase is magnificent."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Suzani-Parson-Dining-Chair-Set-of-2/8692772/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8692772/Suzani-Parson-Dining-Chair-Set-of-2-50f01976-514e-4440-98fa-77a6450e3567_600.jpg"
  ], 
  "description": "Enhance your decor with the bold style of these HomePop Suzani\nparson dining chairs. Durable and solid, these chairs are built to\nwithstand frequent use and heavy traffic. Beautifully crafted from\nsoft to the touch chenille fabric, keep your chairs looking new for\nyears with light spot-cleaning thanks to this easily maintained\nfabric.Set includes two chairs to provide symmetryMulti-color Suzan pattern easily blends with a variety of\n  color schemesTransitional chair design provides versatility to meet your\n  decor needsMid-tone, brown, solid wood frame offers durability and\n  styleSoft chenille fabric is easily maintained with occasional\n  cleaningPair these chairs together as a dining set or use an accent\n  throughout the homeChairs are equipped to hold up to 250 pounds with easeSeats measure 19\"W x 23.5\"DChair dimensions are 38\"H x 19\"W x 23.5\"DProduct comes disassembled for easy transportStyleTransitionalMaterialChenille, WoodChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrown, OtherFurniture PatternFloral"
}