{
  "name": "HomePop_Pewter_Grey_Cream_Lattice_Elegance_Parson_Chairs_(Set_of_2)", 
  "price": "EUR 178.35", 
  "reviews": [
    "Beautiful fabric, but not really a pewter grey, more brown tones, so unfortunately they didn't work with my decor.", 
    "I love the way these chairs look in my dining room. However, one of the back's pattern doesn't quite match the others but decided it wasn't worth it to return. They are very comfortable.", 
    "These chairs are gorgeous! We love the subtle design and the fabric is great. We have cats and need a durable fabric for their claws. While the design has ribbon-like fabric which may pull, the overall fabric should hold up against any potential scratching. They were fairly easy to put together. One tip, once you put together, have someone sit in each chair and then re-tighten the screws. Even though the screw were tightened first, once we sat down, there was an adjustment. However, once re-tightened, they were perfectly sturdy.", 
    "I placed these chairs in my entry way with an accent pillow on each and they look just fabulous. The design is shiney looking, while the material is flat in color, which provides nice contrast. These chair look expensive, but were much cheaper than others from different stores.", 
    "Love them! They're perfect!", 
    "Love these chairs . They are fashionable, well built, and completely updated my old dining set.", 
    "The fabric is lovely the pattern is unique and look way better in person more expensive looking. The gray pewter however is subtle through the fabric but great texture. Everyone comments on how nice they are."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Pewter-Grey-Cream-Lattice-Elegance-Parson-Chairs-Set-of-2/10297085/product.html?recset=5065fc47-d070-48c3-94d0-44333334f652&refccid=5NYNIZSMD7H3SW2KT6ARHCPQ3Y&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10297085/HomePop-Pewter-Grey-Cream-Lattice-Elegance-Parson-Chairs-Set-of-2-f6e2bfe6-0c13-4d32-83f3-bf8a801f6b19_600.jpg"
  ], 
  "description": "HomePop offers up the Elegance Parson chairs to add to the\nwelcoming nature of your space. This transitional chair works in a\nvariety of homes. Number of pieces: Two (2)Transitional chair style that works in most homesBeautiful trend right colors for the homeHeathered linen-like woven fabric with silk like cream\n  lattice design patternColor: Pewter grey with cream silk like lattice patternSolid wood legs in medium brown wood finishBuy this set of two (2) chairs to enhance existing dining\n  setBuy multiple sets to create a whole new dining ensembleUse as fun accent chairs throughout the homeSpot clean fabricEasy assemblyDimension: 19 inches wide x 23.5 inches deep x 38 inches\n  highWeight capacity: 250 pounds           StyleModern, TransitionalMaterialLinen, Polyester, WoodFinishGrey FinishChair TypeAccent Chairs, Dining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredColorGreyFurniture PatternSolid"
}