{
  "name": "HomePop_Coral_and_Turquoise_Paisley_Parson_Chair_(Set_of_2)", 
  "price": "EUR 165.68", 
  "reviews": [
    "Love the pattern. Bright and funky. Also quite comfy.", 
    "Needed two chairs for the end of my table. Hoped the colors of the actual pattern would be brighter than the image online appears and they are. Love how they coordinate with my bright red wooden side chairs. Cushioning isn't as soft as I had hoped for but maybe over time it will soften up and be more comfortable.", 
    "So perfect for my dinning room. I'm so pleased.", 
    "The chairs were easy to put together. Screw holes lined up properly. The pattern is exactly the same on all chairs and colors are true. They are well padded and comfortable.", 
    "I love these chairs. Comfortable, modern and easy to assemble.", 
    "These chairs get many positive comments from my friends. I love them! They are attractive, comfortable, and versatile.", 
    "LOVE!! Very comfortable, sturdy and great color.", 
    "I'm waiting to put them together because my toddlers are still drawing on furniture every once in a while, which was why I bought these, but I peeked inside the box and I'm blown away, I cannot wait to put them out at the table.. The kids just have to grow up a bit more 😄", 
    "I love these chairs! Super easy to assemble, they have added just the pop of color that I was looking for! I was not really shopping for a real comfortable chair, I was mostly looking to add color and additional seating, but these chairs are pretty comfortable too! For me it was a really good purchase!", 
    "Nice chairs. Must line up the screws exactly otherwise it may take a while to assemble. Sits comfortably for short term sitting. Support may not be sufficient for a large body type.", 
    "These chairs are exactly what I was looking for for my craft room! The room is gray with white furniture and I wanted a fun pop of color. These chairs definitely fit the bill and at the price, you really can't beat it. They look just as expensive as PB chairs, nice and sturdy, and assembled easily. They're also comfortable! I'm very impressed.", 
    "Everyone has remarked how much they love these chairs as soon as they walk in the room!", 
    "Love the fabric. Easy to put together. Not sure how durable the seats will be in the long term - they're just foam on a wood frame - but they are comfortable.", 
    "I chose this pattern to match a peacock chair and a coral chair in my living room....we have an open dining room that is adjacent to it. It brought in the colors to the dining room in this pattern and it looks fantastic. I paired these with two neutral off white chairs and they look great. They are VERY comfortable and solid. They are challenging to assemble..to be honest but they are great! It's tedious."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Coral-and-Turquoise-Paisley-Parson-Chair-Set-of-2/9761360/product.html?recset=5065fc47-d070-48c3-94d0-44333334f652&refccid=5NYNIZSMD7H3SW2KT6ARHCPQ3Y&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9761360/HomePop-Parson-Dining-Chair-Set-of-2-Coral-and-Turquoise-Paisley-19dd9308-42e9-4d18-8f46-dff1cadc2b72_600.jpg"
  ], 
  "description": "With their elegant fabric upholstery and warm mid-tone wooden legs, these padded dining room chairs upgrade the look of any room. The set of two chairs is designed with inner padding which provide a comfortable seating experience.\r\nNumber of pieces: Two (2) Upholstery color: Coral and Turquoise PaisleyFinish: Mid-tone brown solid wood frameCare instructions: Spot cleanWeight capacity: 250 poundsSeat dimensions: 18.5 inches wide x 17.5 inches deepDimensions: 19 inches wide x 23.5 inches deep x 38 inches highStyleTransitionalMaterialPoly Synthetic Fiber, WoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardFurniture PatternPaisley"
}