{
  "name": "HomePop_Elegant_Parson_Dining_Chair", 
  "price": "EUR 81.21", 
  "reviews": [
    "Came right away, packed well. Solid enough for a regular or slightly larger person. Sits straight up. For the price it is a great buy. And no shipping,,you can't beat it.", 
    "I am using this for a desk chair. It was easy to put together and is quite comfortable. However, the upholstery job is a bit off with fabric bunching on one side. It's fine for the price, though, and not noticeable to most.", 
    "I received the chair in less than week from ordering. It is exactly as pictured. I plan to use this as a desk chair. It is not the most comfortable chair but definitely easy on the eyes. The seat cushion is more on one side than the other but I have a feeling this issue will resolve with use. Can't wait to get my desk in now to see them both together!", 
    "Very pretty chairs - only using them as accents and will be sat in only occasionally. So, for the money, they are a good buy.", 
    "Although the price on these chairs was what made my decision to buy them, I wouldn't do it again. Assembly wasn't bad but overall quality is barely average. Had a hard time deciding which back of the chair, I bought 4, would face the room as the upholstery workmanship is not very good.", 
    "We purchased 6 of these chairs for my husbands conference room. They get used once or twice a week, not light wear and tear.....it's been just over a year and with two of them the seat has completely fallen through making them unusable. We are constantly screwing the legs back on and tightening bolts. The fabric is nice and the chair comfortable for an hour meeting, but wish we would have spent the extra money and not had to deal with the hassle of the upkeep.", 
    "I opened the box and realized the color was darker than what appeared online to me and it did not match my room. I had to pay $** dollars to return these chairs…. RIDICULOUS. I paid $*** for both.. what a joke I purchased new chairs off*******. Overstock has a terrible return policy… search online. You will see", 
    "Average in materials. The cloth covering was as expected and they were easy to assemble. The 3 is for durability since I feel the legs will not hold up to weight in the short term. I had thought they would be like the others I bought which were nicer. I kept them since they are side chairs.", 
    "Sturdy, firm seating... It's a nice looking chair! Easy to assemble too", 
    "Needed a new desk chair and this worked out perfectly!", 
    "I was looking for 4 chairs in a light brown fabric and here it is. They are the same size as 2 leather ones that we have around our cherry table. Always measure seat height and size and total height to make sure it will all fit if you are adding chairs....", 
    "These chairs are perfect with our current dining room set.", 
    "Comfortable and sturdy chairs. They were easy to assemble. The only problem I can see is the fabric. It seems to attract lint.", 
    "Easy to assemble, sturdy, exactly as pictured, good amount of cushion", 
    "Quality of this item was rather poor, once attached legs were not level and fabric had some misaligned seams,etc.", 
    "Great price , using as a desk chair........cant beat the price", 
    "For the price, these chairs are a deal. We ordered four to use with our kitchen table. They are comfortable, fairly easy to put together (not counting the one bolt that will absolutely not go in) and look like a more expensive chair.", 
    "Solid chair, comfortable, great price. My only draw back is that it was described as more of a greenish/grey... It is brown. Or I'm color blind.. One or the other.", 
    "These chairs look a taupe in the picture, they are a deep brown colored, and extremely lightweight, not sure if they will hold up to heavier family members. Not a good value for the money!", 
    "Great chair ! Just the right height ( Mom's short ). Good value.", 
    "versatile chair which looks nice with or without slipcover. easy to follow assembly instructions.", 
    "Poor quality. Hated the way the seat cushion was assembled. Wopsided! Do not waste your money on this one.", 
    "I placed my order Sunday and received the chairs on Wednesday! Easy to put together. Love the colors. Really makes my dinning area warmer.", 
    "This is a very nice chair. However as it requires some assembly to the legs I am unable to mark the quality as excellent since i dont think you can beat ready assembled especially when it comes to seating. I will have to see how it bears up overtime in terms of durability but so far so good and it is definitely a much higher quality than i expected so very pleased with it overall.", 
    "I'm using this chair at a desk in my living room - nice-looking, easy to assemble, & lightweight for easy mobility.", 
    "We were looking for some extra living room/ dining room chairs. This one is great! It works for our living room and comes in handy for an extra chair at our dining table.", 
    "My chair arrived in four days. Since this is the second chair of this style that I've purchased, the unpacking and assembly was easy. It took about 15 minutes. The color and construction are very good. A handsome chair.", 
    "We searched and searched for a chair that had Brown fabric, modern style, quality construction and a good price. This chair has three of the four. I'm a little disappointed with the workmanship, of the chair. I did read the reviews, prior to purchasing the chairs and some of the reviews did mention some issues with the fabric. I took a chance and ordered them, anyway. Two of the Four chairs do have some fabrics issues but for the hassle of returning them, we decided to keep them.", 
    "Great chair very comfortable being used as a computer chair, color was exactly as shown and easy to assemble!", 
    "....and I love the color also. They are very sturdy chairs.", 
    "You feel every piece of wood in the seat frame. Painful seating.", 
    "I love this chair. I have them placed at my new chess table and they work very well, comfortable and very easy to assemble,", 
    "In the pictures it looked like it had some goldish, orangish tint, but they were more of a brown in person. good quality, good price, comfortable chairs.", 
    "First thing I noticed was the material was not laying properly, kind of bunched in a few places. Overall poor quality, after assembly an using for a coupe of days the front leg became wobbly, after inspection I noticed there was a split in the wood down the length of the leg. I had a choice to have the leg replaced or unassembled the chair and send it back ( way too expensive) or have another leg sent instead. Overstock always stands behind their products and this is no different - they are eager to assist. I will not get the refund, however by the time I got the chair shipped to them it would cost as much as the chair did.", 
    "What a great chair. I got 4 chairs and they are really nice and really comfortable!!!", 
    "The chairs have added an extra elegance to my dining area. They are elegant and rich looking. Extremely comfortable. The fabric is rich and beautiful. They were easy to assemble and are very sturdy. I am very pleased with this purchase!", 
    "Easy assembly, however easier when using a crewdriver with allen wrench head. I like that the legs include adjustable feet (to ensure the legs are even height, chair doesn't tip/wobble). Stain of legs is a nice medium deep color. Back of chair has detailing to look higher quality. Nicer quality than similar style leather-type dining chair, however I bought 2 of each and the mis-matched set looks nice together.", 
    "The overall quality is not up to my expectation. I don't like the fabric although the color is nice. I use it as my desk chair. It's not comfortable at all when sitting on it more than an hour. However, it might be ok if you want to use this chair as your dining chair.", 
    "This is my second purchase from OVER-STOCK.com and i just have to say( I'M HOOK ) the price was reasonable and shipping was fast..", 
    "Chairs arrived promptly. No difficulty with assembly. Directions were straight forward and all hardware clearly separated and labeled. They did have to be tightened in order to be secure (not wobbly) and this required considerable strength. They look handsome!", 
    "A nice looking, solid feeling chair, fabric is a sophisticated dark tweedy look, can't beat the price, works well in our new modern dining room. As I said to our interior designer, at this price, if they don't hold up in the long run, we can burn them for firewood and still come out ahead :-)", 
    "Well packed, easy to assemble, and comfortable. I am using mine as a desk chair and it is working well for me.", 
    "Loved this chair. It was easy to assemble, rich in color, and comfortable.", 
    "There is absolutely nothing \"elegant\" about this chair. It is built cheap. Putting it together was difficult, and the results were creaky and shaky. If I get 2 years out of these chairs I'll be lucky. There was actual spider webs in the bolt holes! The dust that came out of the box was ridiculous, I had to take them out in the garage to unpack! I was caught in a position where I needed them and could not return them, otherwise they would have gone right back. NOT worth the money or time."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Elegant-Parson-Dining-Chair/6331062/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6331062/Elegant-Parson-Dining-Chair-f435ba12-d0e3-4dc4-b6c6-4b7e0cef9520_600.jpg"
  ], 
  "description": "Bring style and comfort to your dining room with this brown dining\nchair. This high back dining chair from the Kinfine collection\nprovides lumbar support while dining. Beautifully and durably\nconstructed, this wood dining chair has cushions padded with super\nsoft polyurethane foam. The sophisticated design and color of the\nelegant parson dining chair complement any design or decor. Materials: Solid wood, foam, fabricFinish: BrownUpholstery materials: 100-percent polyesterUpholstery color: Brown textured fabricUpholstery fill: Polyurethane foamClassic parson dining chairSolid wood frame and legsEasy KD constructionUpholstery matches any wood table finishCreate an instant dining room makeoverDimension: 19 inches wide x 23.5 inches deep x 38 inches\n  highStyleTraditionalMaterialWoodChair TypeDining Chairs, Parson ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorBrownFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleUpholstered"
}