{
  "name": "HomePop_Modern_Parson_Blue_Chocolate_Damask_Diamond_Fabric_Dining_Chair", 
  "price": "EUR 86.74", 
  "reviews": [
    "The chair in person is as pretty as the online picture. It was super easy to assemble. The chair is terribly uncomfortable. I bought it to use as a desk chair. It's not good for sitting for long periods. It has a hump or stiffness in the center of the chair. I did my best to tighten the legs well, but one of the has loosened and the chair wobbles. I would not recommend this item.", 
    "These chairs are perfect with our new rug from Overstock!", 
    "Colors were perfect. Nice side chair with very neutral colors.", 
    "I ordered 2 chairs for extra seating in our foyer and they arrived promptly! They are beautiful and well made. My only concern is that the back support and back legs form one piece, and the seat cushion attaches to it. If you lean back a bit and apply pressure to the back while seated, the chair back feels like it wants to separate. I tightened the hex bolts as much as they would go, so I know the chair will not come loose but I'm not sure they would stand up to heavy usage. We have them positioned against a wall so it's not an issue. Overall, I'm very pleased with this product.", 
    "Easy to put together. Beautiful quality & color!", 
    "This is a very good chair.", 
    "Bought six of these chairs for our breakfast area 2 years ago and loved them until recently. The padding throughout the chair is collapsing and the chairs are becoming increasingly more and more uncomfortable to sit on. We are not heavy people, 2 kids, but the padding seems to gotten squished flat, on the seat and the back. One can feel the frame of the chair through the fabric now and the seats appear \"wavy\" from the springs protruding. I am looking to purchase new chairs already. Not worth the money. These chairs should last longer than 2 years.", 
    "I bought this chair to use in our den and I am loving it so far. The colors are very true to the description and the chair feels substantial, not cheap! Great buy for the money!", 
    "I wanted a more stylish chair for my writers desk then the standard office chair (I generally don't spend more than an hour or so at the desk at any given time). This chair fit the bill nicely and is quite comfortable. I bought platic washers to help level it, but it was fairly easy to put together. Good buy.", 
    "The chair looks exactly as advertised on the site. There were a couple of comments on previous reviews that I didn't understand, but now owning the chair, I do. On the back of the chair, right down where it meets the seat, there is a round indentation that looks like the chair has just been hit with a baseball. It's odd, and no matter how many times you straighten it out it seems to come back. It's mostly only noticeable in dim lighting, but you can definitely see it. However, all things considered, it is a lovely chair, the fabric is of very good quality, and all other aspects are very good for the price.", 
    "The fabric on the chairs were a perfect match to the dinning table that was not ordered from Overstock, however the cushions do not seem sturdy. I dont think they will last long when you sit in them, the sink in and the legs are constantly needing adjustment.", 
    "I would recommend these chairs to anyone. They are great for my dining room.", 
    "super easy to assemble, all pieces were fine. exactly what i needed", 
    "The chairs are fantastic looking! They arrive quickly within 5 days. I ordered them on a Sunday and they arrived on Friday(I live in NJ). The color was just a bit lighter than represented on the site but this was not a deal breaker. The finish of the upholstery has a classy, upscale feel. They are also quite comfortable with a nice firm cushion in the seat. I've mixed them with some chocolate leather dining room chairs and they look great, so great that I'm ordering two more and using the leather chairs elsewhere. The only concerns I have are with the slightly sketchy directions; they aren't very clear at some points, but all it takes is a little patience. Thanks Overstock, keep up the great products and great service!", 
    "They look really nice. There is not much give in the cushions and chair height may be a bit high.", 
    "I love these chairs. They are the perfect for my room. The only reason they got a 4 star rating is that where the fabric meets the seat at the back has a large bump on the fabric at the back of the chair looks a little strange and there is a gouge at the same area. I bought two of these chairs and they both were the same. I like the color and fabric. I would buy more if I need them. They are easy to assemble.", 
    "The chairs were purchase to complement dining room chairs that were no longer available. Easy to put together, the seat, back and legs. Once the legs are in place, tighten each a little at a time to keep them balanced, otherwise one leg is tighten more and the chair is uneven and rocks. Just need patience. We used a racket instead of the Allen wrench provide once the screws were finger tight. The edges of the fabric appear rough until put together just as one would see if they disassembled an already put together chair purchased in a store.", 
    "Color wasnt what I expected but still worked out fine. Chair was easy to assemble. Good quality,", 
    "I ordered six chairs and every one is very pleased with them. They are well constructed and matches my dining room table. I would purchase them again.", 
    "Just like all the reviews. Outstanding! Would recommend to everyone. Very comfortable.", 
    "This chair is beautiful and a nice appointment to my living room desk area. Very pleased with the set up out of the box and the finishing touch it brings to my living space.", 
    "I was very surprised how good the quality of the chair is. It's nicely padded and very comfortable The fabric color is blend of blue- grey and deep chocolate brown . I use it as a desk chair with a small oak desk and works perfectly. The only down side the chair was not assembled as stated in the description. I am not very handy and needed help but it did not take long at all to assemble it. In fact I liked it so much I ordered a second one.", 
    "For the money, the chair is comfortable and the fabric is very nice.", 
    "I love this chair. I am using it as a desk chair. I almost considered buying 3 more and switching out my dining room chairs. Great color -- actually quite neutral. You won't regret this purchase.", 
    "This is a beautiful chair! The colors are vivid and will add character to any space. I needed a chair to liven up my husband's office, and this one did the trick. The colors are somewhat masculine, yet elegant.", 
    "I actually bought this chair for seating at my makeup table. It looks very nice. Construction is sturdy. Very pleased with this product!", 
    "I purchased this for a closet in the master bedroom. It gets light, daily use. It is on a carpet. Seems very sturdy. It is the perfect size and perfect for what I needed it for. Couldn't beat the price. Easy to assemble.", 
    "We received these chairs several weeks ago. I wanted something lighter than the typical black leather chairs as my space is small. These chairs go with my decor but are fairly neutral which is perfect. This is a muted pattern that does not overpower. They are comfortable and not too large. My husband and I are quite pleased."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Modern-Parson-Blue-Chocolate-Damask-Diamond-Fabric-Dining-Chair/6356166/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6356166/Modern-Parson-Blue-Chocolate-Damask-Diamond-Fabric-Dining-Chair-4b34c0e3-0672-4d29-b9a4-bf53b76f2ce6_600.jpg"
  ], 
  "description": "Complete your dining room decor with this Parson chair from HomePop. Sporting a blue and chocolate damask linen fabric in a diamond pattern, the chair features straight legs for a clean, modern look. Pair this versatile chair with a desk to create an instant home office, or purchase several chairs to complement your existing dining table.Made from solid wood for stabilitySturdy frame and legs ensure durabilityKD construction makes it easy to assembleTransforms your dining room or office with its clean designVersatile upholstery fabric complements a range of decors and wood finishesSeat measures 19\"HMeasures 38\" H x 19\" W x 23.5\" DStyleContemporary, Modern, UrbanMaterialChenille, Linen, WoodChair TypeDining ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlueFurniture Frame MaterialWoodFurniture PatternGeometricSeat StyleUpholstered"
}