{
  "name": "HomePop_Red_Floral_Parson_Chairs_(Set_of_2)", 
  "price": "EUR 141.31", 
  "reviews": [
    "Beautiful chairs! Purchased for my dining room to pair with mahoghany table, very pretty! Many compliments. Assembly was easy and a great touch to have the levelers to level each chair, nice touch! Ordered 6 total but will order 2 more to have 8 place seating. Thanks, O!", 
    "I bought 2 sets, that is, 4 chairs in total. They come 2 in a box, and must be assembled. The level of difficulty in assembling them is average. If you have assembled chairs before, you will know how to do this. I coordinated them with my natural oak flooring and oak table, and light green walls, and they look GREAT ! You can dress them up, or dress them down. They are quite elegant, and would go good in a formal setting. To my delight, the pattern is centered and balanced on the chair. I got them at the sale price, which was a real bargain. The seating is very cushioned and comfortable. The back-rest is wide and supportive. The legs are dark brown wood. Each chair is heavier than it looks. BUY THESE CHAIRS ! You will not be disappointed. They are very nice.", 
    "We purchased 6 total, and these chairs look great around our dining room table. The color isn't as 'red' as shown in the picture, but has a slightly burnt orange hue to it. However, they still look great. They are also a little firm, but we figure they will soften the more we use them. Overall, they look good and are a great deal.", 
    "I'm happy with the chairs, but the quality of construction is a little lacking. It took me a long time to put the chairs together because of the lack of precision in how the holes are drilled. The red is not a true red, but more of a brownish-red, and the background is gold. They are good looking chairs, and I'm satisfied with them.", 
    "We ended up buying six of of these for a 4' wide round table. They fit perfectly. The color and fabric are very classy and the seats very comfortable. My daughter put them together without much difficulty.", 
    "I received the set of chairs very quickly. When I opened the box to inspect them I noticed that some nuts and bolts came out of the box. I first thought that they were extra hardware. When I took the chairs completely out I found that one set of hardware was just thrown into the box and not inside any packaging whatsoever. I was very disappointed in this. Luckily all of it was still there. The red floral pattern is more burnt orange instead of red but once I got the chairs together I was still happy with them. They are very comfortable to sit on and were very easy to put together.", 
    "I actually like the color in person better than the photo. Like everyone else says, the color is more of a rust, but I acutally liked it better than what is pictured. They were easy to put together. I constructed the chairs without help. The padding is thick and comfortable. I loved the fabric. They look great with my antique table. Great buy. You will love them. I have received many compliments.", 
    "Nice quality chairs. Definitely burnt orange not red.", 
    "ii would not pay 5.00 for this chairs,they are very flimsy,you say you would send me a retuned ticket for once free of charge,please send me one i dont want to have to pay **.** for on a returned,i will never buy furniture in the mail its to hard to get back.thak you john ******", 
    "These chore go great in my dining room. I purchased a table a while back and used the chairs from my old set with the table so I needed to chairs for the end . These worked great. Not very sturdy but I rarely use my dining room table so its not a big deal. Good buy.", 
    "I never write these reviews but thought you should know that they do not hold up. The cushions flattened very quickly and the undersheath is tearing. NOt used all that much either. You get what you pay for and these are inexpensive but very poorly made......", 
    "Easy to assemble and they enhance our dining room greatly", 
    "Loved these chairs best buy on Overstock!", 
    "Love the color and pattern. Sturdy too", 
    "The chairs are not the RED like in the picture but more of a burnt orange and brown. I was okay with the color even though it wasn't red, they chair look very nice with my dinning set.", 
    "I bought these for my sister for a gift.She said it was easy to put together and she loves these chairs. She said they were so beautiful and sturdy, not cheap looking or made..I also love these chairs.", 
    "The price was right and they are very nice looking chairs. I mixed 2 of them with 2 leopard and it looks great.", 
    "Love these. Very comfortable and look elegant.", 
    "I bought these two years ago. Love the look, but they don't hold up well. Slightly saggy after very little use. The Allen wrench screws need frequent retightening, and the wood surrounding one of the screws split so that it can't hold one of the screws in tightly, so that chair needs constant tightening, only it can't really be tightened properly. These work for me because they are in a seldom-used dining room. At the price, they were very good value for that. I would not recommend them if you anticipate daily use.", 
    "Gold color is muted, and red is a quality orange red. Sturdy, and comfortable. I would buy these again.", 
    "Yes, that is the color but it's \"stunning and deeply rich in color\" when you see it in person. I was hesitant to purchase these because the description said \"red\", when in fact, my home décor is \"burnt orange\". When I read the reviews most folks said it was more of a soft burnt orange than red, that's when I decided to purchase these right away (bought all 4).. and was \"NOT\" disappointed! My goodness.. they match \"perfectly\" in my home, not to mention that it has ENHANCED my place DRAMATICALLY. Very rich and soft in color, it would be impossible for anyone to be disappointed in this purchase. Assembly was quite easy and FAST. Please excuse me while I go back to looking at my dining room chairs.. ahhh........ :)", 
    "These two rust and olive Parson style chairs are at the ends of our dining table. They add a transitional look to our previously \"country\" style dining room.", 
    "I felt for these chairs when I saw them first time. I was looking for black brown as the leg color and when they arrived they were brown which was a total disappointment. In fact the chair description also says brown (so I wouldn't blame overstock for that) but looking at the photo posted by them I thought that it would be black brown (that's overstock to blame :)..Kidding. ). It looked really amazing in reality as well. Chairs were so good that I was ready to paint the legs black brown. But then with disagreement from my partner and too much efforts involved in painting the legs, I returned them and ordered another similar chairs. Worth for the price.", 
    "I Love the chairs, I Love the color and the way it sets.", 
    "These chairs look very pretty in my dining room. The color is more of a burnt orange and chocolate brown, but they still match my decor nicely. Assembly was fairly easy, although some of the holes did not line up quite right, my husband had to help me. They are not cushiony soft but not overly stiff either. Overall I would say that they were a good value.", 
    "Very nice quality, but not red as described. More of a rust color with brown, if that fits your decor, they are very nice chairs.", 
    "The chairs are very nice, looks far more expensive than what I paid for them. I purchased a set of 4, fairly easy to put together. I agree with all the other reviews, the chairs are burnt orange NOT red. The contrast of the burnt orange and tan/copper background is beautiful; I would recommend these chairs.", 
    "Very disappointed when these arrived and they were returned right away. The pictures don't show the tan swirls in this fabric. Not for me. Other reviewers are correct, the main brocade color is more a burnt orange. But I strongly disagree these look expensive. The fabric looks and feels fairly cheap and very \"dated\". I thought the material was more of a soft chenile or brushed velvet, but it's just cheap polyester with a bad pattern.", 
    "I was searching for something classic with color for our dining room...these fit the bill perfectly! They are comfortable for the course of a long dinner and meet our needs exactly! Thanks, Overstock!", 
    "These chairs look great with my refurbished 75 year old dining room set -- they come with no instructions but assembly isn't too hard without them. Since they update the set, I now need to order more. Would recommend these chairs but color is more of rusty red which actually goes great with my decor. If they were actually a true red I might not have liked them as well.", 
    "I really like the chairs but they don't really look like the picture on Overstock as stated in previous comments. The wood on the legs are a lot lighter than I expected, but still looks good with my dining table. The chairs are more of a burnt orange than red but really are beautiful, so I have no complaints.", 
    "We purchased two sets for a total of four chairs for my moms dinning room. They are beautiful, my mom has lumbar stenosis (constant back pain) and the lumbar support is fantastic for her she is only 5 feet tall, but able to sit with no back pain. My husband is 5' 9\" and he also states the chairs are great. this was a great purchase. I was able to assemble all for chairs in about (1) hour with no problem. Just remember when putting together DO NOT tighten screws until all screws are partially in place then tighten all screws one at a time.", 
    "While the chairs are not 5 star hotel quaility, they are attractive and do serve their purpose well. They add elegance and style to my dining room and compliment my capuccino round table. I like the look, but noticed they have a sitting weight limit of 250 lbs.", 
    "If you are looking for a red chair, this is not it. The color is a rust orange color.", 
    "The color of these chairs are more of a burnt orange than a red, but for the price these chairs are a great buy.", 
    "packed well. Easy to put together and comfortable to sit on.They look more expensive than they cost.", 
    "Love them, old recommend with caution on color. It was able to still work for me but not what I was looking for, wanted red.", 
    "I love the style, color and fabric. Unfortunately I wouldn't buy again due to quality issues. Too lazy though to unassembled and return given that they were a super bargain. I'll probably use for several years until they wear out and then seek a replacement...", 
    "I bought four of these chairs for my dining room. They were delivered promptly. The directions were easy to follow and the chairs were fairly easy to assemble. They look great!", 
    "I love these chairs, they are the perfect color to match my decor and very comfortable. I got the red floral and they are just beautiful! Super easy to put together! Highly recommend!", 
    "The chairs are not red, more orange tones. Otherwise very pretty", 
    "I pruchased these chairs to go at my kicthen table. They are really nice looking, light weight and the owwd macthes my table perfectly. Only complaint is with Overstock, because they sent me the wrong chairs and it was a pain to have to take that heavy box back to UPS to return the chairs. I was surprised because I have never had overtock make a mistake like this.", 
    "I purchased two of these chairs and they blend perfectly with our décor. You certainly can't go wrong with the price and I'm looking forward to many years of use.", 
    "I chose these chairs to accomodate others that I have in ivory. the pattern and design of the floral fabric matches perfect with what I have already. The tecture of the fabric stands out and pulls out the designs of the chairs I have already. What a perfect match to enhance the ivory chairs.", 
    "We ordered 4 sets of these chairs. My daughter and I had all 8 of them assembled and in place in about an hour. Actually she did all of the work and I opened the crates and handed her parts and screws as she need them. There were no parts missing and everything was packed very securely. We are both very pleased with these chairs.", 
    "Assembly was fairly easy. Be careful to use the 1 page instruction (bottom of the box; inside), there are different sized screws that are important to use in the right places. One of the 2 chairs didn't balance well; it rocked. Still working the extension tabs to eliminate the wobbles. Nice wood legs. The chairs are lighter than they appear.", 
    "the chairs were fine except fpr the color. other than that,they are comfortableand well designed.", 
    "Everything associated with this order was perfect. Great experience throughout the ordering, purchasing, delivery and assembly process.", 
    "I was concerned about ordering 4 chairs in case the color didn't match my room. I spoke to a customer service rep and she was very helpful and so I ordered them with her over the phone. I was so pleased when i opened the box and saw the color was perfect! They were easy to put together and now I have decided to order two more. The legs had a few nicks in them but they don't show when they are put togehter", 
    "Have not actually put these together and used them yet since they will not be moved up to our new house in New York until December. Despite that, I was absolutely thrilled when I opened the box and saw the fabric. They will look perfect against a dark wood antique dining room table and look like they will be comfortable to boot! We have always had solid wood chairs for our dining room but find that they are often not comfortable to linger on when company is over. With the transition to upholstered chairs, we are looking at hanging out at the table much longer!", 
    "Staging a model home. Great colour,easy to assemble. Great buy...", 
    "So far I'm satisfied with the chairs. I haven't used them yet but I had no problem with putting them together. The chairs are pretty comfortable and heavy in in weight. At first I though that they would be light in weight and feel cheesy, but to my surprise they were not. I'm happy with my purchase.", 
    "Loved this set of chairs, bought two pairs, for an informal seating area. The price is unbeatable, and it brings color, and sophistication to the home. The rich color and intricate design adds the right tough of luxury. Very pleased with the purchase. Comfortable, cannot state about durability as we have had it only for 2 weeks. The assembly took an hour for two chairs. The box comes with marked with parts. The package did not come intact, we were lucky that all the parts were still in."
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Red-Floral-Parson-Chairs-Set-of-2/6541509/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6541509/Red-Floral-Parson-Chairs-Set-of-2-L14123296.jpg"
  ], 
  "description": "Bring comfort to your home with these stylish red floral parson chairs. These paisley parson chairs are sturdy and durable. Your back will be well cared for due to the contoured backrest, which provides the spine with needed support. The high density filling gives you a plush and soft surface to sit on, while the rich color of the paisley parson chairs is sure to add warmth to your home.\nNumber of pieces: TwoSturdy constructionAdd color and style to your dining area or any room in the houseContoured back and high density foam for comfortable seatingSolid wood feet Upholstery finish: Red floral paisley damask fabric Finish: BrownDimensions: 38 inches high x 19 inches wide x 23.5 inches deepMaterialWoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorRedFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleUpholstered"
}