{
  "name": "HomePop_Classic_Brown_Tan_Sage_Leaf_Fabric_Dining_Chair", 
  "price": "EUR 66.25", 
  "reviews": [
    "Super pretty little bargain chairs. Very good price. Absolutely love the fabric and muted colors; it looks just as good in person. Pattern has lots of dimension. Reasonably easy to assemble. Can't evaluate durability yet 'cause I just got them. But I'm happy so far.", 
    "This DINING chair was the answer to a small bedroom space to go with a small desk. Assembly was easy with back attached to seat and then 4 legs Despite odd green background color, the colors go well together. I am happy with purchase", 
    "We were looking for a unique designed parson chair to go with our new dining room table. These were a great price and a perfect fit. I was a bit concerned as the description didn't state much about the color of the legs of the chair however it is a perfect match. The picture was spot on. You can't beat the price of these chairs and they were easy to assemble. We did 6 in about 30 minutes.", 
    "Love these chairs as they work with any color wood. I thought the background color on the fabric was gray based on the online photo, but it is actually a sage green. This color worked for my room but may not work for everyone.", 
    "They are beautiful and comfortable. My friends came over and we had dinner on them and they were great. They went together pretty easily, it took less than 2hrs for all four. My friends thought they were perfect for the setting and the table.", 
    "These chairs were easy to assemble and very comfortable to sit in. I had read conflicting descriptions of the background color as being gray or green. They definitely are olive green background. Someone who loves the outdoor hunting look will like this color combination. It took so time for me to get used to this color but now I find it relaxing.", 
    "I bought a pair of these chairs to complement the wooden chairs I already have in my dining room. Although they are rather light-weight, they do look nice. I actually decided to use them as accent chairs because they are not very comfortable to sit on for extended periods. Not as substantial as I had expected/wished, but fair value for the money.", 
    "The perfect chairs to replace my old leather parsons set that just got too old looking. I didn't want leather anymore because it is too hot and loses its beauty fast. These chairs look nicer than my original set when it was new and they cost half the price even though I bought the old ones over 6 years ago.", 
    "I would order from overstock again. They go well with my dining table and the pattern was as pictured", 
    "very sturdy, easy construction, colors go well with my jewel tone scheme, contemporary yet traditional. would work with any style. Fabric very durable and easy to clean.", 
    "These chairs were beautiful for me, a perfect fit for our dining room and nice earth tone fabric and design, on strong fabric. The leaf colors true to picture shown. Light weight and easy to move about. Great price and value. Was missing one bolt for one of the chairs but was able to run to near by hardware and find a replacement. Easy to assemble... Love My new dining chairs. Perfect match for our Oak Table.", 
    "The chair arrived yesterday and was semi easy to assemble. I think the color is a shade darker than appears in the photo but overall I really like the chair. The only complaint I have is that when sitting in the chair it feels the back sinks in a bit because there isn't much foam. Other than that the price was great and shipping was fast. The chair looks great with our computer desk.", 
    "These chairs look and feel great! The seat cushion is nicely padded and feels very comfortable to the user. The overall feel of the chair when in use is that it is stable and well made. The appearance when not in use is very attractive. I partnered 4 of these at my dining room table with 2 of the Tribecca Home Chocolate Chenille Wingback chairs also bought on this site and they match perfectly. I was a little worried that they would match well but there was no need. Looks like a matched set. Very pleased.", 
    "Bought these chairs for my mother as a gift. She said her old ones were too hard, so I was looking for something with some cushioning that also matched her dining room. She really likes the look and the feel of these. The chairs were well packaged. I found the assembly easy after the first one and could put them together in between 5 and 10 minutes each. They are nice and solid, all the parts were there, and everything went together well.", 
    "The entire process from ordering to sitting for Thanksgiving diner was flawless! NO DISAPPOINTMENTS HERE!", 
    "I feel the picture is misleading. Color is very different.", 
    "These chairs are very comfortable, easy to assemble and stylish. The only problem, and it could be a big one, is that the colors are not as stated in the description. There is no gray, it is a sage green. This mattered to me because my dining room is gray, yellow and brown, but after looking at the color combination for awhile I decided to keep them. They are lovely chairs and very comfortable. They don't look as inexpensive as they are. The only reason I didn't rate them excellent was the color being off. I'm quite satisfied.", 
    "I use this as a desk chair for sewing. it is perfect height and cute for my room décor. Only downside is that sitting in it for a while, it starts to hurt. I wish the seat were more cushiony. I love the design and the colors. And the adjustable screws on the bottom of the legs help because I have a hardwood floor and it is not so even. But adjusting the screws on the bottom of the legs of the chair makes for it to be sturdy and not wobble. I get a lot of complements on this chair.", 
    "This was our first experience with Overstock. The service was very good, The chairs were everything we expected. We put all four together in about an hour with no problems. The colors are beautiful and the chairs are sturdy. They look beautiful in the dining room. Love them!", 
    "I initially planned to purchase all wood dining chairs, but I'm SO glad I bought these...SUCH a warm and rich appearance & comfortable! My mother has an amazing eye for furniture and she encouraged me to buy them (hands down!!!). Assembly was very easy after I got the hang of it with the 1st chair (I assembled all 4 chairs by myself...maybe 20mins each +-). It doesn't even look like they were assembled! My dining area looks fabulous!", 
    "If I could, I would put 10 stars. This chair is quite the influence on my guests. The chair is very light. I love this chair so much, I regret not getting it before.", 
    "The chairs were very sturdy really accented my dinning room", 
    "these are very sturdy chairs with very true to the picture fabric colors. I have used these chairs 2 years and there are no rips, tears or stains on them still.", 
    "I love the looks of this chair. I got four and they were easy to put together by myself. The only problem is that if you are a short person the front of the chair will hit you in the back of the legs in an uncomfortable way. They look well-padded and at first feel well-padded. But after sitting for a little while I found the chair uncomfortable and had to suggest my guests move to the living room for dessert in order to stop the pain.", 
    "I ordered 6 for my dining room and each chair took about 1/2 an hour to put together. I suggest you put the back and seat together first, then the front legs. The chair itself is sturdy and the colors are exactly what I expected. Wish I could add a photo because they really do dress up my dining room.", 
    "These chairs are beautiful, well built, colors are rich, and comfortable as well.", 
    "Easy to put together. The back two legs are already part of the back of the chair, so I just needed to attach the seat and two front legs. This made for a very sturdy design and easy assembly. Chairs look very nice.", 
    "Beautiful, a little darker then I was wanting but really nice chairs, I love them.", 
    "The only thing that prevents me from giving it 5 stars is they're not as substantial (heavy) as I would have preferred but they are worth the money... They are beautiful in my dining room", 
    "Ordered 4. One came without screws. We called the help line and received them in 10 days. We like the look but the seats seem lumpy to me.", 
    "legs continue to need to be tighten. other wise love the pattern", 
    "I ordered two of these chairs. They are beautiful and ive received many compliments BUT they are not sturdy. The legs rock. the seat it self has no support so when you sit you feel you bottom going down. When you turn the chair upside down you can tell it is built for looks not for use.", 
    "I purchased 4 of these and 2 solid parson leather chairs for my dinning room table. The chairs look great and are comfortable to sit in. We had some issues with a few legs but Overstock quickly responded and sent new ones.", 
    "I am very pleased with the set of four dining chairs. Excellent price for the quality, easy to assemble and very attractive. The fabric is perfect to complement tan carpet, teak table and brown leather furniture elsewhere in the room. Seat is comfortable for a long meal and conversation.", 
    "The chairs are pretty easy to put together. I'm a senior and I put the all together myself. My only complaint is that the sit cushions are rather thin. I find that for my comfort, I have to put a chair cushion on them.", 
    "The chairs are nice I like the mayerial but they could use a little more padding.", 
    "I'm always satisfied with my O purchases but this one not so much. It's easy to assemble except that while doing so, the screw split one leg open :-(...it says foam padding but when you lean back it makes an annoying noise like it's stuffed with newspapers or some kinda paper..cheap", 
    "Not as sturdy as I had hoped. Fabric is as described, maybe a little darker but has a warm earth tone. Chair is light for the price. Size is as described", 
    "These chairs are very pretty, but I'll use them in an area that doesn't get much sitting. I'm not sure how they'll hold up.", 
    "After only sitting on this chair twice, the seat cushion is already crushed and looks dented. THe cushion doesn't go back to place. I'm not overweight so this should not happen. Poor quality cushion. Too bad because the style is nice. Now I know why its one of the cheapest chairs on Overstock. This chair is not for sitting on which defeats its purpose. Shame.", 
    "The warm colors of the leaves enhance the colors of my room. I was worried about the wood color because I was sure it would match. I have very dark wood in my living room and fruitwood in my dining room. This wood color magically matches both! I love my two chairs!", 
    "I'm keeping the chairs, they suit my needs. If your looking for perfection, for this price, then don't buy these chairs. There are spots where the workmanship is poor. If all of these places were unseen when the chair gets put together, it would be better. Some of these spots show after you have assembled the chair, but your not going to get perfection for $$ on these chairs. After I put them together, those places weren't real visible unless someone picks up the chair, turns it over and really gives it a close inspection. I cut off the hanging stings from the material edges that were left showing on the chair. Since the least expensive chairs, of good workmanship I could find locally exceeded $$$ each I decided these will suit my purpose. Just don't expect perfection when you get them.", 
    "Perfect chair at a fantasic price. There are no surprises. This is a great deal.", 
    "Great price on a nice chair! Arrived well packaged and was fairly easy to assemble (1/2 hour for one chair). The photo makes it look grey, but the background is definitely a sage green with tan and reddish brown leaves. Great accent chair for a new dining room set!", 
    "WELL MADE AND COMFORTABLE. EASY TO ASSEMBLE AND WELL WORTH THE VALUE!", 
    "Well made and comfortable", 
    "I love this chair! I purchased it to go with my desk and it fits perfectly. I'm very happy with this purchase.", 
    "Beautiful, as it appears in the photo! Soft, plush, comfortable and sturdy!Great buy!", 
    "I love these chairs! They are beautiful and comfy and make my kitchen look so much better. The other comments about the color are correct. The background in the picture looks tan, but are actually sage green, which I am fine with as I have some green in my kitchen. The only reason I gave it 4 stars is because it was a little difficult to attach the backs to the chairs. The holes were hidden and it required a little maneuvering, especially for 1 person. But once they were together they seem very sturdy and I love them", 
    "Furniture looks ok, but we had to order several times bec it came missing several pieces time and again.Chairs are shaky and we keep on having to tighten them and the threads keep on coming out.So if you buy them and plan to keep them short term and not use them that much, they're cheap so they'd be worth it.", 
    "very nice chair check them out you wont be sorry.", 
    "Color, pattern was as shown. Could not beat the price. Very easy to assemble", 
    "I was hesitant about buying chairs on line, but sure glad I did. I love the chairs. They did all have to be put together, but with my husband doing the work, it was easy. The color is a little different from the picture. The background is a soft sage green, the brown is true brown and the leaves are a light gold. Love them.", 
    "Nice fabric, looks really good and is holding up well.", 
    "More than meets our expectation. Quality product.", 
    "Nice sturdy chair. Good colors.", 
    "Bought this for daughter's desk", 
    "Bought this to put at my desk and it is perfect. Looks just like the picture and not difficult to assemble.", 
    "These chairs took about 2 hours to assemble. They look good and should last. They are a little hard to sit on and not the most comfortable. They are also very light. They look good in our dining room.", 
    "This is a beautiful and high quality dining room chair. It is very comfortable. I am going to use it as a statement chair - my other dining room chairs are all wood. Our dining room is in the living room too - the pattern & colors coordinate well with the living room sofa and my recliner. Recommend.", 
    "The chairs match my antique dining table perfectly. They make for a dressy ensemble. The only downside is they have a slight musty odor, which I am hoping time and Febreeze will cure and they are a little lightweight. For the price, they are lovely chairs.", 
    "I bought this for an office chair. Online, the background color looks more grey, which is what I wanted. The title does say \"tan sage\", so I should have known. I am keeping it to put in a bedroom. Comfortable and sturdy!", 
    "Great price, quality, and very easy to assemble. I expected it to be more gray/brown based off the pics, but it is actually sage green.", 
    "Beautiful chairs and quite comfortable.", 
    "Great chairs. True to color on picture. Looks great in our breakfast nook. Sturdy and not wobbly. Assembly was simple and quick.", 
    "I just love my new dining room chairs and they are very comfortable.", 
    "I love my new chairs. The fabric is beautiful and the size is perfect as an accent chair. Very easy to put together.", 
    "Great as an accent chair to a dinning room and comfortable", 
    "These chairs are so comfortable and they look very nice in my dining room", 
    "Nice comfortable chairs. The \"sage\" background color is more prominent that the photos indicate. One of the two chairs ordered was missing the two front legs and hardware. Overstock was very good about having those shipped to me in about a week. Overall, happy with the purchase.", 
    "Chairs were very well packaged. They were easy to put together. Fit exactly into my decor. The chair is very comfortable", 
    "Each chair came in it's own box that had to be assembled. After putting the first one together the rest were very simple. The fabric is beautiful. Chairs are very sturdy and the cushion is so nice and firm. Can't get better chairs and at a great price.", 
    "Nice chair for price. Pattern and style beautiful.", 
    "I am using this chair at my vanity. It is very pretty and decent quality for the money", 
    "the chairs are great although two boxes did not have the legs and nuts and bolts in them but the issue was addressed immediately and to our satisfaction.", 
    "We love these chairs, but the legs are out of balance and are hard to keep level. Also, the whole chair has to be tightened regularly. We have tried all we know to keep the hex screws tightened. They do look good and are comfortable though.", 
    "The chairs were perfect ! color and comfort great. I did havea little trouble with the assembly.I,m very happy with the purchase", 
    "Nicely built, solid wood. Cushion is very thick. The color of the legs a more of a red color than a an espresso. I needed it darker, so I sanded then and stained them sense it was solid wood. The fabric color is a golden dark yellow, deep chocolate brown, and light sage green. Worked perfect with our table we built.", 
    "These chair are beautiful, comfortable and the price is right. The description and picture match what was delivered.", 
    "Easy to put together, sturdy and lots of tush-cush. Comfy too. We paired it with a rustic farm table to give it a less country vibe and it works!", 
    "These chairs are fantastic. Their very sturdy when compared to pricier, comparable chairs from other manufactures'. They are Very, Very comfortable when sitting for extended periods of time, no aching backs or butts. Colors are exactly as shown in the pix. Were the hit of my latest dinner party.", 
    "Excellent quality for the price! (under $$$!", 
    "Comfortable, very easy to put together. Fabric is exactly as it appears, shows little signs of wear even after a year of use.", 
    "Beautiful, good quality, great value...an excellent purchase. Just what I was looking for. Easy and relatively quick to put together. I am completely pleased with this purchase.", 
    "I was going to replace my old, broken wood chairs for my dining table with similar ones which were all around $$ or more each. Then I found these, read the reviews and ordered six. They came quickly and are very nice. The background color is sage, and the colors are a shade or two darker than the picture looks to me. The patterns have a raised texture that enhances the appearance, they look much more expensive than they are. If you go for earthy browns and greens I think you won't be disappointed. The colors and style fits in perfectly with my other things. Very pleased that I found them.", 
    "Bought two of these chairs to complement my dining room., I love them - fairly easy to put together and comfortable to sit on. Colors are just like on the website.", 
    "Comfy, sturdy, and attractive.", 
    "Good fabric and good mix of colors", 
    "The cheers that I selected are very comfortable look good and very practical for the kitchen", 
    "Love love love ... So easy to assemble ... And more beautiful than the pics.. Nice and sturdy ... So happy happy", 
    "These were easy to assemble. They are really nice looking. I love the colors", 
    "Love this chair. It was exactly how I thought it would be. It is very comfortable as well", 
    "Love the fabric. Not difficult to put together. Looks great!", 
    "I bought 2 of these chairs as extra seating when we have company over for dinner. They look beautiful! Very sturdy and easily put together! Very pleased with this purchase!!", 
    "Love them very solid looks great and works well with my décor.", 
    "After surgery, I need a chair in my room that wasn't low and gave me back support. I also needed a chair that was cushioned and did not take up too much space. This chair was exactly what I needed. The color and fabric are great. I'm very happy with it and it was quick and easy to put together.", 
    "Good quality chairs. Very easy to put together and look great. Would recommend these to anyone.", 
    "Beautiful chair!!! Bought 5 and thinking of ordering 3 more.", 
    "comfortable and well made", 
    "I bought them for my daughters Christmas gift and they are beautiful!! Everyone LOVES them. Well worth the price!", 
    "Okay chair. Using it as a desk chair for my armoir. Not exactly the colors I wanted.", 
    "I bought two of the chairs for a breakfast nook and then bought another one for a kitchen desk chair. Overall, I am pleased with them.", 
    "Excellent quality, easy to assemble and very sturdy !", 
    "This chair was very simple to assemble, and it is quite beautiful. I don't believe the picture does it justice. I use it as a desk chair, but feel it would be gorgeous around a dining room table. The price just can't be beat.", 
    "after about 2 years the springs lose some springiness and you sink in a bit more, but fabric is holding p nicely and easy to clean. Legs need to be retightened about once every 2 months.", 
    "Good chair, fabulous fabric. perfect for a lightweight person. I use it as a desk chair", 
    "love these chairs with my table", 
    "Chairs were much better THAN pictured. This picture gives the chair very little justice. The back rolls and is fancy. However, this chair was complicated to put together. Keep that in mind if you want ease of assembly this chair is not for you. But otherwise, GO FOR IT.", 
    "Very comfortable to sit on it", 
    "very comfortable and easy to put together look grand in dining room", 
    "This is one of those items where the price was obviously to good to be true. When I received and assembled them I thought they looked great and the seat was really nice and comfortable. with in two months the main spring broke in four of the eight chairs I bought. It ripped thru the bottom fabric and protruded down with a sharp edge that could cut your legs if you put them under your seat when seated. There was no way to fix it and I had to cut the springs off which made to seats sink in. This item should have been recalled.", 
    "Needed four chairs to go with a cherry kitchen table. I was a bit hesitant to order furniture on-line, but given the price, I thought it was worth taking a chance. The chairs arrived very quickly, they were easy to assemble, and look great. Very happy with my purchase.", 
    "Very pretty and easy to assemble. I may give it an excellent rating in the future if I see that it holds up well. I have only had my chairs for 2 weeks.", 
    "Easy to assemble. Look just as shown. Excellent value!", 
    "Easy to install AND LOOKS GREAT", 
    "great chair goes with my bedroom furniture and very comfortable", 
    "Absolutely beautiful and well made. I bought it for a desk and it is perfect. Comfortable and sturdy...The price was excellent and I could not be more pleased. Thank you.", 
    "Lovely fabric that goes well with earth-tones and seems well made. Needed a chair for a small guest room and this fits nicely. Love the versatility of this dining chair.", 
    "Easy to assemble. Looks great at the table.", 
    "very nice, material soft, a little darker than the picture but looks and matches perfect. very happy with price and product", 
    "I bought 4. Put them together. The seats are losing their firmness after 6 months, I think I need to tighten the legs. They look good, but don't seem like they will last too long.", 
    "Nice chairs easy to put together.", 
    "The chairs are lovely and substantial, but the color scheme isn't quite accurate. The colors in the picture are quite different, than in person. That was the only disappointment. In actuality the chair base color is a grayish sage. Not bad, but it could've been better. Putting all 4 chairs together took less than an hour. A pretty solid investment.", 
    "These chairs are sturdy and comfortable. They really are an incredible value for the price. Colors are very true and material is good quality.", 
    "I love my chairs, they were easy to put together, I am a 73 year old woman and had no trouble with the job.. they are even better than they looked in the picture.. and arrived sooner than promised.", 
    "We received the chairs amazingly fast. They were fairly simple to put together and they are beautiful. We are very pleased with our purchase. Love the colors and the seat is very comfortable.", 
    "I ordered four of these to go with my cherry dining room table. They went together very easily and seem quite sturdy. They have a pretty fabric that blends very with with my decor.", 
    "Just as detailed, Perfect chairs to use for dinning, accent or just extra seating. A good buy", 
    "I got this chair for my sunroom and it works perfect! The price was unbelievable, I'm very happy with my purchase!", 
    "Love these chairs! I bought two to complete my table and they look amazing in person. So happy! I'm hosting Thanksgiving at my house and they look fantastic. Sturdy, easy to put together and arrival time was quick.", 
    "We ordered 4 of these in spite of previous reviewers warning of missing parts. The shipping was fast - just a couple of days - and sure enough one of the chairs was missing two legs.To their credit Overstock got right on it after an email followed up with a phone call and sent a new batch of parts.The chairs were fairly easy to assemble and so far seem very good.", 
    "Hard to assemble.. Not an easy task. Once it was done, it looked good. Nice colors and fabric. Looks rich.", 
    "This chair looks to be well made, with a thick, beautiful material. As others have noted, the background color is more of a sage green, and looks nice. My problem with the chair is the foam used in it is stiff and not comfy to the tush. The last set of chairs I used, were much more comfortable. Also, the back of the chair seems to be under stuffed, and also not especially comfortable. Too bad. Would be 5 stars if they bothered to use the right foam.", 
    "Bought this for my desk chair, love the colors, may order more for my dining room, terrific price, great quality!", 
    "I love my new dining chairs! Very comfortable and stylish! Assembling was a breeze!", 
    "Really great buy! More beautiful in person.", 
    "I needed a chair for my desk, I do not use the desk often, and did not want your typical desk chair as the desk is located in my living room. This chair is perfect, it adds a touch of class and does not look cheap. Bonus, it is very comfortable to sit in!", 
    "Nice looking chair, but the seat cushion is not sturdy. Feels like you're sitting in a hole.", 
    "U found these chairs during a sale, so I got a great deaal. The colors fit into my decor perfectly ! They are also very comfortable. Thanks Overstock !", 
    "This chair is not just beautiful, it's sits great too, Plan to buy more.", 
    "Attractive, well built and vey good value", 
    "We ordered these chairs to soften up the breakfast room/kitchen in our new home and they are perfect! The chairs are substantial, comfortable, and the fabric is very nice. The assembly was easy, too. Love them!", 
    "I love my chairs . Very easy to set up and perfect for my dinning room", 
    "Looks like an expensive chair. Perfect for any use.", 
    "Comfortable & nice. Look much money more expensive than they were & look great with the rest of my cherry furniture.", 
    "A little cumbersome to assemble but love the chairs.", 
    "Very happy with these chairs. Very comfortable. Great color and design. Easy to assemble and durable .", 
    "Love these chairs! Easy to put together and comfortable too.", 
    "I bought 4 of these chairs and once put together, they are beautiful. The instructions are a bit hard to understand, but once they are together, they are lovely for any dining room table. Very pleased with this product.", 
    "Great value for the price and matched my table perfectly", 
    "Came by FedEx without any damages to boxes or chairs.Went together well, once you got all the screws started, then tightened them up. Need to check the chairs after a couple of months use to retighten the screws (tools supplied). Chairs are comfortable, look nice and good value. Colors easy to co-ordinate table linens with. Have received many compliments on them.", 
    "I really like this chair. Has given new life to my dinning room. The color in the picture is right on.", 
    "Cheap nice chairs but not enough parts in each box to make a full chair. Something was missing or didn't fit in every box. I ordered six. I barely have enough parts for 4.", 
    "This chair is lovely but the colors are a bit different than the picture and don't match my needs so I had to return it.", 
    "GOOD QUALITY...NICE MATERIAL...I WOULD RECOMMEND!", 
    "This chair is beautiful and well made. I bought 4 of these and love them.", 
    "Love this chair, bought 4 and easily found a table to match ! Easy to assemble with a little patience, witch is good because that's all I have is a little 😉", 
    "A little back heavy if you have small children around but a nice chair for the price", 
    "The chair is beautiful and looks just like the picture. Matched my table perfectly. Quality is good.", 
    "This is a beautiful and comfy chair. When my daughter moves out I am giving her my current table and chairs and I want 5 more of these chairs and a new table. Absolutely beautiful!", 
    "Purchased two of these dining chairs to use as accent chairs in my livingroom. Very well made, easy assembly, elegant! Very please. Overstock is my \"go to\" online store.", 
    "Both of the items I purchased were excellent buys. Loved the quality of both and looks great.", 
    "Great chair. Purchase for Ladies lounge in office and got rave reviews from my staff", 
    "Beautiful workmanship and quality they look great with my industrial style table", 
    "I know these are inexpensive chairs and they shouldn't be compared to fine furniture. My story: I bought 2 chairs, They arrived promptly and the assembly and design were quite clever. I assembled them and like them so much that I ordered 2 more chairs. Four days after the first chairs arrived, I unpacked the next two and was quite disappointed. The construction quality was nothing like the first two. I had to use my power drill and a file to clean up the underside in order to get the bolts to line up. The holes were filled with splinters. The hardware included with each chair was missing washers for these two chairs. The first set had a clever velcro fastened dust cover on the underside of the chair to cover the assembly. This was totally missing from the second set of chairs.", 
    "The colors were right on the mark for what I needed and it is a very sturdy chair", 
    "The color was a little of in the ad now it states that it is sage", 
    "The screws have come off and parts falling apart in 2 months. Do not recommend this product. Cheap construction quality and engineered wood.", 
    "Good chair for the price, however, it's not that sturdy.", 
    "Great value. Appearance quality very good and passes formal dining standards. Detail/workmanship acceptable. Fabric background colour is light green shade versus tan shade pictured. Disappointing but still works. Assembly straight forward but can be challenging due to non-visual workmanship.", 
    "I bought ten of these chairs. They were a little tuff to get together. But by the last one we were pretty good at it. They are not very sturdy, but they are for my formal dining room. They are nice for the price.", 
    "Love my new kitchen desk chair! Very comfortable and the chair colors go with my new kitchen.", 
    "Liked these, but got tired of the busy fabric. Nice quality for the money.", 
    "These chairs are terrific. They are well made and go with my new table. The price was great.", 
    "First we ordered four of these chairs, not sure if they would be as nice as the picture. They arrived, each packed in a separate box, each about 40 inches long and 2 feet wide and 1 foot thick. It tool me about an hour to assemble the first one - all you really do is connect the chair back, which contains the two rear legs - to the seat, then attach the two front legs. Instructions were straightforward, all pictorial. Hardware was impressive, nice machined screws, with matching lock and disc washers for each and a single wood peg to align/connect the seatback and seat.. These are tighted with a supplied allen wrench, but I used my own allen bits in a cordless screwdriver.They turned out so nice we bought four more, which totaled 45 minutes to assemble.Don't know how durable they'll be... we'll see.I got faster", 
    "I like the chair but do not care for the color. I had read the reviews before I order it but I thought I would take a chance. The color does not appear as bright as you see it on line.", 
    "I purchased ten for my new dinning room table.", 
    "I bought these chairs to replace our old dining room chairs. They are lightweight, yet durable, and have given us so much more room in our dining room. Was leary because the price seemed too good to be true, but I have absolutely no regrets and would recommend (and have!) them highly.", 
    "I immediately loved the pattern of these chairs when I saw them and the price made so much more sense than covering my existing faux leather chairs which were starting to get dried and cracked. They are not quite as sturdy as my old chairs, but for the price I was pleasantly surprised and very happy with the purchase. I got them delivered for free so to get four new beautiful chairs for approximately $*was amazing!!", 
    "Exactly as pictured, although as other reviewers mentioned, the background is more green than gray. The chairs are well made, easy to put together and very comfortable as well as sturdy. Excellent buy for the price.", 
    "I love these chairs. Comfy. Easy to put together after the first one. Directions hard to understand.", 
    "The chairs just arrived and my husband, a very experienced wood worker, set about putting the first together. Three of four inserts (for the bolts) went on okay, but the fourth was stripped out. As much as I think the chair is pretty, that makes me question the quality. Would be an issue without his ability to fix properly.", 
    "Nice chairs- little darker than in picture but still very nice.", 
    "Love the print, color and fabric. I bought 6 of them fir my diningroom table. After my husband put them together in no time , very easy to assemble. They are very sturdy and well built. I decided to order 2 more. I have all 8 around my diningroom table and I get compliments from everyone who sees them .", 
    "good price but not a comfortable chair, feel sinking when you seat it.", 
    "I received the chairs and had a lot of difficulty with the assembly. The instructions and diagrams were not helpful. I am afraid that I did not put it together correctly.", 
    "The color is very rich and the chair comfortable. Looks more expensive than the price!", 
    "cumfy. Can't go wrong for the price. 2 years old.", 
    "Provides comfort, reliability, and class in my new home. Colors are deep and rich with some green. Green really worked well in m case and most likely will work well in yours. I was very surprised and I have received many compliments. Looks like Ethan Allen piece!", 
    "great chair, love the pattern", 
    "Love the new chairs .....the color is great !!!! the seat coushion a little hard. PRICE WAS GREAT .", 
    "I bought these chairs for my mother (over 80 years old). She loves them. They are comfortable and stable which is important to her. The fabric is nicely textured. The assembly was easy and I could not be happier. A great deal!", 
    "Very happy with the chairs that I purchased good quality made well sturdy. Packaged well arrived on time", 
    "Chairs are really nice, comfortable to sit on. Glad I bought them.", 
    "Sweet deal, lovely chair....have mine in guest room and it adds a nice touch to the décor. The assembly was easy even though I'm not too handy with tools.", 
    "These chairs were quick to assemble and are very sturdy. We are a family with some larger members and they are strong and durable. There was a plastic-y/chemically odor when they were first assembled but it faded and was gone after a few days. The fabric background has more of a khaki green hue but it's not unpleasant and fits with the overall pattern of the fabric. These are great chairs for a very good price.", 
    "I'm happy with the look and the price but wish the seat was wider.", 
    "I was actually going for something bright and vibrant to bring out my brown living area furniture, but went with these chairs instead ( because of the price for one and because of being different for two). I made a good choice. It took me no time at all putting them together, and once I did, I love them. The fabric is awesome, the height is great, and the wood color brown of the legs went perfectly with my wood brown round dining room table that I bought them for. **love**", 
    "Really enjoy the chairs. The piping on the back is a lovely detail. Putting it together wasn't too bad after we rubbed soap on the screws. They are very comfortable and solid. The colors are true to the picture and would probably fit into almost any décor. Note we had to retighten the screws as they did loosen up a little.", 
    "these chairs are really cute. worth the money. not a forever chair though. they seem to be not the strongest made out there.", 
    "I like the chairs but the glides that support them are hard plastic that is noisy on a hard floor from just moving a chair and a loose fit that will need frequent adjusting. The noise they make is enough to make your dining room set seem shabby. They're lousy enough that I had to buy better felt-tipped replacements for another $$ online. But given the low price for the chairs (in part due to a coupon code too, btw), I'm still okay with it despite this flaw that seems so avoidable by the manufacturer. Not a mark of high quality.Assembly note: For whatever reason, the screws are hard to turn. This may make them hard to get looser in the future (which could be a good thing as the chairs age) but assembly was slow and annoying because it's hard to tell if they're cross-threaded or not when putting things together.Still, considering that similar chairs are double and triple the prices of these, I say go for it but keep these issues in mind.", 
    "I Love Them! Absolutely Beautiful!!!!", 
    "Nice cushion love the design", 
    "These are nice looking chairs for the price. However the picture gives an appearance that it will be quite comfortable. It is not. However as a dining chair it's sufficient.", 
    "Very pleased with the chairs. I bought themfor an office. One for the computer desk and one for the roll top desk. Colors are hard to tell online. Also I was able toPut them together by my self fairly quickly.", 
    "I purchase this chair to replace my old dinning room chairs...start with one to test out fell in love and made a additional of 5...it has did a makeover to my dinning gives a sense of elegant without hurting ur pocets the reason why I rate 5 stars!!", 
    "The chair is lovely! We were able to put it together quickly and easily. Price was great and quality very nice. Thanks", 
    "Very time consuming to assemble all four. Don't like that tips scratch my floors.", 
    "I thought oh wow they chairs are so cheap what a great deal. Well now I know why people pay so much for chairs \"quality\". First I ordered 8 chairs which I didn't get all pieces and had to send for more. Then got the replacement delivery which didn't send me the right pieces once again. Had to wait again for the remaining. Each chair is a back piece two front legs and the seat which you have to use an Alan wrench to screw in 10 screws per chair. When you tighten one side it loosens the other so you have to keep going back and forth. When the chairs are used or moved it loosens the screws and makes the legs wiggle. Our child has already snapped one leg in half they are so flimsy. Same with the pegs on the bottom of the legs as you move the chairs the pegs loosen up and start to come out this is a constant thing. I like the print of the chairs they look wonderful it's just too much work trying to keep the screws in. I don't think this set will last very long.", 
    "These are very beautiful chairs that fit right into my dining room. I have received numerous compliments from family and friends. Along with their beauty they are very sturdy. I think they will hold up for a number of years.", 
    "The chair is quite nice and a great price. Had some trouble putting together but with my husband's help we did it. Works perfectly by my vanity and is comfy.", 
    "Solid, comfortable, great price", 
    "I love this chair. We have a long wall desk in our kitchen. Our walls are a light sage green and we have dark brown granite countertops. The green and brown fabric looks great with this combination.", 
    "not as sturdy as would have liked", 
    "I was so pleased when I saw my 2 chairs! They make the frontroom writing space special! One chair is facing a window at a writers desk. The other is 3 feet away, at a slight angle... faceing the middle of the frontroom, at a very small, narrow, cute desk (curved legs) for my laptop, while watching TV, The cushions are full and just right!.... It was not difficult for me (over 60yrs young), to put them together. ... It helped having my husband hold the chair on something, while we had it upside down. I love looking at the back of the one chair, from the sofa. As the chairs have a lovely rolled look to the chair backs, also a corded tuck & roll was added. They should show that feature online. It's interesing how the leaves have a tiny fabric raise 3D effect, as you look at them from different angles. Also the leaves colors change at different angles. It's so expensive looking! The main fabric color is almost like a light sea-green... with detailed leaves mingled on it in a lighter shiny sea-green color. Also,there are the brown leaves, and pretty light golden colored leaves. The picture does not do it justice! You have to see it in different lightings to really appreciate the details. I love just looking over to them both... and just be happy I found these chairs!", 
    "I bought these chairs 8/2014 and I thought that it would be a more beige and red color chair = NO. It is a sage green with a darker yellow and red leaves. It turned out perfectly actually. I have two pictures hanging up also and the green in the chairs matches almost perfectly with my pictures. I've had so many complements on dining room with these chairs. I've had a few people tell me it looks like I bought everything together as a set. They are sturdy however as you put them together, I would recommend that periodically, you check the screws to make sure they don't come loose (if you've put chairs like this together before, then you'll know what I'm talking about). To be honest, I haven't checked mine but now that I am writing this I am going to do it. I'm so very happy that I bought these chairs!", 
    "Loved the basic blend in colors. Light to move around.", 
    "The color is a little more on the olive green side but it looks good with my decor. I have it for a desk chair and it is very comfortable. I'm really happy with this purchase.", 
    "This chair was one of the first purchases that I made for my new apartment and I absolutely LOVE it. It took me about 20-30 minutes to put it together (no drill needed) and it's super sturdy. My only regret is that I only bought one.", 
    "Instead of getting a new dining set - I got new chairs. The background color is, like the other reviews read, definitely green.The size of these chairs is perfect in my smaller sized dining area. And the texture of the fabric gives it a little bit of luxe feeling. I started with two chairs, then reordered the additional. Easy room make-over.", 
    "We bought four of these chairs for a smaller table we had purchased. We love them they are well made and beautiful.", 
    "Easy to assemble, very comfy, totally refreshed my dining room! Great purchase", 
    "I purchased 6 of these chair's. They arrived in 6 large boxes, I was amazed at how fast they came. I but them all together in less than 1 1/2 hours. My family and I enjoy these chairs ever night at dinner. Also very comfortable. Thank You Overstock.com", 
    "The price was right, only used four of them, I don't like to put things together, or than that I'll need to sit on them more to really tell you about them.", 
    "these chairs were exactly as pictured, my daughter assembled 2 in less then an hour. They are comfortable and add a lot to my dining area This was my first order from Overstock/", 
    "these chairs were exactly as pictured, my daughter assembled 2 in less then an hour. They are comfortable and add a lot to my dining area This was my first order from Overstock/", 
    "Assembled well and fabric was quality. Not quite as brightly colored as in picture.", 
    "I love these chairs I am actually going to order two more. The only problem was when they came all the screws were not there and I had to call then wait about a week to get the part", 
    "Fast shipping great quality, easy to assemble and excellent customer service.", 
    "The fabric is really nice but the chair is not sturdy. I worry every time a larger person sits on them.", 
    "They look so nice in our dining room..& are eager to use them...", 
    "I like the chairs pattern and material but assembling them was not easy and ended not level. The place for the hardware was not exact so they end up with a little wobble. If I did not have to re-package for their return, I would have returned them!", 
    "Very comfortable and pretty.", 
    "Beautiful, well made, and so comfortable!", 
    "Easy to put together and the chairs are comfortable.", 
    "Bought this for my parents and they love it.", 
    "I love my chair. All that I hoped it would be & more. It's beautiful and comfortable!", 
    "This chair is beautiful. The actual color is much darker in reality. The cushion does not have enough support. I use this chair as my desk chair and it started sagging in a week. if you don't plan on sitting this chair often or just want the look, it is not a bad buy.", 
    "I ordered these chairs as the 5th/6th chair for my dining room table. I loved them so much that I sold my other four chairs and ordered two more. I will look for something like them in chocolate brown for the ends of my table. They were very fast and easy to put together. The background surprised me because they are a sage green and appear taupe in the picture. This was not a deal breaker because my dining room has some green in it. Comfortable and well made for the price.", 
    "The colors and fabrics are beautiful and the chairs comfortable during long dinners. Ordered 4 chairs. Returned one which had a seam can't me my apart. The replacement had a problem with the frame where the screws attach the back to the seat. The 3rd one was great.", 
    "Absolutely love this chair. Use it in bathroom at my vanity. Easy to assemble. Colors are rich and vibrant. Couldn't be more pleased.", 
    "The chair is beautiful, made with quality fabric, and durable. I am using it with an office desk and it is perfect. I wish I needed more because the price is so fantastic. Great deal", 
    "these are alittle darker than pictured. I thought it had burgundy leaves as well but they are not, they are more of a chocolate. they are very nice and comfortable. I am happy overall with these chairs", 
    "Very comfortable. The fabric feels expensive I really like the chairs.", 
    "They were even better than pictured. Very comfortable and easy to assemble. I save over $$$ buying these chairs then the ones that were offered with the dining table I bought. The other chairs were ugly, black and hard as a rock. The Leaf chairs look elegant and gorgeous with my new table and I can't wait for my first party.", 
    "Easy to put together and far more comfortable than I thought it would be. A very good value!", 
    "These chairs are terrific. They gave the room a whole new look. I think they are also quite comfortable.", 
    "love, love ,love my chairs. great quality, great buy looks very nice.", 
    "Superior...sensational...stand out quality! I purchased 6 Class Parson brown/tan leaf fabric ding chairs and if I had room, I would buy 6 more! The elegant and richly varied fabric, the excellent wooden construction, the ease in assembly and the overall appearance of the chairs made for a successful upgrade. The warm colors of sage green, brown and gold highlighted by the rich cherry colored stain on the legs have enhance my dining room. Comfort and design for an affordable price!", 
    "These chairs arrived this morning by Fed-ex. The description had stated no assembly required...but they of course showed up in 4 pieces each. Not too difficult to assemble...and when they are done they look great. Better than the picture. 2 thumbs up---except for the assembly thing.", 
    "Item as purchased. Very comfortable. Matches Table I purchased years ago!", 
    "I did not know I would have to assemble. I must have missed that in the description. It was OK-- I did it!", 
    "Love this chair and it matches my decor. FAst shipping too!", 
    "These chairs made my wood dining table look outstanding....very sturdy well made chairs..nice pattern. the only con is the ad says no assembly when in fact it takes 15 to 20 minutes per chair....", 
    "I liked these chairs very much. Assembly didn't take long. Chair is comfortable and matches the picture well.", 
    "These chairs are great. They arrived in a timely manner -- quickly, actually, were easy to put together, super comfortable and beautiful.", 
    "Just as I hoped they'd be.", 
    "Comfortable, firm and neutral colors make this a good buy for a stable dining or sitting chair", 
    "Very pleased with this product......it is used as an accent chair.", 
    "This chair is surprisingly nice. Very solid construction and a fabric that makes the chair look much more expensive than it is. Most importantly the chair is comfortable. I ordered four of the chairs for my kitchen but when they came I decided they were too nice for the kitchen and they went into the dining room. The chair requires assembly, but the process is straight forward and takes about 20 minutes.", 
    "Ordered 4 chairs from Overstock after reading good reviews on them. Shipped right away and arrived on the scheduled day. Nice packaging -- no problems with damage or missing parts. Legs are nice pecan color wood. Fabric in olive, gold and brown just perfect to hide anything like stains. The diagram how to assemble chairs is not very good, but it is not difficult to figure this out. LOVE MY CHAIRS!!! Thinking about getting 2 more chairs in solid fabric. Can't beat the price, damaged chairs from the Rooms to go outlet were more expensive!", 
    "This purchase exceeded my expiations. We could not be happier. The colors are beautiful, and the quality is far greater than the price.", 
    "Good value, fabric is very appealing, easy to assembly, comfortable", 
    "Looks nice with my glass table", 
    "love the chair but the color is not as described- background is green, which wors fine for me but may not work for others", 
    "Bought for my mom to use ar her dressing table. The cushion I gives her the perfect height. It matches her bedroom perfectly. Very easy to put together.", 
    "Beautiful chairs. Use them in my kitchen nook with a small round table. Love the fabric, and they are very comfortable.", 
    "I have ordered two of these chairs, so far. They are well built and the pattern is beautiful. I have one in my office and another in one of our guest rooms. They are high quality and sturdy. We love them! Thanks Overstock!", 
    "More of a greenish color. nice product though.", 
    "The chair was advertised as \"ASSEMBLED,\" but it was not. I routinely buy already-assembled products because I am a widowed senior citizen and it's just easier. I was VERY DISAPPOINTED because I had to get someone to put it together.", 
    "I desperately needed chairs for the holidays. I ordered 6. What a value. I love them and would recommend them to anyone.", 
    "large size for large or small people.comfortable and great fabric well blended so you dont see stains.", 
    "love it & all my friends too the color and the style", 
    "The chairs are of great quality! The color is amazing!", 
    "These chairs are the perfect edition to my dining set. They look regal and I have received many compliments!", 
    "The chairs arrived damage free which is always great considering I ordered 6!Easy to assemble.. Great fabric..A++++I would recommend", 
    "I purchased four chair to give my living room a price reasonable make over. I took one chair to work for help with putting it together and after seeing how easy it was, it did the other three myself. Everyone LOVED the fabric and color, especially with fall like weather now. The background could be described a tan but in my home it is more sage green and the fall colors adds such color and rich beauty to my dining room. I have an antique ball and claw oak dining set and didn't want to part with it but the chairs differently had to go. Wow, good choice on keeping the table and adding these beautiful chairs. They complement the table and with a little TLC and bees wax on the table, Thanks Giving dinner will look beautiful on the table with new chairs.", 
    "great price and very good quality! The design is very nice, the overall color is more greenish brown for the most part.", 
    "perfect for me...........................................................................................", 
    "For the price, the quality of this chair is very good. If you're looking for $300 quality, then of course this isn't your chair. However, these look nice and I'm hoping they will last a few years.Color: The background is sage green. The leaves are gold and a deep brown that could almost be taken for a deep plum. Trust me on the colors, I am an artist.Comfort: Not as wide in the seat as I had expected but it's well padded and comfortable. Assembly: These were easy, but I am a relatively \"handy\" type. The key is not to tighten any of the screws until you have all of them in place in the holes. That way, you can move it around to help line up the screws to the holes. Then tighten the screws several times. Took me 20 minutes a chair. No tools needed. I really like these chairs and they updated my dining table.", 
    "Beautiful chair, but could not make the legs fit onto the chair body ! I need to hire someone to out it together. Very disappointed that I could not assemble it. Otherwise, I would recommend it.", 
    "These chairs are wonderful. Well built and finish quality is very good. Of the six chairs I bought one has a sticky glue substance on one of the legs but was easily removed with rubbing alcohol. Other than that one unexpected snafu, I could not be happier with this purchase.", 
    "I needed a chair for my desk and it suited perfectly! Easy to put together and a FANTASTIC value!", 
    "I love my new chairs look great and are just what I expected. Took only a few minutes to learn how they went together. one was missing hardware but only took 2 days to replace. Customer service was great,", 
    "Great quality and style however the assembly is tricky. Make sure that you line up and use the correct screws to prevent wobbling.", 
    "I loved the chairs I got from Overstock.com. I have been looking for dining chairs for a long time. Even though the chairs had such good reviews, I waited for a while and thought about them for nearly a month before I placed the order. Finally I ordered the chair and it took me a while to assemble them. Once they sat in my dining room, I love it for the first sight. I took lots of pictures to show to my daughters and one daughter wanted to order the same chairs. One other point, the chairs were at such reasonable price that I thought it was a real steal. This was the best product I had ordered from overstock.com. The chairs were firm, comfortable to sit in. The color blends well with my family room, dining room and all surrounding furnitures. I have to have a party to show off my chairs soon.", 
    "The background color of the chair is a sage green which works perfectly for our space. The fabric quality is nice and the chair seems sturdy. We are happy with our purchase.", 
    "Beautiful chair. What appears beige in the picture is actually a green, which is exactly what I was looking for! Very pleased with this purchase.", 
    "Goes great with a desk I ordered easy to put together love it", 
    "I ordered these chairs to replace some vintage chairs around my oak antique round table. I needed color and wanted to modernize my dining room without too much expense. I love the colors and fabric on the chairs, i t looks more expensive than the picture.The background is a dull olive green with choc brown and tanish gold leaves. The colors are subdued but very rich. I got the look I wanted for little money. The quality is good, but not perfect. These chairs will not be used often, and I hope the frames hold up. That's my concern. Because of the small investment, I won't feel bad if they have to be replaced in a couple of years. I do recommend these, especially if you only use them occasionally.", 
    "The chair is beautiful. I did have problems putting it together as the holes drilled for the screws did not seem to match so I do not feel the chair is as sturdy as I would like. You may need to drill your own holes.", 
    "Very easy to put together and very, very comfortable. I highly recommend this chair. I got this for my 76 year old mother who is an artist and can no longer stand for extended hours at her easel. This chair is very comfortable for her and she uses it every day. Love it!", 
    "I purchased two of these chairs for my dining room. Everyone comments on how great they look. They're comfortable and a great value. They look more expensive than the price.", 
    "The chairs arrived promptly. They are more beautiful in person. They look excellent with my round glass table and are comfortable to sit in. We want them to last longer so I had my husband spray them with Scothguard, and the color stayed true. I would recommend you buy them. We got a lot of compliments.", 
    "The quality of the chair is excellent. I put it together myself. I love the colors and the fabric. I put in my bedroom.", 
    "I've been tolerating four unupholstered dining-room chairs for far too long. I purchased four of these upholstered parson's chairs, and they MAKE my house! I was sorry I had to put them together myself \u0097 the back and back legs come in one piece, the seat in another, and the two front legs separately \u0097 but I had a sense of accomplishment when I did. The colors are amazing. They don't clash with my sage-green walls or my red/orange rug. They're kind of cheap, the upholstery sort of tackily stapled on, but they are super comfortable and seem substantial once put together. I think they are a great bargain, compared to, say, Pottery Barn, which would cost about the same for one chair as I paid for four!", 
    "Nice chairs, love the fabric. Too bad they don't have removable covers. Great fir the price and easy to assemble. Fast shipping. ***", 
    "Absolutely beautiful style and color. Background is more sage than brown but that's what I needed. Easy to assemble. A real bargain. Love these chairs.", 
    "Chair arrived without front legs and hardware to attach missing front legs and seat cushion. Inconvenient, but Overstock eventually came up with the missing pieces and shipped them. The chair looks good in the room for which it was intended.", 
    "Nice-looking, sturdy chairs. Very pleased. They match my table perfectly.", 
    "The chairs were advertised as \"no assembly required.\" They came in twelve major pieces and a handful of nuts and bolts thrown into the bottom of the box. Sound like \"No assembly required\" to you? When I complained, Overstocked gave me a ** credit which will NOT cover the cost to have the chairs assembled. This will be a necessity, as I am screw driver challenged. The quality seems fine, and I will let you know how they look as soon as I can get someone here to assemble them. To say that I am disappointed would certainly be an understatement. Had I known they were NOT assembled, I would never have ordered them.", 
    "I actually purchased these chairs on impulse. I'd been looking for dining chairs for a long time and found nothing I really liked-until I saw these. I was blown away by the upholstery design-really pretty so I ordered them on the spot. Literally the day after delivery I started suffering buyers remorse. I left them in the boxes exactly as received and thought...and thought. I finally decided I should have ordered leather with no pattern. The pattern on these would have clashed with my sofa AND I have two cats who love my current dining chairs which are fabric and cat hair is all over them. I called Overstock and they couldn't have been more obliging and kind. They are mailing me return labels and as soon as the chairs arrive back there I will be ordering leather (I've already found them) at OVERSTOCK, of course!. I couldn't really rate the quality and value because I've never even opened the boxes. I really wish I could contact the person who wrote the 1/21 question regarding the new chairs because I have to buy all six but I can only use four. (S)he wanted eight but could only buy them in quantities of six.", 
    "wonderfully constructed chair. The cushion has it's own intersprings so it's comfortable in all of the right places. Beautiful pattern, almost a tapestry feel to it. Looks great in my dining room. Colors are of orange/brown/gold hues.", 
    "Really pretty chair. Great value. It goes great with our gray walls and dark wood furniture. Comfortable. It was easy to put together. I love it !", 
    "I like my chair very much. Fast delivery:) Easy to put together.", 
    "I have been looking for Parson chairs quite a long time. When I saw this one I was hooked. It took me a little while to order and when they went on sale again I jumped on it. I love the colors which coordinate with my décor perfectly. I have cherry hardwood floors and plan to order an area rug for my dining table that will compliment the gold in the chairs. I am very pleased.", 
    "I really like these, they were easy to put together, seem very sturdy, hide food stains from kids and are super comfortable and seem very durable.", 
    "These chairs were a perfect fit for our breakfast table. The fabric is comfortable and beautiful to look at. The colors are very pleasing and are exactly as depicted on the site. We expect to have many many years of enjoyment from these chairs and are so glad we purchased them!", 
    "The chair came with a defective bolt, but , they lowered the price for me. Very well made & pretty in a bedroom!", 
    "I absolutely love the look of these chairs, blended in with my new dining table and chairs they helped me create a really appealing eclectic look in our dining room. The fabric and pattern is just beautiful. Chairs are comfortable, too.", 
    "I needed two chairs to go with my dark wood dining set. The wood matches perfectly and the fabric provides a beautiful accent to my set. The leaves on the fabric appear dark brown to me not purple, and matches the legs of the chair. If you use an electric screwdriver, the assembly will be quick. They seem durable, and since my dining set is not frequently used, they will probably last for a good while. You can't beat the price.", 
    "although the chair un-assembled is poorly made, the screw holes were not totally drilled completely through, willy nilly stapling of the fabric after assembly the chairs look great. They are solidly assembled by myself but the assembly itself was a bit awkward. They look great in my dining room.", 
    "My chair arrived quickly and in good condition. Assembly was easy. A hint: Read the instructions carefully and particularly follow the advice about not tightening the bolts until all are started in their appropriate holes. The colors are beautiful ... a little more subtle than the picture. The padding is full and comfortable. I almost ordered a similar chair from a major retailer. It was three times the price AND shipping was $XX.XX . This is a real bargain.", 
    "We bought 6 of these chairs. They came in within the delivery time stated. The assembly was very easy.All of the chairs matched but they were much more green then blue. I was hoping they would be more like the photos! The fabric is nice. We've had them over a month and they are very comfortable to sit on. For the price, these are very good quality.", 
    "Everyone who sees my new chairs, loves them! They brighten up the dining room and changed the whole look of my dining room set. I had an accent wall painted in the darker color and wow they look fantastic!", 
    "I was looking for inexpensive chairs for my new dining room table. These chairs are fabulous!! The look better in person and seem to be a good quality. We do not use are dining room so I didn't want to spend a ton of money decorating it. These chairs look like I spend a lot of money. Easy to assemble too.", 
    "They are the perfect size for my RV. Can't beat the price, and they were easy to assemble,", 
    "I bought this to go with the espresso corner desk *** for our living room. It looks great and and is comfy enough for sitting in it for many hours at a time.", 
    "Exactly what I was looking for, great price and I didn't have to buy 2 of them. Very comfortable and I use it at my computer desk in my living room. Goes great with my furniture.", 
    "The chair arrived quickly and was easy to assemble. It looks good and feels solid. My only complaint is that the seat cushion was too stiff and uncomfortable. I returned it and Overstock return policy was very good.", 
    "Was pleasantly surprised overall and particularly re: sturdy quality and fabric.", 
    "Have been searching for months for a smaller chair with a taller back for my computer desk. Looked at slipper chairs, but they're all too deep in the seat. Finally looked in \"dining chairs\" on O.com and saw this chair. It's a great size, and seems very sturdy...will know more as time passes. As far as the color - it has a mossy green/sage background; the leaves are really purple (not a loud purple) and tan. This was mentioned by other reviewers so I expected that and personally love green and purple; also like leaves. The colors are variegated, not one dimensional, which makes the fabric very rich looking. Can compare in quality and appearance to chairs 3x more expensive. Looked at them and so glad I waited to find this gem. When I want to update my Dining Room, I'll come back to this site and purchase new chairs to get a completely different look.", 
    "Quite happy with this product so far. Comfortable, sturdy and perfect match for our dining room. Very happy. Only time will tell how they will last but for the price I am extremely happy. I see these chairs lasting for many years to come.", 
    "The chairs are a great value for the $$$. The seat is a bit small but overall a great value.", 
    "I bought 6 of the tan leaf fabric chairs. I live overseas so could not receive them personally. upon opening the boxes my mom realized the two chairs were completely different in pattern and even in color. Since I wasn't in the country when received I could not get a refund because couldn't call from where I live. The chairs are very nice, but they don't go together. THe chair fabric mixup is the reason you received the ticket", 
    "I love these chairs. another factor is that there are many slip covers that fit this model of chair. I can change the look at any time or cover to protect.", 
    "I would like to start off by saying that I have had an issue with the chairs although I believe that my flooring is partially to blame but my issues were resolved promptly by the Overstock team so I would not let it discourage you from purchasing these chairs! The chairs were just as pretty in person as they were in the picture online. The coloring was slightly different than I expected on the brown as it was not as dark chocolate in color as I had thought it would be but that was no big deal. The blue color being more of a blue green color that changes from more blue or more green looking dependent on the lighting was not a big deal for me either as it was actually more like what I wanted than the plain light blue look would have been anyway. The chairs have a lot of padding which was great and are not wobbly at all. They have adjustable pads on the bottom of the legs to help keep them from rocking if your floor is tiled and not as even as you may hope. My only suggestion is to keep checking the chairs to see if the bolts for the legs are becoming loose periodically after assembly to prevent any damage and to ensure that you do not see any cracking. I did have this happen on 2 out of the 4 chairs that I purchased and have been doing routine checks until they are broken in a little bit more. I love that these chairs feel extravagant but don't have the \"broke the bank\" price tag that usually comes with the look!", 
    "The chair is worth buying but not happy about having to assemble before using. The site stated \"No Assembly Required\" so I was surprised that I had to put it together. It took about 1 1/2 hours to assemble but looked good once completed.", 
    "This is a great chair. I have it at my desk. It dresses up the room. I love it. It was easy to put together, my husband did, I don't do that part!", 
    "i love the chairs i may order more for my kitchen i woud nt hesiatate to order from overstock again", 
    "I bought this chair to use as a desk chair with a very light oak wood desk. One of the colors in the chair (the goldish color leafs) match the light oak wood of the desk. I also needed a narrow chair, which this one is. I use the chair every day since I work from home, and I needed a chair that is comfortable, which this one is. All in all, I am extremely happy with my choice.", 
    "Purchased this as an occasional chair - not dining chair. It matched perfectly with the room decor and is same quality as others I had been looking at that were much higher. Love it!", 
    "I bought these for my mom for Christmas and she loves them. Even better looking than the picture.", 
    "I was very nervous about ordering these online, but I am so happy with the chairs, color is perfect! They are sturdy & comfortable and easy to assemble. I must say my dining room looks awesome!", 
    "The chairs are super easy to assemble. The wood and fabric are both very attractive. With that we are super pleased. However, I was tempted to return them. But I didn't. If both of us were picky, we might return the chairs. But since my spouse is ok with the chairs, I'm keeping them. My frustrations are that (a) the chairs are tricky to get balanced (so that they don't wobble). You have to fiddle with the tiny rubber/metal thingies at the end of the legs quite a bit. As a result, the sound as the chair hits the floor can sound a little rickety, not like substantial wood legs on the floor. And (b) the fabric is upholstered strangely on the back. Instead of it just being flat fabric, there is this piping detail outlining the back of the chair, about 1 inch in, that I find weird. You can sometimes see the staples and that bothers me. I was looking for something super modern, and the piping makes them look a little more traditional than I had hoped. So, a little disappointing, but not enough to return them all.", 
    "I have been looking for quite some time, when I came across these Parson Chairs - perfect all around, easy assembly - they look just as great as brand name ones. Would buy again. Friends and family couldn't believe the price.....", 
    "The chairs are gorgeous and comfortable. They do require assembly of the front legs and the seat to the back, and it was tricky to get that first screw started, but by the time I was finished with the first chair, it wasn't that bad of a pain. I ordered 6 chairs, and it was kind of a drag to put them together, but then it always is. That's just the way it is. The fabric is thick and well made, the colors true to photograph and the wooden legs are beautiful. I was floored by the price, because chairs this nice usually run at least twice as much. Buy with confidence and talk someone else into putting them together!", 
    "I picked up 4 of these chairs for when we have extra guests. The quality is good and they are nice and comfortable chairs.", 
    "Purchased 4 of these chairs. May purchase 2 more. They are gorgeous! I had no problem assembling by myself. a flaslight is handy for viewing deep set fittings to attach seat. You do have to keep going back and tighten bolts as attaching the seat - tightening one means retightening the rest until they are all solid - this creates a VERY sturdy chair - put some muscle into it! Wood legs are perfect. These look and feel like an expensive chair, but at a bargain price!", 
    "Bought these chairs to replace my old kitchen chairs. Extremely comfortable and the colors really pop. They gave my room a look of fine dining in my kitchen.", 
    "These chairs are a good bargain. They are sturdy, the upholstery and construction exceeded my expectations and the colors are rich and beautiful. It was easy to put together althought I used an electric screwdriver rather than the hex key.", 
    "Bought this chair over a month ago to use as a computer chair for a den in a new apartment. We are in the process of selling our home, and my husband just put it together 2 days ago. The char is very well made, comfortable and the color is exactly what I was going for. A rich, warm Autumn feel.", 
    "I purchased two of these for my breakfast area, to use with a square glass table. I was trying to go a little more edgy -- get away from the country look. These filled the bill perfectly, and went well with my walls, which are a golden/tan color. Furniture in the nearby family room is chocolate brown, so the color flow from breakfast area to family room was preserved by the leaf pattern in the upholstery. Wonderful choice.", 
    "loves these chairs. The pattern is unique and goes well with my new kitchen/family room. the pre-drilled holes were slightly off so it took a some extra time to assemble.", 
    "The chairs are beautiful and made pretty strong. I just had the problem of the legs being uneven. I tried the little taps they bring and no matter what I tried they would wobble. My husband had to buy some washers and put them between the little taps to make them sturdy, it's still a problem with some of them. I bought two chairs and then ordered two more. They are nice if you don't have children or pets, my cat is attracted to the matierial and I ended up putting covers on them, with defeats the getting such a nice pattern.", 
    "I got this set of 6 chairs to match with my table but not all the chairs were easy to assemble. Benn made on China and don't have quality control some frames of the chairs were hard to put together. One chair its leg is short 0.5 cm, the color in one leg different than the other legs, little scratch. Those details should be avoid as I said if they have a person to do a quality control over the merchandise. I hope that it will be good for the next ten years. If you like the design take your chance", 
    "I love these chairs, they are beautiful and seems good quality . Took me about one hours to put it together. Buy it !!!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Classic-Brown-Tan-Sage-Leaf-Fabric-Dining-Chair/6356160/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6356160/Classic-Brown-Tan-Sage-Leaf-Fabric-Dining-Chair-928fb734-2bd7-4c59-9f79-c59ce841203f_600.jpg"
  ], 
  "description": "Update your home with this chic and comfortable dining chair. The warm earth tones of this leaf-patterned brown chair coordinates with most contemporary decor, and its high back and unique pattern combine functionality with fashion. The solid wood coupled with the chenille upholstery makes this Parson-style chair a welcome addition to your dining room. Alternately, use this charming chair for extra seating in any room in your home.Create an instant dining room makeoverFinish: BrownUpholstery color: Brown tan sage chenille leafUpholstery finish: ChenilleSolid wood frame and legsEasy assemblyDimension: 19 inches wide x 23.5 inches deep x 38 inches highWeight capacity: 250 lbsStyleContemporaryMaterialChenille, WoodChair TypeDining Chairs, Parson ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorBrownFurniture Frame MaterialWoodFurniture PatternFloral"
}