{
  "name": "HomePop_Linen_Tan_Nail_Head_Parsons_Chairs_(Set_of_2)", 
  "price": "EUR 145.21", 
  "reviews": [
    "relatively comfortable and very nice looking. Linen is closer to the grey linen than beige linen.", 
    "My entire room changed with these new chairs. More sophistication and warm, calming feel.", 
    "These are even nicer looking in person! We haven't sat on them much yet, but they look great with our dining table and go well with every color scheme!", 
    "Little to no support when you sit down. You get what you pay for I suppose", 
    "took about 1 hour to put together two chairs. they look nice. the structure of the chair leans back a tad. (in back of the chair leans back more than i would want)..though overall good for a formal dining room. we hardly use them as they are in the formal....cushioning is foamy, so not the best quality you can buy, but for the price, worth it to me...nail heads look very nice. color as shown in the picture advertised. good value overall.", 
    "These are smart-looking chairs that are reasonably comfortable, sturdy, yet easy to lift and carry. They are slightly more beige-colored than in the online photo, but are otherwise as advertised. Assembly of both chairs took about an hour. Having two people is helpful but not necessary, and all the parts are included, even two Allen wrenches. Assembly tip: when attaching the seats, get all screws finger-tight first, then progressively tighten them, sides of the seat first then the middle screws. This prevents slippage of screw hole alignment.", 
    "Love the look and elegant feel of these chairs! Slightly firm in the seat but comfortable for a dining room. Love the cream cloth color - a little darker than in the pictures. Solid base and structure. Assembly fairly simple - comes with tools needed.", 
    "Chairs are very comfortable and has contemporary look. everyone asks me if they are from pottery barn. Good Quality.", 
    "Love them! Very comfortable and they were easy to put together.", 
    "Nice quality, easy to assemble!", 
    "I ordered these from the online website, as an addition to my very old Texas Barn table which has 6 antique 1830's wooden painted chairs around it which are not as comfortable for my aging mother-in-law and uncle (ages 90 and 92 respectively). Put these together with help of my husband (the instructions are a bit confusing!). YOU do need a screwdriver and a tap hammer. They are really lovely at each end of the table and are very comfortable and seemingly easy to remove any \"dining stains\". Really great value and glad I purchased!", 
    "These chairs look just like they do in the picture, and they were super easy to put together. I would recommend these to anyone.", 
    "Comes in pieces, find myself always have to be tightening the legs, at least once a week.", 
    "A little darker tan than I expected. Easier to assemble than I expect after reading the reviews also. I'm not the sharpest tool in the shed but I found it pretty easy to follow the instructions.", 
    "Great price. They are a little low to use at a dining table but not impossible.", 
    "Very happy with the chairs. The upholstery and nail heads complimented my couch perfectly! My pregnant daughter put one together a couple days before she delivered. I know my family will miss the old leather chairs these replaced because they can't lay across them the same way. You sit upright in these chairs but for the price I am very happy with the way they solved my seating issues.", 
    "LOVE these chairs! They look so elegant and they were easy to put together and very sturdy. Can't beat the price! Very pleased.", 
    "We received the chairs quickly and they were in perfect condition. My husband put them together quickly. They look high end and they are very comfortable. Love them! I would high recommend these", 
    "Great chairs for the price. They are very nice looking and sturdy. We put them together in less than 5 minutes.", 
    "I ordered 2 of these chairs to go at the heads of our large reclaimed pine table. They look and feel amazing! Very high-end. Love the nail-head trim. They are very comfortable and we could not be happier with them!", 
    "I was very impressed with the look of the four chairs that I ordered from Overstock. The price I found was better than any other I could find when staging a house for sale. They give a classic and expensive look to the dining area. I don't know about the comfort or wear and tear since I am using them more for looks. They are a great design and add a lot of warmth to the room.", 
    "These were easy to put together. Very nice chairs. I plan on buying more when back in stock.", 
    "These chairs add a touch of elegance to my dining room. They are quite comfortable and look exactly as pictured. The color is a beautiful tan and goes with any décor. My husband put them together quickly and easily. I would recommend!", 
    "Great sturdy chair. Use it as a desk chair in my bedroom", 
    "These match bar stools that I purchased through Overstock. They are sturdy and comfortable. You do sink down a bit on the cushion but once you get used to that they are great.", 
    "Great price, easy to assemble, very stylish and classy.", 
    "Every time someone seats on this chairs the legs need to be screwed in again And one the leg of a chair is cracked already", 
    "These linen nail head dining room chairs are exactly what I wanted! I researched many different chairs and after reading other reviews decided on these from OS. They go perfect with my rustic farm table. They were easy to put together, my husband took the advice of other reviewers and used wood glue to keep the back and the seat together more sturdily. These chairs are VERY comfortable as well, not like some padded chairs where you can feel the hard backing underneath the padding. They rock a little when not sitting in them, but when you sit down, they don't, so there's no problem in my eyes. The only small issue we had was that on one chair one leg was shorter than the others by about a 1/4\". We'll just be putting an extra pad under that leg. The tan color is pretty much right on. It's not really light like the pic, but it's not khaki tan either. It's right in between. LOVE THESE CHAIRS! Buy them, you won't be disappointed.", 
    "The chairs look great! We ordered two sets of these chairs. When they arrived the box was a little beat up, but the chairs were in perfect condition. The bags that held the hardware had been opened during shipping and all of the hardware was in the bottom of the box. It took about 45 minutes to put together the four chairs. Overall they look great, are comfortable, and were exactly what we were looking for.", 
    "I love the look of these chairs. They fit well with my kitchen table.", 
    "Easy to assemble, my husband had no trouble with them. They look really nice and sturdy, great chairs for the price!", 
    "Very happy with my new chairs. Good quality and great price!", 
    "I'm so glad a purchased these chairs, the table I ordered came with chairs but I did not like those chairs so I brought these and I lover them, they go way better with the table then the actual chairs that came with the set. These chairs are sturdy and elegant and the linen is the bomb!!! Good choice!", 
    "The sewing around the legs of the chairs was really bad. Never seen anything like it before. not worth the money. Im sending the chairs back for a full refund. The star is for the fast delivery.", 
    "Wow these chairs are more beautiful then we imagined!! Stunning around our 6' square farmhouse dining room table. 10 chairs fit perfectly. Can't wait for our first dinner party!! Thanks Overstock- they came fast and packaged beautifully.", 
    "I bought 6 and was only able to use 2 since it really did't work well with my table. I was going to return it but it was to costly to return so they're sitting in my garage still in the box.", 
    "Love these chairs. Color is perfect with room decor and compatible with previous purchases", 
    "These are great chairs for the dining room. They're comfortable and sturdy. We're very happy with this purchase!", 
    "We are so pleased with these chairs! We bought them as \"accent\" chairs to our farmhouse table. They are very sturdy and look great. I don't think you can beat them for the price!", 
    "These were so easy to put together and look awesome with a rustic dining table. The color is a like an oatmeal, and the quality is great for the price.", 
    "Perfect for my new dining room!", 
    "Love love love these chairs. The quality is really good and the are super comfortable. They were kind of hard to put together. But all in all very good quality for the price", 
    "I ordered 4 of these to go with my farm table and they look fantastic! The quality was excellent and the color was as pictured. The seats are comfortable and the overall quality is very good. Overstock delivery was fast and all arrived without any damages. You can't go wrong!", 
    "The chair legs came in a lighter color than I ordered . I figured it'd be to much hassle to send back . The chairs are some what sturdy .", 
    "These chairs look great. They are comfortable to sit in. I've had to tighten the hardware a couple of time in the month that I've had them. Not sure is this issue is with me or the chairs. The jury is still out on that issue. Other than that I am very happy with this purchase.", 
    "Not the most well made but works for the price", 
    "Good chairs for my kitchen table. Took awhile to assemble all four chairs due to some of the holes in the legs not drilled well. Overall good chairs and look really nice once put together.", 
    "We have had these chairs a little under a year and are not built to endure daily use. The seats have gotten squishy and a spring has failed in one of the chairs. Very attractive chairs and once scotch guarded - they have been easy to maintain.", 
    "the chairs are comfortable but just a shade smaller than I was expecting", 
    "The chairs are good quality for the price. The color of the legs are much lighter than the picture portrayed. It cost $** to return them. So I decided to sand and restain a darker color.", 
    "I am so very pleased with these chairs. Great looking and sturdy. Just what I was looking for to add to my rustic dining room table. Highly recommend!", 
    "Picture looks good but color is darker than pictured and overall it looks really cheap. I returned it after opening the box.", 
    "Exactly what I wanted. My husband put them together but he said it was easy. They actually look better than what we expected. I have no complaints.", 
    "A little complicated to put together with not very helpful instructions, but once these were assembled they looked really nice.", 
    "These chairs were easy to assemble and seem sturdy enough for anyone in my family. The color is nicely neutral and I do not have any flaws in the upholstery. I would recommend this item, especially at this price.", 
    "You can't beat these chairs, for the price! They are solid and substantial, and easily accommodate my 6' 3\", 260 lb husband.", 
    "The chairs are sturdy and awesome. Looks great alongside leather chairs.", 
    "beautiful chair set for the price!", 
    "I was very pleased with not only the chairs but also how quickly I received them! The only negative was the color stain on the legs. It seemed darker in the picture, but they they are actually a little lighter and have a red tint instead of solid brown. I kept them, but I may try to restain them.", 
    "Simplicity of chairs was exactly what I was looking for and construction is quality!", 
    "Looks amazing and worth so much more! Everyone thinks I paid so much more.", 
    "A little darker than the picture but I Love them!! They are well made and easy to put together. As always the shipping was fast and efficient", 
    "We ordered 8 of these. Total assembly time was about 2 hours for the whole set. This is not well made furniture, but it does look great and it feels very sturdy to sit in. The legs are also lighter than pictured. Overall, I would certainly buy these again for the price and feel of what you receive.", 
    "Arrived on time, well packed. Handsome chairs that go perfectly with our new table.", 
    "Bought 8 of these chairs and am toying with a few more. they are comfortable and gorgeous. changed my whole dining room. and you cannot beat the quality for the price"
  ], 
  "link": "http://www.overstock.com/Home-Garden/HomePop-Linen-Tan-Nail-Head-Parsons-Chairs-Set-of-2/8393287/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8393287/Linen-Tan-Nail-Head-Parsons-Chairs-Set-of-2-6c27e416-3f00-49e7-b431-0e6d77943b2d_600.jpg"
  ], 
  "description": "Treat your living space to a fresh and elegant upgrade with this\nset of two HomePop chairs. The simple styling of these parsons\nchairs contrasts the richly textured grain of the linen upholstery\nfabric, while the gold tone nailhead trim adds just enough\nembellishment to dress up the chairs.Set of two chairsMade of solid wood, foam and fabricElegantly finished in brown antique wood and linen colored\n  upholsteryComfortable foam-filled seatsWeight capacity of 250 poundsChairs measure 39\"H x 19.75\"W x 26.5\"DStyleNautical, Traditional, UrbanMaterialGold, Linen, WoodFinishAntiqueChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorTanFurniture PatternSolid"
}