{
  "name": "INSPIRE_Q_Geneva_Linen_Wingback_Hostess_Chairs_(Set_of_2)", 
  "price": "EUR 326.49", 
  "reviews": [
    "I ordered four of these chairs for my dining room table. They arrived promptly and were easy to assemble. That's the good part.... Now here are the negatives: Several assembly parts were missing (washers, screws, etc) and two of the pre drilled holes were too large for the screws so they do not hold the legs tightly to the frame. The color is tan, but they definitely have a pinkish hue. The chairs look good from a distance, but they are very poorly constructed. Two of the chairs have large gaps between the upholstered back and the top of the frame where they are possibly staple gunned together....which looks terrible. So overall, I am disappointed with the product...", 
    "They are horrible chairs. We couldnt even assembly properly cause the items are designed so badly cant even fit to the space that they are supposed to while assembling. I am going to get my money back for this.", 
    "I am so disappointed in these chairs. I ordered these based on the color of the photo and the reviews. These chairs are nothing like the color in the photo. The photo looks like a dark tan and these almost are a light gray color. My husband put these together as a surprise, I was out of town. When I got home and look at these I said these are going back. The bad thing all boxes were cut down and taken away.The material bunches up towards the back of the chair. This is happening on all four and we haven't even used them yet. Also where you put the back and the seat of the chair together, it leaves a small gap so you see the black matting they use. I spent a lot of money and can't use these chairs. I will do nothing but stare at the gap and push the loose material back . What a waste of money.Sorry overstock but these are a joke", 
    "Beautiful chair, hard to assemble and breaks in 4 weeks. Let me also point out that our family is not overweight. Stay away.", 
    "Great! I love it very much.", 
    "These chairs match the Inspire Q parsons chairs we got perfectly and they look great at the table. The wingback does take up some additional space that I didn't compensate for because of the way they lean back. But they look great.", 
    "Beautiful, sturdy table. very comfie too. Actually fell asleep in one yesterday while resting from a long day.", 
    "Everything is great, could be more comfortable!", 
    "Made from sub-par materials.", 
    "The quality on the fabric is really great. Easy to put together and love the look!", 
    "Can't wait to pair these gray chairs with my black table. Nice quality chairs for the price.", 
    "I ordered two different products from this brand and am highly disappointed in the quality of both my purchases. I ordered 6 of these chairs and 3 of them sit even on the floor. The quality of these chairs are so cheap! The nail heads are not even individual nail heads they are all connected in the middle and are not straight and even overlap in places. Save your money and spend it elsewhere. you will be returning these and they will be a waste of your time.", 
    "great look and great price. I was very happy with these side chairs when I got them.", 
    "Bought this set for a bedroom sitting area. The quality is great and the price was much lower than other pairs I looked at!", 
    "Great chairs! Very well made", 
    "These are very sturdy chairs. They look much more expensive than I expected. I have ordered 4 more.", 
    "Bought 2 one came damaged and it tookabout 2 weeks to have the chair replaced. Quality is good for the price", 
    "We have received many compliments, as to the beauty and style of the chairs. Both rear legs of one of our chairs was damaged in shipping. Overstock shipped the rear portion of the chair within a week. They initiated contact with me, each day, until the replacement arrived. Replaced. Beautiful. Extremely satisfied! This was my first experience with Overstock.com ....it won't be my last. Bravo!", 
    "Color exactly as shown. A light brown. Works well with my dark brown sofa and blue and brown rug. Nail heads were perfectly aligned on all sides which is different than I have found on other higher priced side chairs."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Geneva-Linen-Wingback-Hostess-Chairs-Set-of-2/8577733/product.html?recset=e83d4c1b-9dde-4e46-b88d-eae8a2104121&refccid=M647KYMPX5MLGFKLRIOXHFHZAY&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8577733/INSPIRE-Q-Geneva-Linen-Wingback-Hostess-Chairs-Set-of-2-5d961ffe-82b1-44e7-9c9b-a6ebea4edce4_600.jpg"
  ], 
  "description": "Dine in sophistication and subtle elegance with Inspire's Geneva linen wingback hostess chairs. The set includes two chairs to add symmetry to your surroundings, whether used as a complete dining set or as accent chairs throughout your home. Shallow side wings and curved back legs in a rich espresso finish add additional support and style.Set includes two rubberwood and fabric hostess chairs for symmetryChair legs feature a rich espresso finish that perfectly accents the chair's elegant styleSoft linen upholstery is easily maintained with spot cleaningUpholstery color options include beige, dark grey, grey, denim blue, tan, and chartreuseUpholstery fill includes resilient springs and foam padding for total comfortThe chairs measure 40.5\"H x 24.5\"W x 26.75\"DSeat measures 18.5\"H x 18.25\"DSeat cushion is 4.5\" thickChair back measures 23\"HShallow side wings and curved back legs add additional support and styleNail heads outline the seat and back of the chair to provide a classic studded designStyleContemporary, ModernMaterialLinen, Rubberwood, WoodFinishGrey FinishChair TypeAccent Chairs, Dining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBeige, Blue, Brown, Green, Grey, YellowFurniture PatternSolid"
}