{
  "name": "INSPIRE_Q_Aberdeen_Beige_Upholstered_Nail_head_Parson_Chair_(Set_of_2)", 
  "price": "EUR 262.06", 
  "reviews": [
    "This was my first time ordering from Overstock and my last. I was so disappointed in the quality, cheap wood and what they called \"Linen\" looked and felt like muslim, an inexpensive cotton. After constructing one of the four chairs, it wobbled because all four legs were not even. After I returned the items I found out I was charged the return label shipping fees of $$, at no time was this mentioned when the labels were emailed to me for the returns. So disappointed in Overstock.", 
    "I thought they would be more substantial I am afraid if someone bigger sits on them it may not be good ,they are modern streamlined nice detail with the nail heads not really black, not to wide so that's good for me because I am mixing it together with my existing set for more people to sit around the table", 
    "There were 2 chairs out of the 4 that I ordered that had damage but customer service was very fast in correcting the problem. There were some reviews about the chairs rocking and I found that they do if you tighten them too hard while they are laying down. If you tighten them half way and then stand them up and tighten them the rest of the way, they don't rock at all. Hope this helps for future buyers! Over all they are beautiful and I love the way they look. They are very light weight as other reviews have said but they don't feel cheap.", 
    "The chairs look beautiful at first, but within the first week they were loose. I've had them for two months and now one broke and the others look like they are on that same direction.", 
    "Bought these chairs for my dining room and was really disappointed when I pulled them out of the box..You can feel the frame coming through the fabric..The seat has no wood for support you sit on foam and a frame..When I put the chair together my husband sat on it and you can see the underneath bowing! The back of the chair you are again supported by fabric and foam there is no wood just a frame. Really poor quality..Beautiful to look at and would only be great for staging. Sent chairs back.", 
    "we use these everyday. easy to slide. they look great but they all rock. matches the zinc table by inspire Q perfectly.", 
    "Nice looking chair but a little lightweight and leg of one chair was cracked so had to exchange which was a pain", 
    "I bought these chairs for our dining area at our summer home-- I know I will be replacing them next year. The fabric is thin and will not withstand the use of the family on a daily basis. The legs, once the chairs are assembled, are uneven causing the chair to wobble-- The seat cushions at this point ( week of use) are starting to imprint and crush. While stylish, there are most likely better quality items out there.", 
    "These sets of chairs look great! They feel very light too compared to other chairs! But they are exactly what I wanted!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Aberdeen-Beige-Upholstered-Nail-head-Parson-Chair-Set-of-2/9816348/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9816348/INSPIRE-Q-Aberdeen-Beige-Upholstered-Nail-head-Parson-Chair-Set-of-2-e7ab508e-0f49-43f9-95a5-6c2c5602b750_600.jpg"
  ], 
  "description": "Make room for two more at your dining room table with this pair of parson chairs. Made from rubberwood and poplar wood, these dining chairs are an enduring addition to your home. The armless design provides unrestricted movement for diners and makes the chairs easy to carry, so you can also use them as side chairs in another room when unexpected visitors come to call.Rubberwood and poplar wood construction ensures enduranceNatural honey oak finish, beige linen upholstery and nailhead trim form a chic aestheticIncludes two parson chairsChairs measure 39.5\"H x 19.5\"W x 23.5\"DSeats measure 19\"H x 17.5\"DStyleContemporary, Country, RusticMaterialLinen, Oak, WoodChair TypeAccent Chairs, Desk Chairs, Dining Chairs, Parson ChairsSeat HeightCounter HeightSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBeige, BrownFurniture PatternSolid"
}