{
  "name": "INSPIRE_Q_Peterson_Floral_Accent_Slipper_Chair", 
  "price": "EUR 200.33", 
  "reviews": [
    "I ordered 2 of these chairs for my family room. In person, the colors are more muted than they appear on line but they are still very pretty. The fabric is rather heavy and I like the look of the chair. They are comfortable and they were easy to assemble. My only concern is the fabric on the seat does tend to bunch a little bit after you stand up. I can smooth that out with my hand but I'm not sure how they will look over time.", 
    "This is a nice looking chair. It is not comfortable, very hard, but I bought it just for show. I noticed the chair has gone up in price and I would not buy it at the current price. $***.** or less, ( we paid **.**) is a fair price for the quality of this chair.", 
    "Chair leg arrived split from top to bottom. I do not believe this was a shipping problem, but rather a quality of wood problem. However, I contacted customers service using the Chat feature online and they were very helpful. I like the resolution whichwas that they would ship me a new part rather than my having to ship it back. They said I would have an answer from the warehouse within 2 days aou whether the part was available and that was accurate,", 
    "True to the picture. So far an excellent piece of furniture.", 
    "I really love the pattern on the chair. It's beautiful! It's rich and elegant -- exactly what we needed to bring a dull brown sofa to life. The only disappointment is that it's a bit too firm in terms of sitting on it (for me). Having said that, most of the time it is used as an accent piece vs. for sitting on (it's in our guest bedroom / counseling room where it complements a sofa bed).", 
    "Happy with my purchase so far. This chair was easy to assemble and is comfortable to sit in. I got the Grey - It is more Tan/Taupe than Grey but it goes great by a grey wall and stands out without being overwhelming. Quality seems fine. My kids have been jumping on it and so far it has been easy to clean. I recommend this product. Shipping was very fast - i think 2 days. Came in a box which was easy to carry and unpack.", 
    "The was a good deal. I got two chairs for 178.00 and they are nice.However, I did have a problem with 1 of the screws not going in all the way.", 
    "Fairly easy to put together by yourself. Sturdy. Beautiful colors. Packaging was excellent", 
    "A bit hard to assemble, but a sturdy and beautiful chair.", 
    "These pretty accent chairs perk up my room. Great color choices.", 
    "I was so excited to receive this chair, but it's so cheaply made and so light, I'm very disappointed. My 1 yr old reclined on it and almost falls because the chair is that light. Would not recommend it.", 
    "Very pretty chairs. Looks great, but no one is ever going to sit in them because they are so hard and uncomfortable.", 
    "I love these accent chairs I purchased for my front room sitting area. They frame my fireplace nicely and add just the right amount of pattern and color to my decor.", 
    "I bought two. They came in boxes and were simple to put together. They are very comfortable, too! I bought matching pillows to coordinate room :) Very cute!", 
    "Nice chair, a little bit of a pain to put together but looks nice", 
    "This is so pretty and the color is exactly as portrayed!", 
    "Exactly as it looks online. I love it. I ALWAYS have good luck with Overstock!! Fast delivery, great prices, good quality and matches online images!! You can't go wrong on this sight!! Exactly as it looks online. I love it. I ALWAYS have good luck with Overstock!! Fast delivery, great prices, good quality and matches online images!! You can't go wrong on this sight!!", 
    "I love it!!! I wish I bought 2", 
    "Got it for the small bedroom. When with the green. I used a silvery grey pillow for an accent. It was fair easy to assemble. It's a nice study chair with a great design. Very pleased.", 
    "Love these chairs! Simple assembly", 
    "Goes beautiful in a formal living room", 
    "beautiful and functional accent chair", 
    "The chair are good quality & pretty, but a lot smaller than I expected.", 
    "This chair is not only beautiful to look at, it is well made and sturdy. The fabric feels good and is exactly like the online photo. Quality product, excellent price, fast shipping. I could not have asked for more.", 
    "It was slightly shorter than I wanted, but the fabric was exceptional and the color exactly what I wanted.", 
    "I was looking for an inexpensive chair for my bedroom. Seems very sturdy but only gets light use. The color and size is what I was expecting.", 
    "I bought 2 for my entryway. Been looking for chairs and they are all $$$-$$$ at stores. I got two for less than $$$ and they look great.", 
    "We ordered these chairs for our day care center's office. We read the reviews on these types of chairs. So we were prepared when we decided to order them. We purchased 2 chairs. We read the instructions first. Then my assistant assembled them in the office. They went together with out a hitch. All is good. The boss came into sit on them the other day is well please at our purchase.", 
    "Great chair and amazing for the price", 
    "Nice accent piece in my bedroom"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Peterson-Floral-Accent-Slipper-Chair/8122319/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8122319/INSPIRE-Q-Peterson-Floral-Accent-Slipper-Chair-2a429488-9c3e-4afe-9b20-a91f96eb448f_600.jpg"
  ], 
  "description": "Add this contemporary-designed floral chair to your office, living\nroom or bedroom to breathe new life into a boring space, or create\nan intimate conversation nook by pairing two chairs together. This\narmless accent chair is as comfortable as it is attractive, as the\ndeep seat filled with spring-foam allows for ample support. The\ndiscreetly-patterned upholstery and Chinese solid wood legs\ncomplement most decor schemes. Fabric upholsteryArmlessSet includes: One (1) lounge chairMaterials: Rubberwood/Chinese solid wood frameWood finish: Rich espressoUpholstery color option: Grey floral, grey gold floral, teal\n  floral, black tan floral, green floral, orange floral, red\n  floralUpholstery fill: Spring/foam       Seat height: 18 inchesSeat depth: 21.5 inchesOverall seat dimensions: 32.5 inches high x 22.75 inches wide\n  x 29.5 inches deepStyleModernMaterialFabric, Foam, Rubberwood, WoodFinishBrown, Espresso, WoodPatternFloral, Print, SolidChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightLow BackColorBlack, Blue, Gold, Green, Grey, Orange, RedFurniture Frame MaterialWoodFurniture PatternFloral, Print, SolidGallery MatchYesGallery RoomBrandon Club Court, Cascadia, Double Comfort, Gracious Grand Master, Lorimer, Plymouth, Quiet Taos, Silver And Blue, Sunny Side Up, Sycamore Street, White Seashells"
}