{
  "name": "INSPIRE_Q_Grace_Cream_Linen_Arched_Bridge_Top_Bed", 
  "price": "EUR 433.17", 
  "reviews": [
    "I had been searching for this style of upholstered bed with the nail head trimming for quite some time to go on my brand new wood floors; but honestly, just the headboard alone was well over $XXX in almost every store and even online. Naturally, when I saw this beautiful and elegant bed with the entire upholstered frame included in the easy to care for fabric for under $XXX, I knew I couldn't pass it up. Having read some mixed reviews regarding the color not being true to its image on the site and it being difficult to assemble and not very sturdy, I was not sure what to expect, but generally I'm a total optimist, so I went for it! Upon delivery all my previous doubts were quickly put to rest as the color and the fabric where perfect. The bed is sturdy and easy to assemble. I did it all by myself! And honestly it makes my tiny bedroom look like a million dollars, so much so that I made a video and sent it to all my friends!! I definitely recommend this item and Overstock.com. I am thrilled with my purchase.", 
    "I've been looking for a compromise between my ultra-glam romantic design sensibilities and my husband's more modern/masculine preferences. Finding a new bed to suit both was a real challenge, but this one fits the bill perfectly. Feminine and glam enough to make me happy, refined and neutral enough to keep him happy. The ordering process was easy, the shipping was really fast, the items arrived safely and all accounted for, the construction was exceedingly simple and fast - I did it by myself in less than an hour. I've been sleeping on it for about a week now and couldn't be happier. The only thing that keeps my rating at 4 stars instead of 5 is the fact that the cross beams that go under the bed were indeed (as I was warned in other earlier reviews) very shoddy/cheap plywood that is full of splinters and cracks. Honestly, it's mind boggling given how well constructed the rest of the bed seems to be. A quick trip to the local big-box home store and a few extra quality boards later, and problem solved. The bed doesn't move an inch or make a peep, even when two very rambunctious young boys jump all over it. I highly recommend.", 
    "Moving to a new state into a new build home I wanted a fresh new bedroom set. I looked on countless websites for an upholstered bed with nailheads and prices were all over the board. I was willing to spend more (at a restorative store or gallerie), but this is the set I continued to come back to...and bought! Saved at least $$$$! It's not white but more linen (light oatmeal) in color. It takes a low-profile box spring and what I really love is that the mattress sits high enough that you don't have to get in between the rails to change sheets making sheet changes a breeze. Yes, there is a small 1\" gap between the rails and mattresses but this hasn't created any sort of problem. It's not a large enough gap where you would catch a toe or foot so I don't understand the complaints about that. Yes, the slats are definitely splinter ready so put on a pair of gloves for this part! Thankfully, we didn't need to run out for any additional parts/pieces. I began putting this together myself. The rails easily lock in to place. When it came to the rest of the bed, THANKFULLY my mover came in with a drill and had everything else together in less than 10-minutes. I STRONGLY suggest you use a drill to put this together. Had I had to do it manually it would have taken me at least another hour since, as to be expected, the holes weren't always where they should have been and with a drill he was able to quickly resolve that issue ;) I have white bedding on this bed with a white shag rug under it and everyone that has seen it has complimented me. Great buy!", 
    "After spending years buying beds that take 3+ hrs to put together from Ikea and the likes, this bed was a breath of fresh air. Really pretty, not quite white, more like a light beige that looks really nice). Now just do yourself a favor and make sure you have a box spring and not just a mattress. I assume the extremely cheap slats that come with this bed are the trade off. They wont do anything for you if you only have a mattress but with a box spring they do just fine. i'd buy again and recommend it.", 
    "After reading all of the reviews, I had a pretty good feeling this bed would not be white. And it isn't. It's a light cream and super neutral so it still works, but considering it's such an easy mistake to fix I'm surprised Overstock hasn't done it yet.The bed is absolutely beautiful! Well made and easy to put together. I'm still a little bit skeptical at just having 3 wood slacks for support, so I might add some more but it's exactly what I was looking for!", 
    "Looks really expensive, it is obvious when you put it together it's not. Unlike other buyers, I didn't install any additional slats. It's not a big deal for sleeping or other bed activities, just be careful where you put them. If you sit on the end of the bed like I do while dressing you'll tip the mattress without a slat there to support you.", 
    "I bought this bed for my daughter's room. She's only five but I loved the head board so decided ok - I'll buy the whole bed and frame. Presently we only have the headboard put up wit her current double bed, propped up on the legs and it looks beautiful. We're saving the base for when she's older and requires a larger 'queen' size bed, but for now the double is more than enough space for her. So I cannot speak to the integrity or quality of the bed frame as it hasn't been assembled therefore Ive only given a rating of good since I can't speak to the product as a whole. She's very happy and the headboard really makes her room look just a touch grown up to off set some of the more fun and girly elements I've added. Very happy with my purchase.", 
    "I have gotten so many compliments on this bed. The headboard is comfortable to lean against and the it looks way more expensive than it is.", 
    "Cute bed for my teenage daughter!", 
    "i recently bought this bed and i just love it. i paired it with a serta mattress i also purchased from overstock. i must say overstock has the best items i renovated my entire bedroom over with all items from overstock. i am very satisfied. very easy to put together i did it by myself. it was quick and i didnt break a sweat. i highly recommend this bed to anyone", 
    "I have had this bed for almost 2 years now, and I definitely would not buy it again. It barely holds the of us and that mattress and my husband and I are not big people. You might be able to get away with it in a guest room that is barely used, but for daily use, find something else. We had to add slats to it, and then make a metal bracing that fits inside this bed to hold the actual mattress and us because the little tabs on the side that are supposed to holdThe mattress are absolute crap. Yes, it's pretty. But the quality is not there", 
    "Perfect fit for my new master !! Changing everything to black and cream and this fits perfect!! Still haven't added extra slats,, to busy but me and my two labs sleep fine ha!!", 
    "I purchased this bed and I am so extremely pleased with the quality and beauty of the bed. The bed is very well made and seems very sturdy and I would highly recommend this bed to others. The bed was also fairly easy to put together and we had no issues with the slats that other people had discussed.", 
    "Exactly what we were expecting.", 
    "I love my bed! Very elegant!", 
    "This bed is beautiful. I was able to assemble it myself. Love it!", 
    "This is a beautiful bed at a great price.", 
    "Gorgeous bed and very easy to assemble. So glad I purchased it! You won't be disappointed!", 
    "We ordered this bed a few months ago and I must say its still as beautiful today as the day we received it. I kept my bed frame since we needed the support for our backs. The bed frame fit right into the bed with no problem.", 
    "I absolutely love this bed. It's great quality and all of my friends love it. This bed really shows my personality and how much I love creams, nudes & white.", 
    "I was so happy with this headboard that I bought another one for the guest bedroom. Very well made and it looks fantastic.", 
    "We purchased this bed for our guest room. It's beautiful! Know that it is a platform bed. We were surprised by this. Still love it. It makes the room look polished and put together. Thanks Overstock!", 
    "I sent this headboard back. The fake nailhead trim is cheap looking. I considered piling tons of pillows on the bed to distract from the trim but I just couldn't live with it, not even in a guest room.", 
    "Great bed, took about 45 minutes to put together. Looks amazing in our little girls bedroom, welcoming and stylish.", 
    "The movers put this together in about 25 minutes. Though it only has 3 or 4 slats, they said it would be plenty to hold everything in place. I added a 9\" box spring and an 11\" memory foam mattress and it's been fine. Held up to both of us plus two dogs. Quality was about what you'd expect, not bad for the price. Color is a nice, neutral off white and looks great against our jade wall.", 
    "I want to buy another one for my spare bedroom I love this one so much", 
    "Re-designing my master bedroom in a glamour style, and this bed fit the bill. It came quickly, and was easy to assemble I am a DIY woman at heart, and I had no problem. It will be helpful if you have an additional hand, but not required. The overall purchase is good quality, and I am satisfied with the overall look.", 
    "Good size. Fits in our guest room. Took a bit to put together. Overall I would recommend to a friend", 
    "love this bed! We get compliments all the time on how beautiful it is!", 
    "Arrived on time and it's gorgeous!", 
    "Great bed. Very happy with the product. It looks great set up. Very pretty look.", 
    "Great bench. Looks expensive.", 
    "The bed is beautiful and looks expensive. Very happy with the purchase", 
    "If you are looking to save money but also get a designer looking piece, this is the bed you should get. Although the instructions were a bit off it was still put together with no problem. It's a gorgeous bed and so far we are very happy!", 
    "Came with no instuctions so had to make a lot of phone calls to finally get those. Doesn't tell you what type of mattress to buy so we bought wrong one and had to return - another week. It is pretty but would never buy again because of all the above problems - & not easy to put together.", 
    "Beautifil bed to look at and very easy to set up!", 
    "Looks very nice and the full size is perfect for a smaller room. Easy to dress up or down with bedding. Very easy to assemble.", 
    "how can you send a furniture and not have the correct parts..", 
    "We bought this bed for our vacation home. It was a quick assemble and everyone comments on how beautiful it is. Great value for the money!", 
    "This beautiful bed transformed my guest room! Now it's stylin'! I have a comfy older mattress on it and my friend said it was like sleeping on a cloud. It is plenty sturdy and looks gorgeous. I've never ordered furniture online before. Overstock is fabulous to give you the estimated QUICK arrival date and email with UPS tracking. I knew exactly when it would arrive and my husband easily moved the three boxes upstairs to the guest room. He quickly assembled it and said it was very easy. Easy process from ordering to FAST arrival to easy assembly. I'm happy!!!!", 
    "not as sturdy but we are adults and handle our stuff gentlty. if you are looking to buy this bed for kids, look for more sturdy product. looks beautiful though", 
    "We love our new bed! It was easy to assemble & is great quality, especially for the price! The only negative I can give is the color looked lighter on the website...but I still love it!", 
    "The bed came exactly colored and just in time as it said. Although it was really heavy to get in the front door, I will get someone to put it together. This bed looks so beautiful in the photo and really is just worth the price. If you are looking for a bed like this, I reccomend you definetely buy! I felt the headboard and it feels so good and soft! If you are looking in to buying this, you really should!", 
    "we wanted an upholstered bed for our vacation house - which is very beachy. its really nice and decent quality. the only thing I don't really like is the level of high shine on the nailhead. really a good buy for the price.", 
    "I spent a few months researching beds before making a purchase, and I am so thrilled with how great this bed turned out to be! It is not true to color in the photo (more of a light beige) but was easy to assemble and is very sturdy! I would definitely recommend it!", 
    "Love it - gorgeous color - neutral but no yellowy tones. Very sophisticated and expensive looking - great price.", 
    "I received a few terribly damaged pieces which appears to be the norm with Overstock so anticipated spending hours dealing with customer service getting parts replaced...possibly several times. The frame itself is very pretty and better quality than expected. The slats are FAR and few between...my mattress basically just feel through the gaps. The support legs used to hold the thin wooden slats came broken and the ones that weren't are still plastic so the tiniest amount of weight made them bend. They couldn't even support the mattress--and I have a foam VERY light weight mattress (compared to traditional mattresses). I give it a 4 because the bed really is pretty and perfect if you want a contemporary chic look but I really want to give 3.5 b/c the damage is just ridiculous!", 
    "My friend can't believe how inexpensive it is.", 
    "Looks like an expensive bed from afar and up close, its not until to inspect it with a detective eye that you can see the material and craftsmanship aren't \"expensive\". For the price though its a value.", 
    "Color appears slightly darker beige than i was hoping for (ivory/off white). Still works in my space, and feels sturdy. Would repurchase for a guest room in the future.", 
    "I decided to redo my daughter's bedroom for her birthday and she wanted a modern/luxe look. Although the fabric isn't my first choice, it's a great neutral. Plus, the price is amazing so i understand the \"you get what you pay for\" rule. Just mixed it with some quality textiles and bedding and it looks amazing!!", 
    "The bed is beautiful and worth it. The assembly was really bad and took more than 2 hours. The screws didn't fit inside the foot covers (warped) so my husband had to spend time using pliers shaping the screws to fit.", 
    "This bed is very pretty, but it gets dirty very easily and was difficult to assemble. Luckily my movers had assembled a similar bed. I never could have done it.", 
    "I can't rate it 5 because I haven't put it together. I literally took it out of box. Box came in a little jacked up but everything inside was perfect. It smells a little but because it's been wrapped up. I've had it in boxes for 2 weeks while I moved into my townhouse. Based on reviews earlier, I will measure and go to Honedepot and have them cut some sized slates just in case to prevent any issues. I already have a staple gun and some fabric so they all will stay together equal spacing. It's really a beautiful bed.", 
    "This bed is exactly as pictured, was easy to assemble and is sturdy..I recommend using a box spring, otherwise the mattress sits too low", 
    "I was looking on Overstock for a mattress for a friend, and bought this on a whim. I was afraid I had made a mistake. But I didn't. It's perfect, it was easy to assemble, and looks great. I'm very happy.", 
    "It turned out to be exactly what I expected it to be. Great quality, high end look, and affordable. It's perfect for my teenage daughter. Shipping was fast and assembly was quite easy. What a great find!", 
    "Nice, decent quality More tan than white,", 
    "For months I have been wanting to make my own tufted headboard, but couldn't find the time. When I found this best, it looked too good to be true! It was just what we were looking for and it was affordable! When we got it, we were quite pleased with the durability and strength of the products. We're certainly sleeping pretty each night!", 
    "This bed is beautiful. It is a fraction of the price I have seen i expensive furniture. It is exactly what I wanted. The white is a light beige. Bed is sturdy and glamorous. I am very pleased with my purchase.", 
    "i didn't have any issues putting it together. and it is pretty sturdy. It is definitely not white though. It's more of an off-white - hints of beige and light grey depending on the lighting. Reading the other reviews I didn't expect it to be pure white, so I am fine with that. I don't dislike the color, but I do wish it was a bit closer to white than beige. The only thing I don't like about the bed is the \"nailhead\" detail. It is metal that actually looks like a track sort of. For the price I paid, I can't complain though! It has been great for the last 4 months that I've had it.", 
    "I read reviews about this bed & kept looking at it for days trying to decide if I should order it. I've never ordered a bed without seeing it in person & I was hesitant.. But I'm so glad I ordered it! It was beautiful.. There were a couple of marks on it but they rubbed right off. I put the bed together by myself to prove to my husband that I could lol. I love this bed.. Absolutely love it!", 
    "It's lovely. it is definatly not white, it's more of a creme color it still looks amazing though.", 
    "I really thought I had bit off more than I could chew. After opening the boxes and checking everything I layed every thing out in order. I then took the instruction booklets and read over them several times over the next days. Finally I said its now or never.TIP #1 throw out those freebie hex wrenchs ( you will destroy your wrist) and get a drill or power screwdriver with hex and phillips bits.TIP #2 finish with hand tightening so as not to strip anything or crack the wood..Once I began it went like clockwork. I did put the headboard legs on the wrong sides and after standing it up immediately knew it was wrong. Took me 10 mins to switch them. Dropped the side rails in, attached footboard (had already screwed feet on) and then began the slat leg attachment. They had me stumped for a bit as the screws didnt seem to want to fit but finally they did. Attached slats with legs to side rail with wood screws and done. It took me 1 hour and 25 mins even with the mistake. And I'm a woman. The instructions are vague...thats why I put the legs on the wrong sides...but not as bad as some Ive seen.I too was pleased at the color of the bed as they match my Belgian Linen drapes from RH. Super pleased I won;t have to replace them! The shade is actually called LINEN and I love it. They do an almost identical bed called the DELANO and it costs almost 10X as much. Did I say how pleased I was :D Pretty smugly satisfied!", 
    "GREAT BUY, is very sturdy and nice quality, looks like it cost much more", 
    "It was for the most part easy to put together and the headboard is nice, but one of the screws could not screw into one of the poles that connect to the platform, so I had to leave that pole out.", 
    "Gorgeous! Didn't take a long time to build and very sturdy.", 
    "This bed is beautiful and very well made. It looks more expensive than it was. The fabric is very nice quality. although it is not white it is more of a beige color. I definitely would repurchase.", 
    "Very nice bed for the price. It's well constructed and looks to be of good quality. It takes about 30 minutes to put together. There were a few missing washers in the assembly kit, but those were easily picked up at the hardware store. Very happy with the purchase.", 
    "Got this for my guest room. It is gorgeous... People tell me the room looks like it's from a model house. It is truly stunning.", 
    "Ordered this based on all the positive reviews and am I SO GLAD I DID! After visiting numerous furniture stores, department stores and searching the web over, I am over the moon with this purchase. The price was RIGHT and it looks better than most of the beds I have seen that cost much, much more!This bed is not only beautiful but easy to assemble! For a woman who dislikes putting things together this was a breeze! Thirty minutes assembly time tops! The color is not a bright white more like an off white cream which is perfect against the newly painted grey walls. This bed could go with white or off white cream.", 
    "I got this at such a perfect price that I was a little skeptical. It turned out wonderful. Heavy and very well made.", 
    "I ordered this bed a few weeks ago, as I had been eyeing this style for quite some time. The price was right, the reviews looked favorable, so I took a chance. I don't normally buy things this large, without seeing them in person at a retail store. It was a calculated risk. I am newly divorced, aged 49 and have rarely used a screwdriver or allen wrench in my life.The bed arrived very quickly, and was perfectly packed. It does make a bit of a mess when unwrapping...have a vacuum handy for flying styrofoam bits, and a blunt knife for cutting open boxes carefully. Invite a friend to help; I believe it is a two person job. Do not drink wine. Find an extra allen wrench for your friend. I prepped it for my friend's arrival by laying it out, pulling off the plastic, and removing my old bed frame. You need a lot of room to assemble it. I carefully unwrapped the screws, bolts, washers, etc and paired them as described in the accompanying paper. We did the headboard first, then the frame. I found that loosely aligning things first, then screwing tight was the best way to do it. The only thing we had trouble with was attaching the wooden slats to the inner frame...the screw had no pilot holes, however, they simply go straight in to the wood when screwed well. It took about an hour to an hour and a half with two chatty women who made occasional mistakes.The bed is beautiful and sturdy. Fabric will have its downside...like pet fur, and my cat could possibly scratch it but so far, so good. I will vacuum it to keep it clean. I did lose clearance underneath for under bed storage - too small to fit anything at all.Overall, I am really happy with this purchase.", 
    "I wish I could upload a picture of this bed in my room. It's absolutely gorgeous. The bed is not pure white it's off white (which I think is better than white). Quality is great easy to put together, YOU MUST HAVE/USE A BOX SPRING. I have a low profile box spring and it really fits and works perfectly with this frame. Delivered fast, looks amazing and very grand in my room. I'm very pleased with this purchase.", 
    "Delivered on time, the only thing is that It didn't came with a box spring :(", 
    "This is an amazing product, worth 3 times the cost!The color, quality, directions and shipping time surpassed my expectations.I received the bed within 3 days of placing my order.The fabric, wood and railings were really good quality.The directions were VERY ease to follow.What I was nervous about were the wooden slats that hold the mattresses, no need to worry; they come with 6 support legs...it's as solid as a rock put together.The silver grommets and covered buttons add such nice detail and give it the classy look I was going for.I have received so many compliments, no one can believe I got it on Overstock, looks like it came from an expensive furniture store!", 
    "Bed was prettier than we expected. Coloring was subdued, and it was well made.", 
    "The bed is gorgeous and definitely looks higher quality than a few hundred dollars. I'm in love with this bed, especially the nail-head trimmings.", 
    "We bought this headboard for our grand daughter's bed room. It is elegant and well constructed, it would give any bedroom that special added touch. It is fabric though, so you do have to watch it, no food fights in bed!", 
    "This is a beautiful bed that definitely looks more expensive than it is. I find the fabric to be a bit on the cheap side, but for a guest room or a kid's room, this is a perfect choice. Be sure to put together with clean hands as the fabric does stain easily.", 
    "I love the quality , color was what they said. And they got it in a time.y manner to me", 
    "Product was exactly how it looked in pictures but I ordered the color white but it looks more like light grey.", 
    "Bed came in about a week, via UPS versus freight - which is always a plus. It was well packed. My husband put it together in about an hour and a half - and he usually takes about 3 times as long on a task like this as most would. I think 20-30 minutes would be a good estimate. It was easy to put together. It is definitely beige/cream, not white. The slats are not high quality, you'll need to add a few. I love the style and the quality is excellent. I don't know how overstock.com sells items like this for the price you pay - you'll NEVER find anything like this in a retail store, especially at the price. Great purchase from o.co, as usual!", 
    "The bed was supposed to be white. It is more like khaki. I am very disappointed due to the color. The picture looks white and the description states white but it is not. This bed is light khaki/tan in color so if you want a white bed as I did, look elsewhere.", 
    "I can honestly say this is beautiful, the structure, the materials used and it is very, very easy to assemble...took about fifteen minutes. The color is more then an off white with a grayest hint then white, but still for the money it's very nice. I highly recommend this product.", 
    "LOVED IT! Looks super fancy and expensive but it was such a bargain!", 
    "Absolutely love this bed, I was very weary about ordering a bed online without seeing it in person first but I couldnt be happier! The color is just what I expected and the quality is great. I did go to ****** and have more support boards cut after reading reviews, the bed is very sturdy with those boards.", 
    "I had even read in other reviews that the bed was not as white as what was shown in the pictures so I was expecting more of a cream or off white bed to arrive. When I opened the box I was immediately upset because it isnt even cream, I would describe the color as more of a light khaki. Other than the color issue I absolutely love the bed. Have not had any issues with it not being sturdy like previous reviews had stated. I just wish it was actually white white.", 
    "just love it. the only thing is that I order a White bed and its completely tan. But I love the look it gave to my room. I would recommend it to my friends and family. I am planning to get another one for my son as soon the price drop.", 
    "I ordered the Queen size bed. The quality of the linen headboard is decent. Better than Ikea. It looks good but my headboard arrived stained in several areas even though the package arrived covered in plastic, so that factory or warehouse is not delivering quality product. Pros: Linen headboard has potential to look high-end. It's a beautiful style. After much research, it's a good value--if it arrives intact. Cons: Comes with 3 flimsy pieces of prefabricated wood so you really need to buy more wood for support under the bed or box spring.", 
    "Bed is beautiful but unless you have a box spring (we called and were told one wasn't needed, so picked this bed based on that factor), the support slats don't suffice. We called and were sent twice as many, but still needed to buy wooden support from Home Depot.", 
    "This bed is a stunner. All our friends are just amazed as to how expensive and modern it looks. It arrived well packaged. There were a couple issues with aligning the side boards because the hooks on the ends (that hook into the head and footboard)were bent so we had to use a hammer to knock them back into place. I panicked a little...won't lie. But in the end, the bed is gorgeous! With the box spring and the mattress, the bed is nice and high. Looks like a bed from a classy showroom. Best purchase I have made so far for my new apartment!", 
    "I looked for a very long time before ordering this bed. Most beds I found on-line with the same value/options were a whole lot more expensive. The bed is a light ivory color with linen material. It took my husband 20 minutes to assemble and it was very well packed with all the right pieces shipped. It only took 7 days to receive it and with no shipping fee the product just can't be beat. We just moved to a coastal town and wanted something new for our beautiful cottage. We painted the wall the bed is on a beautiful ocean blue. Looks fabulous. I highly recommend this bed!", 
    "For nice and soft bed. Love the color and style of bed.", 
    "I bought the bed for a guest bedroom, I personally feel it makes the room look very nice and upscale. My guest enjoyed their stay and loved the bed. Thanks overstock for great customer service.", 
    "So I love the look of the bed it looks great in my apartment and the headboard is beautiful but the frame is so crappy! The support boards were probably one dollar boards they got from the scrap bin somewhere! Right now they are bending a bit but I'm scared to jump onto my bed or do anything too rigorous or I'm sure the boards will break! I got really nice slats from ikea that dispurse the weight more evenly and are alternative to a box mattress. If you don't have a box mattress or slats for support your mattress will sink through the support boards. There is no middle beam running perpendicular down the frame just three horizontal boards and six pegs, two for each board. Anyways I do love the bed just wish the support was better! My bed was shipped in two days!", 
    "Very happy with my order. Received the bed TWO days earlier than initially quoted on the delivery time! Set up was easy, added a few more wooden slats to make sure it was super sturdy. I don't hear any creaking or noises as some other reviews mentioned (maybe it was the extra slats) It is a gorgeous bed all in all. Well worth what was paid I am so happy with my purchase and service from Overstock.", 
    "Arrived as scheduled in pristine condition, very easy to assemble . I did it by myself. Very sturdy and looks fantastic. the color is not the bright white shown it is more cream which is fine with me. very attractive. Love love love it.", 
    "Awesome bed just what I was looking for. No issues at all. Got all the pieces and was very easy to put together for a women in her 30's. The color is the only think that is not correct. Site says it's \"White\" and it's not. It's actually an Ivory color which was great for my design. Some of the comments on here where deceiving such as the bed it's as sturdy as it look but it is for me if you put it together right. The slates that came with it work great I haven't had any issues with them. So I took a chance on buying this bed even though the reviews were up and down and it was the best decision I ever made. I would recommend this to anyone. Awesome price as I have been looking for about 1 year now. And I have had this bed for just over a month now.", 
    "Very satisfied with purchase! :-) Great style Great quality overall. The headboard is the focus of the room. It has a wow factor bringing all attention to its very detailed shape and nail trim (strip of nails) I shall mention. I spent several weeks starring at it online & reading reviews before I finally made the order. The positive reviews convince me to give it a try & I'm glad I did. Received it within a week & took my boyfriend 2-3 hours to assemble. Great instructions he said. Like the reviewers say the bed is \"BEIGE\" not white.", 
    "This bed is simply gorgeous! It makes me feel like a princess. I did notice that it is not really white like the picture suggests, but I like it better in the off white color. In certain lighting, it can even look silver. I did not have the problems others suggested of squeaking and/or shaking. My only issue is with the wooden slats on the bottom. They seem cheap and weak, and I worry that they will break. So far, they're holding up well, though. The bed was very easy to put together. Any issues I had were definitely user error and not the product.", 
    "Great bed, sturdy, does not squeak, comfortable, easy to assemble. More the color of oatmeal though. Definitely not white.", 
    "After months of searching I bought this bed for my daughters' room. I absolutely love it!! Like the previous reviews said the color of the bed is an off white, but it fits in perfectly. The bed is really solid and it doesn't squeak, and the quality is excellent.. It was really simple to assemble, my husband had it up in no time. I'm a very satisfied with it.", 
    "I bought this bed for my guest bedroom and I love it! The only complaint that I would have is that it is not white. I was expecting a crisp white and it is more of a natural beige. But it is still neutral and looks great in my room. It isn't the best quality craftsmanship that I have seen, so I wouldn't recommend it for a bed that will be used every day. But for the price, it is a steal of a deal! And it arrived two days after I purchased it and was super simple to assemble.", 
    "So, originally i got this bed for our master bedroom. however its EXTREMELY creaky so unless you want everyone in the house to know when there's some funny business going on, DO NOTTTTT get this for your master bedroom. Much better for a guest room. Looks super cute and for the price you can't beat it. Like I said though, it's very loud and rather awkward so just beware of that.", 
    "After months of shopping for a bed I decided to give this one a try! I ordered the bed and received it just a few days later. Assembly was fairly easy. My boyfriend and I were able to assemble it in a about a hour and a half. The fist thing I noticed was that this bed IS NOT white! This bed is actually Ivory or beige. That was a little disappointing since I wanted a true white bed. Despite the color, the bed is beautiful and has a very regal look. Another surprise is that this bed needs a box spring! I had to run out to the store and purchase one at the last minute. The last issue I had was that there was a little dirt on the top of the headboard. The fabric used for the headboard seems to be a great quality and has an expensive look to it. Overall, I think this is a very nice bed for a great price. I would recommend this bed to others. I am not sure how sturdy the bed is since I just set it up 2 days ago.", 
    "This bed is absolutely gorgeous. It's functional yet stylish. Beware of touching the bed once it's out of the packaging and the shipping boxes as your hands will probably be dirty. We made this mistake, but the dirt washed right out with soap and water. It's sturdy, we haven't had any problems with the wood creaking or making any noise. You do need a box spring with this bed, and it does come with 3 support rails to lie across the frame. These rails were in very rough condition as the wood was splintering off so we had to use a bit more care when handling them. But they do the job and we'll never see them so it wasn't a huge concern. Overall we are very happy with our purchase. Yes, even the husband agrees this bed looks and works great!", 
    "This piece was a really good deal. It is off-white almost ivory, not white as advertised, but that worked perfectly on my decor. Couldn't be happier!", 
    "I purchased this queen bed for my teenage daughters bedroom. Easy to put together and looks great with mirrored furniture. If you are looking for a reasonable priced item that looks expensive, this is the one!", 
    "Great look for our guest bedroom!", 
    "The only complaint is the same as all others... How could they give such low quality of 3 pieces of raw wood!!! Very disappointed but otherwise it's great! We had to use spring box because it was too low."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Grace-Cream-Linen-Arched-Bridge-Top-Bed/8300398/product.html?recset=ff020176-31d1-4b0b-abf5-5f6504481c28&refccid=QLOTCR77AQMJGMKEIK5W6CXZS4&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8300398/INSPIRE-Q-Grace-Cream-Linen-Arched-Bridge-Top-Bed-4576486e-5a0f-40c1-91c6-f0033cf73ce4_600.jpg"
  ], 
  "description": "Relax in luxury in this comfortable well-made modern bed. The unique shape of the headboard adorned with nail head trimming adds elegance and a stunning style to your bedroom. Upholstered in linen, the headboard and footboard make a fashionable and modern statement. The clean look of this upholstered bed with wood framing in a warm espresso finish creates an inviting design. Arched Bridge Top CurvesNail head trimmingUpholstery materials: LinenSet includes: One (1) headboard, one (1) footboard, one (1) set of railsMaterials: Poplar woodFinish: EspressoUpholstery color: WhiteUpholstery fill: Polyurethane foamOverall full: 52.75 inches high x 59.5 inches wide x 83.75 inches longOverall queen: 52.75 inches high x 65.12 inches wide x 89.75 inches longHeadboard height: 52.75 inchesFootboard height: 13 inchesLeg height: 4 inchesHeight from the floor to the slats: 11 inchesInside dimension of full frame: 55 inches width x 76 inches lengthInside dimension of queen frame: 61 inches width x 82 inches lengthAccommodates boxsprings and mattress, NOT includedFull internal-mattress opening: 55 inches wide x 76 inches longQueen internal-mattress opening: 61 inches wide x 82 inches longMaterialFoam, Linen, WoodFinishEspresso FinishBed StyleRegular BedAssemblyAssembly RequiredColorCreamFurniture PatternSolidGallery RoomCrimson and CloverProduct FeaturesIncludes Hardware"
}