{
  "name": "INSPIRE_Q_Jourdan_Linen_Sloped_Arm_Hostess_Chair", 
  "price": "EUR 202.72", 
  "reviews": [
    "I purchased these as host and hostess chairs for my dining table. For the money I am very happy with the look. They are comfortable enough for a leisurely meal, although they do sit a bit firm. We have really enjoyed them so far. They definitely look much more expensive than they were. My side chairs have a tall back, and these look great to balance them out. I noticed that many of the other similar chairs were not this tall. Very happy with the purchase.", 
    "I have looked at these chairs for at least 2 yrs. Finally ordered them and I'm glad I did. They are perfect at the head of the table. Not too large, arms slide under the table apron easily with room to spare. Not heavy, and can be moved around easily for other uses. Not difficult to put the legs on either.", 
    "These chairs work great at the ends of our dining room table and for a great price point. The shipping was quick. Ready for the holidays now!", 
    "Excellent size, great padding and comfy. Looks wonderful in my dining room!", 
    "After reading previous reviews, I was a little disappointed…expected better quality. While not horrible for the price, the back feels like it's only supported by foam, so just wondering how long these chairs will hold up.", 
    "we love it, but the bottom protection is very easy to fall out", 
    "Ordered 2 of these chairs and received them within 5 days of placing my order. I'm impressed!The chairs look just like the picture so no surprises here...thank goodness. Not very comfortable but perfect for what we need them for.", 
    "Not extremely comfortable.", 
    "These chairs are very hard to sit on. Your feet don't touch the ground and the material stains even with a drop of water. We actually received 6 of them and after several days we took them to the dump. A real waste of money", 
    "Very nice looking chairs...the light gray is a little darker in person but still very pretty. I'm not crazy about the stiffness of the seat but comfortable enough. Well made tho and like how wide the seat is.", 
    "Great quality. Not too small. Fit a 60\" table just right with 4 seating. A little more blue than what is shown but still nice.", 
    "Chair was purchased to sit in front of a desk in guest bedroom. It was perfect for the spot. It was a little lighter blue than I was expecting but it worked well in room."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Jourdan-Linen-Sloped-Arm-Hostess-Chair/8585534/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8585534/INSPIRE-Q-Jourdan-Linen-Sloped-Arm-Hostess-Chair-9bb60a32-bd00-41ed-9b80-ea871dd31ad9_600.jpg"
  ], 
  "description": "Improve the look of your dining area or living room with this\nInspire Q hostess chair. The sloped arm design and soft cushions\noffer a comfortable seat perfect for relaxation. With plush linen\nupholstery and a rich espresso finish on the legs, this chair adds\na sophisticated feel to any room.Constructed from Rubberwood for durabilityAvailable in gray, denim blue, dark gray, chartreuse and\n  beigeFoam and spring upholstery fill provides a comfortable\n  seating experienceDeep seat and sloped arms offer comfort, while curved back\n  legs improve stabilityLinen fabric with rich espresso finished legs complement\n  modern decorSeat depth measures 18.25\"DSeat cushion thickness measures 4.25\"LSeat height measures 18.5\"HSeat width measures 19.5\"WBack height measures 22\"HOverall dimensions measure 40.5\"H x 24.5\"W x 26.75\"DStyleContemporary, ModernMaterialLinen, RubberwoodChair TypeArm Chairs, Dining ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Green, Grey, YellowFurniture PatternSolid"
}