{
  "name": "INSPIRE_Q_Darcy_Espresso_Metal_Upholstered_Dining_Chair_(Set_of_2)", 
  "price": "EUR 76.50", 
  "reviews": [
    "These chairs look great in the picture, unfortunately they are very cheaply made, small, uneven and wobbly. I am a very small person 5'3\" 114 lbs and I barely fit and they are not comfortable at all. The green foam padding is leaking out and the stitching is very shabby. Needed chairs for my reception area and I am afraid they will not hold up or hold anyone heavier then 175 lbs. Had I known they were made in China I would have stayed clear.", 
    "Very poorly make, would not recommend", 
    "basic extra seating; very straight back -- not comfortable for sitting long periods", 
    "Really happy no complaints and stylish for my small kitchen table just the right size..", 
    "The scale of the chair is small; perfect for a small table. It gives back support. It would have gotten a higher grade except for the fact that we had to ask (pay) someone to assemble it for us, as it needed more tools than the Allen wrench that was enclosed.", 
    "For the price, they are fabulous. I had a waiting room in need of chairs and these got great reviews from the customers.", 
    "Very Nice! The color is wonderful and they are comfortable. And I must say very easy to put together, my 12 year old put them together! All in all very happy with my purchase.", 
    "The manufacture of these chairs is poor quality. Assembly is an exercise in patience and there is no room for adjustment. Chair seat is not pre drilled. Legs do not adjust so expect wobble. There is a metal bar across the mid section of the chair back that is uncomfortable over time. The chair seat pad is adequate. I wanted these to work but given the cost, I should have known better.", 
    "The only problem encountered was when trying to put these together. Some of the pieces to a couple of the chairs were warped and difficult to put together. If I had not had a husband who was handy with power tools, I would have had to sent them back. However, he saved the day, and all is well.", 
    "Easy to construct, comfortable, and cheap extra seating for any event.", 
    "It seems that whaterver I order from Overstock it is exactly what I want; no negative surprises. This order again fits that comment. The chairs are sturdy and stylish. To my biggest surprise I thought I ordered a total of 2; one in each box but ended up with 4! My purchase was even a better deal than the one I thought I was getting.", 
    "Just exactly what I need for my kitchen", 
    "These chairs are definitely worth the price. They're very sturdy and cute.", 
    "The quality was not great and the holes were drilled wrong.", 
    "Good quality! Nice fox later!!!!very nice colore", 
    "Great quality and size for your money!", 
    "I can just describe those chairs in one word...!! EXCELLENT we did a good choice", 
    "The chairs are very nice and strong. I love them very much.", 
    "these were bought for my kitchen and not only are the functional, they are comfy and easy to clean!!", 
    "The chairs are great worth the money", 
    "Enjoying the chairs. The red color looks great with my white kitchen table.", 
    "Great price they don't look cheap like I thought they would. they actually look good. the top part is velcro, but you can't tell it's not like the velcro is showing. What I didn't like is it says white , like pure white but it'ws actually a cream or off white, still beautiful though. Also they are a little hard to screw together , the last part of putting them together mine are not fully screwed my husband said he will need me to sit on it while he screws it. but I love them it looks real modern in my dinning room now.", 
    "Could not assemble one of the chairs seat bars was welded incorrectly. Also, missing screws.Being returned.", 
    "I ordered these as I just moved to an apt and the chairs I had were not going to fit. I didnt want all metal chairs. These are padded and at a great the price - I got them for $*** for all 4 with shipping. The cool thing is if I feel like changing the look I can make a cover!", 
    "Decent chairs. They look great but I feel they are a little flimsy for a weight for a big man. But over all I do like them a lot.", 
    "The chairs appear nice but I was disappointed when I found the covering on the back of the chair was being held by velcro. Will see if the chairs look nice 6 months from now...........", 
    "The chairs are very nice for the price. The color is bright and the material feels great. My only issue I had is there are no pre-drilled holes in the seat. You will need a power drill or very strong arms."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Darcy-Espresso-Metal-Upholstered-Dining-Chair-Set-of-2/10390600/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10390600/TRIBECCA-HOME-Darcy-Espresso-Metal-Upholstered-Dining-Chair-Set-of-2-401010c4-8788-40a1-9f94-838e1e07e983_600.jpg"
  ], 
  "description": "Update your contemporary space with these modern dining chairs. Create striking contrast by choosing red or white vinyl, or opt for a neutral chair to complement your classic table. The clean lines and black metal legs make these chairs a streamlined addition to your dining room. Dine in comfort on the polyurethane foam-filled seats of these dining chairs. The metal framework and legs are sturdy, and the vinyl upholstery is durable and easy to clean. This set offers high chair backs for comfort and a medium seat height that is suitable for both children and adults.Features a sturdy metal frame with espresso, brown, red, grey or white vinyl upholstery that is easy to cleanSeat is filled with 20D polyurethane foam for comfortSet includes two chairsChair backs measure 19.7\"\"Seats measure 18\"\"L x 15\"\"WChairs measure 36\"\"H x 17.5\"\"W x 21.5\"\"D overallStyleContemporary, Modern, UrbanMaterialMetalFinishEspresso Finish, Grey Finish, Red Finish, White FinishChair TypeAccent Chairs, Desk Chairs, Dining Chairs, Sets, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrown, Grey, Red, WhiteFurniture PatternSolid"
}