{
  "name": "INSPIRE_Q_Grace_Cream_Linen_Arched_Bridge_Top_Platform_Bed", 
  "price": "EUR 565.29", 
  "reviews": [
    "Beautiful headboard, good quality. The only issue I have is with the slats in the platform part of the bed. It's a bit difficult to put together.", 
    "Purchased this platform bed for my adult daughter's studio in NYC. It's beautiful but the assembly was time consuming and a little difficult for my husband, longer than we anticipated for sure. Well made and sturdy. No issues with shipping or condition of the bed when received. Overall it's beautiful but a little darker cream than we thought but works. Would recommend.", 
    "This is a really pretty bed, true to color. My mattress is about 9.5 in and I did not need a boxspring since it came with the wooden slats. Please note that the wooden slats are thin, each wood slat is about 1 cm thick... was kinda skeptical about it at first but I haven't had any issues so far and it's been a couple of weeks. My sister bought a similar bed from a different merchant that had the same type of slats and she's had her bed for over a year with no issues.I bought the full size platform bed, my mattress is also a full size but looks a bit small on this bed. There's an inch on opposite ends that show the wooden slats below, I don't think it's that big of a deal since a comforter can easily hide that and it's not that noticeable. Delivery was pretty fast, it arrived as estimated. There were 3 boxes total, 2 of the boxes arrived first then the 3rd one came the day after. Assembling the bed took about 30 mins to an hour, I put together most of the bed myself and had someone help at the end when attaching the headboard or making sure the metal pieces were straight (for the slats). I really love the look of this bed its so nice and neutral. I only gave it 4 star because I'm still a bit skeptical about the slats, going to see how long it holds up.", 
    "The linen is beautiful. But, definitely need to buy a low profile box spring. also missing screws. the slats are super cheap but so far so good. I'm afraid if 2 people are on the bed the slats may break"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Grace-Cream-Linen-Arched-Bridge-Top-Platform-Bed/9598431/product.html?recset=ff020176-31d1-4b0b-abf5-5f6504481c28&refccid=QLOTCR77AQMJGMKEIK5W6CXZS4&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9598431/INSPIRE-Q-Grace-Cream-Linen-Arched-Bridge-Top-Platform-Bed-d1dcec15-abd4-4d5d-9f5d-2bd97567983d_600.jpg"
  ], 
  "description": "Bring classic luxury and glamour into your contemporary bedroom with this stunning upholstered platform bed from Inspire Q. The tufted linen headboard is padded for comfort, so you can sit up in bed with a book or your favorite TV shows. The included wooden slat system provides ample support to save you the hassle and expense of a box spring mattress.   This platform bed is designed for use with a mattress, so no box spring is required. The blend of the headboard's curved lines with tufted, cream-colored linen upholstery gives this bed a timeless, classic look. The bed's neutral tones blend easily with most furniture and accessories, making it an ideal choice for a master bedroom.   Set includes: One (1) headboard, one (1) footboard, one (1) set of rails and one (1) complete set of euro slatsMaterials: Poplar woodUpholstery materials: LinenUpholstery color: CreamUpholstery fill: Polyurethane foamHeadboard height: 52.75 inches highFootboard height: 13 inches highHeight from the floor to the slats: 11 inchesLeg height: 4 inches highFull size mattress aperture dimensions: 55 inches wide x 76 inches longQueen mattress aperture dimensions: 61 inches wide x 82 inches longOverall full bed dimensions: 52.75 inches high x 59 inches wide x 83 inches longOverall queen bed dimensions: 52.75 inches high x 65 inches wide x 89 inches longPlatform bed designed for use with mattress; no foundation requiredMaterialLinen, WoodFinishBlack Finish, Wood FinishBed StylePlatform BedAssemblyAssembly RequiredColorOff-WhiteFurniture PatternSolidProduct FeaturesIncludes Hardware"
}