{
  "name": "INSPIRE_Q_Mendoza_Keyhole_Back_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 177.05", 
  "reviews": [
    "I had previously purchased four of these chairs for my dining room. I love them so much that I bought two more. They have a designer look and enhance the design of my thorougly modern dining room. Besides being very attractive, they are extremely comfortable. The chairs were very reasonably priced, and the fact that I did not have to pay any tax and only $2.99 to have them shipped was an added savings. All in all.....a very good deal. Thanks OVERSTOCK.", 
    "I am very pleased with my recent purchase of the Mendoza White Keyhole dining chairs. I wanted to update the look of an existing dining room table, and these fit perfectly. I was pleasantly surprised by how quickly they arrived, and at how easy they were to assemble. I had them all assembled (4), by myself, in less than one hour. My husband is 6'6\" and was initially worried about the size, but he sits very comfortably in them. The material is great for easy cleanup and looks as though it should wear nicely. They have been a great addition to my new contemporary design, and I would highly recommend them to others!", 
    "These chairs are awesome---they are slightly off white, but it is very slight. Now mind you, I am picky about white. I like a crisp white. But, these chairs are so awesome in quality, style, and function I am not even bothered by the very slight off white color. Absolutely wonderful~~~~~~~and the price~~~AMAZING!", 
    "I bought 2 chairs and found them to be very comfortable so I ordered 6 more. As stated, the quality is ok for the price. There were some flaws in the finish on the legs of a few of the chairs, where the paint was rough and even flaked off on one chair. It was easy to repair the one chair and not worth the trouble to send it back. They are bi-cast leather so are a little more plasticy than good quality leather and some of the stitching is less than perfect, but again for the price I think they are a good value.", 
    "I bought four of these chairs to go with my existing glass dining room table. They are so modern and sleek, that my old glass table looks brand new again! The color is slightly off-white, which gives the chairs a very rich leather appearance. Not only are they sturdy, but they are also comfortable. Assembly was easy, and they arrived within a week. I highly recommend these chairs!!!", 
    "very nice fast shipping easy assembly.I would reccomend these chairs.They look like a million bucks.I was afaid after reading reveiws.. Those people who were not happy must be cracy these chair are beautiful .canot beat the shipping price .", 
    "While the chairs appear to be sturdy and relatively well-made, their packaging and shipment left MUCH to be desired. Setting aside the frustrating fact that it took 6 or 7 efforts by the contracted carrier (UPS) to get the delivery right, the chairs themselves arrived in flimsy, corrugated boxes that were partially shredded at the time of receipt and left the seating and legs exposed. Although, through some miracle, that did not lead to any tears, scratches or other nicks in the furniture, the incredibly poor packaging of the fasteners and washers let them \"escape\" from their inadequate plastic bagged-packaging. As they were treated in oil, they left both stains and dark marks all over the white \"leather\" seating/backing. In addition, they also left threading and ring imprints on the material. Finally, as they were no longer properly packaged, several fasteners/washers slipped out of the packaging. In summary: Buy With Caution!", 
    "I am incredibly impressed with how quickly my chairs arrived. I ordered two sets of the gray chairs on 9/30 and received two days later w/FREE shipping! At first, I read reviews from other members and was a bit skeptical to order, but took a chance based on the amount of positive feedback. I must say, these chairs are a fantastic deal. Easy to put together (15 min ea.), sturdy, comfortable, and amazing style! I paired these chairs with the Heritage Dining Table and Entertainment Center. You can't find these deals and style at a regular furniture store without spending enormous amount of time shooing the desperate salespeople away!", 
    "I recently moved into a new studio apartment and needed a fresh look so I bought these chairs to use with a versatile table sofa. They look fabulous from the \"outside,\" but as I was putting them together, I was disappointed to find that the faux leather is sloppily stapled to the poor quality wood base and the wooden supports were splintered. One chair was a breeze to screw together while the other was not. They are comfortable to sit on, but don't get much use, so I imagine they'll hold up for a little while. I'm not sure how they'd fare if they were used every day.", 
    "I must start by saying that this is a great deal for the price... however, don't expect the items to look like pictures at all! We got the shipment in two days (free shipping), which arrived promptly as indicated. The packaging was good. However, when we began assembling, we noticed the keyhole (opening in the back) was not square at all and there were fabrics sticking out and not properly stitched. It is a rather poor job and if you can live with looking at crooked holes everyday, then it will be fine. I wanted to return them right away, but decided for such reasonable price we paid, we can use them. Very, very poor tailoring job and you will feel that you get what you pay forI do not recommend this item or at least buyers beware.", 
    "Decent backup dining chairs but 3 years on the flimsy leg joints are a problem and the leather is beginning to crack. Good interim/backup solution for extra chairs but cheaply constructed (although once assembled they look OK).", 
    "This chair is very modern looking! Love the way it brightens up my dining room! Only problem I have with them is that some of the stitching is not exactly perfect, but only noticeable if you look close! For the price I paid, these chairs are great!", 
    "A full leather keyhole chair is around $$$. This is a great, low cost alternative, where you won't panic if the little hands get all over it. We decided to buy these instead of the real leather version, since we have lots of little ones running around. Once they are all gone, we may consider buying the full leather chairs.", 
    "These chairs are great! I get compliments every time I give someone a your of my house!", 
    "I love these chairs, I purchase 4 chairs for a glass table that I have had for some years. The chairs that I replaced were some white linen, that had become dull & not a great looking anymore, just old & soiled. This was a great choice I am glad of my purchase very comforable, & great looking.", 
    "These chairs are beautiful and classy. They give our dining room a very elegant look and feel. The design is beautiful and timeless, I don't feel these will go out of style in the next year or two. I would recommend these to anyone who is looking for an updated elegant look, but I do not think they would stay looking the way they look if you used them 2 or 3 times a day, day in and day out. They are good for the price compared to other chairs we looked at for way more money, but again, you get what you pay for. If you only use your dining room occasionally as we do they should last a long time.", 
    "Bought these chairs to complete a dining set for an old table that I stained dark. These look perfect and are adequate for my needs. The padding is very stiff and it feels like it is breaking down when you sit on them. This may improve in time. I live alone and need them mostly for show and they look fantastic. The color of the legs matched the table perfectly.", 
    "These chairs look fabulous with my dining table. I receive many compliments on them and everyone assumes I bought them at the local high end modern furniture store. They are always surprised when I tell them I got them on Overstock.", 
    "We were looking to modernize a dining room, and finding the colors that allow us to move the chairs throughout the house where they might be needed, and having them look so much more expensive than they were was great.", 
    "Great comfort and style. Recommend.", 
    "These chairs look great, but arrived in a box that smells overwhelmingly of mildew and chemical to cover it up. Like the chairs, but must send them back because the smell is unbearable and causes a headache after a few minutes. Bummer.", 
    "I was shocked to find these gorgeous, expensive looking chairs! They have added a rich ambience to my dining room and I am thrilled with them.My husband had them put together in no time and the look is amazing.I would like to submit a picture of the room but I don't see a place for it.", 
    "Everyone loves these. Great looking basic. Highly recommend", 
    "great product , it is a perfect addition to a modern dinning room !", 
    "I thought the chairs were great except the color was too white. I wish somehow we could order color samples before we commit. I returned them because of the color, but I would recommend them highly. I love that Overstock let me return them and gave me free shipping as well. It's a wonderful company to deal with.", 
    "I have the matching bar stools & was very happy to find that I could still get these! They are our favorite chairs - most comfortable & lovely!", 
    "Very stylish chairs, not boring. I bought them for my family room. Love the comfort. Easy to put together!", 
    "I purchased 4 of these Tribeca White Keyhole Back dining chairs. They are a faux leather and have stitching on the keyhold back. In some areas the stitching is not even. My major concern is found when putting the seat portion of the chair together with the back. Underneath the seat the amount of material overlap from the chair seat is miniscule! I am concerned that a very heavy guest may pull the material out of the staples. I had to borrow a heavy duty stapler to staple the chairs in additiional areas since the factory did not do that evenly. The idea of trying to repack and then return the chairs was unthinkable, so I am trying to resolve the problems myself. I was able to get 3 of the chairs together with the extra stapling so that they look ok from all angles. However, the 4th chair was put together in such a haphazard fashion that I have had to take out staples and pull the material to adjust it hoping the staples from the factory do not show and the black lining is not visible either! It has been a nightmare. Still trying to get this one chair to an acceptable condition.", 
    "Love these chairs. Have them in dark brown and white!", 
    "These chairs are very stylish and appear to be very sturdy. My husband is 6'2\" and at least 250lbs. and he found them comfortable and sturdy. Assembly was quick and easy. I assembled them without assistance. I have a three year old and two small dogs so I didn't want to invest a lot in leather chairs. I won't fret when my toddler attacks these chairs with her sticky, dirty and/or wet hands. I can just wipe them down with a damp cloth. Easy breezy maintenance.", 
    "Love the light weight of these chairs. Look great with my black wood table, which cost more than all 4 of these chairs. Everyone comments on them, and think they are leather.", 
    "Well packaged. Takes about 15-minutes to assemble. 1 person can do it. The construction is not top notch. Holes are jagged, lots of sharp staples, stapling of fabric is not even. Chair is more of an bright off white, and not a pure stark white. I was a bit disappointed that the color didn't match to photo. But they are comfortable, and definitely easy to clean which is what I was looking for since I have 2 young kids. It's only been 3 days since we put together and used, but so far so good...", 
    "These chairs are in our formal dining room with a glass table and looks like we purchased it all together. The chairs not only look wonderful, but are very comfortable. I considered this a wise decision to have purchased these chairs. :o)", 
    "Love the chairs, very stylish. nice white, sturdy and comfy.", 
    "These chairs are absolutly beautiful. I love them. They were exactly what I expected, except that they are actually more padded than they look in the picture, which is a definate plus. Not only are they beautiful to look at; but so comfortable to sit on. I have a picture of them in my phone and show it to everyone.", 
    "I was searching for these chairs at several furniture stores only to find them over priced and very poor quality. When I found them here, I was very happy and at an excellent price I may add. These chairs are definitely worth their price!", 
    "The dining chairs are beautiful, comfortable, and sturdy. The details are simple yet modern and will brighten any dining room. Note, the chairs are a very light cream and not true white, but still beautiful. I looked at similar chairs by other designers, and what I paid for a set of two chairs with Overstock is what is priced for one chair with competitors. A quality bargain!", 
    "I spent tons of time online to find out good quality chairs because I don't have time to go shopping out. I decided to trust the review comments about this chair set, and I choose it. The delivery was fast and in a good shape. Assembling took some effort and time, but finally we have very nice and great chair! We have two sets (4 chairs) for our new dining room, and we love it!", 
    "I was afraid these would be \"cheesy\". This was my 1st furniture purchase online. Easy assembly and very tight fit. I've had mine for a couple years now, and they look like the day I got them. The upholstery material cleans up beautifully and looks very nice. ..not cheap and shiny. Sure, they aren't leather, but I didn't want leather. From a distance they could pass for leather. Very comfortable and sits nice for tall and short people. I am just barely 5'4\" and my feet touch the ground. So nice having a cushioned back. If you are on the fence about these...don't be. The look and comfort are there for the right price.", 
    "I hate cheap looking furniture (and anything else for that matter) and was very hesitant to buy these chairs at first because I was worried the fake leather would be too shiny and won't look good. But I gave in and gave these a try. They are GREAT! They look very modern in my loft and are comfortable to sit in. I don't have any issues with the seams - everything nice and straight. It took my husband about an hour to assemble all four of the chairs we purchased. Hoping they will last!", 
    "the set is beautiful, it's of great quality and great price.", 
    "I really like the look of the chairs , but the quality is not as good. They are pretty comfortable. We had some trouble with 1 of the chairs not setting level , but we finally got it fixed by re drilling one hole. Overall I like the chairs.", 
    "Good stylish chairs for a starter dining set. Trendy and easy to clean if u have kids. They look great and the onpy thing s that they are not fnished like luxury furniture but that's all hidden underneath seat so u can't see. Happy with purchase!", 
    "I was very nervous while I was assembling these chairs.....waiting for something to go wrong or be missing. I was super pleased when all went together perfectly. I ordered six chairs, they arrived in three days and were put together by ME in less than two hours! I couldn't be more pleased!", 
    "These chairs are really attractive and very, very comfortable. I eventually ordered six of them for the dining table, then went ahead and ordered two of the counter-height for the breakfast bar. They are strong (even a 300+ pound man was comfy sitting through a lengthy dinner), yet because of the the keyhole and the light color, they don't take up a lot of visual space. They are substantial yet light. Do they look like very expensive chairs? Not if you inspect them closely, but most people see the design more than the minutae of the details -- and everyone has expressed gratitude for their extreme comfort. And I am personally grateful for how easy they are to clean. A gently damp cloth, and spills vanish! I'm quite pleased...", 
    "We love the look and feel of these chairs. The are made of a white bonded leather that is easy to keep clean. The chairs are comfortable. The modern design looks fabulous in our formal dining room. They were easy to assemble and of decent quality - as good or better than you would expect for the price paid. It's so nice to be able to get good products that look amazing at an affordable price and have them delivered right to your door!", 
    "I actually have had these chairs for awhile now and I love them. They have held up well. They look great and the faux leather is supple and soft.", 
    "These chairs are very nice, contemporary and prepare to get lots of compliments.", 
    "LOVE the look of these, very elegant touch to our new home!", 
    "these chairs look great with my dining set and bar stools", 
    "I have been searching for chairs for my new table and these were just perfect. I stepped out of the box because I am somewhat traditional but these contemporary chairs fit in to my decor seamlessly. They were fairly easy to put together. Follow the directions and tighten all the bolts after all of them have been installed. My only down side it that they sold out. I purchased 4 chairs and was so pleased with them I wanted 2 more. I searched many websites and finally found 2 more although the legs of the chair are of a different finish. Overstock has the best prices and unfortunately I had to pay an extra $50 at the other website and also had to pay shipping. If these chairs come back in stock again I would highly recommend them!!", 
    "I searched everywhere for these types of chairs with the keyhole in the back and found them on overstock at a reasonable price. I ordered 6 chairs and they are excellent quality, have a great modern look, and are super comfy. (Most dining room chairs I sat in at stores were so rigid and not something you would want to sit in for any length of time.) I get lots of complements on them and friends think I paid a lot more than I did. I love overstock... :)", 
    "We got the chairs because we did a remodle on the kitchen and were keeping the dinning room table. These chairs are a good fit and seem well made easy to assemble. The chairs are not leather but look and feel like leather very nice addtion to are dinning room !", 
    "I waited until the last minute to buy new chairs for my dining room. I needed these chairs in time for christmas. I ordered on Tuesday 12/20 and they arrived on Friday 12/23, exactly how they were depicted on the site. I had no room for errors as I had an empty dining room and guests arriving for the holiday. Love Overstock!", 
    "We love these chairs. We saw something similar on another site for $175 per chair. With a coupon, these ended up costing $$$ each including shipping, and they arrived in 3 days! Yes, the legs on a couple chairs were slightly uneven, but it's not that bad when you actually sit in them, and this can be easily adjusted with magic sliders or the like. We've already had a couple dinner parties and everyone loves the way they look and were surprised at how comfortable they were after sitting for several hours. Highly recommended!", 
    "I first ordered 2 of these chairs to complement my round black dining table and was so happy with the look that I purchased 2 more. The more you sit and use the chairs, the more it softens. I love how easy to wipe spills off the chairs!", 
    "These chairs are a beautiful design and I appreciate them very much because I searched long and hard to find the perfect chairs. Assembly was fairly simple and the construction is what is to be expected for a reasonably priced chair made in China. However, I am deeply disappointed with the fact that my chairs came out of the box with fingerprint marks on the fabric and also BLUE colored pencil marks... Now there is NO WAY I am going through the hassle of sending these back. I had to set them up the day they arrived, as it was a holiday and I was entertaining company, so there is no chance that I am going to break them back down and ship them back. SO, now I have to fight to get the stains out. BUMMER!", 
    "Works great with our new dining table. Seems to be well constructed and comfortable enough.", 
    "My husband assembled them while I was away so that part was a breeze! Very nicely styled chairs, look great around the table and very comforable.", 
    "These chairs were easy to assemble and transformed our modern dining room. They are very comfortable and look more expensive than they were", 
    "Great price. Look very nice in our condo. All 4 legs on all 4 chairs did not sit flat on floor. Had to add felt pads to stabilize from being wobbly.", 
    "Like the style. It would be 5 stars but the Color iffy... Gray fabric has a brown undertone I did not expect. Fabric has a wrinkle and after about 2 weeks the smell is still strong and unpleasant. Kind of musty. Not top quality but for price adequate.", 
    "These are not bad. However, they are not sturdy enough to inspire confidence with some visitors and there were some bolt holes that had not even been drilled so I would say quality control is certainly lacking with these.", 
    "I bought these chairs for my daughter and she loves them! They look fabulous!", 
    "I was very pleased with these chairs,pretty easy to assemble if you do not skip the page as i did some how to leveling them.Once i went back and followed the directions was a breeze very comfortable chairs.I also bought the table Greyson living monoco 48-inch round table top which really made a striking appearance as a set.....Love it.....", 
    "I don't expect them to last forever, but decent quality", 
    "I would give the chairs themselves a 3 star but some factors had me rethinking. The fabric is nice and true to color but the foam cushion feels cheap, nothing underneath. When they shipped it, one of my chair leg was cracked due to poor packaging but they did send a replacement. Another thing was the legs were wobbly on one of the chairs after construction.", 
    "I'm not going to complain given the price but if wobbly legs are important to you then these chairs may not be right for you.", 
    "these sit well and are great looking....", 
    "Look great, comfortable, sturdy", 
    "These chairs look very modern and contemporary. However they don't last long. Bought 4 of these chairs 3yrs back (only faux leather was available then) . After 1 yr of usage the faux leather on one of the chair started peeling off at the base where the material folds when someone sits on it. Assuming it was defective part I ordered another set. After 3 yrs of usage material on all chairs started peeling off. Got to look for slip covers now. May be that's why linen clothing option is available now", 
    "The chairs when completely constructed look fine. The sewing around the key hole did not have the same quality of the upholstered bench I purchased. Two chairs wobbled some when put together, one leg being a tad shorter than the others. I took apart twice to redo, but the manufacturer put the holes for the screws in, and that is where they stay. I ended up putting a chair leg cushion under the legs, worked out ok.", 
    "Chairs are easy to assemble and look nice. Only complaint is that the finishing of the fabric inside the square holes is not very nicely done. But for the price, a good value. I even ordered more :)", 
    "Easy to assemble. Very elegant for Main dining room table. Love it.", 
    "These chairs look great and we're very simple to put together. Very detailed instructions with pictures made it so easy that I put them together in less than 30 minutes. Just love the chairs.", 
    "The chairs are beautiful! It gave my dining room a complete new look! I purchased 8 chairs all in beige. I was nervous the color would not match my table, but these are totally versatile. I would definitely recommend these chairs! Assembly was easy. I've enjoyed seating on these while dining!", 
    "I purchased these for around my dining table. They are comfortable, easy to wipe clean, and look great.", 
    "I ordered these chairs to go with a very modern stainless steel dining table. We were a bit hesitant about not seeing them first, but for the price we felt fairly safe they'd be okay for somewhere. We were thrilled when they arrived. We mixed colors for a funky set of six, and I can tell you, they are comfortable, sturdy, easy to put together, and look amazing. Plus, we find that the keyhole back design matches a lot of other dining room furniture we've been considering. We looked at metal chairs but the weight capacity was too low for the average man with a couple kids climbing on his lap. These chairs have excellent capacity and the funky, eclectic modern look we were seeking.", 
    "These arrived and were easy to assemble. One chair had some grease spots on it and a tear in the fabric as well as a missing washer. Overstock quickly sent me a replacement parts order. I am very happy with them and the look wonderful with our table! Would recommend.", 
    "I ordered these chair's on a Wednesday @ 3:30 and they were delivered the next day !!! The next day ! I know right !?!? They are easy to put together and look Fabulous !!! So very pleased and a huge shout out to UPS for delivering them to my 2 floor apartment.......Thank you Overstock", 
    "Easy to assemble, stylish, and comfortable. No complaints.", 
    "The chairs looked great but they smelled so musty and moldy I had to return them. Not just a little musty, it was so overwhelming when you walked in to out home. I even exchanged them for a new set and the replacements smelled just as bad. Too bad, I really liked the chairs.", 
    "These chairs looks great in the newly renovated dining room space (transitional decor). They are comfortable and so far have been easy to care for even though they are white.", 
    "Great chairs for my office. Wide and comfortable.", 
    "These chairs are everything I had hoped for. Very sturdy and beautiful.", 
    "Loved the look of these chairs, quality is pretty good but I cannot get the chairs level. Have tried various methods and they still wobble. Once you sit in them you don't notice the wobble.", 
    "The chairs are very fragile. I ordered four and two out of the four the legs were crooked. You get what you pay for. This is the risk of purchasing furniture online.", 
    "loved the color -easy to put together and easy to clean..linen..", 
    "Very comfortable and made my dinning table look elegant. :)", 
    "Too hard to put together. I like the way they look but I feel like that will fall apart soon. One of them broke immediately and was not able to get it together. So now I have three chairs instead of four.", 
    "I needed 10 chairs for our new dining room table. These look great and are very comfortable.", 
    "These chairs were the PERFECT choice to A company our large custom made dining table in a Mid-century modern setting. We purchased six in grey. Not as heavy as I might have liked, but adequate for occasional use on special occasions. Fabric is nice.", 
    "Sturdy and look classy in our breakfast area. Chairs are combined with a glass table with wood base matching our hard wood floors. Excellent choice of chairs. One screw stripped but still a good choice", 
    "Love the chairs! Wish they came as mix and match, not 2 of the same color.", 
    "I got the light gray chairs and love them. I purchased 8 and they all came with no problems. Easy to put together. I searched a long time for the right style and color with black legs. These were a great purchase for a very nice price.", 
    "I love my purchase, easy to assemble.", 
    "I purchased 4 chairs for my daughter's first apartment. The grey linen was her choice and the look is very classy. The seat is stiff, but she doesn't seem to mind. I would have given 5 stars, but the stitching is loose in several places - but these were not meant to be forever chairs. Overall, I am very happy with this purchase.", 
    "Got 3 of these sets for the dining room. Super easy to put together and look very nice.", 
    "I am so impressed. They are exactly what I wanted. The only thing is they have a weird smell I'm sure once they air out and get a little fabreeze they will be fine. They are well made and the color is perfect. Highly recommended", 
    "The chairs are comfortable and made of good quality material.", 
    "Cute chairs Easy to assemble Great value Hard to get chairs level so a lil wobbly", 
    "Ive had these for over 2 years now and have held up with 4 rough boys", 
    "these chairs tip over easily because they are very light weight. I have small children so I didn't want anything that i'd be upset about if it were to get ruined. These clean up nice and easy. When they're time is up I won't be upset about it because they were cheap and did the job!", 
    "These chairs really dress up a dining room. They are very slick and sophisticated, yet have a casual and relaxed air. I have six of them.I would have given them five stars except for the fact that I had to return one set of two because the bolt holes were misaligned preventing assembly. Overstock quickly shipped me replacements; well done Overstock!", 
    "Nice looking chairs at a dream price. Easy to assemble.", 
    "Great price and super stylish!", 
    "Easy to assemble. Good quality and price. Recommend Scotch guard fabric treatment before using.", 
    "We LOVE these chairs. They added sophistication to the dining room and are extremely comfortable as well. Easy to attach the legs, good quality. Fabric is lovely. I purchased the light grey and used Scotchgard to protect them. Guests always comment on them.", 
    "I received these chairs and put them together. They were very easy. The instructions were clear. I gave these chairs a 4 because the undeside is very rough and I got a spliter. It would be nice if a little sanding was done since you must be on the underside to put together. Otherwise I LOVE the purple.", 
    "These chairs work perfectly with my new farm table. I choose the light grey and have received several compliments on them.", 
    "lovely chairs but too dark for me, the picture showing them lighter", 
    "Cushioni and sturdy. One chair one to the holes was in the wrong position.", 
    "I wish I could have given this product a higher rating but it was terrible quality, not in just one of the chairs but all four that I had ordered. The grey was gorgeous, perfect for my dinning room, but metal threads for the legs were missing in one of the chairs and the chair legs were uneven. If you are more handy, maybe you'll have better luck but not worth the trouble for me.", 
    "The chairs are bigger and more comfortable than expected, which were a plus. It was absolutely a pain to put the chairs together as the holes simply do not align together. The manufacture was nice enough to provide one page of problem solving information to resolve the chairs' wobbly issue - it took extra longer but at least the chairs are stable now. The quality is okay; you get what you paid for. The look is definitely modern and fits well with the table I purchased. Interested in how the chairs will hold up.", 
    "The chairs look beautiful in my dinning room!! I love them. They were real easy to assemble.", 
    "I ordered the gray chairs and the color is truly gray. I think they are a good value for what I paid. I am more picky than some But I felt the stitching on the inside of the keyhole opening could have been better.", 
    "These chairs are beautiful. Easy to assemble. Very happy with my purchase.", 
    "These chairs were the perfect touch to my square dining table. Easy to assemble, as well.", 
    "We've had these for about 2 years now and they are holding up great. We got the white (and we have a toddler) and they are not stained and wipe clean easily. Also pretty comfy.", 
    "They look high end but of course, they are not. I paired them with a glass top circled shaped table. One seat was shipped damaged and overstock sent for it and replaced. One year later, and I still love them.", 
    "These are decent chairs for the price. I purchased the dark gray, but for some reason they looked almost navy blue to me. My relatives think they look dark gray, but who knows. I plan to purchase the regular gray as well as accent chairs for the ends of my dining table. Hopefully, they will look \"just gray.\"", 
    "Great chairs - nice looking, easy to put together - can't beat them for the price!", 
    "Quality looks expensive, and they are easy to care for.", 
    "Easy to assemble, great looking and comfortable", 
    "These make a great fit to the glass kitchen table I just purchased. These provide a sleek modern look.", 
    "This was my first time purchasing from Overstock and I am very satisfied with my purchase. They don't make anything like they used to anymore... but the quality of these chairs are good. They only took about 10-15 minutes each to put together, no problems. They look very nice in my home office.", 
    "The material started peeling after only 6 month. I wouldn't recommend this chair.", 
    "One of my chairs is totally wobbly. One leg is short by about a full inch.", 
    "I loved this style. Very modern", 
    "I ordered the dark gray linen. Very nice! A little tricky getting the legs level on assembly.", 
    "I have never bought chairs online and I was real skeptical to buy them especially when you want to feel and check the comfort before buying. Well after reading multiple reviews and research, I decided to buy 2 sets (4) in faux white leather. Well, I was pleasantly surprise with the look, feel and comfort especially for the price. The ease to put together was great and the shipping was unbelievable. I ordered them Sunday, 11 pm and I received them on Tuesday. I would definitely recommend. Love them..", 
    "We got white faux leather and it looked cheap. Other colors didn't look as bad. We returned them because they were cut up. It was as if someone cut them before hand with a box cutter.", 
    "I am thrilled with my new chairs!", 
    "Finishings very sloppy especially around square hole. I doubt I can fix itand debating whether to keep them or return them.", 
    "These are very handsome chairs with a traditional but still modern look and style. Easy to put together and the small wrench comes with it, you don't need any other tools. Nice price for 2 chairs.", 
    "It took me hours of searching on several sights and I kept coming back to these chairs, so I finally ordered them and glad I did. They are very well made and look much more expensive than the price I paid.", 
    "When I read the specs on these I thought the legs would look like a dark wood. Having said that I am delighted with they way they look overall. They are very easy to assemble but lubricate the bolts before you start, they are hard to turn. I used soap, just drag them across a bar of soap and screw them into and back out of the holes before beginning to assemble makes them easier.. Also beware of the styrofoam blocks,they are hard to get out without crumbling into tiny little peaces, you could be chasing them around your house forever.", 
    "I ordered 2 dark grey and 4 light gray but received 6 light gray. I kept all six because I was too lazy to call and have it taken care of. Whenever I have called overstock has been very accommodating. The chairs were easy to put together and decently comfortable.", 
    "I love the price it was cheap to bay from overstock very good quality material I love it", 
    "They are great. They fit the room perfectly", 
    "These chairs are study, nice and white and comfortable.", 
    "These chairs were bought for an extra bedroom as a pair of chairs for the computer desk so we could both sit at the desk when we wanted to. They turned out beautiful. Slightly on the hard side I bet they will relax with age. The keyhole is a cute accent and the chair feels comfortable to sit in and relax at the computer so I'm sure it will be perfect for the dining room. I might have to get more for another room! These chairs are the perfect compliment to any room that wants comfort mixed with a pleasing visual. I highly recommend them to anyone wanting cute and comfortable chairs for whatever reason that might be.", 
    "These Chairs are exactly what I was looking for..very rich, comfortable..adds elegance to the room that I just updated!!", 
    "These chairs are attractive, comfortable and put together easily. Only downside is they smell like chemicals for awhile after I received them but it dissipates. For the money, they are a great value.", 
    "The linen fabric looks expensive and the quality of the chair is great.", 
    "Love these chairs. Very sturdy and comfortable. I'm a small woman and put 4 chairs together in 3 hrs. It would have been faster but 1 chair's predrilled holes for attaching the seat were off and I had to work a while longer on it. They were a slightly darker beige than pictured but it still worked well for me.", 
    "I ordered 8 of these and was very pleased. They are beautiful and I receive so many compliments about them!", 
    "Looks amazing. Good quality", 
    "was easy to assemble them. I bough 3 pairs and they were all in perfect condition. Looking good. very confortable", 
    "I ordered 4 of the gray fabric chairs and my expectations were definitely met. The price and quality of the chairs are perfect. I would definitely recommend.", 
    "I love these! Very study and solid and comfy! :) I love the light grey color as well...", 
    "Simply horrible and cheaply made, one them never assembled correctly since the beginning...it has become even more loose now and it basically about to break. I cannot have anyone even sit on them as they will just weaken. It is better to spend more money and get better quality.", 
    "Assembly instruction is detailed and helpful. Comfortable to sit. I'm buying more.", 
    "These chairs are fairly easy to assemble, sturdy, and very stylish. I paired them with an ultra cool breakfast table and am very pleased.", 
    "These chairs look great with our dark dining table. They attract the eye right away, and give an urban feel to our place. Everyone comments on how great they look. They are comfortable enough to cause guests to linger after a meal. We got the white leather, but I had a hard time deciding between the three colors - they all look great. The leather won because we frequently have small grandchildren at our table, and they (the chairs) are easy to keep clean.", 
    "Love the chairs, getting two more!", 
    "I think the chairs are really great but one of the legs didn't have the holes properly drilled. My husband drilled screwed into and had to the turn the leg. It still works but am disappointed, I guess I have to call for a new leg to be sent out. I bought the dark grey and its very dark, almost black I kind of wish I got the light. The fabric quality is good and overall is a good price for the chairs.", 
    "Very cool looking and high quality looking chairs. My only complaint was one slightly wobbles and we can't seem to fix it but its probably some mistake we made..they do send a \"problem solving\" brochure with it.", 
    "I put the chair together and the first thing the wood split and cracked.", 
    "Exactly what we wanted. Fits great with our glass topped dining table. Boxes came damaged but inside packaging kept pieces undamaged. Assembly easy. Very comfortable.", 
    "We bought these chairs as accent chairs for a guest room in our B and B. They were easy to assemble and are sturdy and cute. The only issue is that they have a strange musty odor!", 
    "Absolutely love these chairs there may very well made and have a sophisticated look. I love the fabric and how modern they are. Assembly was very easy.", 
    "Fabulous chairs. Easy to put together and well made for the $. Thinking of buying 2 more. Looks great with my glass dining table.", 
    "Nice chairs but made very cheaply. Guess you get what you pay for. The price point was good, but I would not buy this type of furniture online again. They also have an odor to them that makes us think they have been sitting in a warehouse for some time.", 
    "They are beautiful. Assembly is not that difficult, maybe 30 min per chair. My only issue is that they are not that solid. The chair is light and foams are firm and not to hard. I with they are a little bit heavier and more solid.", 
    "The looks is alright, pretty much like what is shown on the photo, however, the bottom wood is terrible. I just got the chairs yesterday but I know already these chairs wont last long Compare to other online furniture stores that I have been shopping, Overstock doesnt pay that much attention at protecting the packaging even though the shipment was fast. And the manual is HORRIBLE, who still use picture manual.. I had a hard time reading their manual and that was never the case when it comes to reading manuals. Plus there are errors on the manual anyways. I will not recommend this product at all, I do regret it, I would much rather pay a little more and get something with better quality.", 
    "Ordered grey linen. These chairs look great. Had to work on adjusting the legs on some of them to make sure they were leveled but in the end it worked. Good Buy for the price.", 
    "These are cute chairs, I had big issues with some parts missing but overstock.com took care of it promptly. Theres chairs are perfect for my modern kitchen.", 
    "The chairs are beautiful but they are not finished right. You can see the staples around the \"key hole\" and some of the material is loose. I kept them anyway.I used some hot glue to fix the problem.I used one for my office and one for the guest room and they look good.", 
    "Just what I wanted at a price that was great1", 
    "love my chairs my son put them together easily. I definitely needed them will order 2 more", 
    "I ordered the Dark Grey and they are beautiful....they are definitely DARKER than the photo - almost black but will go fine with my decor", 
    "Very happy with this purchase. You get what you pay for but I do think this is well worth the price. Easy to put together.", 
    "I absolutely love these chairs! They are very comfortable and look very chic. They seem very sturdy and weren't a headache to put them together", 
    "Love these chairs. There are a few things in the vinyl I would have liked to be better put together. I would buy them again if I needed more.", 
    "Nice linen chair. Easy to assemble. Pretty sturdy. Good chair.", 
    "Beautiful chairs and Assembly was very easy. One chair came with 1 broken peg, which is why I am giving 4 stars instead of 5.", 
    "Chairs are as pictured, the color is exactly what I expected and I love them. They changed my traditional looking dining table to a modern/contemporary look. LOVE IT. You will not be disappointed if you purchase these chairs!!", 
    "Great chairs with a modern look! I have a mix of the gray and white ones in my dining room. Perfect height for the dining room table.", 
    "I like the look a lot but when you sit you can feel the frame around and under the seat cushion.", 
    "Love the chairs. The color light gray I selected was a good choice and their were very sturdy. Nice addition for my glass dining room table.", 
    "Easy to put together and looks fantastic in my room!", 
    "I purchased 6 of the white leatherette variety. They arrived promptly but one of the boxes was a bit damaged. However the chairs inside were fine because they were well packaged. Likely the delivery companies fault. Assembly was rather easy and they are quite sturdy. Very comfortable seating with adequate cushioning. Of course, there are dining chairs out there of which one would cost more than this set of six but these are a terrific value at a great price. Only problem is the leatherette has a slight smell that I hope will fade with time. Very pleased.", 
    "I was looking for a gray chair with a modern contemporary look and this fit the bill perfectly. Did not cost a lost but looked like an expensive one!", 
    "I was very pleased with the look and quality of these chairs for the price. I got the dark gray material. They arrived quickly, were well packaged, and were very easy to assemble. Absolutely love them.", 
    "Easy installation. Very comfortable with nice thick cushions. Looks very nice.", 
    "the chairs are greatthey arrived in a quick fashion and what easy to put together I love the dark gray color and a very stable a great price would buy from Overstock again", 
    "Lot nicer than I thought for the money. Looks great in dinning room", 
    "Loved the choices on colors we went with a set of each. Love the material and style of these chairs, the price is just right for the quality compared to same style in other stores. We have kids so we sprayed with a stain protector we will see how they hold up.", 
    "Chairs look decent, although the quality of the chair is only ok. Some of the wood was frayed when it arrived - nothing cosmetic to the chair, only where the joints came together. It is easy to assemble, and the seat is very comfortable. True to color.", 
    "Sold house and new owners requested I leave dining set.", 
    "I love white furniture, however white leather frightens me. Cringe if anyone with dark jeans comes within 2 steps let alone sit on it. These gave me the look without the maintenance, fuss or worry. No they do not look like leather, however, if you don't announce it to the world, no one is really going to notice.", 
    "Very happy with these chairs for the price. I ordered the bright white chairs. Some of the stitching isn't perfect which is why I rated it as good instead of excellent.", 
    "Love these chairs.... look great with my glass top table. Ordering more for work...", 
    "Very pretty, but not a lot of weight to them, so if you sit in them any other way then properly, they tip back. So not the safest for active children. The white ones will stain with ketchup/mustard liquids. I bought 2 first to test, then 4 more. The first two were creamier than the others, so order all at the same time. It wasn't too far off, but enough that if they were side by side it was noticeable, so I put the creamier ones on the ends. But they are comfy and not bad for the price, but you can tell they are not \"high end\". So they will not meet quality standards of those found in furniture stores", 
    "Buy them you will love them", 
    "Needed 12 chairs so these are a great value.", 
    "I purchased four of these chairs for my new dining table. They are beautiful, modern and very comfortable. Extremely easy for a novice to put together. The material can be wiped clean and the cushioning is super comfortable. We love everything about these chairs especially the price. And yes, we have also received compliments from our guests.", 
    "Quality is very good and better than expected. Assembly is easy and instructions are simple and clear. If you are looking for modern, this is it", 
    "LOVE these chairs! They look modern and are comfy", 
    "I ordered 4 of these chairs in the dark grey linen, they came quickly and looked pretty close to the picture. They look nice and seem like they will be pretty sturdy, although I have not really used them yet since I am waiting til I move into my new house to actually set them all up. I had a coupon so these were a great deal for what you're getting, a lot cheaper than what you would pay for other dining chairs in the store. Overall, good purchase, can't wait to use them and see how they hold up over time!", 
    "These chairs are absolutely beautiful; easy assembly; easy clean up and nice on the eyes. Very metropolitan and adds charm to any dining area. I purchased a second set for my summer home, I love them so much.", 
    "I use these for my home staging business. I got both the white leather and the gray fabric and love them both.", 
    "Satisfied, this chair is stylish and sturdy and a great deal for the price. They arrived as expected and required light assembly with a provided tool.", 
    "Really bad fabric/ fair stitching. I bought 10 dark grey linen chairs Bc the picture was so pretty and the reviews were so good. I've been so happy with everything I've gotten from Overstock that I bought all at once- what a mistake!I think the good reviews are for the white leather instead:(", 
    "Very satisfied with these chairs. I got gray. I only wish the legs were a lighter brown wood color. They were very easy to put together. I have not had a chance to use regularly but I hope they last a few years.", 
    "Love the fabric and color. Shopped around at retailers and found nothing like these.", 
    "Love the fabric and color. Shopped around at retailers and found nothing like these.", 
    "I recently purchased 8 of these chairs. The first one took me a little while to assemble, but after that I was able to assemble the others in 15 min each. They are very easy to put together. Two of the chairs had issues with the screw holes being filled with glue or not matching up. Overstock was very quick to replace and send out new ones! The look of these chairs are very nice, however I can't speak much about the quality as I have not used them yet and I don't know how the hold up to use over years to come. The underneath of the chairs don't look very nice however I don't mind because no body sees the underside . Overall I am very pleased with this product and you can't beat the price", 
    "Have the bar stools and love them! New home, so the dining table had to be new. When we finally found the table we knew exactly which chairs we wanted. These are well made, comfortable and easy to clean. Would definitely buy again! Price is unbeatable too.", 
    "These are very good looking chairs. The only reason I don't give this a 5 star rating is because the finish around the keyholes is a bit shoddy. I can actually see black staplers against the white leather in some places if I look closely. The seats are a bit stiff, but I think with usage they'll soften some. That said, it looks so expensive and gorgeous that I can easily overlook the negatives. I bought 6 of these and they look great with my dark table. The color is a bright white. Not cream, not Ivory, not an off white.It was quite easy to put together as well. Great value for the money.", 
    "We ordered the dark grey, looks a bit like denim from far but great piece, love the dark color", 
    "I love these chairs, the material and comfort is great for the price. I will be ordering more for my formal dining room.", 
    "This was my first time ordering from Overstock.com and will order again from Overstock in a heart beat. The chairs are lovely; exactly what I envisioned, quality excellent and their customer service fantastic. I over ordered (2 chairs in a carton, just like described) by 4 chairs, their customer service representative was very kind explaining how chairs are often packed. The representative gave me a return authorization without a fuss. I will definitely order again from Overstock.com. Thank You", 
    "nice chairs for the price", 
    "Love the chairs purchased for new home would recommend to others", 
    "well made chair, easy assembly", 
    "Not too heavy and easy to move around. super stylish, modern but blends well with our eclectic decor! Nice color, not too white, but not ivory : nice clean white. Easy to clean and comfortable for short periods.", 
    "I love these chairs, but I had to get replacement parts mailed to me because they were broken.", 
    "I ordered 2 sets of these chairs to go in our dining room of a condo we recently remodeled. We love them! I was worried about ordering them without sitting on them first but I'm very happy with how comfortable they are. The white color looks clean and love the dark legs. I am using them with a black dining table. Great purchase.", 
    "They were exactly what I was looking for- modern yet very comfortable. I bought 4 of the light grey and 2 dark grey for the ends of the table. I like the contrast and we have a reclaimed wood and metal dining table. It looks perfect together. One of the legs on one chair was a little shorter than the others. My husband followed the directions and was able to fix it.", 
    "These chairs are a soft tweed gray and are so unusual that they fit with every decor. They are the only fabric keyhole back chairs I could find and the price was just right. The legs are relatively easy to install if you follow the directions and not tighten everything until you are sure the legs are even. Beautiful.", 
    "I really love these chairs. I like that you can just wipe these chairs down. I bought these to replace two other chairs that I had which were ruined due to food stains and spills (I have twins). These are so much better when you have kiddos that miss their mouths. ;0)They look great in my kitchen. Very stylish.", 
    "I love these chairs. They are fairly easy to assemble ( although it's easier with two people) and they have added just the right amount of chic to my dining room. I ordered the white with black legs. Great value for the price.", 
    "easy install,comfortable . new , fresh look to my dinning area. i amgoing to order more .", 
    "These chairs are well worth the cost. They are just as described, very easy to assemble and very comfortable. Looks like a more expensive chair and really contemporizies my kitchen!", 
    "Not too thrilled with the quality of the chair. They are very light and can easily topple. However, they look very pretty and will serve their purpose as a kitchen set.", 
    "these are gorgeous! I purchased four of these and I love them! They are just as shown on the picutre", 
    "Nice Style but both chairs had one of the front legs shorter than the other. Had to get out the saw and carefully trim about a 1/4 inch off of one leg on one chair and about an 1/8 inch off of the leg on the other chair then restain the cuts. Ugh !!! Do like their appearance and they are comfortable.", 
    "The chairs were bought for a dining area and look very nice.", 
    "I am using this in my new office and all the clients immediately compliment them.Only one issue: One chair had the holes drilled improperly but a paid a handiman to fix and it is fine.", 
    "Love these look great and are pretty comfy! Great value :)", 
    "I bought these chairs for our dining room and breakfast nook. They are really nice and modern. I love the clean lines and the keyhole adds visual interest. I got the Gray Linen color--it's a very nice medium shade of grey and the material is high quality. They are pretty comfy too, but they feel new still so could use some breaking in. The chairs are a little tricky to put together and make sure they're solid and even. You should be sure not to tighten the screws too much or it will cause the chairs to be uneven. I did have an issue with one chair missing parts and another with a ripped seam on the side, but Overstock customer service sent out replacements right away along with a mailing label for me to send back the damaged chair, so that was great. Very happy with these chairs!", 
    "The first two chairs came to me in good condition. I decided to buy two more, and they weren't sewn properly and didn't fit together quite right. Although Overstock is taking them back, my husband had to take them apart , rebox and send them back. Inspect the chairs carefully before putting them together.", 
    "We put these chairs together in now time! Super easy to assemble. The chairs look modern but are so comfortable to sit in. We loved the chairs so much I'm ordering 2 more.", 
    "My dark dining room table with dark chairs was like a pit in my small home. By adding the white keyhole back chairs, the room seems bigger and so much brighter. I walk out every morning and smile at the sight of the chairs. Perfection for me!", 
    "Very pleased with these chairsAssembly is straightforward- but takes some effortThe look great- and feel solidFor the $$$- a great set of chairsWe mixed dark and light grey for a cool effect", 
    "We've received a lot of compliments on the chairs, they look very nice in our dining room. We combined 6 of them with 2 darker grey chairs (for the head and foot of the table). They were easy to assemble and shipped quickly. They look very nice, but you can tell they are a rather inexpensive chair when you sit in them. They are very light and don't feel super sturdy. However, for the price I think they are great. I would recommend them if you're looking for stylish modern chairs but don't want to spend a lot.", 
    "I order the chairs I the gray linen fabric and they are beautiful. I love the color and the style of the chair. They were very easy to assemble and feel very sturdy. My only regret is that I didn't order four - I ordered two to make sure I would like them and then planned on buying two more. Now it appears they are gone :(.", 
    "These chairs hit the mark from a style perspective. Hard to say after having them for only a few days if they are durable. But the fabric looks like it will stand up to our 3 cat home. The chairs are not terribly comfortable at least compared to their predecessors at our home. And they are painful to assemble. We got 8 chairs, and my very handy husband and his equally handy daughter spent 4 hours each (8 hours total) putting them together ... along with many expletives.", 
    "Purchased three sets of 2 a month ago , still happy about them. I had different chairs in mind but they were way over priced and I decided to go with these for more than half price. They are not my dream chairs, but it is so hard to find good set with excellent reviews. I decided to buy these mainly because they were not bad looking for the price I was paying. They had good reviews and for now they are sturdy. We will see if they will hold for a long time, I doubt it , but then at least I haven't paid a fortune for them and can afford to replace them.", 
    "It's definitely not very expensive-looking with the naked eye, but I won't be using these chairs often, so they won't take a beating. It does bring out the overall look to almost any modern set. My dining table is dark wood from World Market and I'm not a fan of their dining chairs. These chairs look great with them and I love the price!", 
    "They are not leather and do not look like leather. I am a little concerned with them breaking down easily, but only time will tell.They look great. Love them.", 
    "Loved the chairs. Easy to assemble. I bought 4 chairs and it took me approx. 1 hour to assemble them all.", 
    "LOVE THEM!!!!!! These chairs are awesome for the price! I was looking at almost identical ones for double the cost somewhere else. We were concerned about the quality before we received them but we were pleasantly surprised to find that they are pretty good quality! They are very comfortable as well. Also so happy they arrived so fast!", 
    "I love my chairs and they are exactly as described. I'm very happy with this purchase!", 
    "one two of the chair they rock. one leg is shorter than the other three", 
    "These chairs are awesome!!!! I would recommend these chairs. The size were just right.", 
    "I have 8 of these chairs for staging - a friend loved them and ordered four for her home. Great for the price!", 
    "The chairs are absolutely beautiful. The construction is perfect. Very easy to put together and my favorite was they were very white. Very satisified with the Mendoza Keyhole chairs!!!", 
    "Ordered 2 of these chairs and 2 royal blue in another style. Didn't know which color I would order 2 more of and I ended up ordering 2 more white. The size was not to small, not to big. They are comfy and the color white is so clean on these chairs. The quality is good, the only down fall is one of the holes didn't line up, so we had to make a new hole. I absolutely love these chairs and the knock out square in the back gives so much style. They definitely make a statement in my dining room.", 
    "We bought a set just to \"try them out\" to replace our black dining room chairs. However, by just adding these 2 (one at each end of the table), it gave our glass table and other 4 black chairs a fresh modern look! I have gotten compliments on the chairs and I am very happy with not only the look, but also the quality and the comfort of the chairs. Highly recommend!!!", 
    "These chairs matched my current dining room furniture so well, that everyone thinks they are part of the set. The chairs are so comfortable . The design is modern and elegant . These chairs are excellent for any modern dining room and will also work wheel with at traditional set-up. Some chairs look nice but are not comfortable to sit in, that is not the case for these chairs, there is lower back support and seat cushion.", 
    "Putting it together was easy. Don't forget to use the lock nuts. It is the difference between stability and totally loose! Follow the directions and you will be happy!", 
    "I love love love these chairs. Assembling wasn't too difficult and they seem like good quality pieces. They look awesome but I'm not sure how durable the white leather is because one of my 8 chairs did done with a stain on it.", 
    "For the money not bad. They are a pain to put together with the order of the washer being important or they don't tighten right and then u have to reassemble. The directions are good enough, but a little bit difficult to tell on the pictures. I don't think these will hold up too long, but they are very good looking chairs. Like others have said the stiching can be slightly different from chair to chair and getting them level is tricky. In the end though for the money a decent value.", 
    "These chairs are as pictured. Perfect white color. As close To white as I have seen in a while. I get so many compliments. Love these chairs", 
    "I didn't think it was made strong enough. It looks great. I like the style, but 2 screws is all that is holding it together.", 
    "The chairs are beautiful, I ordered two sets. They went together fairly quickly and they are true to the colors as shown. Like earlier reviews mentioned they seem more padded than expected and look fairly sturdy. They are roughly finished under the bottom of the chairs but I think we could finish that off with a bit of fabric and some staples. I also thought adding a couple of little wooden support bars underneath would really add to the strength to the bottom seat of the chair, although I think they would be fine as is.. better safe than sorry right?", 
    "These chairs are exactly what we needed to tie together old furniture and new. The took a bit of time to assemble, but went together well and the assembly hardware made the legs secure. Legs are almost black, and the oil rubbed satin on them gets on your hands while assembling, then rubs off on the white. Wiped it off immediately, so had no on-going issues with it. padding one the seats is a little thin...you sink right to the base when you sit on them. All in all, very pleased with the product.", 
    "I bought 4 of these chairs and they look great in our trendy and modern San Francisco apartment. As mentioned, they were a little difficult to assemble due to the poor quality of the screws and nuts that came with the chairs. However, once that was remedied, I was happy with them, they are sturdy and look great. The color is lovely (white) and east to clean.", 
    "Chair is light and seemed to be cheaply produced- as reflected on the price. However, it looks awesome. bolts needs tightening time to time, and the cushion is springy, but padding is thin. it is comfortable ok though. Bought 4 pairs and didn't regret it. it is functional, designer item on budget.", 
    "When I opened the chairs after arrival I was just amazed! The quality of the chairs were premium, stylish and super plush. They're a great replica of leather chairs. I teamed them with the Braxton Studio White Bar Stools and they are clearly off white and not white like my white plantation shutters or my white outlet plugs and switches. I chose to keep them anyway because they are so unique, classy and are definite conversation pieces. I'm simply overwhelmed by the quality of overstock.com items!!!!!!!", 
    "The chairs bring elegance to the dining room, the color and style is great however, they are made poor there is no covering under the chair just a piece of wood exposed. There should have been a lining covering there bottom of the chairs it make them look cheap and unfinished. the chairs have a very elegant look they do bring a good look to the dining room, but they are made poorly", 
    "One of the best buys on overstock and I shop a lot here.....they are definitely a conversation piece in my home....easy to assemble...sturdy and simple to clean....perfect chairs.", 
    "I love these chairs. Prior to purchasing these I had two other sets of chairs purchased from other on line stores and returned both due to poor construction and wrong coloring. These chairs the perfect Colorado and are easy to assemble. They are solid and very comfortable. I would deffinately reccomend this product.", 
    "Classy looking chairs...quality matches price and rivals most big chain furniture store offerings. Packaging was well thought out. Easy assembly.", 
    "Love these chairs! What more can I possibly say just to meet your 50 word requirement... I had a 4-hour surgery early this morning and typing is very hard with one hand! I answered all your question and left nothing unsaid.", 
    "These chairs need assembly that can be a little tedious because you have to line the nails to the anchor holes perfectly and that can take a while. Other than that no other problems.", 
    "I love my new chairs. They are sooo comfy & stylish. Delivery was fast & the setting up of the chairs was not difficult . My son put them together in a few hrs. My only problem was their weren't enough washers to put them together & two pegs were stuck in the chair itself but between my husband & son they were able to resolve those problems. I would definitely give 5 stars had it not been for those snags. Overall, I love my new chairs!!!", 
    "Look really nice for the money. Go great with modern flair", 
    "I was scared to buy furniture from overstock after reading all the horror stories but these arrived unstained, unblemished and with all the hardware included. The wood under the seat of one chair was split slightly but it was a surface thing, kinda like peeling skin, nothing that would affect the overall integrity of the chair so I decided not to try to send it back. Still you'd think overstock would fully inspect these things and notice something like that. Odd. I don't know why people are saying these are 'off white' - they look bright white to me and match well with my white-white dining table. They are also very comfortable and seem sturdy once put together. And luckily I didnt have any issues with them not being level - because honestly if they weren't I don't know how you'd remedy that in terms of putting them together. You'd probably have to just put something under the leg that was too high, like velcro or felt. Assembly was a pain only in that the thingy you use to screw in the bolts cannot, due to the position of the bolts, go around 360 degrees, so you basically have to turn halfway, remove the thing and reinsert it in the bolt, turn half way again - so it took me about 30 mins per chair. I'm sure a guy wouldn't have this problem but my hands and back get sore from all that bolt tightening, so even though I like these I wont be ordering any more. I need 2 more chairs, but Ive decided to find some that come already assembled. I like the idea of having 2 different pairs of white chairs around a white table anyway so no big deal (or I may get 2 ghost chairs). I do love how comfy the thickly padded seats are. So much so that I'll prob also use these and my dining table as a work station.", 
    "Very sturdy and classy-looking chair. Easy to wipe clean too.", 
    "very pleased with my purchase they look absolutely beautiful and very comfortable easy assembly", 
    "This was my first order from O. I waited several months to actually purchase these chairs. I believed that I could find something at a retailer locally, but that didn't happen. After a lot of running around, what I found was more expensive and less desirable. I finally broke down and ordered these and wondered why I took so long! They look great in my kitchen and were easy to put together. Done!", 
    "Great chair. I was looking for white leather chairs for so long and finally found them here at overstock. I was amazed by color and design. These chairs are so light and ease to lift up. The brand is very fansy! Loved them!", 
    "Ordered two of these chairs. Arrived quickly and in good shape. No instructions on how to put them together but pretty easy to figure out. I am a 65 year old women and it took me about 20 min to put them together by myself. They are pretty sturdy and do look very good with my glass table. Not the best of quality but very good for the price.", 
    "Nice chairs - screw holes not drilled properly, but easily fixed. Very pretty chairs.", 
    "Great set of chairs! Very modern and stylish. They fit perfect with my decor, are very sturdy and good sized. They're also very comfortable to sit on. Packaging was great, nothing was damaged and they were fairly simple to put together. Would definitely recommend! Great quality and great price!", 
    "These are great chairs. They look exactly like they did in the picture. I love them", 
    "These chairs were needed to bring a touch of white across a room. They complement the decor and my husband put them together very quickly.", 
    "Although I experienced some frustration during assembly due to the holes on 2 chairs not lining up properly , I must say that I am still satisfied with the overall look and quality. These are not expensive chairs , they just look like they are. The material so closely resembles real leather, one would have to ask if it is or not. When paired with my existing glass table, the legs are a perfect match for it's black wood table base. I purchased 2 sets and I'm pleased that I was able to transform my dining room to such a high end look with less than a $400 investment.", 
    "seat 7 back material really looks more like plastic rather than faux leatheras sold as, all the excess staples shoddy wood work under chair looks cheap, advertised chair height was 39\" high butthey measure only 38\". Not worth the price. Sorry just being honest!", 
    "We replaced our existing dining room chairs with these. We love the look and they are surprisingly very comfortable. All our friends think that these are expensive chairs and are very surprised when we tell them I found them on Overstock. The size is great because we can fit more friends around the table. I would recommend them highly.", 
    "I was hoping to like these but they did not work for me. These are a true white not a light beige as pictured. The faux leather looks very cheap.", 
    "I love these chairs! I waited several years to pull the trigger on 8 new dining chairs, and I was incredibly excited when these went on sale. They're modern and comfortable, and I hope to have them for years to come. They definitely set the tone for that area in our new home, and we bought some counter height ones in black to go around our island as well. My only concern is that within a month of getting them, a leg cracked as I scooted myself up to the table. My heart just sank. My beautiful new chair broke! I am not sure if it's overall quality, or just a weak spot in the wood. But I am hoping for some response from the manufacturer on a warranty/new front leg for that chair. Crossed-fingers.", 
    "These beautiful white modern chairs are a perfect addition to my home. I love then, they were easy to assemble, they are light wiehgt, and great quality. I will buy another set.", 
    "The chairs are perfect for our new dining room glass oval table. We didn't like the ones that came with the table and found these online. First time to ever order anything online. The value was incredible, they were very easy to assemble and are comfortable and sturdy. They actually arrived the same day as our table, timing was perfect. Would definitely recommend Overstock.com to friends & family. Had a great experience.", 
    "Very nice chairs. Some assembly required, but it's not difficult (just time consuming). I bought 8 chairs total. A couple of the chairs had issues with the legs - once they were assembled, the chairs were not level and one leg did not touch the floor like the other 3. This isn't an issue on carpet, but a big issue on wood floors unless you like wobbly chairs. I had to take the thick plastic pads off of the \"longer\" front leg on each chair and the problem was solved. Not the best, but it works without having to deal with customer service. For this, I rate the chairs as very good quality, not the best. They look beautiful, but the issue with the uneven legs and the craftsmanship on the details brings these chairs down. I would still buy these chairs again. I love them and they are comfortable. And the price could not be beat! I love cyber Monday!", 
    "The chairs are very easy to put together, I did it myself taking about 10 minutes per chair. (I am a 55 year old woman, if you can turn a screwdriver you can put these chairs together easily) These chairs are beautiful and comfortable! I ordered a total of six and one was broken during shipping. I called Overstock and explained to J*** what had happened, he was fantastic, he got right to work and contacted the company that made them to see what could be done. I received several emails from Overstock notifing me of the progress and within one week the new back was at my door!! I LOVE them sooooo much, they exceed all of my expectations, not only the chairs but Overstock's FIRST CLASS customer service!! Thank You, Thank You, Thank You - You have MADE my Christmas!!", 
    "I needed a chair that could hold all sizes of people. They are beautiful. I want more and the matching bar chairs.", 
    "These are actually very comfortable to date. Lots of room. Easy to put together.", 
    "The chairs look great and have that perfect contemporary feel without being cold and that is hard to do with white. Fairly easy to put together and not too many pieces. Originally I was going to pay for a friend to assemble them, but when they got here and were so gorgeous, I decided to try one and it was too easy to pay someone. I did have one chair that the pre-drilled holes were damaged and within 5 minutes of the live chat feature they had a replacement part on the way. Got it in just a couple days and I didn't have to send anything back or lift a finger. I was so happy with customer care. This was my first time ordering on OS.com and I am hooked and soooooo happy! Enjoy!", 
    "I have been looking at similar chairs in pier 1 for some time... these chairs were half the price and gave me the essence of the pier 1 versions... I like the look ... for my $ they are lovely.... with free shipping and a 10% coupon...they were a great bargain.... i bought 6 and they took some time to put together... but my daughters and i got them together quite easily....", 
    "purchased this dining chairs in black leather for my diningroom. the chair look simular to the picture but are light weight and are not strong enough for heavier people. the seat is uncomfortable feels as if you're sitting in a hole.", 
    "Relatively easy to put together. Once I did one chair, other were easier to assemble. The chairs are very comfortable and easily wiped off if spill. I like the clean look of white. Padding in chair makes it very comfortable to sit in.", 
    "the only negative is that the seats are a bit deep for me but I am short", 
    "Chairs are perfect for our small dining room. My decor choice is white assessories and these chairs completed my decor. They are comfortable and go perfect with my White Chandelier and glass dining table.", 
    "These chairs were delivered so quickly! They were easy to put together and like everything I have ordered from Overstock, of great quality. I like that they are faux leather so I can easily clean them and they are animal cruelty free!", 
    "I have had to return items that were advertised as \"white\", but were actually cream or beige. These chairs are actually white. Very pleased. Extremely easy to put together. Directions were accurate and holes lined up perfectly. Sturdy construction. LOVE, LOVE these chairs.", 
    "Love love our chairs!! It adds such a modern touch to our home and the price was unbelievable!! I love the easy to clean material. Some of the chairs are a little off balance once assembled, but not enough to bother me. I get a lot of compliments on the chairs. They completely make our dining room paired with the 3-light Contemporary White Shade Satin Nickel Chandelier. Thanks, Overstock!", 
    "I love these chairs! They are exactly what I wanted and they were so easy to put together! They look amazing in my dining room and I would buy more if I had more room!", 
    "We wanted to redecorate our living/dining room with a small budget. We bought 2 of these chairs to add a modern touch to our dining set. They look great with our existing Italian chairs. My husband put them together in less than 30 minutes. Love these chairs", 
    "I purchased the chairs for my grandson in college. He is very picky and said the chairs were perfect for his condo. Thanks", 
    "We absolutely love these chairs! I went to a designer store and it was going to be $800.00 for 4 chairs, and when I found these on overstock I couldn't believe how similar they were but I didn't think they would be as good of quality. Oh but they are and I paid less than half for them. Which is amazing because I can never find deals. The only semi downside is that they are a wee bit difficult to put together, so I was very thankful to have a very handy husband!", 
    "This was a good purchase. It came promptly and was easy to assemble and met my expectations.", 
    "I just modernized my decoration and these chairs are very nice. Changed the whole style and don't hesitate about them.....Really like them. Easy to put together.", 
    "I think that the quality of the product is good, but the bottom could use a little spiffing up (e.g. a velcro secured cover to hide the wood - there are lots of splinters under the seat)", 
    "Couldn't wait to get them and they are beautiful. They really brighten up my dining room which is what I had hoped for. You will not be disappointed at all.", 
    "Love the design of these chairs. Have them in my dining area with glass top table and they look very modern and different.", 
    "I just easily assembled two chairs and I love them. The size is perfect, the color exact as per the listing. Very happy. Adds a nice touch to my rather small living space. I paired this up with the 27\" table from overstock and am quite happy with both purchases.", 
    "Two of the four chairs I ordered had the wood below cracked and had black spots of moisture. This was not visible on the top but it was obvious that these chairs were not stocked properly", 
    "poor quality,bad look,disappointed.a lot of money for return and doesn't worth the money....i ordered more things from overstock and happy with them but this order disappointed me", 
    "the quality could definitely be better. I don't like the staples under the seat and you can see a little faux leather fabric from the bottom side. I got 2 sets, and the hardware was incomplete (# of screws and washers)", 
    "I love my keyhole chairs, saw them in a local furniture store and they wanted way to much money for them but i searched overstock and found them and ordered them right away! the price was great. assembly was easy. very satisfied wit my purchase", 
    "This is a very nice looking and comfortable side chair. Adds a bit of modern style to any area.", 
    "LOVE these chairs. bought four and they go perfectly with our modern steel table and help tie in our contemporary style throughout. they're beautiful and sturdy and, according to the husband, pretty easy to put together. we like these much better than some that we saw at our local furniture store for almost twice as much.", 
    "This was my first experience with OverStock but it now will be my first stop in shopping! I thought Amazone was good, and it is, but this was better in a few aspects, including being able to talk to someone.", 
    "I love the look of these chairs. Assembly was super easy. I might have to order more.", 
    "I love the look of my chairs. We ordered 6 to go with our glass dining room table and the look if exactly what I was trying to achieve. To be honest, they do not get alot of use, but when I do sit at the table to do paper work it is supportive and comfortable. We have had a couple of dinner parties, where the guests have complimented the look and mentioned how nice the feel of the soft leather. The only spill to clean up was red wine, and it was cleaned up VERY quickly with no stain left. My husband put all six together in about an hour, but he improvised and used some of his personal tools, not just what was provided. Over all, I am VERY happy with my purchase.", 
    "Great chairs! The legs are black not espresso brown, but the chairs look beautiful and they are comfortable. They are really designed for a large table but I have 4 of them around a small table and it works.", 
    "We'd wanted a different set of chairs for quite a while, but ended up settling on these due to a drastic price increase on the other set that we wanted. The quality of these chairs is pretty good, although we haven't really gotten to use them much so far. They seem quite comfy and will hopefully last for years to come. They do have a pungent odor - from the fabric - that lingers for a while, but dissipates after a while. All in all, very nice chairs for the price, and definitely worth the price.", 
    "THESE CHAIRS LOOK GOOD ESPECIALLY FOR THE PRICE. CHEAP COMPARED TO MY 15 YEAR OLD PARSONS CHAIRS I WANTED TO REPLACE. I THINK I WILL KEEP MY OLD CHAIRS, UNSURE HOW THESE CHAIRS WILL STAND THE TEST OF TIME AND USE. AS USUAL THEY ARE MADE IN CHINA. I WOULD RECOMMEND THEM FOR LOOKS BUT PROBABLY NOT FOR ACTUAL EVERYDAY USE.", 
    "I really love these chairs. They are of good quality and really look great with a black table. My only qualms are with the stitching. Right now the stitching is white, but I don't know if the stitching would come clean if anything staining like tomato sauce spilled on it. Other than that, the chairs are very attractive and are very comfortable. It's very hard to find a white vinyl chair with black not brown legs and the legs on these chairs are very nice and very black. They were easy to assemble and we had no problems with the legs being uneven.", 
    "Very nice and comfortable chairs. Set up was not complicated We continue to enjoy them", 
    "I bought 8 chairs for a new dining room and once we figured out the simplest way to assemble the chairs, it went pretty fast. The we're just what I was looking for and have received many compliments on them.", 
    "great chairs for a black table. I could not find white with black anywhere. So this was perfect!", 
    "Definitely enjoying these chairs and love how they look in my place. Clean, sleek and modern.", 
    "We were pleasantly pleased with the chairs. The quality was great and quite easy to assemble", 
    "Modern and fabulous! I combined four of these chairs with two of the Decor Bubble Print dining chairs also found on this site. Now I have a fantastic modern formal dining set that is unique and will never be found in a retail furniture store!", 
    "i like the comfort they look really nice, have received compliments", 
    "Got these chairs to update the look of an existing black dining room table. Did the trick and I am very happy with these chairs. Once put together, very solid. At the moment, I am down one chair (ordered 4) because the fixed leg on one of them arrived broken. Disappointed at that but hopefully Overstock will rectify quickly. Would definitely recommend these chairs. Stylish, looks high end and adds to decor of the home. I put them together myself and 3 of them took about 20 minutes. The holes on some were a little tricky but other than that no issues.", 
    "Great chairs for the price. a couple of holes did not line up, but I made it work.", 
    "This chairs are outstandingly comfortable and perfect in our modern dining room. We ordered 6 total and one showed up broken. We're still working on being able to send only 2 back instead of all 6. Other than working out this issue with the company, these chairs are fabulous. Very easy to assemble. Extremely soft and comfortable. Definitely recommend them.", 
    "These chairs took me about 2 hrs to put together myself (I bought 6). They feel very sturdy, and friends have commented that they're very comfortable. Plus, everyone loves how cool they look, from my parents (traditional taste) to my artsy friends. I've liked these chairs for a year and wanted them, and finally moved into a new place where they were needed. Paired with an espresso brown/black square dining table, they look simple but interesting. I've even stood on them to hang curtains, etc, and they felt very secure. I would recommend these to anyone buying dining furniture on a budget. They are similarly priced to *** parson chair line, but look nicer and include cheap/free shipping.", 
    "these chairs are beautiful . so modern go great with my decore and great price", 
    "Assembly was easy. Chairs are comfortable and look like I spent so much more.", 
    "I'm so in love with my chairs. Great style. High class looking chairs. Makes my room look so rich.", 
    "very nice chairs.arrived within a week and very very easy to put together.like the style and very comfortable too.good price. i ordered 2 and than ordered another 2.happy with my purchase.they did smell like plastic when i first put together but the smell goes away.they look like leather", 
    "Bought 6 of these chairs for new dining table chosen dark black wood grain Absolutely love them!! Very Contemporary look Very Happy with quality & comfort Def would recommend these chairs!! Didn't take long for husband to put them together....Also love the cut out hole which was so diff than average looking chairs...", 
    "the chairs are exactly what my dining room needed. ordered two and then ordered six more.", 
    "I love the look of these chairs. They go perfectly with my black and white kitchen. The shipping was super fast, the assembly was easy, and the quality is great. They are comfortable to sit in, and I have no complaints.", 
    "These chairs are just what I was looking for. Color was spot on and just how it is pictured. They were packaged very well, I was plesantly surprised. The seats are comfortable however, the back not so much. Unless you are sitting up (probably with correct posture) the hole on the back doesn't provide as much support as I would like but I do like how cool it looks. I have only had them for a few weeks, maybe I just need to get used to them but overall, I am happy that I found these.", 
    "We bought 6 of these chairs and liked them so much that I ordered 2 more. They look much more expensive than they are. It takes a little while to put them together but it was not all that bad...well worth it when we saw them all around our dining table! We're ready for Thanksgiving dinner!!!", 
    "These chairs arrived much faster than i expected, packaged very well, carton in great shape and all packageing inside was very neat. Took some time to get thru all the packaging. Chairs went together very quickly, with all the right parts. Goes perfectly for the extra 2 chairs needed sometimes for extra guest at dinning room table.", 
    "The chairs are very modern, yet elegant. They go perfect with my white leather sofa. I was concerned they would not be white enough, so I ordered two and then ordered four more. Basically easy to put together. Just make sure the legs aren't tightened till the last one, so they will all be level.", 
    "These chairs are so classy looking. Was trying to pull in some new contemporary elements in my dining area and these chairs really fit the bill. They look great and are sturdy and comfortable. The backs are a little higher than I thought they'd be, but still work great for me. Easy to put together - took about 30 minutes for 6 chairs. I'd recommend to anyone!", 
    "Gorgeous chair, we received one with a little damage (shipping) and they replaced right away.", 
    "Easy to assemble and looks perfect in the two places I bought it for: 1 for the office counter space in the kitchen and the other for the vanity in the master bath. It's slightly uneven but easily fixable with those rubber stickers you can place under the legs.", 
    "I absolutely love my 4 new chairs. They came in a week..there was a one day delay due to Hurricane Irene but I was able to track my order which thought was awesome. The color on the site said white, but it's a little more on the creme side which is better for me. I put it next to a paper white vase and you can see the difference in the shade of white that way. My dining room looks very elegant and classy. Every person that walks in has commented on the chairs and how beautiful they look. I was afraid to order these on line, but I've heard the return policy is good and customer svc is good too. I also realized I ordered a cocktail table 3 years ago and It is still in perfect condition in my living room. I forgot about that until Ilooked at my order history. So, the chairs are perfect, I love them and it makes a huge difference in the way my dining room looks! I totally recommend this product!!", 
    "loved them . sturdy seats too. comfy if your wall decor is bold in color then these chairs will stand out Perfect an d Modern", 
    "I purchased these chairs to go with an antique round dinner table to give a mix of new and old. They look perfect in my small space and are very comfortable. Easy to assemble and a great find for a good price.", 
    "Iam not very happy with these chairs. After assembeling them I have concloded that they are not very stable. I purchased two sets(4) of chairs. The first set was fine for the price but the second set was horrible. No matter how many times I adjusted the screws the chairs are not sturdy. One of them moves to the slightest touch", 
    "LOVE MY CHAIRS!!! Everyone who comes in my home comments on my dining room chairs. They are high quality and very comfortable. They look much more expensive than the price I paid. I had seen some other white leather chairs and they wanted over *** per chair. I found these on Overstock.com. They are very similar design but much more affordable. Could not be happier with my purchase. I have made several other purchase's since and have not been disappointed with any of the products that I have received. Recommended this site to a friend and she has since ordered 4 chairs and a bedroom set!!! Will continue to spread the word about your company.", 
    "Bought 2 & I loved them so much I bought 2 more! I've gotten lots of complements. They are beautiful, sturdy, & comfortable.", 
    "I was a little disappointed. The legs on one chair are uneven and the chair rocks. On the other chair, there is a gap between the seat and the back, but not on the other. However, considering the low price, overall I like the chairs. They are sturdy, and they look great. No one except me will probably ever notice. The delivery came quickly and the chairs were easy to put together.", 
    "I am submitting a review on this page since the dark brown option is no longer listed. I love the chairs, but unfortunately ordered 2 sets of 2, and one was damaged in shipping. So I kept one box hoping to have Overstock send a replacement, but now dark brown is no longer available. However, on opening the box, it is clear that these chairs are black, not brown. Perhaps \"dark brown\" was mislabelled/misrepresented to begin with (?), now I'll just have to decide about order more that are actually labelled as black. Overstock quickly refunded my $$ for the damaged set, but has no answer about how black chairs are in a box labelled dkbrn. If you want white or black they are great chairs, and easy to assemble. Comfortable and look great.", 
    "The chairs were pretty easy to assemble and where just as they appeared and were described on website. Very happy with them.", 
    "Nice chairs. Just as pictured/desribed-- no surprises. At this price if you are looking for a comfortable chair with a modern look you can't beat it.", 
    "We love these chairs. They are a true white and very comfortable. Easy to clean and I love the keyhole cut-out. I had six of them put together in about an hour and half, before my husband got home. Easy instructions and very sturdy construction. They look amazing in our dining room around our vintage wood farm table, a great mix of modern and old. I could not be happier with this purchase and with the O.com on making it so easy and a great price. We also bought the 5-year protection plan with this purchase for piece of mind.", 
    "They came in a box, as expected. It's very easy to assemble them and no missing parts. So far, they have been very comfortable. I hope they will last in that way. The chairs we bought before were comfortable for a while, then the cushion sagged. But, I hope these chairs will not go in that direction. I will update this review if that happens.", 
    "I Love, Love, Love my new Mendoza white Keyhole dining chairs. They look very expensive!! I bought an expresso brown dining table, and 6 white Keyhole chairs, 3 for each side..and found 2 Beautiful Gray fabric chairs for the ends...as I have redone my dining room in modern decor. I will be buying one of O.cos gorgeous chandeliers for over the table. Love O.Co...delivery is amazingly FAST and no problems on assembly.", 
    "These are substantial, padded chairs.They are white (not quite as bright white as the Overstock white ottoman), not ivory, and they were very easy to assemble (holes drilled correctly, allen wrench included). They are nice for extra seating (for a desk or in a living room). Pretty comfortable, too.", 
    "I've been looking for new chairs for a while and in dept stored they can get a little expensive. I looked on overstock.com and I was pleasantly surprised. I ordered my chairs and they arrived in 1 week. They chairs were easy to put together and came with an Allen wrench. My Company loves they way the chairs make my space look. I absolutely love them as well. They are sturdy and easy to clean! I would recommend this product!", 
    "The chairs were perfect. The size, color and comfort for the price: \"What a deal\", is all I can say.", 
    "I found these chairs to be wonderful. They are soft, firm and sturdy. They add elegance to the mirror glass table I made. My husband says that they were not difficult to assemble. I had purchased two, loved them; purchased two more and near future will purchase additional.", 
    "Although these are not leather they are STUNNING! Ships fast and is partially assembled. They make a Statement to any INTERIOR AND ARE SHOW STOPPERS!!", 
    "Good price for a mid or up-middle class dinner room. They look good from outside and seem to be solid to sit on. But when I assembled them, they were very, very rough woods. They could hurt your skins, if you do not wear gloves.", 
    "Ordered these side chairs to go with a black and white bedspread in my master bedroom. Needed them to be white (not cream or light yellow). Put the chairs together in no time at all. Directions were good and holes matched up perfectly. They are just perfect for where I wanted them to be placed. Overstock, you rock!", 
    "Some of the nuts and bolts were missing. However, the chairs are gorgeous and looks expensive and is super comfy! Too bad about the parts that were missing; though you could get it cheaply at a hardware store.", 
    "these chairs are chic and sturdy....they bring a nice modern touch", 
    "Excellent quality, beautiful chairs, very modern and stylish. The picture actually does not show how great these chairs are. I loved them and I'm so happy with my dinning room set.", 
    "Soft White, beautiful and expensive looking. Very decent quality. Love them.", 
    "Needed some glam in my newly remodeled dining room. Ordered 4 of these to start, exceeded my expectations! I will be ordering two more. They look great with patterned arm chairs on either end of the table. Packaged beautifully, no parts missing, went together easily, great price and I received them in just 4 days. Thanks Overstock.", 
    "These chairs look amazing, and much more expensive than they cost. I had a little trouble getting a couple of the screws all of the way in, but other than that they are perfect. It took me about 90 minutes to put together 6 of them. I would absolutely recommend these to anyone.", 
    "The product looks good, however: the vinyl is not leather like, I've found several spots of discolorment and the construction is not sturdy. I like the look so much and the cost to return out weighed the refund benefits, so I'm keeping the chairs and putting them somewhere they won't get use, but can sit and look nice.", 
    "Beautiful Chairs. Easy to put together. Comfortable. May purchase another set. Fast Delivery.", 
    "These chairs give an instant glamorous look to my dining room. The white faux leather with tone on tone stitching with dark legs give a very contemporary and upscale look! They were easy to put together, they are sturdy and extremely comfortable. They look like they were way more expensive then they really were. I feel they were a high quality chair at an amazing price!", 
    "I love, love, love my new chairs! I replaced my upholstered Parsons chairs with two pairs of the Mendoza keyhole side chairs. It looks like I have a whole new dining room set. Even though my table is glass-top on a off-white base, with my former chairs everything looked HEAVY. Now, it's light, stylish and modern. The stitching is uniform, cushions firm and overall they have weight to them. These chairs look more expensive than what I paid, so I feel this was a very good value and purchase. I had my boxes delivered to me at work, which arrived very quickly after I ordered them. Separating out the parts made it easy to transport to my car and then to my apt. Assembling the chairs took me about 15 mins. tops. Just make sure to read the diagram, sort the screws by size, put the washers on and then screw them in, going around to each about 4-5 times. Note: a wedge of styrofoam is packed in the corners where the front legs go and they don't come out in one piece. So, you'll end up with bits of foam on your floor.", 
    "We ordered 8 of these chairs & so far have only put together two as end chairs & we love them! Very solid feeling & at the same time, \"cushiony\". Definitely happy w/the look & feel- the only thing that would make us like them more is if we got them for even LESS than $**** a chair, but you can't have everything & this really was a great buy! Enjoy!", 
    "I love these chairs. Had guest over for a dinner party and they were blown away by the modern look. Thanks", 
    "I absolutely love these chairs! It took less than 5 minutes per chair to put together. I have them in my kitchen with a black rectangular table. They pop against the black table. I get sooooooooooo many compliments on them. I would definitely recommend buying this product. Jani From Marietta, Ga.", 
    "I love the way these chairs look in my dining room. They really brighten up the space. Apparently they were easy to put together, my husband had them together in no time and I did not hear him utter a peep while doing it. Good quality item for a great price.", 
    "A little chunkier than they look in the picture, but otherwise very comfortable and modern looking. Assembly was fairly easy after you figure out the minimalistic instructions. A little rough on the finish constructionwise, but that's to be expected for the price and it's only noticeable on the underside of the chair when you're putting it together.", 
    "these chairs are more than what i expected. I started to order only one set so i could check them out but a couple of days went by and i ordered another set. To my surprised i'm GLAD i did!! Keep the good quality and afforable merchandise coming. Delivery was excellent also.", 
    "These chairs are absolutely beautiful. The pictures do not do them justice. The keyhole back and the stitching make them look very stylish and expensive. Great delivery service and easy to assemble. These chairs would easily mix with any decor and they are extremely comfortable as well.", 
    "These chairs will make your dining room pop! The complements I have received so far are all in the \"wow\" zone! They are very white and the legs are a deep expresso, which seem to complement each other. I put them with a simple walnut finished table which blends very well. I found them very easy to assemble, and the shipping was very quick. You will love these chairs!", 
    "These chairs are so comfortable. They go well with any decor and are well made especially for the price. I really like these chairs", 
    "I love these cute and stylish chairs. Great price too!", 
    "I loved the modern look of these chairs, this was exactly what I was looking for. I've received many positive compliments and they are very comfortable.The instructions were very easy to follow, and assembly was a breeze.", 
    "I got 4 of these chairs and love them. They were just what I was looking for for my kitchen table. nice size seats and sturdy and comfortable.", 
    "These chairs look so good in my new dining room! Modern, sturdy and stunning and the price just added to the joy I have when I sit on these comfortable chairs! I'm so glad I bought 8!!", 
    "These chairs are great! I ordered the first set of 2 just to test them out. They are comfortable and very modern looking. The color is a perfect sharp white contrasted against a rich ebony. Chairs are easy to assemble and packaged nicely. I loved the first two so much I bought a full set for my dining room and kept the first two for a cocktail table by our fireplace, that way I have two extra chairs when we extend our table for larger parties. I initially had a shipping problem which was quickly resolved by overstock.com customer service...(thanks, *****!) And the right chairs were in my house within a couple days. Can't wait til my new sets arrive.", 
    "I ordered these for my reception area and they comfortable.The first chair took a little while to put together,but the rest went pretty quick.+++note++there was a staple blocking one of the screw holes,so if you are having trouble, look to see if that is the case.They are perfect! I may order another set.", 
    "The table is nice, but one of the legs has a dent in a very visible area. Like someone hit it with an empty stapler a couple of times. Have requested a replacement leg and will update once I receive it.", 
    "Yo pedí el gris dark y me encanto perfecto para disimular las manchas de mis niños fáciles de armar y renovó mi comedor", 
    "Cheap from China they can have it back no thank you. It assembled easy enough but it walbled when together who wants that in a dinning chair?You get what you pay for and that is why I sent it all back.Cheap cheap cheap.", 
    "Beautiful chairs. They look so elegant and sophisticated. The seats are wider than they appear in the photos. The chairs are a bit low, however. That is the only complaint I have."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Mendoza-Keyhole-Back-Dining-Chairs-Set-of-2/5178479/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5178479/TRIBECCA-HOME-Mendoza-Keyhole-Back-Dining-Chairs-Set-of-2-7809fc1b-011c-433f-a11e-82ecfca91395_600.jpg"
  ], 
  "description": "Rethink dining seating with the modern style of these keyhole-back dining chairs from INSPIRE Q. Choose a neutral upholstery color to make the chairs blend into their surroundings, or choose a bold color to make the chairs a focal point. The high backs combined with the thick padding on these dining chairs offer a plush seating option. Sit around the dining table for hours chatting with friends, or use the chairs as extra seating for company. The faux-leather upholstery holds up to regular use and is easy to clean when dinner gets a little messy.Constructed from Asian rubberwood for sturdy constructionFaux-leather upholstery for durability and easy cleaningVarious upholstery colors for versatilityEbony wood finishKeyhole back design for visual interest18\"\" seat heightMeasures 39\"\" x 19\"\" x 23\"\"StyleContemporary, Modern, UrbanMaterialFaux Leather, Rubberwood, WoodFinishWhite FinishChair TypeAccent Chairs, Dining ChairsSeat HeightCounter HeightSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorBeige, Blue, Brown, Grey, Purple, Red, WhiteFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion, Upholstered"
}