{
  "name": "INSPIRE_Q_Parson_Classic_Upholstered_Dining_Chair_(Set_of_2)", 
  "price": "EUR 149.44", 
  "reviews": [
    "I have had these chairs for two years and they are still like new. I have a two year old who eats at them and the stains come right up. They are easy to clean and very sturdy even after the abuse of being knocked over many times by my toddler.", 
    "As others have said, these chairs are a great value, look good and are quite comfortable. I ordered 6. At first I wasn't sure what all the fuss was about regarding assembly - the front legs go on effortlessly. The rear legs, not so much. After struggling w/the first, I was dreading doing 5 more. With a friend's help, we got it done, some went a little easier than others, but overall it was definitely not fun. Some tips...you have to jiggle the rear legs while you're threading the screws (7 on the rear), I found it somewhat easier to use a drill w/hex driver once threaded in, but the screws are soft metal and will strip easily if you muscle it. I'm glad it's done!", 
    "I love the look of these chairs--they look more expensive than they were, and they are super-comfortable. I also love the size. Many of the comparable chairs on the site had comments regarding the seat being too narrow. The seats on these are nice and wide, and the chairs seem really nice and stable for those with a larger backside and a few extra pounds. The assembly wasn't as bad as I was expecting, but perhaps that's because I've had extensive dealings with Ikea products. The first chair took about 45 minutes, with a few F-Bombs dropped here and there when things didn't screw in correctly. The second only took about 15 minutes, and was a PG-13 experience. I've included some tips below, which will hopefully prevent your own F-Bombs. Assembly tips: - I assembled completely on my own, only getting help on the final step of tightening everything, as your fingers get a little crampy using the little allan wrench; I think having more than one hands on it at a time would be more of a hindrance than a help. - I sat on the floor with the seat on my lap to put on the front legs--this was relatively easy. - After putting on the front legs, I sat on the floor with the back of the chair on my lap, legs on either side of my waist, situated so the holes in the wood were face around the area of my knees. - I put the seat in place lining up the dowel to the hole, using my arms and hands to hold the seat flush in place while putting in and turning bolts. - I put in all of the bolts at once, before tightening any of them to make sure they were all lined up (I learned this after screwing the entire seat on the first one, then finding out that the final bolt was completely unaligned). - When screwing in, the trick is to hold the seat in place and flush to the holes. It's a little tricky, but not that hard. Hope the tips help. I highly recommend these chairs and hope you love them as much as I do!", 
    "These chairs were ordered to match ones I had purchased at xxxxxx several years ago. A perfect match and excellent quality made me thrilled to get these. We've gone through 5 grandbabies and there isn't anything that they can do to these chairs that can't be cleaned off. We've had spaghetti sauce, chocolate and ink pen even drawn in a bullseye that came out with just water or a little dish soap and water.", 
    "The chairs look really nice and they were not that hard to assemble once I got the first completed. The scfrews are very near the same length but they are not interchangeable so line them up before you start. The directions are not that specific. It would be better to have 2 people to put them together but I managed by myself with a few contortions. Use a power screw driver as the small tool that comes with the chairs does not tighten fully unless you are extremely strong.", 
    "I rarely take the time to write online reviews of products but I was so happy with this purchase I thought I would do so. I am a very discerning shopper and spent countless hours researching an elegant and affordable dining chair to coordinate with an expensive dining table I recently purchased. I was skeptical due to all of the mixed reviews but took a chance and ordered 3 sets of these chairs. Yes, they took some time to assemble. They are, however, very sturdy and modern. They are not cheap looking. I used some shabby chic slip covers in a neutral color to cover them and I would put them up against any of the $200-$300 side chairs from major retailers. In my opinion, they would be great without slipcovers if you want a more formal look. The seat cushions are more of a taupe/mushroom color but they are very attractive. I would highly recommend these chairs. They are a super value and you can't beat the $2.95 shipping.", 
    "The chairs arrived with the boxex pretty banged up. I was worried about the chair when I unpacked them. Beautiful. We purchaced 8 chairs. We found several ways to improve the assembly process. Work off of the dining room table. Instead of uptting the front legs on first, put the chair back on first. Leave the seat upside down on the table and hole the chair back up to the seat. there is a center post that you will need to match up./ Once that is done put in the screw - this will hold the chair in alignment for the remaining 6 srews that go into the chair back. Do Not tighten until yu have all 6 screws started. Once you hae the back in place, put in the front legs. They are a breeze. Hopes this helps.", 
    "These are great chairs for the price. Sturdy with solid wood legs and very nice microfiber upholstery, they look quite elegant. However... People have mentioned the hassle of putting them together--maybe I'm just a puzzle fan, but I didn't find it difficult at all. My main beef is the smell of the off-gassing PU materials. That's a big PU, little buddies! After two weeks with them next to an open window 24/7 and some Febreeze, the scent is much less noticeable, but it's still there a bit. I've also ordered natural citrus odor eliminator to help the process. So why the 4 stars? Look, durability, and the magical fabric that doesn't seem to collect a single piece of cat hair. And I'm talking about velcro supreme-style long cat hair that ruins everything. After 8 years with those lovable buggers, it's such a sweet relief to have a nice looking surface other than metal, wood or leather that I can happily offer as a seat to guests. Smell or no!", 
    "Took a little time to put together, but basically smooth and without major difficulty. These chairs are light weight and comfortable. I'm very happy with the purchase. Added a little elegance and comfort to our Thanksgiving table this year - as we replaced some 1980's oak dining chairs (replica style) which were hard as rocks! We actually stayed around the table and visited longer than we used to :-).", 
    "These chairs are extremely difficult to assemble. The screws do not line up with the legs. The seat is poorly padded or should I say not at all padded, therefore, the chair is not very comfortable. The bottoms of the chair legs are unfinished so they will scratch your floor. We went to Home Depot and bought felt pads for the bottom of the legs. Two of the six chairs I ordered were damaged. On the plus side: The customer service dept. was very willing to replace or send replacement parts for the damaged chairs; and the chairs look more expensive than they cost. These chairs are inexpensive in price and inexpensive in quality and workmanship. You get what you pay for. If you are looking for a comfortable or sturdy chair forget these. If you are looking for something easy to assemble, forget these chairs. If you are looking for something to display in a formal dining room, that rarely gets used (this is my category) then these chairs will be OK.", 
    "the chairs are mediocre at best. cushions are very stiff, not so comfortable. one leg wobbles as if it is not the same length as the others, contacted customer service and they weren't eager to assist me.", 
    "I bought 4 of the chairs, which are at my dining room table. This is open living space., so It was important that they blended in with the couch, casual, yet not too....I hope you get what I mean. We use this chairs daily, they are very sturdy. We got the light tan color and after about three weeks or more of use everyday they look great!!!! My husband did have a few moments with the legs of the chair not quite lining up, but after the first one he said the rest were easy. I wish that I had room for two more chairs, so I could have 6. For anyone just starting out on a budget or just want to change a look, I would recommend these chairs.", 
    "I bought 4 and I'm quite pleased. They are a nice beigey color and are comfy too. They do not look cheap and were very easy to assemble.", 
    "Looks nice and cleans easily but a little cheaper quality up close. Comfortable. Might not last more than a few years", 
    "These chairs look nice and have solid wood chairs, but the quality overall is poor. Ok for price. Issues: 3 of 6 chairs had alignment issues , so the wiggled when you sit. We added some tabs at the bottom and seemed to fix but very annoying.Also the fabric is then so you can see the frame and outline of trimmed fabric inside on the backside. I suspect over some time and handling this stress edge will eventually rip on the edge.the chairs look and feel nice but I wouldn't recommend them unless they will be used in a dinning room that doesn't get daily use.", 
    "I just opened the boxes. I ordered 4 chairs for my dining room. The quality is much more than I expected considerating the price I paid.", 
    "I originally thought these chairs were going to be a pain to put together due to other reviews, but it was rather simple. The only frustrating part was making sure all the bolts were equally as tight. If you are thinking of buying these and have made *** furniture before, you will be perfectly fine. Definitely give yourself 30 min per chair though! The chair looks great as it. But upon detailed inspection, you can tell they are not perfect- the underside is still rough wood that can give you splinters, the seams are not all straight, a small piece of cushioning might be coming out of a corner. However, for the price, you can't beat it. As these chairs get used more, I might be diligent about make sure all stitching and seams are in place so they can last as long as possible. Overall, I am happy with what I got at the price I paid!", 
    "These chairs are perfect for my dining room table. They look and feel great! Very easy to assemble!", 
    "I purchased these two chairs because the price was right, and the color goes well with my furniture. Major complaint with one of the chairs. It was wobbly. I made sure I assembled correctly, tried to switch between the legs, but still didn't come out right. The other chair was fine. So, basically, I paid (***) for one chair.", 
    "I love these chairs. I'm so glad I ended up purchasing these. I will say the color of the legs are a little light than the pic (which is exactly what I was hoping) . They do have somewhat a smell following another reviews advice I have been spraying febreeze on them each time I walked past them for the first couple of days. I ordered 4 and I am looking to purchase 2 more soon. The color is great and looks fab with all of my new decor, I would agree that the color is Mushroom or Taupe (another review I had read). If you have a hand held drill thats the best and easiest way to apply the legs on (you also need an attachement for the supplied allen wrench) I hope this review helps the next person whom keeps going back and forth from page to page. These are def worth the money. I purchase from Overstock a couple times a month and this is by far the best item (for the $$) with out any regrets I have bought in a while.", 
    "Don't buy these chairs! One came not fitting together - it was replaced, no problem. Then over the next year, with light use, out of six chairs, one is broken - the wood inside the back is cracked and cannot be sat on, and the whole set has to be retightened frequently - legs and back. Junk junk junk - don't waste your money! And Overstock won't do anything after the first 30 days.", 
    "These are nice looking chairs. HOWEVER! Be prepared to have lots of time to put them together. I ordered 8 of them and was able to put one together strictly by myself. The other seven required help. There is the little wrench that is included to put the bolts in-AAAHHHHHH!!!!!! It would be much better if they could use a universal bolt so that the average person could assemble with the usual screwdrivers that we all have. Because the back is curved, it is extremely difficult to get the predrilled holes to align and that is compounded by the horrible tool that is sent to assemble the chairs. One of the 8 chairs was so poorly constructed...holes were not drilled or/and not completed, and had excess wood splinters in the holes...that I had to use my nail gun to insure that it did not fall apart. These are for my dining room and will work for the purpose intended. If they were to be used daily, I would not recommend, simply because they need to have the bolts tightened often with that horrible tool and using bolts that do not allow for ease in tightening.", 
    "Although the chairs are beautiful, the workmanship on the screws and screwholes is not. One chair lined up perfectly for assembly and the other did not. We worked on it for hours. Even my carpenter, fix-it-all dad said the ***** messed this one up! Even worse, it is a HUGE package to have to return and after getting one put completely together, having to take it apart and repackage it to return ship is a complete nightmare!", 
    "I had some doubts about ordering these chairs. I've never ordered furniture over the internet before. I ordered three sets of these chairs. When they came and I looked them over, I was thrilled. Every one was in excellent condition and the color was perfect. I liked them so much, I went ahead and ordered one set of counter chairs to match also.. The color is a soft \"mushroom\". My husband had no trouble putting these together, (He is very clever, however) I couldn't find these chairs anywhere else for this price. I am very pleased with this purchase. Don't be afraid to order these chairs.", 
    "This product was horrible! Some bolts did not line up witht the holes and the front legs on 2 chairs kept coming lose. On one of the chairs there was something carved into the material . There are scratches on some of the legs. I would never recomend ordering furniture online to anyone!", 
    "these chairs are awful !!! I purchased 4 and only one will sit straight, they teeter totter and the one that sits straight has drawings on the back because they were obviously returned by a previous customer. I cannot return the chairs because I do not have the receipt. What ever you do,do not ,I repeat do not purchase these chairs.", 
    "Ordered and received 6 of these chairs. They are exactly as pictured. Nice fabric and comfortable seating. Easily assembled. Only problems found were slight unevenness of the legs - had to put a little furniture pad on one of the legs of each chair to prevent wobble. Also, one chair arrived with a small spot on the fabric that I have been unable to remove thus far.Otherwise I am pleased with my purchase.", 
    "We really like the look of these chairs I our dining room. They are very comfortable and clean up very easily.The only disappointing feature is that some of legs are wobbly. We thought we did something wrong when we were assembling the chairs.... Unfortunately, it was the chairs and not the assembler.", 
    "Crappy chairs and I wasn't even able to assemble them all the way because they were so poorly made.", 
    "This was one of those \"you get what you pay for\" situations. The chairs were defective, missing hardware and impossible to assemble. I had to return them.", 
    "Pretty good for the money.", 
    "I ordered 4 of these chairs not sure how they would look. They are so pretty that I came back to order 2 more. Very happy with this purchase. Oh and I put them together myself without much difficulty. You just need to make sure everything is lined up before you tighten the screws completely. If you have ever put together any furniture before, you will not have any problems.", 
    "These were a good buy. Very comfortable and smooth material.", 
    "These were easy to assemble and look great with the table. Comfortable and texture is great!", 
    "These chairs look great. We bought them because our dining room set has been discontinued but we wanted two more. These are neutral enough to go with what we already had, and they look AMAZING! Easy to put together, sturdy, and very comfortable. Super happy with this purchase!", 
    "We received our six chairs yesterday, having ordered them exactly 1 week ago. They arrived in perfect condition. We read the reviews about assembly, and agreed with them. The front legs went on quickly, but the rest took some finagling. The only thing my husband would suggest to other buyers, is to 'chase' the seat back holes with the bolts alone, to clean out unseen sawdust and debris inside the holes. These chairs are quite sturdy, and the color is great. I've been looking for a year to buy replacement chairs for our teak finish table, and could never match the color without ordering custom made. I finally gave up on searching for wooden backed chairs,and realized I would have to settle for upholstered chairs, thereby minimizing a mismatch in color with just the small amount of wooden legs showing. To my surprise, this 'cherry' finish actually is pretty close to the teak table, just a bit darker! I am delighted with them, they arrived just in time for a dinner party this weekend. This was also my first purchase on Overstock, and I am very pleased with the quality, free shipping, and the selection offered.", 
    "Love these, I was worried about durability but my 260 lb 6'2\" husband has been sitting on them for dinner everynight for three years now and they have held up \")", 
    "I am happy with these chairs (after having them for about 6 months) - they are elegant and added some dimension to our otherwise dark, antique feeling dining area. Assembly was a little time consuming but I like that there are no visible screws, which makes the chairs look more expensive than they are. They are slightly wobbly so I'm sure will need to be tightened a few times a year (especially before hosting a large dinner party), but that is my only complaint. Overall, great value and very nice looking chairs!", 
    "At the risk of sounding like Goldilocks, these chairs were \"just right.\" Just the right size to be that \"go to\" chair to add to the dining room table, living room seating, or pull up for extra chairs when people come over for movie in the TV room. Neutral, solid, stylish, comfortable. My husband and I assembled them both in less than twenty minutes.", 
    "I bought four of these chairs for my home because my husband has a broken tailbone and finds wooden chairs uncomfortable. These are quite comfortable for all of us; ranging from 4'11\" to 6'3\" (and 270lbs). Having read the comments about them being hard to assemble, we were braced. However, with two people we assembled them all in under an hour. The tips of do the back first, before the front chair legs was good. And, of course, don't tighten the bolts until ALL pieces are on and aligned and ready to go is always good advice. The only things I don't like about them: 1) at the seems there is some slight puckering. It's NOT enough to want to send them back, but it is enough to make an OCD person a little crazy... as is 2) the chairs are not exactly straight- meaning, it's not possible to have all four legs exactly flat on the floor at the same time. There is a fraction of an inch difference in the legs. This is NOT obvious if you look at them, nor is it uncomfortable or wobbly. So- I guess it doesn't really matter... however, if you are standing and you wiggle them they have some play. HOWEVER, for the price they are great.", 
    "A comfortable, large chair. Compared to other chairs from Overstock, these were hard to put together due to holes obviously drilled quickly into the wood, not with, say, metal inserts. But others have discussed this. The most important thing for me was that these look so cheap from behind --the seams aren't nearly as smooth as in the pictures, but rather wrinkled material. So they look great from the front and side, but if you're looking at the backs, it looks unacceptably cheap.", 
    "One leg on one of the chairs came in cracked; one leg on the other chair couldn't be screwed in... bolt just didn't fit.", 
    "just yesterday I had the time to open the large box and put the chairs together..there was so much cardboard unfortuatly I threw it away.. one chair is OK but not comfortable.. the other is not only uncomfortable but has a lump protruding out of the back.( it is hard and obiviously a design flaw.. the seams on the body are not balanced. one seam is on the edge and the other side 2inches in.. tell me what to do as I can not return but do not want to use them.. the lack of comfort is the worse part.. why sit in a chair that cuses back pain.. ?", 
    "These chairs far exceeded my expectations. Very simple to put together once you get the first one done. These completely change the look of my dining room table and everyone loves them. I can't stop starinig at them every time I walk by!", 
    "I ordered these chairs after reading many, many reviews. I agree with the posivite comments. These chairs came in two pieces. I was able to put them together pretty easily. I am 53, and don't have much experience putting things together, especially chairs. It went amazingly well. I used only the little tool that came with it. I think they look great in my dining room. I had planned on having them only on the ends, but I think I am going to put them all the way around the table. They are quite comfortable, and look nice. The only thing I would say, is that they are microfiber, so you can see the brush of the fabric quite abit. Its my formal dining room, and doesn't get used very much. More for show than go. So once they are smoothed, mine will stay that way quite awhile.", 
    "The chairs are just what I wanted. They are sturdy and blend will with my dinning charis. For the price they are a great value Had a friend help put them together, it was not a problem. Advice don't tighten until the end.", 
    "Assembly of back legs was extremely difficult, even with 2 people and a better tool than what comes with chairs.The holes were not lined up for the screws and even had some staples from upholstery in the way. Bought 6 chairs and all but one wobbles. Not sure would recommend for everyday use. In this situation they will only get occasional use.", 
    "I bought 6 of these chairs. The picture shows lighter but the color is much darker. That was my first shock. However, I was happy to have them within my budget. My second shock was when I sat on them the first time, I thought something might be under one of the legs. Then I found out the legs are not even so they tilt. After a week the screws started to come off. Every time a chair gets used, we have to tighten the screw of that chair. This is very frustration.", 
    "Pretty ,neat and not so difficult ot put togther, but since I am a large woman the legs weaken and need to be tightened often.", 
    "I liked the style and upholstery of the parsons chairs, but the actual color was several shades darker than the site photo.", 
    "I never write reviews about products. My wife really liked these chairs and was a bit skeptical. Eventually they came back in stock and we bought 4 of them. Shipping was very quick, and the packaging was excellent. I assembled each chair in less then 10 min. 2 of the chairs wobbled at first. I just loosened the front legs a little and sat on it. I re-tighten the bolts and everything was perfect. I am extremely happy with these chairs. They look awesome as well. Construction seems to be very good as well. My wife loves them. Thanks", 
    "I'm happy with my purchase. I have to admit they were a little challenging for me to put together. I came back to the reviews to read what other customers said, I admit I'm not good at putting things together. But once I re-read everything I was able to complete it by myself. As another review said - the screws are not all the same length so line them up before you start. I somehow lost one screw set so had to go to the hardware store, but they were easily able to find a match. I originally only wanted one chair for my sewing room, I was using a leather office chair with rollers and the constant up and down from sewing to pressing with the rollers plus my hardware floors I was afraid I was going to end up on the floor. This chair instantly dressed up my sewing room, it's sturdy and comfortable, just the right height and a bonus, I used the other chair in my bedroom for my vanity. All for much less than I would have paid for one chair at a department store. Overall I'm happy.", 
    "The chairs were not complicated to put together, but the allen wrench screws are a bear. They would be so much easier with traditional screws that you can use an electric screwdriver with. My main complaint is that after all of the careful assembly, both chairs wobble due to uneven leg lengths. Aaargh. That really makes them a terrible purchase and a frustrating addition to our dining room.", 
    "They look just like the picture -- more of a medium wood with a touch of cherry color. I got them to match a medium wood table and they work great. They do wipe clean easily, except for oil or grease. Perhaps with a special cleaning product you could get grease out. But I use them every day with 3 kids and I think they will still look decent for a while. It took my husband about 3 hours to put together 6 chairs and they are quite sturdy. As with other reviewers, a couPle of chair legs were a bit shorter, so when we added felt pads to all legs we doubled them up on the shorter legs and now they are perfect. Did I mention they are extremely comfortable? I am very glad I bought them!", 
    "I've had these chairs (bought 3 sets of them) for several years in my beach home. They are great just need to tighten the legs every season.", 
    "I was originally looking for upholstered folding chairs for my condo, when I came across these chairs. I was so impressed with the reviews and the price, that after thinking about it for a few days, I decided to go ahead and buy them. I am so glad I did. Although not exactly the same style as my dining chairs, they coordinate perfectly. I now thave both of them at the dining table and put 2 of my dining chairs on the other side of the room, creating another little seating area. The packing was great, better than most other items I've purchased online. Assembly was very easy, even though I am a 69 yr. old female who lives alone. About half an hour total for both. As I was assembling them, I was impressed with the quality of workmanship, even on the underside of the chairs. Although light and easy to move, they are very strong and sturdy...and comfortable!!! Exactly what I neeed for my guests who have some health issues. And my dining area looks so much more sophisticated now.", 
    "These chairs are absolutely beautiful -- they do look way more expensive than the price. It was not hard to put them together after we completed the first one. Some of the hardware was missing and we had to improvise. One of the chair back's fabric was sagging. One call to customer service and it was replaced within a couple of days. Although some of the reviews talked about an odor on the fabric we did not experience that at all. These chairs are excellent value for the money and the customer service is outstanding.", 
    "These chairs were exactly what I was looking for, and were very easy to assemble!", 
    "These chairs are a bargin. I have been looking for new chairs for my dining room for some time. I was a litle leary about the durability and comfort at first, as I have never bought furniture on line before. I knew there would be some assembly reguired...this was not a problem. They arrived on time and took me about 1 hou to assemble 4 chairs. I used a power drill with and allen wrench bit, this made for a fast assembly. They look elegant and are very comfortable. Love them!!", 
    "We bought 6 chairs. We read the reviews about the nightmare of putting them together. Pretty much true. It is very difficult to line up the holes to screw in the screws. My husband did two at a time and it took over an hour each time. One chair has a leg about 3/4 of an inch too short. We didn't want the hassle of returning, so we just put something on the bottom of the leg. These chairs are comfortable, but as I said before, we will see how they wear. Probably wouldn't get them again, but they work for what we wanted them for.", 
    "I just completed assembling four of these chairs and as other reviewers mentioned they look FANTASTIC! Yes, they smell a bit; yes, some of them were easier to assemble than others (two went together very easy and sat level on the floor, two I had to jiggle the screws a lot to get them to fit into the threads and one leg was a bit shorter on each of the two chairs) but I took the advice of all the previous reviewers and used Fabreze for the smell and added 1\" felt chair tips to each leg that I purchased at Lowes and for the one shorter leg, I added an extra 7/8\" felt tip that I purchased at the grocery store. It works; they look great, feel sturdy, smell good and sit level. For the price and a little extra work, you will not be disappointed in buying these chairs. Oh, by the way, I am using these chairs on hardwood floors with an existing glass rattan table - my original \"fan back\" rattan chairs were dating the room and were huge. So glad I ordered these. Overstock also delivered on time and as promised.", 
    "I bought this set of 2 tan chairs as well as a matching set of 2 red chairs to put together at my dining room table, and they look amazing together. Very easy to assemble and look much more expensive than they are. I'd definitely recommend these chairs!", 
    "These chairs are great. Same color as in the picture. They matched my cherry wood table perfectly. Very solid, comfortable and easy to assemble. I would recommend these chairs to anyone.", 
    "Had no problem with assembly. I expected to having read and studied the previous reviews. Much to my surprise, no problems! I laid everything out carefully, counted it, read the directions which are so easy to follow it's almost elementary. Everything was there and packaged beautifully. I assembled everything in the right order and it went perfectly. My only complaint is that one leg is a teeny bit shorter than the other three on both chairs but I fixed it with a little plastic round chair leg protector---evened it right out. Bear in mind I am a person who rarely buys anything unassembled---but I loved these chairs and for their price it was too good to pass up. I must admit, I was very pleased with ease of assembly. I love these chairs---very comfortable and great looking.", 
    "Was pleased to see the chairs matched description perfectly, however, I wished the quality had been as good. Taking only one chair from the box, in order to see how it fit under my dining room table found several defects. One leg was completely scratched from top to bottom, the stitching on the back of the chair was crooked and the holes drilled in the bottom of the legs for inserting chair protectors were all off center. This would cause all the legs to be off balance. This was just on one chair. I didn't feel I could trust the others to be any different and did not want to keep them. The fabric was nice, leg color good and comfortable.", 
    "The delivery was fast, assembly was easy but the materials and construction of these chairs are not that impressive. They do look OK, I guess you get what you paid for, but I have a feeling the paddings are going to give after some usage. The color is darker in real life, more life taupe and the microfabric is thin. I was unable to assemble all the screws in 3 out of the 4 chairs I purchased, somehow the holes were either blocked by the fabric or the screw threads could not line up. I probably would not recommend it if you are looking for a long lasting and good quality piece.", 
    "When I purchased these chairs, I was not expecting TOP quality because the price was so reasonable. But, I did not expect them to be so seriously flawed. The holes do not match up exactly which makes assembly challenging and, in some cases, requires some resourcefullness just to get it together. We had to use a drill to tweak some of the holes so that the bolts would actually line up. We ordered 6 chairs and 4 of the 6 required some handy work to get them together. They do look nice, though, which is the only reason I gave them 2 stars. If I had to do it again, I would pay more money for more quality.", 
    "I am so pleased with these chairs! They look beautiful at my kitchen table! They are completely solid.This is my first overstock purchase and I was concerned as to the quality of the chairs. I had shopped around at several up-scale furnature stores and similar chairs were $200-300.00. These chairs were actually more comfortable than some I tried out.My husband put them together and he is very handy. it took about 20-30 mins per chair and like lots of kit furnature took a little finessing. You need to put the screws in but don't tighted then down until all are aligned properly. then tighten them a little at a time. He only used the allen wrench because he didn't want to strip the threads but he is experienced. I probably would have needed a power drill to get the screws tight.", 
    "These chairs are just as nice looking as I was hoping for, and a steal compared to similar chairs at most retailers. However, the directions leave something to be desired as they fail to mention that there are THREE different bolt sizes--beware using the wrong bolt and overturning!", 
    "After much searching, I ordered a pair of these chairs based on the positive reviews on O'Stock. They are a good value for the money - comfortable, sturdy, and nice-looking. They were exactly the look I wanted. The workmanship is about average - particularly with the upholstered part of the chair - but for the price I won't complain! I took others' advice and lined up the legs before assembling, then made sure I stood the chair upright before tightening the bolts all the way - the chairs don't wobble at all. Tightening 11 bolts/chair with an allen wrench is a bit tedious, though! All in all, I'm pleased, and I just ordered 2 more pairs to complete our dining room set.", 
    "I am very happy with the appearance of these new chairs. After a couple of days of use it will be necessary to re-tighten the legs. Don't throw away the allen wrench that you get with the chairs you will need them again. Fabric is nice looking but a bit bunchy at the corners in the back.", 
    "These chairs look great. The assembly was a pain as others have already mentioned. I bought four and the first two were difficult but the third and fourth were not bad once I figured out what I was doing!", 
    "The chairs were pretty and easy to assemble and look nice with our dining room set, but these aren't chairs that will last more than a few years. We wanted something neutral and that's exactly what they are. Good value for the $$. Nice microfiber seating - comfortable.", 
    "really nice chairs. well made. happy with them", 
    "I bought a pair for the holidays. They are much prettier and more comfortable than a folding chair.", 
    "Very comfortable and easy to assemble. Would like 2 more", 
    "Very comfortable and plush chairs. Easy assembly.", 
    "The chairs look great . They are comfortable to sit on.I did have a problem with one set of legs. Overstock sent new legs immediately. I also had trouble with 2 of the chairs. The chairs had one leg that was off the ground. Overstock sent replacement parts right away. Dealing with Overstock was a pleasure. Two of the chairs needed to be fixed and 2 were perfect. That is why I gave them a good.", 
    "Pros: The chairs are beautiful, comfortable and match our table better than we could have hoped. They were also pretty easy to put together with the following exception.Cons: They were a little difficult to get the legs evenly distributed so that they do not wobble. Several of them are still pretty wobbly despite our best efforts. Also, it appears that it wouldn't take much to chip up the legs based on one of the legs being slightly blemished from shipping.", 
    "Great chairs and I personally found them easy to assemble. One leg was cracked but the Customer Service people are taking care of getting me new ones to replace it. All in all, comfortable and look better than the price would suggest.", 
    "They will do the trick but you also get what's being paid for", 
    "I bought these as a present for my elderly mother. She loved them and says they make her dining room look like a magazine and they are very comfortable.", 
    "I bought these chairs a very long time ago and we sat on the every day. No complaints. They were comfy and the fabric held up well. Easy to clean up minor spills too.", 
    "Had to return 2 out of the 4 chairs could not put together because screws would not line up.", 
    "Surprisingly comfortable and easy to assemble", 
    "I received my chairs and they were everything that I was looking for. They were easy to assemble and look so nice. I liked them so much I have ordered four more. They are comfortable to sit in and look nice also. It really perked up my old table that I absolutely love.", 
    "Every dinner guest who has used these chairs has commented on how comfortable they are. We had previously purchased 3 sets (6) of them and now will have 8 chairs at our lovely table. Each of the other items ( a bench and a side table) have worked well in our home. Overstock has helped us transition from a traditional style to a more modern transitional style since our move to Florida. Now, I can enjoy my blended Southern tradional look and sleek modern look in our new home. Thank you for these great products.", 
    "great in my dining room with my custom made table and benches!", 
    "Pretty, just don't feel like nice, solid furniture", 
    "Love this chair, very comfy. Would have given five star but the color (gray) is lighter than what it was in the picture.", 
    "I purchased these for my daughter's dinning room table and she is in love with them. It has been about a year now, and they are still like new. High quality product!", 
    "They look really nice. Got them for my dining room. Haven't gotten the chance to use them yet.", 
    "We ordered three sets of two chairs. These were easy enough to assemble, look nice and are comfortable. I was a little disappointed to discover what I first thought was a piece of lint, but upon further scrutiny appears to be some sort of permanent stain or mark on the seat. Keeping the chair but wish the packer had a more rigorous inspection process.", 
    "Very nice and heavy chairs. They are very pretty to look at and comfortable to sit on. Definitely upped the looks of the dining room.", 
    "I originally bought 4 but bought 2 additional ones. Look gorgeous. Wears well. Amazing value.", 
    "These chairs are comfortable and were easily put together", 
    "Bought 2 of these and one went together like a breeze, but the other one didn't line up well at all. So, kind of a mixed review on this one. Other than that they're nice.", 
    "These chairs are very sturdy and add to my decor in my dining room. I purchased these to replace some old chairs and it gave a new life to my dining room set. They were easy to put together after doing the first one. I did them myself.", 
    "We love these chairs and everyone of our guests have said they like them. At first I did not think that were comfortable but after a week they grew on me. We don't have small children or pets so the light color is not an issue for us. My husband is very handy and he had a tough time putting these chairs together - we were warned. He cursed and fixed the errors got new screws re-drilled the holes where necessary and go it done. We got 6 of them so by the third chair he learned. Great chair - great price", 
    "We purchased these several years ago for a conference room. They have held up great! clean easily and remain sturdy although we have tightened the screws once or twice when the legs became wobbly. They are used every day and often several times a day by groups and classes. Totally worth the money spent.", 
    "Nice looking and comfortable", 
    "these chairs are beautiful and wear well. I love them.", 
    "I purchased these chairs to match a wood dining room table. My guests think it came as a set; the height is perfect, the wood matches, they're comfortable and very easy to clean. HOWEVER, pre-drilled holes could be lined up a bit better, and the assembly directions only get a \"C\" - the bolts included are 3 different sizes - it's very easy to put the wrong bolt in the wrong pre-drilled hole, cracking the leg (my brother tried to \"help\" with the assembly and discovered this unfortunate fact). The directions caution against using a drill; if you're planning on assembling more than 1 chair per day, be prepared to get blisters in the palm of your hands from twisting the \"L\" wrench.", 
    "I have 4 of these chairs for the dining kitchen area. I needed light use chairs and these fit the bill. The price was right!!!", 
    "The quality of the chairs were okay. We ended up sending them back As they didn't go very well with our dining room table. Customer Service was so very nice regarding the return. What a great company!", 
    "These were very big for my table but my faultEasy to assemble. Very comfortable to sit in", 
    "A little difficult to put together. The screws have to line up exactly or it won't work, but when they finally are in place and tightened down, you have a very nice chair. The seat is large and comfortable. They look very good.", 
    "I bought based on great reviews on overstock. Ordered two sets (4 chairs). got the yesterday. One of the chair back has a black grease spot. So now the hassle of sending it back. However, my ranking is not low due to that. Workmanship is barely fair. The wood is not sanded properly and splinters are all over the chair bottom. I had to carefully wipe off each chair for prickly splinters with heavy gloves on. Instructions are OK but the design is fair to poor. I have bought chairs online before and typically assembling chairs are very easy. Not these. holes are not aligned, hardware is greasy and all the chairs wobble after assembly. I tried \"the bang the short leg with a hammer\" routine suggested in the instructions with no impact whatsoever. I'll just put an extra pad under the short leg and live with it. Overall, I would NOT buy these chairs even 30-40% less than what they are selling for.", 
    "We received these with parts missing. I was able to get what I needed at a hardware store 20 minutes away, but needless to say it was an inconvenience. These chairs are fairly comfortable to sit in, and they're very lightweight, which could be good or bad, I guess I'll find out the more I use them.", 
    "The chairs are nice quality and the wood stain matches our other furniture well. My only less than positive comment concerns the legs: 4 out of 6 chairs right front legs are approx 1/4\" shorter than the other legs, therefore, had to be built up some to sit level. Only the 2 front legs required assembly per chair, and they were identical (no right or left leg). Not wanting to return the chairs, I built the legs up slightly with pads. You may want to pass along to manufacturer. Thank you.", 
    "We've had these chairs for 1 year now. They are all assembly-required. That wasn't too bad once you got one put together. The fabric is top quality and wiped clean with a damp sponge or towel. What I don't like is that we have to tighten the bolts every month because they loosen up causing the chair to be loose. The second issue is the seat cushion stuffing is breaking down in 3 of the 8 chairs we ordered. It was a comfortable, supportive seat before. Now you can feel some of the framing through the cushion because the stuffing has flattened. If you need something to use every once in a while - buy these. If you need a chair for daily use - find another chair.", 
    "These chairs look really nice once you finally get them assembled. I purchased 3 sets of chairs and two of the chairs went together easily. The others were a real struggle with the bolt holes not lining up, being obstructed by wood splinters or having glue on the threads. One of the chairs had hairline cracks in a leg and another had a cracked angle bracket the broke when tightening the bolts. I'd say the quality is inconsistent at best. I was able to remedy the situation with Overstock but the experience was pretty frustrating.", 
    "These chairs are nice looking, however, the craftsmanship leaves something to be desired. Next time I would elect to spend more for a higher quality product.", 
    "First chair took us an hour to assemble, but the next three were easier. Once you figure out how to wiggle it while screwing.☺️", 
    "these chairs are so comfortable,am going to order two more.", 
    "Ordered these chairs to replace ones in our motorhome. The color is perfect, the legs match our cabinetry and my husband was impressed with how well made they are. The detailing is very nice and they are very comfortable.", 
    "I returned these chairs. They looked nice and they were easy enough to assemble, but there is a slight recline when you sit in them that I found to be quite uncomfortable and awkward for a dining chair", 
    "Ordered the cream color and purchased slip covers with it. Great longlasting buy", 
    "Very comfortable, easy to assemble, looks good in my dining room", 
    "have used these for 3 years with 3 young boys, held up well so far and don't show stain! Easy to wipe down, did scotch guard them but only once.", 
    "Nice looking chairs (I bought two). The first was challenging to assemble. It took about 30 minutes. Once, I figured out how to do it, the second chair only took 10 minutes. Happy with my purchase.", 
    "I bought 4 to match my previous chairs. They arrived on time and look good, however the color wasn't what I expected so I had to return them.", 
    "the chairs are awesome. They are a pain to put the first few together until you get the hang of it..women have more patience doing it while men want to man handle them and use power tools. So some of the the legs are shorter that others, I'm not fighting it I bought felt pads to put on the short ones. The directions show other ways to fix the problem I just want 8 nice chairs for Thanksgiving and now I have them!", 
    "I ordered a total of 4 of these chairs and I have never had such a difficult time assembling anything! I consider myself a pro at furniture assembly and usually I don't listen to reviews that talk about assembly problems, but please be warned. Screwing in the bottom seat to the base was extremely difficult. Sometimes the holes don't line up and other times the screw just wouldn't fit nicely into the hole. It would get stuck, which would require re-positioning the bottom seat cushion, unscrewing to rescrew and try again. My husband, the handyman, also had an extremly difficult time. Hours of try to get the proper placement. Even when we assembled them, all 4 chairs have uneven/wobbly legs. The instructions say to hit the short leg with a hammer to loosen the leg so it will drop down and even out. First of all, it is impossible to hit the leg with a hammer without damaging the leg. Second, this doesn't even make sense. The screw holes were placed to high the leg so no amount of hitting the legs with a hammer is going to change the length. I got furniture pads to even out the legs, but it is still not perfect. The design of the chairs itself is okay. The chairs are comfortable and feel solid, with the exception of the uneven legs. Despite that, I would never recommend these due to the extreme assembly hassle.", 
    "Easy to assemble, strong, fast delivery, comfortable, and replaces the chairs of my dinning room set perfectly!", 
    "I bought 6 of these chairs - 4 solid red and 2 striped red for about $350. I have received nothing but compliments on their beauty and awe at how sturdy they are. These are not cheap chairs; just very inexpensive. I'm using them in my condo in Mexico. The red and the stripes are lush; a true red. I love them and recommend them.", 
    "These chairs were pretty easy to put together and look good when you are finished.", 
    "Comfy. Very easy to assemble. I got two blue chenille and 2 silver-gray chenille. Love the espresso finish. Perfect for my breakfast room. Color of fabric true to website photos.", 
    "comfortable chairs and easy to put together. colors match the room.", 
    "I put these chairs together myself and it was very easy. I must have them at least 2 or 3 years and they look as good as new. Very easy to clean and super stain resistant.", 
    "The box that the set of chairs came in were not heavy, only cumbersome due to the length. The chairs came packaged very well. The upholstered parts of the chair were covered in plastic, to include the back of the chair that has the legs already mounted and the front wooden legs were individually wrapped and placed together inside a small separate box which fit in a space in the larger box that held the two chairs. The hardware and tool were very easy to find and came in a double wrapped and sealed red package that was stapled to the underside, side of the chair's seat. The instructions were covered inside, underneath with the seat. We purchased six of these chairs and by the 3rd chair it was quite easy to put together. Just remember to finger tighten every thing first THEN begin to tighten each bolt a little bit at a time with the tool provided. One person can put these together, however it goes quicker with assistance. These chairs are very comfortable! The contour of the chair fits to your (our) body nicely. The color is identical to the picture. The fabric is smooth and soft, quite durable. Clear and clear-ish liquids clean off easily by dabbing a dry cloth (that's all we've spilled on them so far) on the wet area. The only issue I have found is having to re-tighten the bolts that attach the back of the seat to the front of the back (the part that your back rests up against). This is probably because certain people in our home like to lean back in chairs... tsk, tsk, tsk. I've only had to tighten bolts on two chairs once in the past 4 months. On hard wood floors they are a tiny bit wobbly even after adjusting them different ways, however when we sat in them they level out. I've received many compliments on the chairs about how much better they make the dining area look and how much more comfortable they are than the hardwood chairs we had before. My family and I have been very pleased with these chairs!", 
    "Bought these for my diesel pusher. Very easy to assemble, and designed to be very stable. I Scotchgarded theme and expect many years of service. Very satisfied.", 
    "These chairs look really nice in our dining room. We has a visitor come over and thought we has got a new set so it changed the whole feel of our room. Not a heavy as we would like but for the price worth it. Had a problem with one of the chairs but Overstock worked with us better than we could of ask for.", 
    "I needed some nice new chairs for our dining room and these have fit the need perfectly. They're simple but classy pieces that enhance our home nicely.", 
    "I purchased 6 chairs. They are comfortable, fabric is beautiful, and legs match my table I already had.", 
    "I ordered 8 of these for the dining room ad they look very nice. The microsuede is very forgiving. The only warning is that they would be great with a little more padding in the seat.", 
    "We love the chairs. They really improved the look of our dining room.", 
    "After reading the other reviews, we decided to take the plunge and purchase six of the blue chenille dining chairs. The price can't be beat. Seriously, these chairs look like they cost twice as much. We found them somewhat challenging to put together, as others have described. My hands hurt so badly from using the small wrench to assemble each chair. It took between 45 and 60 minutes for each. I would probably do it again though, because of the great look and price. The pro of these chairs is the look, the comfort and the price. We also find the blue color to be unique and beautiful. These are not your typical bland beige chairs. The blue is a rich blue, not as bright as it seems in the pictures. They go beautifully with the wood table. The cons are the assembly, the offgassing/smell (reported in other reviews), and that the underside of the chair is raw wood not covered by fabric. Even with the cons, we are very happy with our purchase.", 
    "I purchased 6 chairs. It took my sister and I less than an hour to put all 6 of them together. The chairs appear to be very sturdy and are very comfortable. I highly recommend these chairs!", 
    "I like the chairs very much. They were hard to put together. But I have a husband who is very handy. They came sooner than expected, which was nice. They are comfortable. Thanks Overstock for having a place to buy on line.", 
    "I wish i could write the great reviews that I see on here. I just don't have the time to get into specifics....chairs look amazing! Great qualityVERY EASY TO ASSEMBLE I BOUGHT 6", 
    "Love these chairs for the price, and the fabric wears great. Even greasy stains come out with a bit of soap and water without leaving a trace. Construction is fair and I've had a few of these chairs give out because the quality control on the leg attachments isn't adequate. With all that said, I'm still going to order another 2.", 
    "easy to assemble, the wood is a nice medium brown/red color, the fabric is very easy to clean.", 
    "I was just able to put together my chairs and I am so happy with them. The chairs are sturdy and the fabric and material was exactly like they looked in the picture. My dinging room is fabulous! There was one stubborn screw that was very hard to put in during installation but I am happy with everything else. I would certainly recommend Overstock when purchasing online.", 
    "These chairs are perfect for our dining room furniture. The seats are soft yet comfortable and give support to your back when you are seated. Pretty chairs that are now part of our redecorated dining room and .............we love them.", 
    "These chairs are so comfortable. I ordered them for our kitchen and the color is dead on. The price for 2 chairs was out of this world. One leg had a crack but the coustmer service dept fixed that right away. I love overstock you people rock.", 
    "Beautiful chairs. Great price. Were hard to assemble. I had to have my boyfriend do it who works in carpentry, because it was hard to line up pieces and fir in screw. But, pleased with end result.", 
    "These chairs are very comfortable and sturdy to sit on. The color of the legs are a little lighter than pictured .", 
    "We love these beautiful, comfortable dining chairs to give our home an updated, contemporary look!! Excellent product for the cost.", 
    "I love this chair. I have a 7 and 9 year old. It wipes clean even though I still make them use a towel on it when they are eating. I had to purchase a few extra bolts from the hardware store because a few were missing.", 
    "Comfortable, and after 2 years they are holding up well.", 
    "I was a little worried that we would have difficulty putting these together, my 15 year old son did it while watching a movie. Just follow directions and wait to tighten until it's all together. He didn't even go out to get the screw gun. Beautiful well made and a great price. Helped transform my dining room into a comfort area. Thank you!", 
    "I liked so much I bought them again. Adds additional seating to my dining room table without spending a bundle", 
    "Bought three sets of two chairs. In two of the three instances parts were missing or otherwise incomplete. One chair had a shorter leg which required propping up to balance it and prevent wobbling.", 
    "Outstanding purchase... look great and are very sturdy. Would buy again for sure.", 
    "I bought these chairs in the blue.. Very very comfortable .. Love them", 
    "these are cute chairs but the fabric is a bit cheap looking. Also have had much trouble assembling them due to the holes not aligned. Will persevere and hoepfully like them more in the end.", 
    "These chairs are very elegant and do wonders for my dining room. Very pleased!!", 
    "Apparently 1 chair was a return or display as it had been previously put together. Bolt threads were somewhat stripped but I got it together OK. It doesn't sit a flat on the floor as the other but not a deal breaker.", 
    "Chairs are comfortable, stylish, pretty fabric. A bit tricky to assemble if you hurry so take your time", 
    "We were a little weary of ordering these chairs sight unseen. However we took the chance and were very happy we did. These chairs are well made and sturdy. They do take a little time to assemble but nothing to difficult. The fabric seems durable but only time will tell. Shipment was quick and the items were received well packaged. Overall a great value", 
    "These chairs are very comfortable. I ordered 4 of them and two of them arrived with different sized legs. I think it was one from each set, so we assumed sending them back wouldn't do us much good. We bought some felt pads and evened them up. Work good now. We scotch guarded them as other reviewers had mentioned. So far so good, I have two boys and the only trouble we have is that it's a little static cling to crumbs! All in all I love the colour and brightness it adds to my eating space and have had many great compliments on it already!", 
    "The Chairs look great and are really comfortable. I am a 70 year old woman and as I read reviews, I knew I would have to pay careful attention to the chair assembly. Honestly, it was pretty easy. I have done a lot of knock down furniture. The secret was keeping the 90 degree angle and starting with all of the screws for the back in their holes, even if not fully engaged. I sat on the floor with the back of the chair on by legs and held the seat and front leg portion in position. Tighten all screws a little bit, go back and do all a bit more...repeat until all are fully tightend.", 
    "Chairs sit well and were just what I was looking for.", 
    "Love the fabric, the detail and the comfort of these chairs. They were a bit difficult to put together but once assembled, I was truly impressed!", 
    "stylish and beatiful! love them!!!", 
    "Ordered 2 sets of these chairs (4) for my dining room table & they are a lovely addition ( went way past my expectation), what a terrific buy & they were delivered fast (in 3 days)!", 
    "I loved how comfortable these chairs were for my waiting room.", 
    "On a whole, the four chairs look very nice. They do compliment the room. However, putting them together is another story. You do need two peopleto attach the base to the back, and then fitting the screws into the holes, OMG, I still have one more to finish.", 
    "Very nice set of chairs for the price!", 
    "Easy to assemble, good instructions, comfortable. Exceotional quality for the price.", 
    "For the price I had not expected these chairs would be so nice. We purchased a set of the light brown microfiber. I was worried that the color might be too dark but it is a very pretty soft sandy beige. Not too much yellow tones -- more neutral.Even though I thought these might be a bit cheap looking due to the low price, I bought them anyway because they were the only ones I could find with cherry stain on the legs. Our dining set is solid cherry with 4 all-wood chairs. I couldn't really afford to buy more of the wooden chairs plus I thought mixing in some fabric chairs would be more attractive (and a LOT cheaper!) These fit in so nicely that we bought a second set. They blend in most anywhere so also make nice extra seating for guests in the living room or game room.Maybe we got lucky but our chairs were pretty easy to assemble. We rested them upside down on another chair to hold in place while we screwed them together.We have been using them for over a year ... with young grandchildren as frequent guests. They have held up well and they are quite comfortable. Joints have not loosened at all. They have been easy to wipe clean which is a nice bonus considering the light color we chose.All in all we are very happy with this purchase and would definitely recommend them.BTW: If you look around you can find cloth slipcovers covers for these type of parsons chairs that easily change out the look if you redo your room. We had planned on getting some to dress the chairs up a bit more but found we liked them as is. I plan on getting some just to keep these chairs looking nice.", 
    "Love the chairs! Difficult to assemble, yet have forgotten this, as they look so good, and are very sturdy. Sprayed with scotchguard, still look spotless.", 
    "Comfortable and a good bargain", 
    "With a little patience they are not to hard to assemble. One was missing a few washers which I picked up at ***** for pennies", 
    "no quality control. one chair is excellent. one is a pos..i took the legs off 3 times, still the same..trouble shooting says to use a hammer on the glue blocks...did not help..no can only be used for relative who has had alot to drink.", 
    "I have been looking for chairs like these for a while and finally found them. I found them easy to assemble. These are comfortable, look very nice, and modern. The legs are a little darker than pictured. I recommend these chairs.", 
    "These are ok. I don't think they would hold up long with everyday use.", 
    "Good chairs for the price. I like the microfiber because they are easy to clean with three children. Easy assembly. Put some weight on seat and have someone else tighten seat/leg screws, chairs will not wobble. (I've notice other reviews state chairs uneven or wobble) Easy to match to other chair colors to add some color. Although packages arrived pretty banged-up, the chairs were in fine shape. Nice looking chairs for an inexpensive price", 
    "The chairs are good quality and look great with earth toned decor. One problem that I had was during the assembly, the wood on a few of the legs doesn't leave enough space for the screws. So, some screws and bolts are only partially inserted, however the chairs still seem to be sturdy.", 
    "About 5 years ago I ordered similar chairs. Everything was fine. This time I ordered matching bar stools and chairs. See stool review under separate review. Chairs are okay, much less quality than previous chairs bought. I will not let some of my heavier friends use these chairs, I suspect they will not last long. They are 'rickety' already. Had to use glue to get them put together, holes and screws did not line up well enough to make the chairs 'solid'.", 
    "Previous reviews almost stopped me from ordering these chairs. I'm glad that I got them. The chairs are comfortable; and gave my room an instant make over. I'm very pleased with this purchase.", 
    "I purchased 10, and I'm so glad I did! I placed one of the extras in my bedroom and another in the hallway by a chest. They are so adaptable. Can't beat them for the value and flexibility. Color is true to photo. Haven't had a stain", 
    "Love the color and great to sit on. Had to re-drill one hole for the screw.", 
    "Lovely, but 1 chair had holes that didn't line up and putting in the screws was very difficult...frustrating.", 
    "These chairs did not disappoint. Easy to assemble IF you follow the instructions. My husband is a tall/large man - no worries about the chair supporting 250+ lbs. Color is a great neutral and we couldn't be more pleased.", 
    "These looked great with my other chairs and table, but legs got wobbly and screws became stripped so legs could not be tightened.", 
    "I wanted to update my dining room. These were perfect. They were easy to put together and look great. The was spot on. Other reviewers noted that they were not durable.One out of the 6 I purchased one of the backs of the chairs became loose and was not able to be repaired. I do not believe that they will hold up if used everyday or could stand rough use but for my dining room they fit the bill", 
    "These are fantastic for the price. Very comfortable, easy to put together. Nice color and good fabric, just like in the pictures. Highly recommended, especially if you live in a rental and need something to tide you over for few years.", 
    "very nice extra chairs. I keep one by the door in front foyer for those who need to sit while putting on shoes.", 
    "We bought these chairs to go with a drop leaf dining table for our new dining room. They are very durable, comfortable, and fit many of the Parson chair slip covers. I highly recommend them!", 
    "Got an extra set to go with chairs I bought over five years ago at JCPenny. And they match. Pretty much the same chair - what you would expect and more for the money.", 
    "My husband and I purchased four Jofran dining chairs as part of a set five years ago in a cherry finish. Needless to say, when we recently wanted to add two more chairs to our set, the ones we had purchased were no longer available. These tribecca home parson chairs are PERFECT. The color is beautiful (and matches our set almost exactly). The microfiber is soft, and the seat is very comfortable. My husband had no problem putting them together, and they are gorgeous. We get tons of compliments on them every time we have guests over for dinner.", 
    "These chairs are sturdy, comfortable, and really updated the look of our dining room. Assembly was a bit involved - but not by any means impossible. All in all, extremely happy with this.", 
    "Went together easily - comfortable and sturdy. Makes a nice accent to the ends of my dining room table coupled with the Tabouret Vintage Finished Metal Chairs at the sides - casual but elegant.", 
    "I love my chairs, they are beautiful but...the underneath looks slightly unfinished. The wood is sort of rough . My intention was to by something plain to highlight my dining table very unique single piece of wood with a matte finish. My table is modern with pewter legs that go like a rectangle, I spent a lot on this and wanted plain chairs which fit the bill, now my dining room will be perfect with the eight chairs, my table is 96\" long.", 
    "Looks beautiful and comfortable", 
    "Using these in my dining area and they are nice and strong, too.", 
    "Nice, but not as well made as the same chairs but in the brown stripe print.", 
    "Beautiful color and sturdy. Was not to difficult to put together after we got the hang of it.", 
    "Received all 6 chairs in perfect condition and they were super easy to assemble. We didn't have any of the problems with the assembly that other reviewers experienced. They are exactly what I wanted and the price can't be beat! Love them!", 
    "look FAR more expensive than what they cost. Very comfortable. Will definitely be buying more. Great value!!", 
    "I put these in my dining room and they look lovely! They don't get a lot of use but I have no complaints. The price is right!", 
    "These chairs matched my new kitchen cabinets perfectly. They were true to the picture. They are extremely comfortable and durable. Assembly was easy.", 
    "After reading other reviews I was slightly hesitant to order but the price was right so I figured I'd take my chances. Although they did have a fairly strong odor it quickly subsided and I had very little difficulty putting them together by myself with only the allan keys given. Hosting Christmas dinner and got many complements in their look and comfort.", 
    "These chairs are beautiful! My husband put them together with no problems, and he likes them, too. The only little thing is that one chair can't be leveled no matter how we've tried. Small inconvenience. May even order another set so that we have a few extra \"just in case\".", 
    "I was a little nervous to order these chairs at first because I needed 6 of them but I was pleasantly surprised. They are fairly comfortable to sit on (which is a big deal for me) My husband put the legs on in just a few minutes without any problems (disclaimer: he is very handy and has every tool known to man) The fabric seems to be fine -- so far no spots for such a light color. All and all, I am very satisfied with this purchase and would recommend these chairs if you have no young ones or red wine drinkers :)", 
    "These chairs are comfortable and beautiful.I had my own set of Allen wrenches, the kind where there are around 10 and you just tip out the one you want. Using my wrench made the put together process about ten times easier than the little wrench included. It took about an hour to put all 4 together.I am using these chairs with a table I already had but repainted, and the chairs make the set look gorgeous.", 
    "I am staging a home for sale. I needed some new chairs to go with the clients existing table. The chairs were easy to assemble and did wonders for the look. I buy many things from Overstock when I stage homes and often sell them again right with the house.", 
    "nice chairs, comfortable, alittle hard to assemble back legs but worth it", 
    "These chairs are exceptional! They are extremely sturdy as well as fashionable!", 
    "I ordered 8 of these chairs for my dining room table. They came within 5 days all in excellent condition. My husband put them together and while it was time consuming it wasn't difficult if you know a little about a screw driver! The color is perfect and I couldn't be happier with them for the price they are a great buy.", 
    "Very nice chairs...we got them to replace the ones that came with our motorhome.Very easy to assemble, especially if you cut off the long end of the allen wrench an put it in your drill.All the holes will line up if you take the time to wiggle and properly align.", 
    "The chairs look elegant and are very comfortable. Definitely a good buy. I am not handy but I read the tips on how to assemble on the reviews. Assembly was not too bad.", 
    "I love these chairs! They are exactly the color I was looking for including the leg color. I was nervous about putting them together after reading some of the reviews but they were not that hard. You just have to make sure you line the screws up before screwing them all the way in. They are a great deal for the price and do not look cheap at all. They are in my dining room which does not get used that often and I have only had them for a few weeks so I can,t speak on how well they will hold up.", 
    "They are not as good a quality as I thought they would be but I do like them.", 
    "I bought these chairs for my son and daughter-in-law to use in their new home. Although they are not in actual use yet, we opened the box to examine them and were quite pleasantly surprised at the top quality construction of the chair. It is well padded and the material is as pictured. We have experience with microfiber on our sofa so we are pretty sure that they will work out. We read all the previous reviews about the chairs before purchasing and we will update this review when they are in actual use.", 
    "These chairs are nice. They are very sharp looking. I get compliments every time somebody walks through the door. The color is a little darker than I thought they would be....definitely tan. Pros: super comfortable, look great, the price was certainly rightCons: slightly annoying to put together (takes a while to rid the wobble), darker than I perceivedOverall- great product!", 
    "Of course bought sight unseen, but I must say these are just as described. They are beautiful chairs with my black and cream rug with a glass top table they are really top drawer. They were not difficult to put together as some as said at lease we did not have a problem. We still have two to put together but after putting together four and having no trouble I don't anticipate any problem for the final to. I would definitely recommend these parsons chairs.", 
    "Easier to put together than other reviews led to believe. Look great at the table and I am glad I purchased them.", 
    "I am pleased with these chairs. The color is a nice greyish tan, a good neutral. The chair was easy to put together and is sturdy.", 
    "I am so happy with this purchase. LOVE these chairs. They look beautiful in my dining room. They make you want to go and sit rather than pass it by. They are very comfortable. The color was a bit darker than what I expected but I like it even more. I really have nothing bad to say. Would highly recommend them! You simply cannot beat the price for the value.", 
    "Great price! very confortable, super fast shipping. Thanks", 
    "Great chairs for the price. Took a while to assemble, but it is one way to save a few dollars on Overstock's products that require a little work on the consumer's part.", 
    "Took a few trial runs to assemble. Holes for screws do not match up perfectly...very nice comfortable chairs. Wish they came in a darker color.", 
    "I really love how elegant they make my dining room. The color is perfect and I love the blend of all the different woods in the room. Not necessary to match everything anymore. Delivery was quick and seamless. Really like the tracking form. Husband says they were very easy to put together.", 
    "I just purchased 6 of these chairs to go around my dining room table and they look fabulous! They are very comfortable to sit in and curve to your back just right. I had no problems with the assembly, just used common sense and read the directions. I got the hang of it after my first chair and after that, it took maybe 10 minutes to assemble a chair. The bolts are big and durable and the pre-drilled holes are nice and snug, ensuring that these chairs should last a long time without ever wiggling loose. Nothing was damaged, scratched or uneven. Overall, great chairs!", 
    "Love these chairs. Easy assembly. Only thing that could be better if they were available as single items and not sold only as a pair.", 
    "These chairs replaced captains chairs that matched my cherry dining room table. They've totally changed the look. Now the dining area is rich looking and classy. I also added little lamp shades on the chandelier lights which also helped. The chairs are a little light weight but it makes them easier for me to move around.", 
    "I ordered the chairs online and ordered six of them and they were exactly like the picture and I love them", 
    "we just put them together today, but theyre beautiful, sturdy, and look way more expensive than what we paid for them. They took awhile to put together, but everything lined up perfectly. overall we're quite pleased with them!", 
    "I bought 2 of these chairs for a very small kitchen table. They were well made and sturdy. I am ordering 2 more now that we have a larger table. Suggestion: I ordered the light tan color, so the day I got them I scotch-guarded them. I have dropped spaghetti sauce on them and they cleaned up great.", 
    "Arrived one day after ordering. Great price and quality. Nice neutral color and easy to assemble.", 
    "Everything was as expected, except there were a couple of tiny nicks on the wooden legs. Overall, very happy with the quality vs the price.", 
    "Chairs came unassembled but I was able to put them together with no help just by reading the instructions. Easy to do and they look wonderful in my dining room.", 
    "These chairs are absolutely beautiful! They look very expensive in comparison to what they cost. My sister has ones that are almost identical from Crate and Barrel and they cost almost $300 each. Yes.. those came assembled.. but who cares? The assembly was a bit challenging, but if you have ever put any furniture together you know that it is a bit of a challenge until you get the hang of it. They look stunning in my dining room and I could not believe how rich looking they are and how comfortable for the price. DON'T HESITATE.. the color is a beautiful camel color.. not taupe/ mushroom as some have mentioned in their reviews. Thanks Overstock for another AMAZING purchase!!", 
    "The chairs were somewhat difficult to assemble since some of the hardware was missing and also because the hardware did not line up easily into the drilled holes you needed to screw together. I had to take two chairs completely apart after trying to fuss with lining up the hardware into the chairs. Not all of the hardware was able to be used so one of my chairs is really wobbly. Not even a friend could help align the chairs I was having trouble with.", 
    "I purchased this set of chairs as well as two made by Parsons. My recommendation would be for one to buy the Parsons or try another brand. I'm not very satisfied with the quality of the chairs. Also the chairs seat cushion is not that firm. You sink into the seat as if they have been used for a while.", 
    "Good price for a good chair. Had to get help putting one chair together, but overall easy. I know can seat six for dinner and a near match to the fabric on the chairs I have. Can't beat these chairs for the money.", 
    "These chairs are great! They are nice and heavy, well made and look & feel expensive! They were easy to put together took me about 30 minutes for both chairs.. I purchased it for my brown/black dining table looks like its meant to be!", 
    "For the price, these chairs are ok. They did take a while to put together. The quality is not great. I would have sent them back but the shipping would have been about the cost of the chairs. They look find but I don't think they would take much weight or abuse. My table is used by teenage boys to play cards, and they can be rough.", 
    "my son is putting them together, they are very nice quality and really pretty compared to my old chairs. I bought them in a set of 2 totry and become a bit more formal in my living room, as I have some art deco chairs and they are getting older and aren't comfortable ifyou have company and people are eating over, I have a chair and table for 2 people now 4 people can eat instead of 2. Very pretty too.", 
    "These chairs are very nice. Great value. The color is slightly different than the picture tho. I expected them to be off-white but they are definitely Beige. Still they look great with my dining room table.", 
    "I am extremely pleased with the look and quality of these chairs. The color is true and they were easy enough for me to put together without any help. All six went together with relative ease. The first one took me about 30 minutes, but the next five took about 20 minutes each - and I am not mechanically inclined. They are sturdy and comfortable. I am very happy with the chairs!", 
    "I ordered 2 sets of 2 chairs per set. Three of the chairs are lovely, comfortable and well made. One of the three is misaligned and therefore off balance. It cannot be readjusted and must be returned.", 
    "I jest got my 4 chairs today, and they look so good. it only took me 1hr. To put them together......I made a good choice!!!!. Thank you.O overstock", 
    "I had so looked forward to these chairs... They are comfortable and look great with my new table... But, one chair has one leg shorter than all the others... They look like with a lot of use they will not hold up.... And stability of the chairs is a serious concern. This is so SAD. It took me 3 months to find the perfect chair. Then only to discover that the quality and workmanship is poor.", 
    "I first ordered the set of 2 so I could check out quality and color. First 2 arrived in excellent time and packaging was intact. Upon assembly, 1 of the chairs had a shorter assembly leg. Took it apart and reassembled in opposite order, no help there then measured everything. Leg length, depth of insertion, measured everything and all measurements were exact. Only thing I can guess is angle of screw entry. Anyway the difference was about 3/8 inch and wobble still there so I had to add a piece of wood to bottom of one leg (shape it glue it and stain it to match) to make it sit without wobble and sit level. Even after all that I ordered another set to make out the set of 4. Next set arrived excellent time and packaged very well. Assembly on first one went OK for 3 legs then last leg bolt, I could not get to start no matter how I angled it. Took apart to see what was stopping the entry of last screw. A staple was down inside the bolt entry area so had to use needle nose pliers to pull out, after it was out bolt went right in. These next 2 did not have any wobble. Yay! So all in all I have a set of 4 chairs that I am pleased with since the comfort of the seat is excellent. The coil seat is more comfortable than just a cushioned seat. Color is same as pictured. I would call it a light taupe tan. Patience is of the utmost in assembly. Finger start all bolts and then easily tighten in rotating order till all are tight. If all goes well as it did on 2 of the assemblies it takes about 10 minutes per.", 
    "I bought four of these chairs. I thought they were very difficult to put together and had to ask a family member to help me. I immediately put white slip covers on them, so I can't address the quality of the fabric. All four had one leg that was slightly shorter and I had to put a felt pad on each. I like the shape of the chairs and the slip covers look really nice on them.", 
    "Had looked for months for the right chairs - I wanted a contemporary look to \"mix\" with our antique solid cherry dining room table. I didn't want to pay a lot for them, as I like to change things up every few years with décor. These chairs surpassed my expectations. If anything is spilled on them, the microfiber is easily cleaned. Another successful purchase from Overstock.com!", 
    "I am very pleased with the look and feel of these chairs. They look great and are very comfortable.", 
    "One chair cushion is badly stained, even though the wrapper was not damaged. Assembly of the 6 chairs was not too bad, just a lot of bolt tightening.Two chairs were packaged together. One cushion is too small to return in the shipping box. Help!", 
    "These chairs are very nice for the money. Very comfortable and pretty. I love the style and fabric. You get what you pay for, however. They are lightweight and almost every chair (I purchased 6) rocks a little from uneven legs. They were poorly packaged- not enough protection- and one of the chairs had a back leg that was completely broken in two. But overstock was wonderful, and fast, in replacing the damaged item.", 
    "I was a little reluctant to order these as a few reviews said there were problems putting them together. We ordered 4 and they all came in perfect condition. My husband is handy and never would use the allen wrench supplied. He took out his power drill and had all 4 set up in mo time - maybe 10 minutes each! Do not bother with the little tool provided, just find someone with a power drill. The color is right. Reviews are correct that say they are very comfortable (I like to try things before I buy so this was a leap of faith). An excellent product at a very resonable price.", 
    "Love my new chairs. Had a problem with one of the legs but called customer service and they shipped out a new one fairly quickly. They were easy to assemble too.", 
    "Awesome looking chairs, but WOW! What a pain in the A$$ to put together. My husband and I are VERY mechanically inclined people and these chairs were horrible to put together. Nothing lined up. It was a nightmare. However, now that they are together, they look great and we are ordering two more so we have a set of six. They are a great value for the money. If you have more patience than cash, I highly recommend them.", 
    "Didn't want these chairs to be too brown and found them true to the picture. Legs are medium/dark wood color. Overall, nice chairs.", 
    "I bought 4. Weren't hard to put together. Sturdy. Look fabulous!", 
    "Great quality for the price and took less than 10 minutes per chair to put together. Much easier than I thought they would be! Instantly upgraded the look of my room. My kids even volunteered to wash the table an remove a sticker so that everything looked great.", 
    "Good value for money. I bought 6 of these and 2 were slightly rocky. They are quite comfortable though and in general good value for the price.", 
    "beautiful chairs but legs are uneven. need to but something on bottom to even them.", 
    "I PURCHASED THESE CHAIRS TO USE ONE AS A DESK CHAIR IN THE MASTER BEDROOM AND ONE AS A CHAIR IN THE GUEST ROOM.THEY ARE PERFECT! EASY TO PUT TOGETHER AND LOOK LOVELY. I AM VERY PLEASED!", 
    "They are comfortable and attractive. I have gotten many compliments.", 
    "I love the chairs - they are as depicted in the photograph and exactly what I have been looking for. They were easy to assemble and look perfect in my dining room. I couldn't be more pleased and would recommend them to others.", 
    "Pretty long to put together, they kept coming up unstable, but my husband worked on maybe one chair per hour and got them to be even - and he's very competent in building - They are beautiful and fabric is easy to clean -my kids got a spot on one of the chairs on the first day and it came out easily", 
    "The chairs are comfortable and look OK. The fabric is slightly darker than pictured...I would call it tan. Assembly was OK, but I have assembled a lot of \"affordable\" furniture and these were probably the least accurate with holes lining up (and 2 large flat washers were missing). The upholstery on the back of one of the chairs is horrendous. I could have done a better job getting the wrinkles out, but I will put it on the wall side of the table, and if it bugs me enough I'll get slip covers. Over all, for the price, I can't complain too much. They will serve the purpose of seating at my table.", 
    "I was concerned after reading the other reviews on the difficulty of assembly. Believe me. Do not be concerned. I purchased 6 chairs and had them together in under an hour. Using power tools definitely helped and saved my fingers on using the Allen wrench provided. The chairs are lovely. I found the identical chairs at Kohl's for a much higher price. My hefty brother, over 250lbs, sat on one with out any \"problem.\" These chairs are not heirloom quality. But I like to change up styles every few years so they will work beautifully. Thanks Overstock!", 
    "I purchased these chairs to go along with miy grandparents mahogany dining room table set from the 1940's. The legs matched perfectly. Assembly lay tip: lay all the bolts out first for both chairs. Some bolts are only shorter by a 1/4\" and it's hard to tell them apart. It was very easy to put them togetherafter that. The fabric is the perfect and and easily brush off crumbs.. I'm thinking of purchasing 2 more for chairs to be located on either side of the hutch as additional seating for family gatherings.", 
    "This is my second time ordering furniture from overstock, both purchases were exceptional quality. These chairs were good height. For the table, comfortable to sit in and fashionable, great delivery time also.", 
    "We have three small grandchildren and chose these microfiber chairs in \"Classic Peat\" for easy clean-up. We have had the chairs approximately one year and they still look great, except for a ball-point ink stain, and one chair needs a little tightening up. Kids have spilled everything imaginable on these chairs (from Play-Doh to yogurt, to juice to milk, to pizza...) and the spills clean up with a little scrub with a wet dishcloth. Some spills have even gone unnoticed for several days and still clean up. I only wish the chairs had come with gliders on the bottom; we had to purchase our own. And the color is a little deeper tan than it appears in the photo provided. All-in-all they have been a great value and I would highly recommend them.", 
    "Purchased 4 will get 2 more, they are comfortable, and the color matched perfectly. Love them.", 
    "Chairs are pretty good value and look nice, however one chair leg was shorter than other three.", 
    "In and around the holes where metal inserts are used, they must be cleaned thoroughly....I found laying the back flat and proping the legs up about 9 in. and setting the seat verticle, then just starting the 7 bolts that mount the seat was the easiest way----Tighten the 7 bolts slowly and evenly----Mounting the front legs last is a piece of cake...", 
    "Yes, that first chair is a challenge to put together, but boy is it worth it. These chairs look great, are very comfortable to sit in and have freshened up my dining room. I ordered four and by chair 4 construction, I was a whiz. Wipe spills off easily and even my crazy tweens haven't hurt them. Now I'm considering some options for the end/captain chairs and will definitely look at this manufacturer.", 
    "As previous reviewers have mentioned, the color of the chairs is actually a darker beige than what is pictured. I wanted a darker color so that was one reason I ordered them and the color matched my expectations. When the chairs arrived the packages were a little banged up. Everything was in good condition except two of the front chair legs were a little lighter cherry and a little scratched. The color on them was not a good match to the back legs. So, I contacted customer service and they were wonderful! Two new legs were sent out and they matched and arrived in perfect condition. In regards to assembly, attaching the front legs did not take long at all. Attaching the back legs that go into the corner at an angle was a little more difficult but not impossible. Overall, I really like the chairs. I think they look nice especially for the price. I have only ordered one set and I am considering ordering more. I do think that I will need to tighten the screws on a regular basis because I don't feel that they are going to stay super tight. With that said, these chairs are being used in my dining room which only gets used a few times a year for family gatherings. I have not had them long so I cannot attest to durability. Hopefully they will last!", 
    "I have bought these chairs for myself and then bought a set of 6 for my sister, she loves them as well", 
    "These chairs are perfect. They are very comfortable and attractive. I have read how hard they are to put together but, if you put them upside down and then put the legs on , it takes no time at all.", 
    "I absolutely love these chairs. They not only complement my dining room table, but they are comfortable, well constructed, and could not beat the price. I ordered 8 chairs, one had a defect on the seat but I called customer service and they sent out a replacement promptly. I am really pleased with Overstock.com.", 
    "These chairs were really beyond my expectations. Very stylish and comfortable. I have been lookiing for a long time for dinng chairs and these were on sale way below the going price for chairs. I'm really happy. Very easy to assemble. The color is rich looking also. You won't be dssapponted.", 
    "Great chairs, function and form. Easy enough to put together. They look great in my formal dining room and are casual enough to go with my farm table without being too casual. Haven't had any problems with the material so spills yet.", 
    "I just got these chairs and I love them! They are a great color and the wood is nice looking too. It took my husband about two hours to get them together (we got 4). It's not too hard to put together, he just took it easy because people said that they had a hard time with assembly. The material is soft and my daughter just loves how comfy they are. The chairs are the same fabric as our rocking chair, and that has held up incredible, so I'm sure these will be just great too. You don't want to miss these! Great value!", 
    "We are very pleased with our purchase of 2 parson chairs. We bought these 2 chairs to coordinate with 6 mission chairs (in black wood). We may paint the legs of these chairs at a later date to make them black too but we haven't decided yet. The only complaint that I have with these chairs is that the pre-drilled holes are not aligned well making it much more time consuming than necessary to assemble the chairs. If you barely start each bolt into their respective holes before tightening any of them, the job becomes slightly easier. The finished product looks great and the quality seems to be very good.", 
    "You know that old saying \"you get what you pay for\"? Well, the chairs are really nice, love the microfiber fabric. BUT, they are extremely hard to put together (yes YOU have to put them together), and then they rock from side to side, one leg somewhere out of whack. I bought 8 of these chairs because I didn't want to pay $** each for the Calais dining chair from ? (theirs had suede fabric and the microfiber fabric is so much easier to clean). Had planned to make these chairs look like those at Pottery Barn. Still working on getting them to not rock. Would have loved to have given this chair an \"excellent\"!", 
    "These chairs are nice for the money, but the holes are not drilled through properly, making it impossible to assemble the chairs. I had to send them back. I noticed others had this issue as well, so it may be something the manufacturer needs to look at from a quality control perspective. On a positive note, Overstock was wonderful! The return was very easy and efficient, and the customer service rep I spoke with was very nice and helpful. I would definitely order from Overstock again....just not these chairs.", 
    "I absolutely LOVE these chairs! I read the reviews before I bought and was slightly nervous about having to put them together myself. However; not half as bad as people made it sound. **One Tip-once you get to the point where everything is tightened about 80% have someone sit on the chair (or use weights) and then tighten the rest of the way.** They are slightly darker than the picture I had on my moniter, but VERY close! They are very luxurious and are well made. They don't wiggle at all once I had everything tightened. I would suggest these as a purchase anytime. I just recieved them so I am unsure of how they will hold up long term, but they are much sturdier than other chairs I have purchased. I am going to spray mine with that never wet stuff and that should keep the stains & spills at bay. Super happy with the purchase from overstock!", 
    "Ordered these chairs for a spare roomm (office). They look great and were a good price. The only issue i had was that the chair legs were uneven and rocked when you sat on them. Not wanting to return them, I bought chair caps to hammer into the bottom of the legs to adjusts the height. Problem fixed. Would recommend chairs. Comfortable and stylish.", 
    "These chairs were an incredible value-we ordered 8 and it totaled under $600! They came quickly and are of very good quality, sturdy and solid wood. The actual seat is supportive and well made. Color is beige.", 
    "These are great, very pretty, easy clean and look great in my dining room with dark wood table and sideboard.", 
    "The chairs were packaged very well. The chairs were easy to assemble, and look great", 
    "Super hard to assemble ! And once u do! The chair is rocking! So the legs are not very equal in length Price is cheap comparing to *** a piece in the store for similar chairs- but quality is cheap too...", 
    "These chairs were very easy to put together. They look even better in person. The curved top to the back and the edging on the back are stylish touches that make these more interesting than plain parsons chairs. They are much more comfortable than I expected. This was a great buy!!", 
    "These chairs are a bargain for the price. I don't know that they would hold up for the long haul if they are used on a regular basis, but for my purpose, they are perfect. The suede cleans up nicely and they look really nice.", 
    "As others have said the back leg assembly is a little tricky. Clean around the holes to nothing is blocking the screw. Make sure you pay attention to the angle the screws have to go in. These chairs are very comfortable.", 
    "I like the chairs very much. The delivery was timely. I did have to have a man assemble them. And the only thing I would say is the seats need just a little more padding at the back.", 
    "The chairs look fine but it is a little off putting to o know how cheap it really is in terms of quality construction. Putting in the legs was difficult for some as alignments aren't precise as it should be. However, for the price, it worked for my budget. Hopefully it will last for a few years before I can hand it off to my kids!", 
    "Although these chairs were easy enough to put together , my husband id have trouble with lining up the holes. He had to drill the hole to make it fit . Not to difficult to put together, very sturdy and they look great .", 
    "I bought these for extra chairs to keep in the bedrooms and bring out when needed. They are a neutral color so that works they were a little difficult to assemble. we had problems getting the legs even. They look nice and fit the purpose.", 
    "assembled fairly easily, very comfortable and looks great. cannot do better for the price.have seen similar chairs in the store for much more money per chair, not a set.", 
    "I would certainly recommend these chairs to anyone. They are high quality, good looking and easy to put together. My only request would be that they were not made in China.", 
    "I bought 6 side chairs for my dinning room. They just finish off the room perfectly. The color looks wonderful with my rug. I did not find it hard to move the chairs in and out from the dinning room table. I had 14 for dinner and believe me everyone commented on how lovely they looked.", 
    "These chairs are very nice. They are comfortable and are the color as described. These chairs are not that hard to assemble. Just follow the directions and it will be fine. I am a 60 year old lady and had no problem.", 
    "These chairs are sturdy, but light weight enough to easily be moved into the LR from the DR after dinner for additional seating. One downside was putting them together. It took my handyman over two hours to assemble eight chairs. As always, I received superior customer support and service from the Overstock staff -- in the USA. I highly recommend this site.", 
    "love these chairs! bought two to test, immediately bought two more...", 
    "Hope they come back in stock soon so that I can get more for the dining room this time. Presently using 4 of them in the kitchen.", 
    "My husband has a lot of problems with assembly...rickety legs; holes were not aligned. We had to get some replacement pieces to make them work. The fabric is not tight so we had to hide some that are sagging a little against the wall. From a distance? They look modern and chic...great neutral color and they are actually comfy. All in all a good deal, but they won't be in our house forever that's for sure.", 
    "We are really happy that we chose these chairs to go with our existing dining room table. They match the cherry wood perfectly and the cushions look exactly as pictured. They are surprisingly comfortable. So glad that we took a chance on them!", 
    "I recently purchased a used cottage style pedestal table from Craigslist, that I'm going to paint off white and distress. I bought six of these chairs to go with it and they are perfect! Extremely comfortable for everyone that has used them, from 6'2\" to 5' tall. They are very well made for the price. The fabric is beautiful and so soft and they are very sturdy. I saw a review that said the legs were too spindly, but I haven't found that to be the case at all. They are in proportion with the rest of the chair and if you make sure they're tight they are fine. It was difficult to put them together, but well worth the trouble. I would definitely recommend them to anyone...and I'm pretty picky.", 
    "A little hard to get first one put together but the other 5 went smoothly and quickly. Very comfy chairs. Get many compliments from guests. Wanted something to match our microfiber living room furniture and these were perfect! After looking for chairs on different websites, these were the most reasonably priced for what we wanted and they match our dining table perfectly as well. Very happy with purchase!", 
    "They contrast well with my antique mahogany drop leaf pedestal table.", 
    "The chairs are of a good quality, and easy to put together. I would have spent much more at a store if they were assembled.", 
    "The chairs were easy to assemble and look like they cost way more than they did. Love it!", 
    "I bought these chairs to supplement my dining room set. One of the chairs a bit wobbly, so I added a felt disc on the bottom. Took a while to put together but otherwse I'm please with them.", 
    "Great chairs for the price. Had a kids party with chocolate smeared all over one of the chairs. Sponge and a bit of water cleaned it up. We have young kids. I didn't want to spend a fortune on dining room chairs and these fit the bill.", 
    "I would definitely recommend these chairs. They very comfortable and study. The height is very good. The color is very beautiful.", 
    "I would recommend these chairs for the use that I purchased them. I have a round table that is arranged behind my sofa and in front of large windows. These chairs set very nicely on each side of the table and are a great color to fit in many color schemes. I use these chairs when I sit at the table to read or scrapbook and they are the perfect height. They are more like side chairs in a living area.", 
    "Overall I am satisfied with this purchase. The chairs came quickly, as do all of the orders I've placed with Overstock. They took a little time to assemble, but I did not find it complicated. Setting it on your lap inverted and assembling everything according to the directions worked well. Tightening the screws fairly evenly seemed to work best for the rear assembly. Now it is possible to sit at the kitchen table and do take home work, which was not the case for the last chairs we had. Overall soft and comfy, and with enough support not to feel like you sink down. For the price they should hold up for a reasonable amount of time. One funny characteristic is that sometimes the microfiber can create static electricity upon standing up... : )", 
    "The chairs we an addition to our two other chairs and matched perfectly. They are sturdy, comfortable, and stylish all in one. A great investment and price.", 
    "Love these chairs. They look elegant without sacrificing comfort. I get so many compliments on them. Great buy for the price.", 
    "Easy to put together. Great looking chair. The color is more of a brown than the neutral that shows on site. I bought chair covers so did not matter. Great, comfortable dining chair", 
    "The chairs need to be assembled but it didn't take long and we didn't have any issues. I was nervous about ordering them online without seeing them but the quality is great. We ordered 4 and just ordered 2 more by ETHAN HOME. I'd definitely recommend these.", 
    "The product is very comfortable but the legs don't seem to b all the same length, little wobbly", 
    "I wasn't sure when I ordered these chairs, but they are perfect for my dining room and sit quite comfortably. I have already had compliments on the chairs. I liked being able to order 2 at the time; and assembly was easy.", 
    "Nice chairs, I would have kept them if the color had worked in my space.....", 
    "These chairs are beauiful and I love them. Putting them together was not that hard. I would recommend putting in all the screws in very loosly so that the seat is adjustable as needed. The holes do align but you may need to slightly move the seat up or down to put the screws in. Their is no reason to have to drill holes and in fact I would not recommend that. The holes are medal screw inserts. Getting to know how to put together the first chair makes putting together the remaining chairs easier. Do not forch any screws in, if their aligned, they will screw in easily. Me and my daugher put 4 chairs together in 2 hours. The chairs are very sturdy and look so good. I did not need a table but my old chairs needed to be replaced. These are excellent chairs for the money.", 
    "I am an avid reader of reviews so as these chairs had an excellent rating from customers I felt comfortable in ordering them. I was not disappointed. Assembly was easy just make sure to poke around in the holes to make sure no debris is left inside that would make it hard to screw on the legs. I had read this in a previous post and thought it very helpful and it was. In fact the hardest part of putting these chairs together was getting them out of the box. I am a 70 year old female so it took me a little longer than someone with more dexterity but I had them both put together in about an hour. No problems so far and they are quite comfortable and the fabric is very nice and my cat does not use it as a scratching post. I only have a small dining area so they fit perfectly. Will be ordering 2 more before they go out of stock.", 
    "Assembly was fairly easy although only 1 of 6 went together perfectly on the first try. They have a very bad odor. I left them outside for 7 days to air out which helped, but after 10 days in the house I can still smell them. It is not as bad as it was so hopefully it's going away.", 
    "I love the look and feel of these chairs! The fabric is wonderfully soft. The screw holes were a bit of a challenge to get started in some instances but it didn't take too long to put them together.", 
    "I was very please and surprised with this purchase, for the price,what a value. They are beautiful sturdy ! I am just really pleased! I see more shopping at Overstock in my future so yes I need to free shipment voucher. I wan to purchase a bed next. Happy New Year Jerrie", 
    "Love these and they were super easy to assemble. No idea why so many complained about screwing in 11 screws per chair. I purchased 4 and had them together in 1.5 hours with a few breaks. You can't go wrong for the price!", 
    "Greetings. I bought these chairs because the reviews seemed great with the exception of assembly. The chairs are indeed very nice and good. I simply want to add a word of advice for folks considering these chairs. Yes, assembly is probably more difficult than it should be. It's not horrendous, though. It is definitely easier with another person to help. I suggest assembling all parts and only tightening the bolts 90% of the way on the chair's side or back. Then, set them upright so that gravity works in your favor to level out the legs, and tighten the chairs the rest of the way while they are upright. It took us 1.5 hrs to assemble 4 chairs. The first one took about 45 minutes, but the other three went fast once we knew what we were doing.", 
    "My husband and I took a chance and bought all six chairs that we needed at one time. Thank goodness they were as advertised. They look great and the quality is actually better than the picture that appears on Overstock. Of the six chairs, four were very easy to assemble. The other two chairs took more time and we still have two screws that would not fit into the assembly. That said, we are very happy with how the chairs look and with their quality.", 
    "I hate alle keys, but it's worth putting the legs together for the price. The chairs look great.", 
    "These are nice chairs. I bought one set to see if the wood matched our existing dining room table. 99% match so I bought another two sets. All in all a good purchase; however, two of the six chairs seemed to be off on the leg length. We took apart the chair and we worked it hoping the legs would be even-no luck. I ended up putting a felt pad on the one leg to make the chair not wobble on our hardwood floor. That is a con and the fact the chairs appear to have drilled holes on the bottom of the legs for some sort of protective pad to be inserted but no such pads came in the box. I am happy with the comfort, color, quality.", 
    "The first thing I noticed when I opened up the box, was that the color was exactly as advertised. Then the set up was very easy but time consuming (it's worth every minute though). Immediately, I realized there was no need for tools and the instructions was clear as well. The only helpful tip that I have is to put the same size screws together, so you won't get confused while putting the chair together and... Don't fully tighten all the screws until all of them are in place. Be patient with it because it's a beautiful finished product when your done...", 
    "Love these chairs! I've always wanted Parsons type chairs at my dining table but they were always too pricy! Found these and read so many great reviews....Got some myself and couldn't be happier. I just finished out my set of 8, each time Overstock had a coupon, I'd order a pair. The screws/bolts on the bottom of the chair have to go in at an angle, and it challenged me at first, but, once I got that the rest flew by. 2 were put together by me and 6 by my hubby. We had a wonderful, comfortable Thanksgiving thanks to these chairs. We inherited a large oak table that is really not my style, it was sort of country-ish. I sold the giant oak chairs that came with it, added these cozy chairs, and it changed the look entirely to warm, comfy, and modern. I totally love the eclectic look our dining room has now! My dad wants to replace his old dining chairs with these in his dining room. I'm planning on gifting him a pair when they go on sale again.", 
    "Although the color isn't as light as I had hoped, I'm keeping them for my dining room. You would never guess by looking at them how inexpensive they were! Putting them together was a bit of a pain, but no major problems.", 
    "We purchased two sets and did not anticipate any problems assembling them. Three went together quite well. The last one was a different matter. Nothing seemed to work. We had our handyman put it together since he has tools and ability that we don't. He managed to get it together with same obstacle due to upholstery material being lodged in holes causing things not to fit. After these minor setbacks, we enjoy these and love their look.", 
    "The chairs arrived in record time, were sturdily packaged and exactly what we wanted. I suggested to my husband that he read the reviews on assembling the chairs before he started. He did not depend on the tool that was enclosed, but went to Home Depot and got a better one. He assembled all six chairs in about 4 hours, taking breaks in between sets. The reviews that included various suggestions for assembly were very helpful to him and saved a great deal of time.", 
    "I'm VERY happy with these chairs. Nice color and good microsuede. Very comfortable and sturdy. Match my current ones exactly (that I paid a lot more for). Assembly was very easy - maybe ~15 minutes per chair after I got it out of all that packaging. Arrived promptly.", 
    "I ordered 1 set just to see how they looked and if they were easy enough to assemble. They looked really nice in the dining room. We didn't have any problems with assembly, just needed to move the legs a little as we were attaching. I ordered a second set and it arrived in good condition. I am considering ordering a 3rd set.", 
    "i have looked for over 2 years for parson chairs at this price and the ones that were higher in price didn't come across any better than these so for the money i would recomend them to anyone... the have changed the entire look of diningroom by giving my old table a brand new life and modernizing it... they are just the touch of class i have been searching for..", 
    "I loved the picture of the chairs and when they arrived yhey looked just like on the website. I received them very quickly and I am so glad I ordered them. They are so comfortable!", 
    "I saw some chairs like these on the Target site, but they were always out of stock. After waiting 2 months for that status to change, I found these. I got them in less then a week and I'm very happy with them. They look great in my dining room and are very comfortable. Buy them!", 
    "We are very happy with these chairs. We initially ordered 2 to be sure we would like, then ordered 4 more! Whole family is enjoying gavin comfortable chairs around table after our meal. I have big men in my family and these chairs have been fine for them.", 
    "Nice looking chairs. I bought them with the high chairs and they matched perfectly. The fabric is nice enough, and it looks good, the seats however are not padded as thick as I would like and after a few weeks I think the padding is beginning to wear down already. Would probably be really great for someone who didnt use them much.", 
    "I received them on time. No damage!!! Easy to assemble! very Happy with the product! :)", 
    "I couldn't have asked for a better deal. I was looking for 2 extra chairs for my dining room set and my daughter recommended Overstock. The selection choices and prices were better than any of the showroom furniture stores I had been to. The fabric is a good quality and the color was a little darker than the website showed, but that was perfect for what I was looking for. The wood grain matched my existing set perfectfully and is true to color on the website. The only negative thing I would say is that one of the chairs was missing 4 screws and my husband had to go to a hardware store to get more - an inconvenience, but easy to match the missing screws.", 
    "Overstock's shipping cost of $2.95 is amazing and much appreciated. The chairs arrived a few days after order placed. However, I was disappointed with the workmanship. There is stitching on the front of the chairs and it is loose in many places. I am concerned that the loose stitches might come apart in due time. The bottom of the legs are left unfinished. It would have been better if they put some sort of cover. The other problem we had was the holes that were drilled were full of shavings so we had quite a difficult time redrilling the holes when we assembled the chairs. The chairs are a very nice beige color and the microfiber material is nice. The chairs are not as comfortable as I thought they would be which is a shame as I use my dining table as a work table for my lap top. After sitting for a while my legs fall asleep. I guess all in all they are worth the price. I just hope that the loose stitches won't come apart and will be calling Customer Service to ask about their experiences.", 
    "The only thing missing were 'Glides' for the bottom of the chair legs.", 
    "if you are looking to not spend a ton of money on dining room chairs but still want a rich looking dining room chair that is sturdy then buy these. The neutral color can go with so many things. Another great product by Overstock.com", 
    "Was satisfied with chair. It's okay to use in a causal area. The feel of the material was good.", 
    "I had very little trouble putting these chairs together by myself I might add. The allen wrench that came with it was very help; I had my husband tighten. I loved these chairs so much I purchased another two sets for my increasingly large family for the holidays. I have to mentioned that one of the backs of the chairs had a hole in it - looked like a drill missed the wood and got the upholstery instead. I had wonderful customer service and quick replacement..Such a nice reprieve from the usual customer service folks at other large stores either on a website or at a locally owned or national retailer.", 
    "Important to follow the insturctions for assembling and to not try to force screws inot poosition. I ordered 6 chairs and some came together more easily than others. Wait to tighten the screws after you stand the chair up and even out the legs. When it's in the right position, the screws tighten easily.", 
    "I purchased 2 of these chairs for end chairs at my dining table. I covered them with slipcovers to coordinate them with my set. But the color is perfectly neutral, sits comfortable and the price was amazing. Great chairs. Would buy again if needed.", 
    "Very pleased with this purchase. Chairs were delivered in 2 days. They were easy to assemble. The chairs are well balanced and very comfortable. A great value for the money", 
    "Love the chairs. Bought them for the wife for a mothers day gift. She loved them. Very comfortable.", 
    "This was a good purchase, like the way they look and sit, quality is good, would recommend.", 
    "Nice chairs, no issues. I purchased two of these and two of the cream ones with chocolate swirls on them and they look great together. We put one together and it did not quite screw in correctly so it was wobbly. We took it apart and tried again and it was fine. Very quick to put together, it was maybe an hour tops for all four.", 
    "Thes chairs fit into my decore very niceely. The price was on target for me and I will use them for a long time.", 
    "They are well made chairs and they look good with our dining set. Delivery was swift and assembly was pretty easy. My wife and I are both very happy.", 
    "I bought 2 chairs on a trial basis and liked them and will be buying more. The chairs are not flimsy. They are quite sturdy and very comfortable with good padding in the seat.", 
    "This is a nice product, I do wish the chair was a little more detailed as it is a bit bland but I put a pillow on each chair and it popped with flavor. It is a nice centerpiece for a room and for the price the quality is great.", 
    "Love them, They are attractive and comfortable, they meet our needs updating our dining room. easy assembly!", 
    "These chairs are a great value, are very comfortable, and make my dining room look elegant. The first one was very difficult to assemble, but once we got the hang of it they went pretty quickly. The chairs were a great and inexpensive way to make our old dining set look fresh and modern. I definitely recommend them!", 
    "I bought 4, I am so happy, they are sturdy, beautiful color and easy to put together. I will be buying 2 more.", 
    "Great chairs; don't be intimidated by the comments on assembly. With a drill and hex bit, the first chair took about 35 minutes to figure out and the rest went smoothly. Tip: The fabric sometimes in not well trimmed around the holes and catch on the screws, which can hang them up and cause issues. If you check that the fabric gives appropriate clearance before attempting to assemble, it's a breeze. Very happy with these and would buy them again in a heart beat.", 
    "I purchased the chairs after reading the reviews. I agree they are good chairs at a great price.", 
    "These chairs look really good in my dining room. One chair is wobbly, and I cannot fix it, which is disappointing. The same chair also has imperfections in the fabric. They are very comfortable.", 
    "Others reviews were very helpful especially when putting the chairs together. Remember be patient and you should have the chairs together in an hour.", 
    "Great value. I had been looking for new dining room chairs to replace my un-upholstered wooden ones, and was shocked at how expensive they were. These chairs from Overstock were exactly what I was looking for. They arrived quickly and were well packaged. They did take a little time to assemble but that is because I ordered 6! Make sure you read the instructions carefully and separate out the different size bolts and you should be in good shape. The chairs do have a \"synthetic\" odor initially (not uncommon in new furniture these days), but it seems to be lessening every day. I highly recommend.", 
    "I am very pleased with these chairs! They were easily assembled and have worn well. I was going to put slipcovers over them just for a different color but I like the color so well that I just left them like they are.", 
    "When these chairs arrived I could hardly wait to get the boxes open and start putting them together, I had read the other reviews and knew the chairs might be a little hard to put together, but my husband is very good at putting things together( he is use to me buying things that have to be assembled) and we had no problem at all. They went together just fine. My only problem will be to now find covers.", 
    "I give these chairs 3 stars - mainly because of the inconsistancy of the ease of assembly. I purchased 8 chairs of which 4 went together super easy and the other 4 were a fight to the finish. I literally have bruised thumbs. Also, I was a little skeptical when the chairs arrived because the boxes were VERY beaten up. I quickly inspected and all was well. The upholstery is beautiful but the workmanship is terrible. I had to re-staple some areas of a few chairs because it was obviously done so quickly. I stained the legs of the chairs to match my table and overall - it is beautiful. The chairs are comfortable and pretty sturdy. These seem like they will hold up and last a while. I move alot - so we'll see... Basically, 8 chairs for $$$-ish is unbeatable even though it involved quite a bit of elbow grease and bruising ; )", 
    "my wife has been wanting parson chairs for dinning rm for a while but the ones we looked at locally were very narrow.seen these and took chance on the dimention givin on line,all is fine the seats are perfect very comffy seem well built and solid,putting together was't a problem 6 total didnt tighten bolts all the way took chair to a level area in kitchen sat on it kinda hard like that leveled the legs then tighten all the way no wobble like some reviews said. she's happy so i'm happy buy them won't regret thx frank", 
    "Very happy with chairs. They are sturdy and attractive. One draw back was having to assemble them. Had to hire someone to do.", 
    "Love these chairs! They really dress up my dining room and the price cannot be beat. I have a three year old who smeared some red sauce on one of them and it cleaned up right away with a wet towel! So great for families. The chair legs are cherry wood in color so they match our table. We love them. They are \"good quality\" and they dress up my dining room and look elegant. They are stain resistant and we bought two extra in case one or two break down (not that they would) or get so dirty...did I mention I have a young child? Anyway, I love them. We couldn't afford more expensive chairs but for the price -- the look and quality was exactly what we needed. We bought four sets of two and set up six of the 8 chairs. It took my husband about 90 minutes - so it takes a while to do it (and he is usually good at that sort of stuff). But it was worth it and I love my dining room now. It's not where we eat every night - it's for \"company\" and we just had our first dinner party last week. No one could guess the price of the chairs...heee hee. Not even my mother who is very keen on that sort of thing. So highly recommend for kitchen or dining room...", 
    "The chairs are great. They aren't high end, hand made chairs, as you can see how it came in separate pieces. But if you don't look too closely you would never know the difference. I bought 6 chairs for $400, the same price as one upholstered chair from Crate and Barrel or Room and Board. I have little kids so I wanted something that I could have a for a few years and wouldn't be upset if they got messy. These are perfect for what we need!", 
    "One thing missing from this chair were little floor protectors that are supposed to be at the bottom of the legs. . . in fact, there is a hole for popping in such a protector, but none were included.", 
    "everything was very good - comfortable, easily cleanable microfiber material, sturdy, delivery times.", 
    "These are nice chairs. They do not get heavy usage, so I cant comment on that, but they are quite comfortable (even for my king-sized husband) and quite refined-looking.", 
    "So. First, you're buying a pair of chairs for $$$, so you do get what you pay for. That said, the color is a perfect neutral. The wood legs go perfectly with our reddish table from Crate and Barrel. They look great, feel great, and no one knows that they were so inexpensive (except my parents who bought them for a wedding gift for us!) 6 of these took me over 3 hours to assemble, and I am the Queen of assemble-at-home furniture. Definitely invest in a hex drill bit set if you order these; being able to use a power drill helps a lot. That said, most of the chairs were a pain to line up correctly; and two chairs wobble substantially. We have a townhouse thus the chairs on the wall side of the table are little-used and we just put them there. Also, the boxes arrived absolutely destroyed - don't know if that's UPS's fault or Overstock, but it's worth mentioning.", 
    "I really liked these, you will need to use something with a torque to screw these in faster and the directions weren't very clear about the 3 different screws either. But they are very nice", 
    "I love my mew cjaors. They were simple to put together, although I had a little trouble leveling them. But, I did, and they're comfortable, easy to clean. Perfect. Love Overstock.", 
    "I wanted small solid chairs for my living room for extra seating. These look very nice and are comfortable. If you have little space but need more seating these work great.", 
    "Already had some of these chairs but wanted to have at least 6 for our table. Matched perfectly.", 
    "Very pleased! Have used chairs at our dining table for about 6 mos. with no issues. Excellent product and value.", 
    "Poorly constructed. Will not last for very long. Look fine", 
    "I love these chairs! They wipe down clean and easy (red wine, kid's and dirty fingers, parties) and look expensive. I only wish we could choose the stain of the legs as the cherry finish does not match my espresso table. It's probably an easy stain job but I'm not a DIYer. They were really easy to put together and you can't beat the price. I always get compliments! Everyone asked me what I have done differently in my breakfast room and it's only the chairs!", 
    "I love my chairs. I would definitely recommend them to anyone. They look elegant and are very comfortable. They are also very easy to clean with a little soap and water. All comments I have received are very positive.", 
    "Those chairs are very comfortable and my husband love them. I will recommend them to my friends.", 
    "The Parson chairs replacied oak dining chairs that were cumbersome and uncomfortable. Very pleased with how comfortable they are. The hex wrench(included) made putting the chairs together a breeze.", 
    "I bought 6 of these chairs, they look very good, but they are light in weight and easily tipped over.They are comfortableand easy to clean. The reason for the 4 stars is because of the weight of the chairs.", 
    "The chairs arrived with no damage, easy to assemble and I was very pleased with the color and appearance. They are very comfortable and easy to wipe off stains. I would highly recommend these chairs.", 
    "These chairs are really good quality for the price. This is the lowest price I was able to find for this style and quality chair. The chairs themselves are a good height (not too short) and wider than I expected, which was nice. They are very comfortable and appear to be pretty solid. We found them easy to assemble and did not need any additional tools. They do not wobble at all when you sit in them. The only problem we had was with the shipping. The boxes arrived pretty beat up and one of the chairs had a completely broken leg beyond repair. Overstock was quick to handle the return request, but did not have the available parts to send me out a replacement. Instead, I had to take a partial refund. Good chairs. Bad shipping and packaging.", 
    "Easy to assemble and really nice chairs for the price!", 
    "I really do enjoy these chairs and would recommend them highly but it is a bit of a challenge to get the screws in place when attaching the seat to the back, but overall love these chairs for the price!", 
    "I needed additional chairs to go with my dining room set which has off white leather chairs. These chairs blended well with the set. The are tan and microfiber which gives the room a little flair without color. THe padding is perfect. Very comfortable. They are not oversized and may be a little slim, but I like that they don't take up a lot of space and I can fit them in a corner when not in use. The wood and microfiber are of a really good quality. I've seen similar in the stores for much more. I am very pleased with my purchase.", 
    "Luv luv luv these chairs... Great style for my little dining area. The color is just as pictured and the fabric is very nice not cheap at all. Strong chair not a weak chair, can hold some weight on it. I\"m so happy with my set, going to purchase another set as soon as they get them back in stock lol Also you can't beat the price, tried shopping at Pier 1 the cost was over the price for 2 with this set. Well worth your money!", 
    "Purchased two chairs before the holidays to add seating, liked them so much that I purchased two more and replaced the old chairs. They gave my old dinning room set an updated look. Just love them.", 
    "The color was exactly what I expected. The legs were a little darker than what they appear on the website - I'd say more of a dark cherry wood which was perfect because I bought them for my office which has a cherry wood desk. I rated 4/5 because the padding could be a little more comfortable when you sit in the chair. But for guest office chairs that have been sat in so far about twice, these were a really great price and purchase!", 
    "We needed new chairs for an old table that fits our space. These chairs were perfect and we were happy to see they have nice high backs and the seats are so comfortable. Easy clean microfiber also is a plus. They were easy to assemble and would recommend to anyone. Thanks Overstock!", 
    "Great chairs. One leg is shorter on one but fixed it with sliders. I would recommend them for a sale.", 
    "I bought these chairs as additional seating for my living room and they are just perfect. The color shown in the picture was on point, it matched the rest of my furniture perfectly. They are the perfect accent piece. They are pretty easy to put together", 
    "I love these chairs! They are a great neutral color and the perfect size. They look expensive and changed the whole look of my dining room. I have received a lot of compliments from guests!", 
    "Easy to assemble. Took 20 minutes per chair because I assembled it alone. Great for wanting to achieve a classic look without paying a lot.", 
    "The chairs arrived promptly after purchase and was packaged well. Took me about 15 mins to fix the legs on each chair. Pretty straight forward and easy. The quality is good not great - the underside of the chairs is \"unfinished\" - just bare wood and holes. No one is going to look under there and for the price its great. Love it for our dining set.", 
    "I recieved my chairs today and I love them. They really compliment my dining area. They are comfortable and sturdy. They were pretty much easy to put together my 14yr old put them together. The only problem was some of the pre-drilled holes didn't line up so well. After putting the first chair together a drink was spilled on it. I used a little soapy water on a rag and it came right out. I will be spraying them with scotch guard, but all in all the chairs were a great buy.", 
    "I ordered 2 sets of chairs..it took me awhile to assemble the chairs but, time I got down to the 3rd chair I was a pro. The chairs are comfortable and look very elegant in my dining room. I was hesitant about ordering furniture on line but I am glad I did!", 
    "I had been looking for Parsons Dining Chairs on and off for a few years. I really didn't want to spend too much for them. When I found these on Overstock, I decided to give them a try. I replaced four rather ornate carved Chippendale chairs with the Parsons chairs. I call them \"bridge\" chairs because there are very few styles that these chairs will not go with. They are simple and always seem to \"bridge\" the gap between styles. We are very happy with the way they look around our round, dark wood table, and the way they update the room, which is open to the kitchen (I also bought two Parsons counter stools for the snack bar that faces into the dining room). The Parsons chairs took the formality down without sacrificing style. I also like the look of upholstery because there is so much wood in a dining room. The only negative I can think of is that they are very lightweight, although they seem very sturdy. As far as assembly, my husband, who is very handy, had a little trouble putting the first one together, but the rest were relatively easy Both of us took turns sitting on each chair before he tightened the bolts down. That is a step that seems to be necessary to even out the legs. The color is great - a light mushroom beige that will blend with most color schemes. I highly recommend!", 
    "i read many of the reviews, good and bad. mostly it seemed the problems were about putting them together. when the chairs came, i told my husband about everything i had read...my husband used to be a carpender, he listened but dismised me..refused the instructions after listening to me..had absolutely no problem putting them together..they are perfect, very confortable. i havn't had anything spill yet, but i can tell it won't be a problem, everything should just brush right off. i am very impressed. the price was to die for.", 
    "I bought two sets of these chairs to use in a waiting room for my office. The waiting room does not get heavy use....one person at a time for brief periods. They are fine for that purpose. They were fairly easy to put together, although I had problems with one back leg on one chair. With some help I did get that together. Otherwise I was able to assemble all the chairs by myself. The legs were a little uneven but I solved that problem by attaching pads to the bottom of each chair. I am not sure how they would hold up to heavy use, but for my purpose they are just fine.", 
    "These chairs are beautiful. Perfect for my dining room. We followed the advice from some of your other shoppers and they were not hard to assemble. A super value!", 
    "The chairs arrived in about a week's time. Putting them together took some time and patience, but is definitely doable. Two of the chairs had one leg that was slightly shorter, but its fixable with one of those button chair glides. That being said, I love the chairs. They gave a fresh new look to my dining room and are quite comfortable. Can't tell you how they wear since I just received them. But right now I am very pleased with this purchase.", 
    "I just got these chairs and was hoping (fingers crossed) the legs would match my dining room table. Turns out, they do! The picture shows a warm mahogany leg and that's exactly what these chairs feature. The chair itself is incredibly comfortable and the microfiber is soft and durable. The chairs would be a nice, classy addition to any home.", 
    "I was glad to have read the reviews before my purchase. These chairs were easy to put together and look great in my room.", 
    "I bought 6 of these as a gift for my mother (and me since the Windsor chairs they replaced were nice looking but not even remotely comfortable). She loves them. They are not easy for the average person to assemble (I would recommend two people, one who had some additional tools) but once assembled are extremely sturdy and very handsome and comfortable. A damp cloth is all you need to wipe away a small stain and even a day old red wine stain came out with very little effort and a tiny bit of laundry detergent suspended in hot water. They are also versatile as additional seating in a living room for cocktail parties, etc.", 
    "Nice chairs. Didn't arrive packaged well from manufacture. Black stains on one chair however overstock sent me another one. Hard to put together with Allen Wrench provided but went to store and bought a drill bit that matched wrench. After that only took ten minutes for each chair. Chairs are nice and lightweight. Great for my dining table.", 
    "I ordered 4 of these chairs and after putting them together, I ordered 2 more. They are easy to move around, comfortable and quite sturdy. A real bargain at this low price. Be sure that you DO NOT tighten the bolts more than 80% until the whole chair is put together or you will have difficulty lining up everything. Then just go back and tighten completely. The chairs are very neutral and blend with everything. I plan on ordering the counter stools next.", 
    "Chairs came well packaged. Easy to assemble. The seat frame cracked on one. during assembly REplacement came quickly.! Very happy with the product", 
    "Decided to buy these two chairs after reading the positive reviews. They arrived within the time frame given and were easy to assemble. They were the perfect chairs for the extra seating we sometimes need in our small condo. This is the second time I have ordered from OverStock.com. I will will continue to seek quality products from this company.", 
    "microfiber is comfortable and style is attractive. after complettely assembled, legs aren't perfectly balanced. this would be a problem if kept on hard wood or tile floor. our use is in carpeted are, therefore not as big of a problem.", 
    "I bought 4 of these chairs to replace the broken down ones that went with the dining room table that was still in good shape. They were fairly simple to assemble. They look modern and update my dining room. The wood legs are kind of light cherry color and match my old table perfectly. I would recommend these as replacement chairs to update an older set if you don't want to purchace a whole new set.", 
    "I would recommend these chairs as a good solid side chair. They are comfortable and sturdy. ls", 
    "I bought these for extra seating when my grandchildren visit. The fabric looks like it will hold up. Comfy inexpensive chairs.", 
    "I had hoped to have help, but when it did not come I decided to tackle the job alone. This 81 year grandma had no trouble with the first chair as I worked on the floor alone. For the second chair, I sat on my sofa and watched TV and all was finished within 2 hours.", 
    "These chairs were exactly what I was looking for and at the best price I could find anywhere. They look like they were more expensive and the leg color was the same as in the photo, which was important as they needed to coordinate with the china cabinet and dining room table. I'd buy them again.", 
    "I bought 2 chairs and absolutely love them -- the color, the finish on the legs, and sturdiness. And you cannot believe how simple they were to put together. No screwdirivers necessary. It comes with a small allen wrench and the directions are very clear with only 3 steps required. I had no problem assembling by myself. I really didn't expect such a quality product if I had to put it together but I don't think I could have done better had I purchased something similar already assembled from a showroom.", 
    "Love these chairs. Had friends help me put them together and was not too tough at all! They look great!", 
    "I ordered these chairs for a new dining room table I built. They were easy to put together, and I added felt pads to the legs. The chairs look high end, and expensive, but were more than reasonably priced. This was my first purchase on \"Overstock\". I just ordered counter stools and am excited to get them, delivery comes in a reasonable time, the wife and I are very happy with our buy.", 
    "When recieving the chairs I said to myself \"great they must be assembled' this is going to be a headache. WRONG, I had no problem assembling them and they looks great in my dinning room area", 
    "Excellent quality and very comfortable. All food and stains wash away easily. Only problem was putting them together. They screws kept stripping, but he was able to put them together. Just add high quality screws. Love them very much.", 
    "Love these chairs and very pleased with the purchase! Great price...and I have extensively searched for these replacement chairs. Arrived quickly even though it was the Holidays. Easy to assemble...no horror stories! Paired these chairs with an antique Rock Maple Table that is in a breakfast nook...perfect! Would highly recommend.", 
    "Seriously great chairs for the price. They are easy to put together, very sturdy, pretty color and easy to clean! We get complemented all the time on their look and comfort! We plan on buying more", 
    "These chairs are great in a traditional or contemporary setting. They look great in my dining room.", 
    "couldn't be happier...good quality....comfortable....great color....would recommend", 
    "My first shopping experience at Overstock but definitely not my last.", 
    "I love these chairs. They're a beautiful color and so comfortable. My husband (who was very skeptical about buying chairs on line) LOVES them as well. We got two pairs, and we're considering getting another. Assembly is a two person job. There were a few of the attachment screws missing, but they were easy to find at the local hardware store. I recommend this product.", 
    "We got 2 sets of these to go along with an oak table that we had refinished and stained to look like Cherry. I wanted some chairts that had Cherry legs instead of \"espresso legs\". These fit the bill. They are comfortable. My partner put them together in about 30 min( 2 chairs). We bought a can of scotchguard and did that ourselves. You'll need two cans for the 4 chairs.", 
    "I bought the chairs for my son and his family who just got their own place. They were pleased with the chairs. I would recommend the product.", 
    "These chairs are absolutely and very good quality. Even though they needed to be assembled, which was not difficult, they were well worth it because of the price. Would recommend.", 
    "I used these with a 60 year old dining room set as end chairs and they are great. Solid chair, comfortable, easy to assemble. I wish 4 more would fit around my small table.", 
    "I love these chairs. They shipped quickly. I did have help putting them together, but that went very fast. They are just beautiful with my new dark wood dining room table. Loads of wonderful compliments. Great product at a great price!", 
    "Very comfortable chairs. Didn't take too long to assemble, as we had an assembly line set up with one person laying out bolts and two others holding parts together and screwing in bolts. Chairs look terrific with our dark wood table.", 
    "We have been looking for a dining room set for 2 years. We found a table and server that we like but didn't think the chairs where worth the money. I came across these chairs and they where just what we had been looking for. They look great with the table. I have gotten compliments from everyone that has seen them. My mother loves them and so does my adult daughter. They were a little tricky to put together but we managed to get 10 of them together in about an hour and a half.", 
    "The investment in these chairs are so worth the price the are beautiful and look great in my dining room.", 
    "Overall, these chairs are very nice for the money. I'm pleased with their appearance.", 
    "I really like these chairs they are comfortable and look nice. Tthe assembley does take some time and patience, but is worth it for the price.", 
    "I have been looking for reasonably priced dining room chairs that were comfortable and look nice for several years now. (My old ones were falling apart.) I found these on Overstock.com and because of the price, thought I would try them. I half way expected to be returning them, because I'm generally disappointed when I go with something that seems to be too good to be true; but I am totally pleased with these chairs. I got them right before Thanksgiving and everyone thought they looked really nice and thought they were comfortable too. You have to be patient putting them together, as other reviews mentioned; but I am so pleased with my new chairs.", 
    "I am happy with the chairs and I am planning to order two more. They were easy to put together. The first one took a little while but the next one in no time. Very pleased and I love overstock . com I have ordered alot from the site and have never been dissappointed.", 
    "These chairs are attractive and comfortable and a great buy that complimented a sofa nearby. I would recommended these!", 
    "I would highly recommend these chairs. I am thinking of ordering another six because I was more impressed than I thought. Very good for the price.", 
    "chairs are great for my breakfast area and no problem with assembly", 
    "Love these chairs so much got 4 more for my daughter. Very comfy and very stylish!", 
    "I love these chairs. Bought two, then two more. Very sturdy and nice. Look way more expensive than the actual cost. My ONLY complaint is the second set arrived with a \"musty\" smell which has been lingering for a couple weeks. I have Febreezed them once, will have to do it again. perhaps warehouse was damp? Didn't have this problem with the first set of chairs.", 
    "The chairs drilled holes did not match up. It was a challenge and time consuming to put them together. If you get them assembled they are nice looking chairs. I would not recommend anyone to buy them unless they have exceptional handyman skills.", 
    "I was pleased with the product, but due to inadequate packing, some of the hardware was missing. The box was broken that the chairs were shipped in and the hardware had spilled out of the bag and lost along the way.", 
    "overall satisfied with the chairs,five are great ,only one has a problem.color is great,price is outstanding.The chairs were a gift to my son.", 
    "When I returned from a trip. my husband had the chairs assembled and sitting in the den . It looked like they were custom made for the spot ! All I did was toss on a little throw pillow and I have the perfect, neutral color. decorator piece that looks like they were originally coordinated to go there. Excellent !!!", 
    "very nice quality; much, much better than I expected, beautiful and elegant. Adds class to my dining room", 
    "I have had my dining room set for some time and recently moved into a bigger space so the 40' table and 4 chairs looked lost. One solution was to buy two chairs entirely different and put them at either end of the table. These chairs fit the bill. They matched the stripe in the seat of the older chairs and blended in well. But now I want to toss the older chairs and buy more of these. They were very well priced, beautiful and comfortable and look so elegant.", 
    "Being an 84 year old widow I read all of the reviews of these chairs and decided to buy them. Putting them together had to be figured out as placement was important to me. The screws were all there and TIME was not my problem. Little by little I put the first chair together..I learned to put the screws in very loosely..and screw them in a little bit at a time. First chair took me 1 1/2 hours ..second chair 45 minutes. Bless expereince", 
    "I took a chance and purchased 8 of these chairs for my dining room and I must say I'm glad I did. The quality of the chairs is excellent and very cofortable. They are not as difficult to build as I thought they'd be and compliment my dining room perfectly. Although I read they are pretty tough standing up to daily wear & tear, I purchased some covers for them just in case. Can't wait for Thanksgiving to show them off. :-)", 
    "These chairs appear to be much more expensive than they are.", 
    "Theses chairs were a great deal. They were easy to assemble, it took my husband and I along with the powerdrill about 30 minutes to set up 6 of them. The most difficult part of the assembly was lining up the holes. The chairs are a decent quality of the same kind of you would find in any mid point furniture store, but at at least 30% less than the price you would find in the store. Even though microfiber cleans up easily, I scotch guarded mine before use as we have teenaged boys who can be clumpsy at the dinner table! All in all a great deal, buy them, you won't be disappointed.", 
    "Chairs arrived promptly. We use them at our dining table; they are sturdy and attractive. Assembly took two of us and about an hour which is worth it considering the very affordable price of these chairs.", 
    "These are fantastic quality, neutral color to go with almost any decor, easy to dress up or keep causal. The review about the legs of the chairs being a bit difficult to put on turned out to not be an issue. We had very little difficulty and the chairs look like they cost a lot more then they actually did, and I'm VERY picky about my furniture purchases.", 
    "Unbelievable chairs for the price- easily worth twice as much. The chairs look and feel terrific. They are sturdy, not at all wobbly. Assembly not bad at all. We love them and wish we had ordered them earlier! We had looked at many chairs over time. Nothing compares to this one for the price. Can't go wrong with them.", 
    "had some trouble with the assembly of these chairs, due to some of the holes not being exactly aligned and also one of the chairs was missing the hole, so we needed to drill one. But for the price and the look of the chair they are great. we love these chairs and they feel very sturdy. great product.", 
    "These chairs were easier to put together than what previous reviews stated. Just make sure you get all the materials out and attach nuts to bolts before assembling. Re-tighten after upright and after you sit on them once. They were just what I was looking for at a very reasonable price! So very comfortable and look elegant in my dining room! They are a huge set up to what we had before. We also found out early that they are extremely easy to clean. Just a quick wipe with a wet cloth and the drop of syrup deposited earlier in the day disappeared. They are also not as bulky as they may appear in the photo; slim and fit perfectly at the table.", 
    "I absolutely love these chairs! I was very sceptical about buying these chairs on-line (This was my first buy on Overstock). I kept going back every once in a while for a long time before I bought, but if you read the information AND the reviews you can be confident in your buying. I bought six! I did have trouble putting them together but I incorporated my husbands help and got them all together. I get so many compliments on these chairs. Not only how good they look but also how comfortable they are.", 
    "I absolutely love these chairs. The only reason I didn't give them a \"5-star\" rating is because they smell a bit weird, but I guess that's just the microfiber upholstery and it should go away (it's getting less and less as days pass.) Exactly what I wanted to go with my new table. As usual, Overstock had the best price and they delivered super quick. Oh, and they were NOT that difficult to put together. I bought six chairs and it took me about 3 hours to put all of them together (by myself) and I took breaks in between.", 
    "Ordered 2 of these chairs to accompany a recent table purchase. They were a perfect match and a perfect fit. The chairs are much prettier in person and look much more expensive than they are. It is obvious they are not the highest quality, but certainly adequate for our needs. After helping my husband assemble, I can understand the frustration of others regarding the assembly instructions - a little awkward - but so worth it. In fact, I'm going to order 2 more to complete the set!", 
    "Great price, I love that it is shipped to my home, I found it easy to put together. I am very happy, I ordered 2 sets to use as side chairs for my dining room.", 
    "Overall, I like the chairs, the color works well and is as described. The quality of the construction is fair, but for $XX a chair, I can't expect anything more. On each chair 1 leg was a little shorter than the others but it is not noticable when you sit in them, they do not wobble. The chairs are comfortable and I am happy with them for the price, but if you are looking for good quality chairs, you will need to spend a litlle more.", 
    "Ordered these chairs as a wedding gift. They were very attractive, and looked great with the wood/glass table that the couple was using. Would order these again, if available.", 
    "They are great chairs and look great in our dinning room. I traded them for chairs I had for 20 years and they updated the room great. They took some time to put together but worth the time and money.", 
    "These chairs look great. I don't have any complaints.", 
    "Fairly easier to assemble. One chair arrived broken but O.Co promptly replaced and everything was handled through chat and email.", 
    "What great chairs and for such a great price! We purchased 4 of them to go with existing dining chairs. They blend perfectly and add a touch of class to our dining table. The assembly was easy, although time consuming, as we had to assemble 4 of them. Also, 2 of the legs on 2 of the chairs were a bit shorter than the others, so we just added a felt pad to the bottom and that solved the problem. We love the look of the chairs and would recommend them to anyone!", 
    "they look beautiful in our closing room. Make the room look very rich.", 
    "The only reason I would not give these chairs an \"Excellent\" is because they did not come assembled and it was a long and tedious process to put them together. Otherwise, once completed, they're great. My husband and I put them together and it is definatley a two-person job, as others have mentioned. He did use a drill because the little Allen wrench that comes with the chairs would have taken forever to complete. I do not recommend purchasing these if you can't get a handy person with a drill to help you! I, too, have seen them for A WHOLE LOT more in my local mall just last week. Overall, I would highly recommend them!", 
    "Buy them! Excellent chairs for a small space needing extra seats. I like the chairs, the price and the service. packaging was good, assembly was not too difficult. I put both together in less than an hour by myself. Alignment is key but once you have that the rest goes quickly. As another reviewer advised - organize the screws since they are different lengths and must go in the correct places. Enjoy!", 
    "Used these chairs on either end of a 9 + ft dining room table. Blends well with the mahoganny table and chairs. Love the way this updated the look without the cost.", 
    "The chairs arrived within a few days and definitely had \"some assembly required\" - the first one took a while, but after that, it wasn't bad. Instructions could be a bit clearer, but previous reviews mentioned the leveling process, so he got that done. We are thrilled with the chairs - a great product at a great price. They feel like an expensive chair and meet or exceed our expectations. So glad we made this choice!", 
    "These chairs are comfortable and look very nice. We did put a small slider on the legs which made them move on the carpet more easily. The only negative is that we had to have help putting these chairs together. It was worth the few dollars that we had to pay for assembly--we are pleased with these chairs--they are well made and dress up our room", 
    "I purchased 3 sets of these Parson chairs for my mother. She needed them to replace her existing dining room chairs that had seen some wear and tear. The nuetral color of these Parson chairs match perfectly with her set and gave it a more modern look. The wooden legs happened to be the same color wood of her dining room table. She is extremely happy with them.", 
    "great chairs for the value I have them in the bedroom, good size", 
    "I saw these same exact chairs at stores, and the price on Overstock was so much cheaper! The chairs look a lot more expensive than they actually are, and I've received compliments them already. The assembly is difficult. Some of the holes in the chairs did not line up properly, so we had one chair that we actually had to replace. Overstock customer service was amazing though, and they shipped a new one to us within days. I was incredibly impressed. So although I wouldn't want to go through the assembly again, it was worth it in the end. Such a great value for the money.", 
    "I was very pleased with these chairs. ONly issue was one of legs split when I was screwing it in for assembly but when I contacted them another was sent out asap .. much faster receipt of part than I expected. They look good, color was as pictured and sturdy", 
    "I had been eyeing these chairs for a couple of months contemplating replacing my existing chairs. The chairs finally went on sale and I decided to buy them and I'm so glad that I did. These chairs are great! The description is spot on and the quality is excellent. My kids were so excited when they were put together which only took my husband about 30 minutes for 4 of them. He did say he had to work with the screw holes a little but he was able to make them work. They are very sturdy and comfortable. They clean up nicely with a damp rag. They are somewhat taller than I expected but they dofit under a regular height table. They are a little on the dressier side so if you're looking for something more casual, these may not be for you. Overall, I'm very happy wih my purchase!", 
    "I needed two extra chairs for our dining room and didn't have time or money to do a lot of shopping. Found these and thought they would work, they did and used them last night for a dinner party. They look nice with existing chairs and I am happy with them.", 
    "I love these chairs - they are easy to assemble and make a great addition to our dining table.", 
    "i recently bought a beautiful antique walnut/cherry antique dining room set ,but unfortunately it had one broken chair. I looked at many magazines showing tables with four matching chairs and two parson accent chairs to complete the set. I took a chance by buying the above set and I was extremely pleased with the finished look. Easy to assemble,sturdy,nice fabric details, color,and legs of chairs match my set perfectly. Many compliments by friends and family!", 
    "I was very pleased with expediting of shipping, packaging, product.", 
    "Chairs appear to be well made and easy to assemble, but after they were assembled I noticed that 2 of them were rocking due to uneven legs. I gotta figure out a solution for that. The chairs look good and for the price they're worth it even with the leg problem.", 
    "chairs came in today, was nervous about the color but when i opened the box i was so excited. color was just what i has hoping for. took about an hour and a half to put four together, probably easier with 2 people. love the chairs. i have a round glass table and they fit perfect.", 
    "Chairs are very comfortable after the work of putting them together. Very worth it!", 
    "The chairs took about 10-15 minutes per chair to put together and I bought 6 of them. The price is extremely affordable and the quality is great. Great for my xxxxx black table and buffet set. The legs are brown so they do not match my set but i will just sand the legs and paint them black. I will need to add those things to the bottom of some of the legs since they are not all exactly the same length on 2 of the chairs so they are a bit wobbly. Easy fix", 
    "I looked a long time for chairs to update my table. These chairs are a very good buy. For the price they cannot be beat. My husband put four chairs together without any problems. My dining area looks so modern now. I cannot say enough good thinks about these chairs. Love them.", 
    "very nice chairs. could not be happier. paired them with glass topped table and they look incredible. color was accurate, putting together not an issue at all if you follow directions and pay attention to screw length. nice purchase, great price.", 
    "Handsome looking chair at a very good price. Easy to install. However, beware that there are some sharp nails on the bottom of the chair leg which may scratch your wood floor. Nothing major and a relatively easy fix.", 
    "These chairs are wonderful! I ordered a table from overstock too, but it didn't come with chairs. So I searched the site and found these beautiful parson chairs. I read the reviews, and many people said the chairs were difficult to put together. I disagree! Once you do one chair, you figure it out and it is really easy. I got the hang of it, and I was able to assemble each chair in about 15 minutes. Not bad! And once assembled, they are extremely sturdy. No wobble, no shake. The chairs are very comfortable to sit on, and they look amazing with the \"versatility round dining table\" found on this site. All in all, these chairs are a great quality, built sturdy, and come at an incredible price. My next purchase will be some slip covers from overstock, so that I can change the look of my dining room whenever I want to!", 
    "Had to put together myself:(. But looks great and very comfortable", 
    "we really like these chairs,bought 2 sets. Although the color is darker than the picture, as some reviews mentioned,but it still looks very nice with our dinning table. The chairs look like more expensive than the actual cost, and very sturdy. And most important for me is very easy to clean.(we have a 2 year old lady, put the dirty hands on and on, but still very easy to clean up,so happy with this). The only problem is 2 chairs' legs not even,as some review mentioned before,that's the reason I just give 4 stars~~,but we still can fix the problem. Overall, it's really good,and worth the money! Will buy 1 set again. Good luck~~", 
    "Very nice chairs! Great for the price. Looked many other places at the same type of chairs and they were more expensive. Had issues with defects on one, shipped a replcement very quickly at no cost. Have had them for 3 months; my 3 year old spilled apple juice on one and it cleaned up very easily with no water marks. These are the perfect fit for a formal dinner room - that you still would like to use. And if you get them at a good price - order them! Because they go out of stock quickly, and it may take a few weeks for them to come back in stock.", 
    "I needed new chairs to go with an expensive walnut dining table, but didn't want to break the bank. These chairs look great and the price was perfect. I am happy with the quality -- the seat isn't too narrow and they feel very sturdy. They were easy to assemble -- I assembled all 8 of mine by myself. Each chair took me about 10-15 minutes to assemble. The instructions are very poorly written though. Overall, I am incredibly happy with this purchase and would definitely recommend these chairs to others.", 
    "I was more than happy with my purchse. I had already ordered 4 and got two more. They were just what I was looking for in my dining room to update it a bit. They are the perfect color and size. The reviews had indicated they were difficult to assemble so we were prepared. The first one took my husband a liitle while, but once he had one together, the next 5 were pretty easy. They arrived in just a few days, were packed well - no damage whatsoever. I have purchased quite a few things from Overstock.com and will continue to do so.", 
    "Yes, one of the chairs had issues with cross threading, but once I slowed down, wiggled the pieces while screwing the bolts in, thet were fine. For shipping, the bolt package has a small amount of oil inside. I started using this on the treads, and it helped. The chairs were easy to build, and sat flat. Don't tighten the bolts until you flip the chair over and sit on it. Only snug. This will even everything up, and allow the legs to sit flat. Reach up, tighten a bolt a leg, then flip over and finish. Very comfy, they look great, and I would buy again. Great prie too.", 
    "I bought 8 of these chairs to compliment our new 68 round table and I am very satisfied. The chairs are very nice looking and look more expensive then they were. I am very pleased with the price since the price at other retail stores were double. I put all 8 of these chairs together without any issues in a span of one week, mostly in the evenings. The color is what I would call a mushroom color and the fabric is a micro swede. There is a couple of areas on the fabric under the chair that aren't put together that well, but they are well worth the price.", 
    "I bought these chairs to spruce an older dinning room set. The asian cherry wood matched perfectly. They were fairly easy to assemble. The fabric is nice, construction seems very solid. These chairs are great, you won't be disappointed !!!", 
    "First- assembly- The first chair is a pain to get together, after the first one it goes a lot faster. Look- the fabric is nice, and my kids are filthy. I have been able to easily wipe up their messes on them, and that is super convenient. The color is a beige with a hint of mushroom. It is not to brown a beige, more a neutral beige. Sturdy- they are pretty sturdy. I have no problem with them, but my 10 year old leans back in them and the legs loosen up easily and have to be retightened so they are not a death trap to sit on. Overall, they look like a pricier chair. I am very happy with them. I would buy them again and recommend them to others.", 
    "Beautiful! Very easy to put together. I did it alone. Just be sure you use the proper screws as there are 2 different sizes and they are similar to one another. Very comfortable and luxurious. I purchased 4 for my round, glass dining table and would highly recommend them!", 
    "These chairs are a great buy. The color is just as described and they are a very nice shade--not overly beige. They were quick and easy to assemble and they look terrific as guest chairs in my home office.", 
    "I have been very happy with these chairs. They were relatively easy to assemble and once together they are very sturdy. I have had them for several weeks now and am very satisfied with them.", 
    "I agree with everyone who purchased these chairs It's a no-brainer, folks. You'll be happy!", 
    "I bought these chairs to stage my house for selling and wish I had done it sooner. These are beautiful chairs and are exactly what I was looking for and having trouble finding. They will be used for years. Thank you", 
    "OK...This is my first order on Overstock, and I am so happy with my purchase! I had no idea what to expect. 1st...these chairs go perfect with my antique farm table. They are very sturdy, very comfortable and the best part is the fabric. After we had them for a few days, my husband asked if I scotch guarded them. I said \"no\" they came scotch guarded..he advised me to add some more as we have a 7 year old son that makes allot of messes. Well, 2 days later I was polishing my table with Old English Oil, and YEP, I spilled OLD ENGLISH on my new chairs..just a few drops..but still. So, I cleaned it off with a damp cloth with water and dish soap and hoped for the best..YEP - a few hours later, the chair was dried and the STAIN WAS GONE!!! I love these chairs. You can't go wrong.", 
    "Beatuiful chairs. Easy to put together, just what I wanted and at an unbelieveable price.", 
    "These chairs look much more expensive than what they cost. The fabric is rich and the color is very neutral. I purchased them to update an existing dining room set and they have completely revitalized the look. They are sturdy, comfortable and have more style than all the other parson style chairs I looked at. No problems with assembly, they arrived quickly and in perfect condition. Don't hesitate to purchase!", 
    "I purchased a set of these chairs to go with the brown striped Parson's chairs. The chairs are designed to be extra seating for the dining if needed but find their home in two bedrooms. The chairs look much more expensive than they are. They are comfortable, even for my husband who is a larger person. We did have a bit of trouble putting them together. All the parts were included but some of the screws were difficult to get in-seemed as if the wood was not \"threaded\". My husband is handy so it didn't create too much of a problem however; if it was just me it would have been. Overall the chairs were a great buy and look great as a dining chair or as extra seating in a bedroom/living room.", 
    "I love these chairs. They are not top of the line, but look great at the head and foot of my dining table. We seldom use this room but I wanted an updated look. These fill the bill and blend nicely with traditional, or modern furniture. Very clean lines and you can't beat the price.", 
    "These are very nice chairs. Comfortable and strurdy. However I was disappointed in that the color is really brown -not the light color shown. I may have to cover them.....", 
    "These chairs had really excellent reviews and the reviews are right on! The chairs are very nice quality and sturdy. They wipe off easily and we have two young kids so that's a major plus. Some of the leg holes were off a bit but nothing that impeded putting together the chairs. Some of the legs are uneven and wobble a tiny bit but again, nothing too major and easily fixed with those pads you can put on the bottom. They really do look expensive and changed the look of our dining room which is what I wanted! LOVE THESE CHAIRS!!!", 
    "Do not buy this product is you are a mother who has to assemble this by herself. Difficult to assemble as some of the alignment was off and had to be adjusted. Once assembled, product was study and looked good, but VERY DIFFICULT TO ASSEMBLE. Needed more strength than I had.", 
    "Love these chairs. I ordered three sets and they fit perfectly at my dining room table. The seats are quite comfortable and the backs are nice and high. They came in two pieces and were easy to put together. You only had to put the front legs on and the seat. Easy enough. The color and fabric are exactly as described in the ad. I recommend them for the quality and price.", 
    "We ordered six of these chairs and they arrived within days. The color is just like the pictures and I think they're really classy. They are very comfortable. Not as sturdy as I would have hoped but I think that's the case with any piece of furniture you put together yourself.", 
    "The chairs were quite easy to assemble. No additional tools are needed other than the hex driver provided. The style is beautiful--and seats backs are nice and wide and would accomodate even a bigger person. Incredible bargain. I ordered 4 years ago from this site and the chairs have been used everyday since in the kitchen. They have held up wonderfully and look like new.", 
    "I bought 2 chairs first to see if I liked them. I really loved them. Then I ordered 4 more and I got a 10% discount. I would recommend them to everyone. Great price and excellent quality I definetely will buy from this company again", 
    "I ordered 4 sets (8 chairs). They were delivered within 5 days, making me very happy. I put the chairs together myself as the directions were good and it wasn't very complicated. The chairs are beautiful, a soft taupey-beige color that is very neutral. They look much more expensive than they are. I had priced parsons chairs in four other stores - I found no difference in look, weight, or sturdiness in these - essentially the same chair. I had a dinner party a few days later, one of my guests dripped butter on the seat. The next day I was able to wipe it away with a damp cloth/soap, no residue - good as new. The only irregularity I found was in one chair having a slightly shorter leg. I put a felt leg pad under it and it is fine. Had it not been for that, I would have given the chairs 5 stars.", 
    "I was very pleased with the 2 sets of chairs that I purchased. The color of the legs matched the color of my 40 year old dining room set perfectly. What a nice surprise that was! I put the chairs together myself but had to get one of my sons to tighten the screws. That was the only problem that I had with them and that was due to my lack of strength.They really make my dining room look updated and they are very comfortable. Thank you Overstock.", 
    "We purchased these chairs to \"update\" our dining room from upholstered chairs with brass frames. After reading other reviews on these chairs, we made our purchase and we are thrilled with them. The material is lovely and quite neutral; goes well with our beige carpet and nearby living room furniture. I did some local shopping/checking on parsons chairs, and these are much nicer than the budget chairs I found. Delivery was prompt and we are very pleased with the product and the service from Overstock.com.", 
    "Nice chairs, the color is pretty neutral, almost a beige with slight yellow cast. My 24 year old son put them together pretty easily.There was a broken dowel but it didn't seem to serve much purpose so we didn't request another one. One of the chair legs is off, leaving it wobbly but so far that is my only complaint.", 
    "I love my new chairs, they were very easy to assemble and they look great with my dining room table and my colors, the material is so soft and the chairs are firm......I would recommend them to any one that is looking for a great look for your home", 
    "The chairs look great in my bedroom. They sit beside my Thomasville round table and give an air of elegance. They had to be partially assembled. It was much easier with two people. It wasn't hard. If there was one disappointment it was that it was not American made.", 
    "These chairs are beautiful and very comfortable. They were very easy to put together. They do not sit perfectly level, but I am sure it is something I can fix fairly easily. For the money, these are a great deal!! I will be ordering another set to complete my dining room!!", 
    "I bought these as accent chairs for our Dining table. Turns out to be simply amazing and very comfortable. The color is bit on darker sise though! It was easy to assemble too!", 
    "I made my choice b/c of a review I read. The reviewer was right. An amazing bargain and good quality. Firm seat, comfortable chairs, perfect for our dining room table.", 
    "These chairs are imports. I was looking forward to finding out if they were put together well. After opening the large box I quickly looked at the chairs and put them together. Care should be taken when laying out the screws...some look similar. I had ordered two of same type of chair earlier. Borh sets of chairs are now at my dining table, and look stunningly good. If you need a change in the dining room, try these chairs....easy on the pocketbook too.", 
    "I love these chairs.....very comfortable, fairly easy to assemble (need two people for ease) color was perfect, shipping was fast!", 
    "When I purchase a product online, I'm often concerned that the photo won't match the reality - not so with this set of chairs. My extremely particular wife thought they would be perfect for our dining room and I was a little wary that they would not live up to the expectations. We were both very pleasantly surprised with just how impressive these chairs are for the the price. Once we made the determination that there were several different sizes of screws (we would have come to this conclusion much sooner had we read the instructions more carefully) these chairs were easy enough to get together. I do heavily recommend not tightening the screws completely until you've placed the chairs on a flat, level surface. This allows for the legs to somewhat find themselves and you'll avoid any wobbles. From the looks of them, we're expecting many years of enjoyment from them.", 
    "Love the way the chairs look and feel. Not very hard to assemble. I did 6 of them in one afternoon without my husband's help.", 
    "Ordered 6 and putting them together with my husband was a breeze. They are beautiful and comfortable to sit on. Still wondering what the color \"Peat\" is? Others have named it \"Soft Mushroom,\" and \"Beigey.\" How about \"Oatmeal?\"", 
    "Chairs are great and they look very push in my new dining room. I read reviews about how it's difficult to put them together but i like challenges so i was determined to do it. It probably took me 2 hours to assemble 3 out of 4 and I had problems with the last screw in every single one, so I decided to allow my husband to finish the job. He did not even need instructions! He completed assembly in minutes (and he is not an engineer but administrator!) ! I guess I was not the person for the job! Also at one point, it appeared there is not enough flat washers, but it's because they are greasy and stick together 2 may look like 1. Great chairs again!", 
    "These chairs are very elegant looking. I bought the 72\" Laguno trestle table from World Market hoping the fabric color, size and wood finish of the chairs would work with my new table. I am very pleased, however I think the chairs a more over-sized than they look in the picture. They are quite broad across the upper back which is OK but I won't be able to cram three people per side like I was hoping to for large gatherings. Oh well, it looks very elegant yet contemporary none the less.The wood is a rich dark brown with a hint of cherry, the fabric is definitely darker than the picture indicates more like a taupe but is still beautiful. The quality is as expected for the price...good-very good, the cushions are a little firm.", 
    "We were so pleased with our previous order for the Parson Side Chairs that we ordered another set. They look great as an addition to our dining table.", 
    "These chairs look and feel luxurious! Easy to put together...just make sure to read directions as the screws are different sizes so watch the guide. And it comes with an allen wrench so no problemo there! I have one chair on each end of my table and benches on the sides. Adds a nice touch in my eclectic dining room!", 
    "I got these chairs delivered to me yesterday and I was very pleased with them. They're very stylish and has a clean look to them. I would have given 5 stars if some of the legs weren't slightly shorter than the rest of them and if there was more padding on the back for support. Overall it's very nice and I think it's a good price for 2 sets.", 
    "The chairs are beautiful, sturdy and have a larger seat than expected. Of course I couldn't put them together but,my son and daughter in-law put them together within one hour. Well worth the money.", 
    "I bought 4 of these, expecting to get them at the end of next week. They arrived the day after i got the shipping notification. Very solid, comfortable and good quality chairs. They look great, and you can't beat the price!", 
    "These chairs were just what I wanted, just what I ordered. Unlike the comments from previous buyers, I had no problem assembling them with no wobbles. They are comfortable and good looking.", 
    "Great chairs for the price. Takes about 20 min a piece to put them together, not to bad. Read other reviews for tips on putting them together, very helpful! Look just as nice as chairs I've seen in stores for more than double the price!", 
    "I did receive my chairs in a timely manner. My husband put them together with no problem. However, the legs were not even and wobbled. I will need to get something under each chair to make them even. Also the color was not as shown in the picture. They are more of a taupe color. This was not what I was expecting but they still work with my color scheme. I purchased 2 sets of chairs. They are comfortable.", 
    "I was thrilled with the timing of the delivery. I love the appearance of the chairs. They are very elegant looking and quite sturdy. However, the assembly was quite difficult and one of the chairs has a short cut leg which we had to level. Overall, for the price, I am pleased with the item.", 
    "I bought 6 of these chairs for my dining room. It took my husband a little bit to get the chairs nice and even but once that was done, the chairs were beautiful. I have had these chairs for about 3 months and with 3 young kids messes were easily cleaned up.", 
    "Lovely chairs. Exactly as seen in the picture and description. Required to assemble the back to the seat and front legs but not too difficult. Be careful with screw gun to not overscrew into the wood.", 
    "These chairs are lovely and very good quality. My fingers hurt after 2 hours of trying to get the bolts to twist in correctly. They are a little darker than in the picture. Once they were assembled they were perfect!", 
    "The initial delivery was very expedient and received in time for Thanksgiving; however, there were 4 front legs missing with the initial delivery, and the required second delivery was too slow and not received in time for me to use 2 of the chairs for Thanksgiving. The chairs themselves are gorgeous. They sit well and are very sturdy. I love them.", 
    "The box was a bit damaged when received, however the contents were packed well, so there was no damage to the chairs, thank goodness! The chairs are sort of mushroom colored, much darker than the picture, however the fabric is quite luscious and the color actually worked better for me. I put the chairs together while watching TV. They were pretty easy to assemble. One screw on the second chair did not line up to insert completely into the hole, however the chair is sturdy enough without it. I decided to leave it vs. trying to redrill the hole. The chairs are perfect accent chairs in my family room and were easily moved to the dining room for extra seating @ our Thanksgiving table. Thanks Overstock!", 
    "These are great chairs! My husband had a little trouble at first putting it together but once he figured it out the second one was very easy. They were great for our Thanksgiving celebration. I never had enough chairs for everyone so needed two more. The fabric is very nice and the color is what I expected. Have ordered slipper chairs from overstock before and people are always commenting on how great they are.", 
    "I needed chairs for a large table in our dining room, and I had looked for months. I was getting desperate because we were having family for Thanksgiving, so I decided to go ahead and order four sets of these chairs all at once. I knew it was probably smarter to order one set first just to see if I really liked them, but time was against me. So, the chairs came, we put them together (worst part of the deal), and we used them for Thanksgiving. They are great! They are comfortable, they look wonderful in my dining room, and they look like they should have cost much more than what I paid. My advice is to use a drill with the appropriate bit instead of the tool that came with the chairs for putting them together. Once we did that, it went 10 times faster. Also, I bought slider tabs for the bottoms of the legs because they are somewhat raw and could scratch the floor.", 
    "These look amazing in my dining room and look just like the picture. Assembly was a little rough and my guys are handymen too! Main problem was off center holes drilled into the frame. They are sturdy once you get them together though.", 
    "I have my grandmother's circa 1910 dining room and the chairs had been repaired over and over. We needed something new. These chairs bring a contemporary flair to an otherwise victorian style dining set. The color would work with any decor and they are truly comfortable. We had no problem putting them together, but had a good laugh at the engrish directions! They arrived when promised.", 
    "I read everyone else's review before purchasing the chairs. I was still leary since I'm a very visual person who needs to touch and feel before buying; especially with furniture. I bought one pair and absolutely loved them. It didn't take long to put the two chairs together. We put a bit of hand lotion on the screws to get them to go into the holes easily. We both loved the chairs, so I purchased another pair. One of the chairs we had to re-drill a hole, but other than that, they were simple to put together. I am using the chairs with a round glass table in the kitchen. The color, size, height, and comfort are all fabulous. I would highly recommend these chairs.", 
    "I was totally satisfied with the product and upon delivery was amazed how good they looked. I was also satisfied with the online customer service rep. who helped me with the dimensions of the chairs so I could measure and make sure they were right for my dining room. I would definitely order from Overstock.com again.", 
    "Love love love these chairs... great color, (sort of a light taupe), great fabric, (plush but very modern and sleek) great size ( very comfortable, not rickity or dinky) and great price...one of these cost 200.00 at a local store and was not as well made. I bought 6 and used them to bring my oak pedestal table into the 21st century. They are a bit of a hassle to put together, but well worth it. Love them!", 
    "I bought 2 sets of these chairs. Was reluctant because this the first time I purchased furnature online. I needed chairs to go with my dining set. Look on Overstock and saw these chairs. I was really pleased with them. They were not hard to assemble which I did myself. My only complaint is the hexagon tool is a little rough on the fingers so put on gloves. They look great! The price was great and well worth it. I don't think I could have found a better chair at any local furnature store. You will be very pleased with this purchase.", 
    "These chairs were a great deal and looked great in my dining room. They aren't super sturdy but we don't use the dining room that often. For the money, you can't beat them.", 
    "Chairs worked out great. I bought 6. They are pretty sturdy and look good in the dining room. I loved the fact that I only had to pay $1 to ship all six. I used a coupon and got 6 chairs for $***. Can't beat that.", 
    "We ordered 6 chairs. They arrived in only 4 business days. That was a nice surprise. My boyfriend had most of the chairs put together when I got home. Even with all the tools he owns he did not have the metric bit to put on his power tool. Just like most customers he used the tool that was provided and it took 45 minutes per chair and his fingers were shot. That is the only negative we would give the chairs. Leveling the chairs is very easy though. In all the quality is very nice. When we put them with our glass table, the set looked like we spent a lot more than we did. We are very happy with the purchase.", 
    "I bought four of these chairs and plan to buy 2 more. They are very comfortable and clean well. The legs are off a bit so I bought leg caps at the hardware store to even them out and then the wood is not touching the light carpet I have. Works perfectly. They are a great value compared to the price in stores for this type of chair, just wish they had more colors available.", 
    "I love them!! I am planning to get 2 more. Thank you Overstock!", 
    "These chairs are very nice but a lot of work to put together. Some of them went together quickly others took redrilling the holes. I am very happy with how they look and agree with previous reviews that one leg is always off just a bit. I did loosen the bolts and retighten with a little weight in the seat and that helped quite a bit. All in all I am very happy with the chair and the price.", 
    "The chairs went together nicely and they are very comfortable. Very sturdy,too.", 
    "For this price I expected an average quality. It turned out these chairs are great: comfortable, stylish and stable. The only drawback is that I had to spend 4 hours to assemble 4 chairs.", 
    "Very nice chairs. Easy to put together, all hardware was intact.", 
    "After reading all the reviews about how the chairs wobble we decided to go ahead and purchase 8 chairs anyway. If put together properly you can eliminate the wobble. TIPS You will need a ratchet set and a ratchet screw driver. You will also need a bit/driver head the same size as the allen wrench. When assembling the back of the chair to the seat, DO NOT tighten the bolts completely. Stand the chair upright on its four legs and then adjust the seat to the point where there is no more wobble. Now you can tighten the bolts. They look great and are pretty sturdy.", 
    "I love these chairs I didnt buy this color I have a great tip for puting them together when doing the back bolts tighten each till they are almost in... then have someone sit on the chair to tighten the rest it stops the wobble that some will get. overall great chair for the price", 
    "The package arrived in a condition that led me to believe that it had been used as a pinata. The UPS guy was like uh if there is a problem... However the chairs were fine and all parts accounted for. It is kind of a pain to attach the seat to the back because you have to have it lined up just right or all of the bolts will not go in, that took a while. Once I had the chairs put together they look great, are very sturdy, and they are very comfortable. They are a little larger than common dining chairs and a little darker in color from the picture. Definately a good deal.", 
    "I really love these chairs. They complement similar striped chairs that I bought from Overstock, and are truly comfortable and attractive. I just hope my husband doesn't accidentally spill on the the nice, light-colored fabric. Mostly easy to assemble, though a couple of the hex bolt holes required a little maneuvering to line up. Just be sure to do several successive rounds of tightening to make sure all bolts are fastened as tightly as they can possibly fit.", 
    "i love the fabric and comfort of these chairs. However once we assembled them, they were wobbly. my husband is quite handy and he fixed one but the other 2 that were wobbly could not be fixed. currently we have carpet in our dining room so you cant notice but once we move and have the hardwood floors we will have to figure something out. the price was great for the comfort and the wobbly is to be expected since they were cheaper.", 
    "I was very impressed with a) the price of these chairs; b) the efficient manner in which order was processed; 2) timeliness of the delivery. Assembly of the chairs was not too bad. I was disappointed in that the legs were uneven on 3 of the 6 chairs that I ordered (resolved by putting felt 'bumpers' on the uneven chair legs). This was my first time making a purchase with Overstock.com, and I'm sure it won't be my last!", 
    "I wanted to warm up a large entry room, but did not want to spend a lot of $. These microfiber parsons chairs worked out great. I was unsure of the color name, \"peat,\" but it is actually a light beige/taupe color and is very neutral. Assembly was a snap, and the chairs are quite comfortable for an occasional chair. Very stylish for the price!", 
    "The chairs were shipped quickly. I purchased 4 of them to go with a small glass top round dining table and they are beautiful with it. The only reason I gave this purchase 4 stars insted of 5 was because the color of the chairs was actually taupe and not cream as shown in the picture. This did not matter to me but thought I would mention it.", 
    "Chairs are a good size, look nice and are comfortable..However one is not level..It' s tippy. It would be too much trouble to exchange at this point. I would consider ordering more in the future, I have a Parsons table and old cane back chairs. These look better..D.V.", 
    "I love them. They arrived in great condition and were very easy to assemble. Everyone thinks they look fabulous. Thank you Overstock.", 
    "I love these parsons chairs. They are very comfortable and match the bar stools in our kitchen, which I've received many compliments on. They were easy to assemble by two people. You can't beat them for style, especially the microfiber upholstery. I use them at my desk and as an extra seat anywhere in the house.", 
    "These chairs are attractive, comfortable and sturdy. The only reason I didn't give it 5 stars is because it took 2 hours to put it together for both chairs. There are way too many screws and washers to put this chair together with.", 
    "Overall good experience. Chairs came \"unassembled\" and required some extra time than I expected. Package was missing a couple screws and washers and we had to rectify that problem at the hardware store. 3 of the 4 chairs went together well...1 not so much. But again, we were able to get the job done. Love the chairs however and they look great. Definately worth the money we paid. FREE shipping was an added bonus that week and pushed me into making the final decision. Quality is 4 on a scale of 5.", 
    "very affordable, look great in dining room, comfortable, color true to picture, love the curved back and seamed back accent, just a bit difficult to put together", 
    "We were looking to reuse an old glass table for our dining room; so I began my search for appropriate (look, usability, and price) chairs. I bought two sets and when they were delivered, my husband put them together immediately. We love them- they are a great product for the price! My daughter spilled syrup on one chair and I was able to use a warm towel to wipe it up. Not sure how the chairs fair with heavy usage, currently our chairs are being used three times a week. I want to purchase another set so we will have seating for six. Just in time for the holidays. Great choice for style and usability on a budget!", 
    "I couldn't believe when II found these chairs on Overstock. I had been looking on ***** and ***** for months. The chairs looked the same in the pictures and were much lower priced and with the other stores, shipping was outrageous. I thought there must be a difference in quality. I have some ***** Trevor chairs so I am comparing to them. First, they came so promptly, I wasn't expecting such a fast delivery. The boxes were in good condition. The chairs come in parts, and my husband had no problem in the assembly. I purchased 6 chairs (3 packages). One was a bit wobbly, but easily fixed by putting a felt pad on one leg. The fabric looks and feels the same as the PB chairs, and the color is identical. We felt a bit of space on the two of the chair sides where the fabric covers the wood, but nothing anyone but us will notice. One of the legs had a piece of the wood chip off, but Elmer's glue fixed that. All in all, they are extremely great value for the money, half price from *****, and the shipping price is unbelievable. The fabric maybe of a slightly lesser quality than the higher priced chairs, but with Parsons chairs, they are very easy to slipcover in the future, so no worries there. They may have a problem with people over 300 lbs. We have no one like that, but I feel the chair maybe a bit weak for really heavy people. I am ordering 2 more (1 package) so I have enough for big events in case they are no longer available.", 
    "I LOVE my 2 new microfiber chairs at a price I could afford and low delivery charges and speedy delivery. They are so beautiful and couldn't be happier with the process of ordering through delivery. I wish they were all put together, but the assembly really wasn't that difficult and easy to understand. Very happy! Wun N", 
    "The chairs look great and are so reasonable in price. Assembly is not exactly user friendly as some of the pre-drilled holes are difficult to line up. But once they are together, they make a quick & inexpensive way to update a dining room.", 
    "i haven't set them up as yet but open them and went over theb,breafly the only thing with shipping the box was almost thorn apart but packing was great and the chair its self looks wonderful love it", 
    "We ordered one set of these chairs to start, and while they looked fine, one was wobbly when my husband put it together, so Overstock sent replacement parts, and I ordered 2 more sets. The second 2 sets came the same day as the replacement parts, and my husband put them all together. Of the 7 chairs (6 plus replacement), 2 were so wobbly because of poorly drilled holes that we had to send them back (I convinced my husband not to send all back). My husband is pretty handy, and he said there was no way of making them not wobble-the screws wouldn't go in the holes properly. Thankfully Overstock is paying for return shipping of the 2 we're not keeping, but I'd guess this happens a lot with these chairs. I know they're pretty inexpensive, so I wasn't expecting super high quality or anything, but I would like to be able to sit on the chair without rocking back and forth!", 
    "These chairs are great, They came in a few days and look really look wonderful. Assembly was a little rough, because a few of the screws were either missing or the wrong size. Luckily I had a handyman, that was able to get them together just fine. They are comfortable and sturdy. I looked all over for the right chairs, and these were the best chairs for the best price!", 
    "The chairs came quickly and were easy to assemble. The wood color on the legs is a cherry and the microsuede is an oat color. Very happy with purchase", 
    "Nice chairs for the price. Shipped quickly. They take a little bit of time to assemble (for us two, a couple hours to do all the chairs). The hardest part is getting the legs to be level to the floor. But they are a nice, contemporary look. The chairs are comfortable to sit on. If you lean onto the chair hard in one spot (e.g., kneeling) you can feel where the wood is underneath the cushioning, but overall I am really satisfied with this purchase.", 
    "I thought these chairs were worth the money. They had some weight to them, seemed pretty sturdy. The color was slightly darker than pictured, but pretty close. My old chairs were falling apart, so as to not have to buy a whole new dining set at this time, I just replaced the chairs. I thought these were a great compromise.", 
    "The Microfiber Parson Chair are very comfortable, easy to assembly and price superb. Would definitely recommend to friends.", 
    "After moving into a new home, I needed more seating at my traditional dining room table. Unable to match the wooden Wiindsor-style chairs, I ordered two of these chairs to set at each end of the table. I put them together myself in about an hour. It was simple, and fortunately, did not require a drill. I did appreciate the other reviews warning that the screws, nuts, and bolts are very oily, so be prepared for that. Also, don't tighten the screws until you are finished! I can highly recommend these beautiful chairs. Not only are they beautiful, they are comfortable as well.", 
    "I ordered 2 of these chairs. Not real sure if they would be as nice as they seemed in the picture. Received them, the construction was easy & the chairs are beautiful. We love them. So I ordered 2 more!", 
    "These chairs just arrived and easy to install. They look great in my formal dining room against an espresso table and contrasted against leather, chocolate chairs.Would purchase again!", 
    "GOT 6 OF THESE CHAIRS AND FOUND THEM TO BE OF 1- GOOD QUALITY 2- EASILY PUT TOGETHER 3- STRONG CONSTRUCTION 4-COMFORTABLE TO SIT IN 5- PRICED FAIRLY", 
    "I bought 2 sets of chairs, and they arrived in a timely manner, and in good shape. I had no trouble putting them together. The trick is to make sure to separate the different size screws, and not to tighten them all until you've checked to make sure the legs are level. If not level, then just wiggle the leg until it is, then tighten. After I got the first 4 chairs, I liked them so much, I ordered another set. I now have 6 new chairs. They look very nice, and are confortable to sit in. They are not the lightweight parsons chairs I've seen at other stores. These are very substatial. The color is just what it looked like on line. I recommend these chairs. Just take your time putting them together, get organized, and don't tighten until the very end! You'll be as pleased as I am.", 
    "I purchased 6 of these chairs to replace older chairs for my dining room.The chairs are great, colour as described and have seen them in shops for more than double the price.My husband and kids put them together easily.The order was processed and received in a couple of days.Thanks Overstock", 
    "I originally purchased 2 sets of these chairs to go in my eat-in kitchen. The color is more of an oatmeal, as stated by another customer, than the cream that they appear in the picture, but they are the perfect color for my decor. They are hefty enough but can easily be pulled away from the table. They are comfortable and expensive looking. Such a great product for the price that I purchased another set for a total of 6 chairs.", 
    "Look great, and are quite comfortable.Only when you look underneath do you see how very cheaply made they are (much worse quality than my other **** chairs)For the price, a good buy.", 
    "I ordered these chairs on Thursday and received them on Monday, so very fast delivery. I put them both together in about 45 minutes by myself, which says how easy they are to assemble. The only reason it took me that long was because the bolts on the second chair didn't want to go in very easily, but I managed to get them lined up. The fabric is very nice, but a little darker than the picture. One of the chairs has a leg that's not the same length, so I'll have to put something under it. Besides that, they're very pretty chairs that will look great in my dining room. I definitely recommend these chairs, and I'll be buying two more myself.", 
    "It's true that the picture doesn't reflect the actual color of the chairs -- it is definitely a tan/beige and not the off-white as pictured. But that was OK with me, since I'm selling my home and was looking for a neutral accent chair to go with our new walnut desk for open house. This was PERFECT. The legs were the same walnut color as the desk, and the neutral beige color of the chair looks great. I have the extra chair in the master bedroom in an unused corner space next to the bureau. Fills the space nicely for a throw blanket, drape tomorrow's outfit over it, etc. It was very easy to put together -- I would recommend that you separate all the screws, washers, etc. and group like pieces together on top of a piece of plastic or paper. They are covered with grease and could stain your carpet, so make sure you don't just plop them down on the floor. Be careful handling the chair as you put this together, since grease from the screws, etc. may transfer onto the microfiber fabric.", 
    "Great value for the money! These chairs are great - they are easy to clean, very sturdy and comfortable.", 
    "Style of chair is elegant, with rolled seam detail on flaired back (visible in photo) that looks expensive and unique. Low-maintenance faux suede material looks like it will wear and clean up easily, especially after scotchgarding. Color shown in photo is accurate - light neutral beige. Assembly of 6 chairs took about 2-3 hours, without any cursing from husband. Firm, comfortable cushion. Guests linger at the dining table for hours.", 
    "... you don't get a set like one of the sets I ordered. I purchased 6 chairs total (3 sets) and the first box looked like it had obviously been returned before. When I attempted to put them together, the holes didn't line up at all and I had to completely re-drill the holes, in addition to ordering a replacement leg for one as it had a crack in it. Overstock.com had great customer service and the leg arrived within 2 days (and I'm sure I could have easily returned the two chairs that were difficult.) Aside from those 2 chairs, the rest of the chairs went together very smoothly (I used a drill to make it quicker) and only had minor defects (4 out of the 6 chairs were slightly off balance - one leg was slightly longer than the other). After getting past those issues, the chairs are now together, sturdy and look great (especially for the price). We just had our first big dinner with them too and they held up great!", 
    "Fabo looking and easy to put together. Very elegant and comfortable. Overstock shippedright away. Very pleased! Thanx...", 
    "The fabric color pictured on-line appears as off-white. Instead, the chairs I received were a khaki color. I returned these chairs only because the fabric color was darker than what I wanted. The legs are a nice cherry color, though.", 
    "Great chair-super buy. Very comfortable. Did need help putting them together. Very pleased.", 
    "A bit of a pain to put together, and the wood on legs is fairly light, but looks great in my dinning room.", 
    "I bought these chairs based on the other reviews on OS. I wanted something pretty neutral because I am constantly changing my style. These are great! The color is like an oatmeal color and the wood is true to the picture. They are pretty comfortable and have good back support.We sat in them pretty much all of Thanksgiving which says a lot. The only downside is putting them all together. We purchased 10 so it was pretty tiring. Overall good buy.", 
    "I bought three sets of these chairs to go around my dining room table. They are sturdy and well made! Assembly took a while, especially because we had six pieces. Overall, a great classic look for a great price! Thanks Overstock! :D", 
    "these were easy to put together. they look very classy. i am using them at my kitchen table in my breakfast room, but when we have a formal dinner in my dining room, i will bring them in there. they are comfy,they look expensive. they feel sturdy. the legs are real wood. i did not pick up any flaws. this was probably my best purchase yet from overstock. i bought a steam cleaner once but did not even open the box until over a month later, the thing did not even work, did not even turn on but i was stuck with it because of their horible return policy.", 
    "Love these chairs! I bought six of them and they were very easy to assemble. I'm a 60 yr old woman and used a ratchet driver only and did the assembly all by myself. Be sure to sort the bolts by length before beginning the process and use the proper bolts in the proper places. It will save on having to undo and redo later. Each chair averaged 15 minutes assembly. They are very comfortable and exactly as picture - quality is very good - much better than the price would indicate. The fabric color is a neutral taupe - exactly as pictured. The wood matches my 25 year old table perfectly. I'm more than pleased.", 
    "These chairs arrived very quickly. One was easier to assemble than the other, as the holes for the screws were not perfectly aligned, but it was not torment. If you buy them, get all the screws in a little before you tighten! They are a great neutral color, seem sturdy and the details make them look much more expensive than they are. I treated them with Scotchgard before I put them near the table and there was no discoloration. I would recommend them!", 
    "I was looking for simple chairs for my kitchen table. These gave a more luxurious feel to the room. They are pretty well constructed and (for me) easy to put together. The holes lined up well also. Had my husband tighten everything one more time. Use a drill. It will be easy. For the price, they can't be beat. I like the piping detail on the back as it adds a bit of detail. Well worth it and VERY comfortable.", 
    "I purchased 6 of these chairs (3 pairs) for my 60\" round dining room table. Very comfortable and look much more expensive than the price I paid. For the most part they were easy to assemble, 2 of the chairs were a little off balance but that was easy to remedy with a small piece of felt attached to the bottom of the shorter legs. I also treated the fabric with Scotchgard before I assembled the chairs to help prevent stains, this did not discolor the fabric.", 
    "I bought 2 sets of these chairs, and I am very pleased with them. They went together easily and are very good quality. They are much nicer than the Ikea ones with much more padding. They arrived promptly and were packaged well.", 
    "We bought these to replace (for now) antique chairs in our dining room that just weren't practical with small kids in the house. They are a great bargain and my husband (who is handy) had no problem with assembly. They are comfortable. I will probably scotch gaurd them but have had one small chocolate hand smear and it washed right off. They look very nice and are just what we needed to make our dining room a little more practical for now while still looking a little formal. They are very comfortable too. As usual Overstock had speedy delivery. If you want these I wouldn't wait - I let them sell out once and was kicking myself until they came back in stock!", 
    "Good Value for the price. NOT a piece of cake to assemble.", 
    "We were looking for new chairs for a custom made table we received as a gift. Shopped all over and when I saw these they looked like ones we saw at a local high end store only at a much better price. When received we were not disappointed.The only problem encountered was in the assembly.. need to be patience.I give these chairs a overall 5 star rating.", 
    "You get what you pay for... these chairs look nice but are very cheaply constucted, they come packed ok but 2 of the 8 we got were either broken or made wrong, we were able to only get replacement parts for 1 chair and then they ran out of replacement parts so Overstock refunded the price on the other chair.The chair construction is very cheap but we only use them 2 times a year so we think they will do for now but dont expect them to hold up to any heavy usage or for a very long time...Overstock by the way has been a great place to do business and while we were not satisfied with the end product on these chairs we will buy from overstock again.", 
    "The fabric of the chairs is beautiful. They were easy to put together. The only problem I have with them is that one of the chair's legs is significantly shorter than the others - as much as 1/2 an inch shorter. Hence the chairs are wobbly. I'm hoping that my brilliant spouse can save the Christmas dinner by putting shims under the short legs.", 
    "I bought a set of 2 bar stools originally and then liked them so much we purchased 6 matching chairs. I shopped extensively and found this to be the best price/value especially given the shipping charges. Yes, as the other reviews indicate - assembly is not a piece of cake but do-able. We had to do some shaving/sanding to stop the wobble on tile but overall we are extremely satisfied.", 
    "These chairs are beautiful! They were just as were pictured, arrived in excellent condition and were fairly easy to assemble. I searched everywhere and did not locate anything even close, anywhere else for the money that was as nice as these chairs. I have bought furniture from overstock before and from now on will be the first place I look and you can't beat the shipping!", 
    "These chairs are gorgeous!!! Putting them together is not fun, but not difficult either. Just tedious and time consuming. Once assembled they look amazing and are super comfortable. Also, stains are easily removed with warm soapy cloth!", 
    "The chairs are really cute, and were not too hard to put together. The problems I found is the poor quality that it was put together(by the manufacturer) and the poor quality of materials used. The wood on the chairs is clearly fake and chips off easily so you have to be careful to not lean it against anything so it doesn't scratch off. They look great with my table though and are comfortable to sit at for short periods of time- I wouldn't spend more than an hour on these chairs though.", 
    "These were beautiful chairs that are not only attractive to the eye but comfortable to sit in.The quality is excellent from the fabric to the detailing of the stitching but the assembly was a bit of a challenge.", 
    "I bought 4 of these chairs for my dining room. They look great! My daughter is an interior designer. She was amazed at how good they looked for the price. The chairs are nice and sturdy, good quality, and good contruction. They would blend in with any style. Assembly was easy, but be sure to follow the directions.", 
    "These chairs were exactly what I was looking for... great price, stylish and comfortable. My dining room is an eclectic blend of contempory/antiques and these chairs pulled the look together beautifully.Overstock, as usual, delivered quicker than expected. Pretty easy to assemble once you got into it. A couple of them needed to have levelers put on a leg, because the legs were a little off, but that was really no big deal.I would say, all in all, a fantastic purchase. Great bang for the buck.", 
    "...a pain to put together. Literally, my hands are still cramping. Definitely use a drill when putting these together...the allen wrench won't cut it.", 
    "I love my wood dining table but hated the uncomfortable wood chairs that came with it. These chairs were just the look I wanted within my budget. The leg color is a good match for my table. My only complaints are the funky directions (I'm handy enough to overcome those), and the workmanship on placement of the holes was a little off. I haven't been able to get a couple of the bolts in. I think it would be easier if there were 2 people to put these together, then one could help stabilize the chair to better align the bolts and holes. I scotch-guarded the fabric for better protection. I've already received lots of positive compliments on the more modern look of our dining area.", 
    "The finished results are worth all the work of putting them together, The chairs look better than the picture. The directions are easy enough it's just that some of the holes don't line up and that makes it difficult to put the screws in. I had to have someone finish one of the chairs for me since I just couldn't do it. It does take time to assemble.", 
    "These are great chairs for the price. They're really comfortable, and have classic good looks. Putting them together wasn't all that difficult, especially when using a drill instead of a scewdriver. I bought six of these - and love them!", 
    "I ordered 6 of these chairs and loved them so much that I just ordered two more. It does take a little work to put them together, but it isn't difficult at all. For the price, I can't complain. The fabric looks great and cleans really well. All in all, I highly recommend this product and I am very, very particular.", 
    "I been looking for chairs to match my mango wood dining table and so far these chairs go quite well with it. I only ordered 2 and may consider ordering the other 4 to put my dining table set together.Assembly is a bit confusing but after you do one, the 2nd is a snap. One chair seem to be uneven at the legs so add a foam pad to make it even if that's the case.", 
    "Love the parsons chairs! They look good and are fairly well made. My only complaint would be the amount of time it took to assemble them! And, on two of the six chairs there was a problem with the holes for several of the long screws to go into and we had to use wood glue to hold them in place. Otherwise, they were a great bargain and we're happy with them. Also, they arrived in two days!", 
    "I love the chairs. Great value! Great quality! Good service.", 
    "I purchased 4 of these chairs for my dininig room and, although the quality of the wood and fabric is not great, it is a good value for the money. One of the four chairs came with the wrong hardware, but Overstock was prompt in getting out the correct hardware. All in all, I am happy with the purchase.", 
    "I ordered these chairs after searching for similar chairs for almost a yr. for a price I was willing to pay. I ordered 6 chairs. For the money - they look fabulous, they are durable, sturdy, comfortable and fit the description on Overstock.com perfectly. Because I ordered 6 - assembly was a little time consuming, but easy. The holes were all pre-drilled correctly - I was short 2 washers in the packaging - I happened to have them on-hand. Other than that - great product! I'm happy!", 
    "I was a little leery about ordering chairs without seeing them but after reading the reviews as well as the inexpensive shipping charges and the easy return policy, I decided to take the chance and order them. Once the chairs came and they were easily put together, I was extremely satisfied with the quality of the chairs as well as the design and the material. The color was exactly as it appears in the picture online. They look beautiful around my dining room table and I receive compliments on them all the time.Thank you.", 
    "Initially I ordered only two chairs to see if I liked them. Well, I loved them and ordered two more. They are very comfortable and the tan color is soft and beautiful. They are a great value for the price!", 
    "Really happy with these chairs. Easy to assemble, just a few bolts! Found the easiest way to level the chairs was to seat all the bolts (but don't tighten all the way down), then have an average weight person sit on the seat while a second person finishes tightening down the bolts. They look great and match my sofa pretty closely! Love Overstock.com!", 
    "Chairs are exactly as pictured. Nice large size, comfortable and easy to assemble. It helps if you have an electric drill or screwdriver with the correct attachment to put these bolts in.", 
    "sturdy, takes time to assemble, overall good product, great appearance", 
    "We are really happy with these chairs. They are much more affordable than anything else I have looked at. Very, very comfortable and looks great. I think that they were a little tricky to put together- but my husband was able to master the angles after two chairs. I really have no complaints.", 
    "I just bought a house and desperately needed chairs. After searching and only finding those that I liked cost over $300 a chair I decided to try these. They were very easy to assemble (however, you really do need to follow the instructions to make sure that they are level). They look so beautiful with my new dining room table, they are now my dining room chairs. They are also extremely comfortable. Hands down, these are the best chairs that you can purchase for this price.", 
    "I purchased one set for my living room as occasional chairs to go on either side of a mahogany wedge table in my living room. I wanted high-backed parson chairs with exposed wooden legs for their elegant simplicity and to match my microfiber camel-colored sofa with mahogany trim. Their dark mahogany legs match perfectly--both the table and the sofa. The color of the fabric is just a shade or two lighter than the sofa so I am thrilled with the color. The legs are truly very dark. I read another review that said they were light. These are in no way light. They would match any dark mahogany or cherry woods. I only gave them 4 stars because they were a real challenge to assemble as the holes were misaligned. They did finally go together, but my fingers are so sore I can barely type this! The bolts are tight even though some of them are not all the way in. These chairs will not get a lot of use anyway, so I'm not too concerned about their durability, but they do feel solid to sit on. I did put one of the Allen wrenches in the wedge table drawer so it will be handy if I need to tighten the bolts. Overall, I'm very happy with their appearance and that they go so well with the other wood and upholstered furnishings in my living room.", 
    "The assembly for these chairs were difficult for us because a lot of them had misaligned holes which made it really rough on our hands. One chair had a piece of fabric that was falling off the bottom, but it was hardly noticeable. Also, the leg color of these chairs were a disappointment. They are a beautiful light walnut color, and not dark like is shown in the picture (which would have matched our dining room set better). If I had a walnut dining table, I would have liked them much better. They are nice chairs, its too bad about the assembly and misrepresentation of the leg color.Regardless, I love Overstock and go to them for all of my small furniture needs.", 
    "These chairs are nice, sturdy and comfortable. We were looking for casual, modern chairs that would match our existing cherry wood table and these really look great with it. We wanted neutral-colored chairs for our small dining room, and these work well in a small space because they aren't bulky. The fabric color is pretty true to the picture, the wood legs are slightly lighter in color, not quite as dark as in the picture however. They were fairly simple to put together according to my husband, manageable in about 3 hours (with breaks). They were delivered fairly quickly, we were surprised on how promptly they arrived.", 
    "I have been looking for nice dinning chairs for a long time, and when I learned about over stock, I thought, why not to try it! Wow, I sure was very impressed as normally I don't buy much on line.. Not only I am extremely please with these chairs, my guest are have been giving a lot of complements. I bought two other chairs similar to these from a local store, but, the quality is not the same.. So, make sure, the look don't fool you. I am really pleased with my purchase.. Thank you..", 
    "The chairs look great. They're comfortable and sturdy. My boyfriend put them together and he said it wasn't easy...and he's a carpenter. Some of them were missing some screws but we improvised and it worked out fine.", 
    "I couldn't be happier with these chairs. For the price, they are better than I expected. I replaced my expensive furniture store parson chairs with these, and they look much nicer. The fabric is pretty true to the color shown if not a shade lighter. The legs are a dark mahogany color. They are very easy to put together as long as you follow the instructions and don't tighten any of the 11 bolts until the chair is standing and you are laying underneath it. I had one come out a little unbalanced, but I noticed if you pair up the legs for each chair before you start, (some are off by about a millimeter), then they will be fine. The shipping was pretty fast. I ordered them on a Saturday and they were delivered the following Friday.", 
    "Love these chairs, I got them to offset my dining room chairs that I could not find matches to. I'm thinking about purchasing 2 more. My brother in law put them together for me and it took him about 1/2 an hour. I'm glad because i would have been still putting them together today, if it were left up to me to assemble them. In all I'm glad I made this purchase.", 
    "For the price this was a very good item. It didn't take long per chair to install. About 20-25 minutes each one and i got 6 of them.The only complaint i have is the legs are a medium sort of cherry color wood and do not look dark like in the picture...day and night...The fabric is soft and the chair is definitely comfortable. Its quite a surprise for the price actually how comfy these chairs are. The fabric, as mentioned in other reviews does pull on edges and its not perfect and you can tell if you are sitting close and inspecting the chair...overall though you really dont notice much...it sort of blends in. Also, the chair curves back which gives it a very nice look. If this chair was 150-250 each i would definitely have returned it and given it 2 1/2 stars...for the price though it totally deserves 4 stars...", 
    "I bought these chairs as office waiting room furniture. I was surprised at how nice & easy they were to put together. highly recommend them for the price.", 
    "I purchased 4 chairs. They were reletivley easy to put together however, it would be great if an allen wench bit was included to use with your drill. One issue, that is an easy fix, is that all 4 chairs wobbled. I just placed a felt pad of the correct thickness to fix. They give the room a little more of a formal feeling but still casual enough.", 
    "My husband and I love these chairs in our dining room. The ultrasuede look is modern and simple. The chairs are very comfortable. We have received so many compliments about them. The assembly took some time, but if you are patient and follow the directions, they weren't too hard to assemble. We would definitely recommend these chairs to others!!!", 
    "Great chairs for this price. Assembled easily, though one leg cracked. (They are replacing it). The welting on the first two bought was a bit wrinkled. The fabric around the top back was wrinkled on the second two ordered. I had planned to slipcover them eventually anyway. Comfortable enough for everyday dining. They are a very light tan color. They look very nice overall. Good Customer Service as well.", 
    "Came as promised. Look great. relatively simple to assemble. Missing one bolt, though. Other than that, great chairs for the price!", 
    "We got four of these chairs a few months ago, and have found them to be attractive and comfortable. The assembly was not terribly difficult, just follow the directions. There may be a slight uneveness of two of the chairs legs, but I have them sitting on a rug in my dining area, so if they do wobble a tiny bit, it's not really noticeable at all. The workmanship on the upholstery is fine for the money. If you are looking for top of the line upholstered chairs, you're going to have to pay more. Overall, they give a very nice, and classy appearance, and I think they will be just fine for average everyday use.", 
    "For the price, these chairs are amazing. Frankly, I bought them because they were the most affordable Parson chairs I could find and I planned to buy chair covers to cover the fabric/legs. However, they look nice enough that I plan to leave them as is. The legs are a nice deeper cherry color, so they would pair well with any of the darker woods. And I don't know what other reviewers are talking about. These are easy to assemble. It's just 11 bolts, everything you need to assemble is included, and I simply sat on the floor while putting together. (In other words, there's no need to put yourself in crazy positions like sitting on the chair while tightening the screws.) If you try to assemble all ten chairs you bought in one day, the pads of your fingers might be a tad sore, but really assembly is a breeze. I only gave it four stars instead of five because it is obvious if you look close that these are not exactly designer quality, but the quality is amazing for the price.", 
    "Nice sturdy chairs, great feel and comfortable to sit on.", 
    "After reading other reviews, I hesitated to order because other people said they were hard to assemble. But, if you read and follow the directions, they are a little time consuming, but not hard to assemble. Fabric under the seat would have been nice and the actual upholstery fabric could have been a little heavier, but all in all, they suit my needs and look good in my dining room where I've paired them with an antique round pedestal table.", 
    "I purchased these chairs and am very happy with them. They did take a little bit to assemble. I basically had to sit on the chair, then tighen the bolts, then sit again to get them all fully tightened and the chair settled. The fabric is a nice, tan ultrasuede look. I did end up scotchguarding the chairs due to their light color. I would recommend this if you are going to be using the chairs a lot and want to preserve their newness. Overall I am very happy with them.", 
    "I bought these chairs based on price and previous reviews. I am thoroughly pleased with my purchase and will continue to buy from Overstock.com. These chairs look exactly as they did on the website.", 
    "I loved these chairs, they were exactly what I was looking for and they are built better than I expected, the only thing that would have made them better would be if they came fully assembled.", 
    "I am pleased with my purchase. The quality of these chairs are fantastic. They are comfortable and elegant. The ease of the assembly is tricky because you have to make sure you are using the right screws, there are three different screws and, you have to work with it until it falls into place and are balanced. Once they are assembled, if you do the job right, they look marvelous on any dining room. I have recommended them to my family and friends already. Thank you!", 
    "They are a pain and non returnable. So if you want to invest in a fortune in proper fabric and a seamstress to cover them. They may work out. I have 12 and not all of them are sturdy. So if I cannot have them fixed properly, then I will throw out the three that wobble. Now if you are modern and have a higher then normal table, they will be fine. But they may not be sturdy. However, I would happily recommend them to someone I did not like.", 
    "... but a little difficult to put together. Took my husband a long time and one of the chairs is tipping due to a piece of rubber or something missing on the end of one leg. This was easily fixed. Overall a great bargain.", 
    "The seat is cushy and the chairs really are very comfortable. Another reviewer mentioned their hesitation about ordering dining chairs online without actually sitting in them. I was just as hesitant but couldn't pass up the deal. I was happily rewarded by nice looking and comfortable chairs. I, too, had some difficulty assembling. This was primarily because the bolts are three different close-together sizes. The four smaller screws go in the spots holding the previously unattached legs to the front. The medium screws go in the middle of what holds the seat to the back. The longer screws go into the corners of what holds the seat into the back. I am quite happy with the chairs and they really do look and feel just as good as the much more expensive chairs I've seen in the stores.", 
    "My goal was comfort and simplicity...I got it. Husband assembled chairs which required attaching seat to back of chair and attaching front legs to seat (back legs and back of chair were already one piece). He didn't seem to have much trouble...although he was familiar with the assembly - had previous experience working in furniture/design store. Screws at legs do need to be adjusted to account for \"the wobbles\" - apparently common requirement when assembling chairs according to husband's experience - slight \"wobbles\" have not been an issue since chairs were placed on area rug in dining room, but old hardwood floors in our 1930's home are not very forgiving. Fabric is soft; cushioning (sp?) seems substantial; color is similar to maybe a seashell light neutral - vaccums well! (I have 3 indoor only cats!) I plan to have simple WASHABLE slip covers made when ever I want to change to style - VERY PLEASED!", 
    "We could not believe how easy these chairs were to put together! They arrived the day after we ordered them online, and we had them put together two days after that.The color is beautiful and the chairs are very sturdy. We definately feel we got what we paid for.", 
    "I was so disappointed with this product. The order came in with a light tan legs. Picture shows a dark browinish/black legs but they are not it's more tanish.Also back of the chair was is not comfortable.", 
    "Am extremely happy with these chairs. They are comfortable, gorgeous, and a great value! Can see long dinners with friends and family and everyone being comfortable as we mull over world events and our lives. Comfort, beauty, quality and value. The chairs have it all!", 
    "These chairs are well crafted and they really compliment my dining area. The seat cushions are a lot thicker than the picture suggests, which only increases the comfort. The chairs are very easy to assemble, as long as you DON'T read the instructions. This was my first time purchasing furniture online and if the quality of these chairs is what I have to look forward too, it definately won't be my last.", 
    "I was really surprised at how well constructed these chairs are. My husband put them together in a matter of minutes. They go very well with the granite table I bought and make the room look so elegant. I've gotten several positive comments on them from family and friends. Who knew I could shop overstock.com? They arrived in 5 days....not 2 weeks. I will spread the good word!", 
    "These chairs are beautiful, and a great bargain for the money. They are, however, a bit of a pain to put together; the directions are a poor translation (unclear). Some of the chairs went together smoothly, while others took a fair amount of \"fiddling\" with to get the screws to fit in the pre-drilled holes.", 
    "Overall very happy with purchase on Parson Chairs. They were easy to put together, nice neutral color, and good quality. They were also delivered in a timely manner.", 
    "Good chairs for the money. A little difficulty with some of the screws/bolts, of course the very last one didn't want to go in at all. But I made it work. Comfortable and nice looking, fits well with just about any look and/or color scheme.", 
    "These chairs are very nice overall and very comfortable. Definitely worth the amount you pay for them and not hard to assemble, just takes some time. The only problem I have with the order was that one of the chairs were VERY uneven. So I had to make my own leg extension so it wouldn't wobble. The leg on that particular piece was cut wrong. But overall, VERY GOOD! Would definitely recommend.", 
    "If these were any more expensive than they are, I'd be bothered. I purchased six of these chairs for my dining room. They are very lightweight. The fabric is nice, wooden legs are nice, size is what I expected and the price was great. I didn't have trouble with the assembly as some have. By the sixth chair, I was a pro! The key is not to tighten any legs until all are on and the chair is sitting balanced on all four legs. Then you can reach under the seat and tighten. NOW FOR THE BAD NEWS: The upholstery on these chairs ranges from passable to abyssmal; puckers, lumps, and ripples are the norm. If this would bother you, keep looking . . . don't buy these. But if you want an inexpensive, casual look and aren't too fussy, these will work just fine.", 
    "I'm so happy with these chairs and so proud of the fact that I was able to put these together by myself. The first one took a little longer, but once I got the idea they took 20 minutes each to put together. I bought four and they really add a beautiful updated look to my dining room with my existing table. The lighter color brightens the room and makes it more inviting yet elegant.The chairs are very comfortable and fairly lightweight, which is exactly what I was hoping for. The shipping was lightning fast and everything came well packed in two large boxes. This is my second purchase from overstock.com and I am very pleased. The customer reviews really helped me to make my decision when purchasing online sight unseen.", 
    "I was a little concerned about buying dining room chairs that I wasn't able to try out first so we bout only 1 set of 2 first. They arrived quickly and very easy to put together. The only thing I wasn't too excited about was the under part of the chair. The fabric is stapled on and you can see all the staples and be careful not to get a splinter from the wood. A bit unfinished. Overall I loved the chairs and the same day we got the 2 in we orderd 6 more to complete the set in our dining room.", 
    "I love these chairs. I was a little nervous about ordering them online but when I opened the box I was extatic. It was exactly as they showed in the picture. The color was true to the picture. They look classy and makes my diningroom table look very elegant and contemporary.I ordered 6 of them and I have no regrets,expecially for the price.", 
    "I am very pleased with these chairs. They look great with my existing table and have a very lovely style to the chair. They are also very comfortable .", 
    "I bought these chairs a couple of months ago and absolutely love them. They are an amazing deal and are very sturdily constructed, with an elegant and polished look to them. I agree with prior posts that they can be challenging to assemble, but if you're willing to take your time with the assembly, you can get them completely level. I'm hoping they'll come back in stock so I can order 2 more!", 
    "Thanks for this excelent place to buy, my experience was great.....", 
    "It was a good value comparing to other major furniture stores. I had four of them and they look fabulous in my studio.", 
    "These Parson chairs come as a pair in one box and well packed. They are so easy to put together, love the color, and the style of the chair. They have a rich look about them. I had put Scotch-guard on the chairs before using them, because of the light color beige, the picture shown looks pretty close to the color. I had bought a second set recently. Love these chairs and comfy too!!", 
    "AWESOME! you can't get a better deal anywhere. I have kids and they stand up to them and wear well. As far as putting them together, my 8 year did most of the work! We bought 6 and truly love them, they are very comfortable too.", 
    "I think the Microfiber Parson Chairs were an ecellent value for the price. I had been loking for dinning room chairs but found most either out of my price range or if affordable the look & quality was just not there. I order two chairs to begin & were satified enough to order an additional six. I matched them with a very expensive table costing over 2,000 dollars & they look nice together.", 
    "These chairs came quickly and were SUPER easy to assemble. Each chair only took about 15-20 minutes to assemble. I ordered 2 sets (for a total of 4 chairs) and they look beautiful in my home. They are versatile enough to place in other rooms and they add comfort and style (as well as an extra seat). I have 2 at my dining table, one in my bedroom and one in the living room.The color is listed as 'peat' but they are more like a light fawn color. I expected 'peat' to be a little darker but they still are beautiful!", 
    "This chair is fairly easy to put together--even more so if you have an electric screwdriver with allen wrench attachment. From a normal sitting position this chair looks much more expensive than what it cost. However, there are reasons it is less expensive than others. The underside is messy and looks like it might give you splinters if you touch it. Instead of doing professional seams, the seams are simply covered with trimming. The legs are somewhat wobbly when no one is sitting in the chair, but this is not a problem when you sit down. It is so light weight that I wonder how long the seat cushion will remain full and supportive. I am happy with this product because it looks nice for a low cost, but I disagree with the reviewers who say it is as good as or better quality than more expensive chairs from well-known stores.", 
    "These chairs are neutral and can go anywher-- I bought the pair and used them as side chairs on an accent wall for extra seating and they work great. They'd be extra comfy for dining chairs to though. I thought that they were easy to put together ( i did it solo). My only problem was I was missing a minor screw-- I contacted overstock and they shipped it out to me very quickly. I was impressed by the chairs and the customer service!", 
    "Pretty easy to put togetherVery attractive lines and upholstery.A bit lightweight, but for the price will do the job as occasional chairs in a room that needs an extra seat occasionallly.", 
    "I had purchased two chairs almost identical to these 3 years ago and wanted two more to match. I found these on overstock and was skeptical about buying them without seeing them. I was pleasantly suprised when I received my chairs. The color matched almost perfectly to the ones I had already. These chairs seem to be very well made and were very easy to assemble. The only fault that I have found with them is they are hard to get \"balanced\". The chairs rock a bit as if the legs are uneven, you have to have all the screws tightened just right for the chairs to sit right on the floor.", 
    "These chairs seem to be made of quality materials and were VERY easy to assemble. They are very comfortable and look INCREDIBLE! They arrived just before a friend came to visit for a few days. We all enjoyed the excellent fit and finish. Highly recommended!", 
    "I bought a total of 8 of these chairs for my dining room. Being a little uncertain ordering without seeing them in person, I first ordered 2 chairs. They were great and arrived within a few days of ordering, so I ordered 6 more. The set of 6 chairs took more like a week to arrive and 2 of the chair backs in the set of 6 were damaged. One had a pen mark on the fabric and the other had a gash about 3 inches long (there was no way I did it opening the box, so I think it happened during packaging). I called customer service and they had the vendor send me two new chair backs. It took about 7 days until I received the new chair backs. A little long but not a big deal, and as always customer service was GREAT and very easy to deal with.It took me approximately 20 minutes to assemble each chair, but other than time it was fairly easy and the bolts went in nicely (11 per chair). I have the chairs on carpet but I tested a 3 of them on a hard wood floor and on 2 the legs are off slightly (maybe 1-2mm). I could probably adjust some of the bolts and try to correct it but I have no reason to since they sit on the carpet.I think these chairs are very comfortable. I also had family visiting last weekend and they thought these chairs were comfortable as well.The chair legs are not quite as dark as they appear in the picture but they still look nice with my dining table which is a very dark mahogany stain (appears almost black). The chair fabric is also a very nice color and it feels nice as well. My only thought here is that the fabric feels thin and I'm worried it will be damaged easily; hopefully my concern will prove unjustified.Overall I¿m very happy with these chairs and think they¿re a great deal for the price! They really do look nice!", 
    "items arrived quickly and very pleased with the quality. price can't be beat!", 
    "We looked all over at similar (and very expensive) chairs and were a bit concerned about ordering online. The chairs are fabulous. They're plush and beautiful with great wood legs and nice high back. The one caveat is that our wood floors are antique and uneven and the chairs legs needed to be balanced. It took a few felt pads (which also protects the floor) and they're terrific.", 
    "This was my first order from Overstock. I must say that I am impressed. The chairs look expensive and go great in my \"nook\". The legs are a cherry finish. The chairs are sturdy and are a great value for the price. I will continue to purchase from Overstock!! You won't be disappointed.", 
    "The instructions are horrible, but once I got the hang of it the chairs went together pretty easily. The hardware is coated in some sort of oil - be careful not to get it on the fabric or your clothing.The workmanship is not the best. The fabric on one of our chairs has a little puckering. One leg on one chair is slightly shorter than the others because the pre-drilled holes are off by about 1/8 of an inch. The chair rocks when you're not sitting in it, it's fine when you are.You get what you pay for and I am not unhappy with my purchase.", 
    "ORDERED TWO 2 CHAIR SETS. ONE SET ARRIVED WITH A BROKEN LEG. IT WAS A BIT INVOLVED TO GET THINGS SET UP FOR A RETURN AND REPLACEMENT. LOVE THE CHAIRS BUT GETTING THE TENSION CORRECT WITH THE BOLTS WAS TESTY TO GET THE LEGS PROPERLY LINED UP.. BUT THEY DID WARN ME IN THE INSTRUCTIONS TO NOT TIGHTEN BOLTS UNTIL ALL WERE PUT IN.", 
    "I can recommend this dining chair. Very comfortable, easy to clean and perfect for every diniing room. We bought this chair together with the Stockton Dining table which matches perfect.", 
    "A little unsure of buying furniture online, sight-unseen but it turned out great. We bought 4 and liked them so much we bought 2 more. Overall, very pleased with the chairs - and with Overstock.", 
    "The chairs were easy to assemble, but some of the screws were a little challenging. Workmanship seemed good, although I did note a split in the wood at the base of the seat - too soon to tell if that will be an issue. The chairs are beautiful, comfortable and look even better than in the picture. I am using them as waiting room chairs for my office. One of my colleagues was so impressed he ordered some for his dining table. Great value, beautiful buy!", 
    "CANNOT RECOMMEND DUE TO THE QUALITY - THEY LOOK BEAUTIFUL AS LONG AS NO ONE SITS IN THEM. AFTER HAVING MY FAMILY OVER THE CHAIRS BECAME VERY LOOSE AND I HAD TO TIGHTHEN EVERY SINGLE SCREW ON THEM. THIS WAS THE FIRST TIME SITTING ON THESE CHAIRS.", 
    "These chairs are absolutely beautiful. I have an open floor plan home and the color matched the sofa and chair perfect that was purchased at Furniture Row. Would not have found a better match. Love, Love, Love these chairs.", 
    "All four chairs that I purchased came with a strong chemical odor. I thought the smell would dissipate quickly, but it hasn't diminished at all and it's been 3 weeks. I researched the cause online and understand that it's due to off-gassing. It is very potent. I put them in a closed room with the windows open and a fan blowing at them for several days but that didn't do a thing to alleviate the odor. I then tried Febreze, but that just masked the smell. Just the other day I purchased two bad-air sponges to see if those would help eliminate the odor, but they don't seem to be doing much good. The chairs were meant to be used in my elderly Dad's home, but I'm afraid the noxious odor will harm him. I'd like nothing better than to return them, but taking them apart, packaging them and shipping them would be a huge hassle.", 
    "at first i was apprehensive about buying furniture online but when these chairs arrived, i was thrilled..Just bought a new house and they went into the dining room.. they are beautiful and very sturdy and the fabrick is outstanding..... will buy from o.co again."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Parson-Classic-Upholstered-Dining-Chair-Set-of-2/2216230/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/2216230/TRIBECCA-HOME-Parson-Classic-Upholstered-Dining-Chair-Set-of-2-76657717-8e37-4f79-b159-e3dbb3fa0e72_600.jpg"
  ], 
  "description": "Elevate your dining room set with this set of two upholsteredParsons chairs. Slightly curved backs give each chair a dramaticsilhouette, and the armless design lends an upscale look to thepair. Place these chairs at a formal dining table for an elegantlook, or add them to your breakfast nook to bring a refinedfinishing touch to your space.Set of two Parsons chairs adds upscale elegance to your  spaceCrafted from Asian rubberwood and your choice of microfiber  or chenille fabricCherry or espresso finish for beautyUpholstery available in multiple colors and patterns to match  your roomIndustrial coil springs provide additional comfortChairs measure 38\"\" H x 19\"\" W x 26\"\" DSeat measures 19\"\" HStyleContemporary, Modern, UrbanMaterialCherry, Microfiber, WoodFinishGrey FinishChair TypeAccent Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorBlack, Blue, Brown, Grey, RedFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion"
}