{
  "name": "INSPIRE_Q_Grace_Grey_Linen_Button_Tufted_Arched_Bridge_Upholstered_Bed", 
  "price": "EUR 405.01", 
  "reviews": [
    "Thought I would leave a review to help others when wanting to purchase this bed. It was really hard to order a bed online without seeing it in person, but Im happy I did! Its beautiful! Looks way more expensive then the $$$ I paid for it. Also it is sturdy enough for two, I weigh 120lbs and my boyfriend is 162lbs. Also, another note. When looking on overstock this version requires a boxspring. When you see the same exact bed that says Platform, that comes with the slate system. Great bed for a great buy! Very happy with the purchase.", 
    "Love this bed! It is SO nice! I love this so much and it looks classy and is strong and sturdy. It was easy to put together. My son and I did it on our own in less than an hour. Have had it now for a month and can say it's really nice and worth the money!", 
    "This frame is perfect for my space and bed. I have an adjustable Temperpedic bed which really ahs its own frame but have owned it now for many years. It was hard to find a bed frame with headboard which will fit around my temperpedic frame withouf impeding the functionality of the matress. This is perfect. I didnot need the cross board its very sturdy and well constructed. It has just enough room around the frame so the heavy quilt I have on the bed can be tucked in and the bed looks very manicured!!", 
    "I have been looking everywhere for a quality bed for a bargain and I have found it here! I can't believe how beautiful this bed is, the details and the fabric; it looks like something you would find in an upscale furniture store. Thank you Overstock!", 
    "I was a little worried about ordering a bed online as there was really no way to check quality, sturdiness, etc. All there is to rely upon is reviews...The bed arrived and it was pretty easy to assemble. I'd suggest having a drill handy otherwise you will spend hours using the allen wrench included. I'm very pleased with the quality and look of the fabric covering it. The headboard doesn't seem like something you should really be leaning up against reading at night though as it isn't the most rigid construction where it connects to the rest of the frame.Wish I had more rooms to buy this bed for!", 
    "Spend more on a better bed! It is near impossible to put this thing together completely straight. And there are only three TINY slats. When you move the bed the entire frame bends- bad news", 
    "This bed is gorgeous, simple and elegant. I took a star away for two reasons. One is the \"nail-head\" detail. Not actually nail heads. It's a strip of decoration that is supposed to look like nail heads. Additionally, I thought it was a platform bed. I don't know if I just missed that when I bought it, or if the description was misleading, but make no mistake, you need a box spring or to create your own platform support under your mattress.", 
    "I purchased this bed because of the great reviews. Overall, I am happy with the bed because it is so beautiful, and would definitely recommend it. However, some of the hardware to put the bed together was missing! We had to drill holes where they didn't belong to fit in our own hardware just to put the bed together. This is my first time purchasing from Overstock, and if this is how they operate...then no thank you.", 
    "I love it. Super modern, easy to assembly but was missing rails", 
    "Now that the bed is put together, we are extremely happy and love it. However, a seemingly easy assembly was actually quite difficult due to poorly written instructions. We kept using the wrong bolts because the descriptions were not clear. Also, the bolts didn't catch well into the pieces, which made the assembly take a lot longer. In fact, one piece had a diagonal hole, therefore when we tried to screw in the bolt, we had to screw it in on an angle for it to catch. Overall, the bed is beautiful, but we wish we were prepared for a more difficult assembly.", 
    "Great looking bed. Would buy again. My daughter loves it.", 
    "This is my First time ordering form Overstock. I have ever ordered anything online this big. Completely satisfied, shipping was really fast. The bed is amazing, it is a little darker than it looks on this picture, but the fabric is beautiful (light gray, white and black). Putting the bed together was really easy even my 3 year old helped. So glad i bought this bed.", 
    "The bed arrived quickly via UPS in a couple of heavy boxes. The set up was simple, the cost was very reasonable and the quality is top notch. Overall, very elegant looking and the fabric is very durable!", 
    "This looks great in my daughter's new room. Looks even better than online. Not hard to put together.", 
    "Looks great and very easy to put together", 
    "In excellent shape- nice color, nice studs along bed.", 
    "I love this bed & am so happy I picked this one over others I had my eye on. The combination of button tufted with nailhead detail on the headboard gives this bed such a high-end look. It looks like we paid much more than we actually did! Other reviews commented on the supports not being strong & having issues with them breaking which almost deterred me, but this has clearly been fixed by the manufacturer because in a year with this bed my husband & I have had no issues at all. Would strongly recommend.", 
    "If you are considering buying this bed, don't hesitate. The details are beautiful and it was easy to assemble. I highly recommend this!!!", 
    "I had been looking for an elegant looking bed for quite a while, but every time I would find one it would be way too much money. I feel that this bed looks like it cost way more money than it did. It is sturdy and nice looking. One of the nailheads is a tiny bit too close to the other which bothers me every now and then but nobody probably would notice that unless they were staring at it a while. Overall, I recommend this bed for an elegant, inexpensive bed.", 
    "love it !!! good quality but very low to ground", 
    "Very nice bed put together easily and is pretty study", 
    "Love this bed.. Easy to essemble and exactly as shown in picture and value for money", 
    "Very pretty,However the color is more of a scratchy black/white/grey.But overall looks Beautiful.", 
    "I just got this bed! Looks great! Easy to set up!", 
    "This bed frame is so pretty and very sturdy.. I love the gray !", 
    "Bed color is a bit darker than picture, but I preferred a darker color grey any way. Overall nice bed, easy to put together", 
    "beautiful bed, easy to put together", 
    "Love this bed! Bought it six months ago, easy to assemble, was able to fit the headboard and pieces up my extremely narrow and curvy staircase, must have box springs, sturdy but makes a little noise", 
    "I've gotten many compliments on this bed. Its definitely a show stopper. My only complaint is that if you were looking for more of a lighter gray as shown in the picture -- it is not. Its definitely darker than the photo shown. Not super dark but definitely not light. Since the room I placed it in is a blank canvas, I decided to keep it and make it work", 
    "good for price, wish it was a little sturdier but you can add screws if needed to fix that. looks really nice", 
    "I love this - however, it is MUCH darker fabric than in the photo. There is another one on the site that is the same color but a different price. I see where there may have been another option, but this one is definite much darker grey - not light at all..", 
    "Unfortunately, the upholstery on this bed is not as soft or light in color as it appears in the photo. The color is very dark with variations of lighter color and resembles dark gray denim... and is rough to the touch. It was not the look we were going for, but decided to keep it regardless, because we had an immediate need for it! Overall, it is a fairly nice looking bed, however do expect the fabric to arrive darker and a bit scratchier than pictured. Of course Overstock delivered promptly and all the pieces were there and everything was in good shape when it arrived!", 
    "This headboard and bedframe combination is a really good deal for the money. I read the reviews for this bed before I purchased it and reviews were mixed with quality issues etc.... My headboard is very nice and substantial. It is sturdy and for the most part well made. The only issue I had was that one of the buttons for the tufting fell off. My mattress almost covers up where the button was and with the pillows, you would never know. I needed the bed right away for company so I did not send it back. The bed would be perfect except for the missing button that is why I gave it a 4star rating. The color is as specified online and it is quite a sturdy piece for the money.", 
    "Matches my bedroom and very easy to assemble", 
    "This is a very nice bed and very study too. I am happy with it overall. The color is not as nice as the photo though. I got it in the grey and wish I had gotten it in the beige or a lighter color. We had to use some metal stilts from an older bed we had and drill them along with the wooden stilts that the bed comes with to make it more sturdy, that way I could use a boxspring. I got a low profile boxspring because I felt that the bed is too low with just a mattress. Now my boxspring doesn't show from the side bars and the bed is at normal height and I am happy.", 
    "The instructions were good. However, the fit for one insert in the foot board was impossible to insert the side board. Tried reversing the side boards but nothing worked. the other 3 inserts were easy so we left the one side barely fitting but fitting enough to keep the bed together - with cover, you can't see the bad fit on the foot board corner. It would be impossible to return after getting that far into the building of the bed", 
    "Arrived in wonderful condition. Slightly darker than pictured, but only by a little. My husband and I have had this for about two months now and we still love it! :)", 
    "I was very pleased with my purchase. 😊 Sometimes order things online could be very disappointing. But not this time!!", 
    "I ordered this bedframe in August and since then it has been super sturdy. It comes with a couple of extra posts that help support the frame in the middle, so there's no room if you wanted to storage underneath the bed. The instructions were easy enough and came with all the necessary bolts and washers. Super happy with the purchase and the quality thus far!", 
    "This was an awesome purchase given the price point and the bed is simply beautiful. It was very easy to assemble, the directions were easy to follow and I was able to put it together in a reasonable amount of time. There is however an issue with the slat system. The design isn't the best and I quickly discovered it would not support my mattress without falling. I easily solved that issue by going to my local mattress store and purchasing a bunkie board. For those of you that aren't familiar with the term like I was, a bunkie board is a slender piece of furniture that can be placed under a mattress to stabilize it. Traditionally, a platform bed does not require a boxspring but this bed will require something to stabilize your mattress. I also tried using a traditional boxspring but it ended up sitting too high and took away from the overall look of the bed because you could not see as much of the headboard. I would've given this bed 5 stars had I not had to make the additional purchase of the bunkie board. Overall, I am still very pleased with my purchase and I receive many compliments.", 
    "Love this bed, it's very elegant looking.", 
    "Looks expensive but wasn't too pricey. Easy to assemble. The color is beautiful in person.", 
    "This bed is really beautiful, it was easy to assemble, no problems at all. It took me awhile to find a pretty headboard and frame , and I finally found it. Had lots of compliments on this bed. So happy that I bought it. Love it😄😄😄", 
    "But the bed frame is not very sturdy. The frame moves constantly and doesn't feel too secure.", 
    "My husband said it was a bit difficult to put together because he was missing some of the screws", 
    "When I was looking online to purchase a new bed I was skeptical about ordering one online without seeing in person. I finally decided on giving a shot on this bed and have been nothing but pleased. The bed is great value in terms of price and quality. I would highly recommend this item and think anyone purchasing would be pleased.", 
    "This bed is a great value and worth the purchase. Color is very true to picture. Larger than I was thinking it would be. Easy to assemble. Very sturdy.", 
    "Very happy with my new bed. It looks even better in person", 
    "The bed does look nice in our guest room, but our guest room is very small. The frame is much bigger than a queen (maybe 6-12 inches longer and wider) so it made very little space except for the bed. I had to return the bench we were planning to put at the foot of the bed because it wouldn't have fit right in our room.", 
    "We've only had it for a few days, but love it so far. - It feel pretty sturdy- the color is a little darker than it appears online, but we like it (maybe better)- pretty easy construction, 1.5-2 hoursLooking forward to seeing how it maintains", 
    "I love this bed looks just like the picture", 
    "Beautiful bed. Easy assembly!", 
    "This frame is beautiful! it looks way more expensive than it is and pulls my bedroom together perfectly", 
    "The bed looks wonderful and was easy to assemble. The wood slats are pretty crappy though. I'll be replacing them with better quality wood.", 
    "Just as other reviews noted, we loved the look. Assembly was fairly straight forward, and when you double check on each connection for tightness, the bed is very sturdy. Only 2 days in but sag in the frame or support. Definitely recommend.", 
    "The nail heads were a strip glued on. The \"tufting\" was not so \"tufted\" as the picture appears. I was really excited to get the bed, but once I got it and put it together I felt let down.", 
    "The bed frame and headboard took a few hours to put together but was the finished product was worth every minute of it. The design and quality of this piece looks and feels expensive. The headboard and frame feel strong and secure. I like the neutral gray color choice and feel that the nail heads add just enough bling to the design. Overall, I am happy with my purchase.", 
    "Beautiful bed. Easy to assemble. Love it!", 
    "Shipped fast, sturdy but came with a missing button. Other reviews claim missing buttons as well. The hammering is also very cheap looking and is close together.", 
    "This bed is beautiful. It looks luxurious and expensive and it is so sturdy! Easy to put together and a great price! Also, thanks to Overstock Customer service, a minor error in my address was fixed quickly and the bed was shipped to the right place on time. So happy with this purchase!", 
    "Excellent item. Very happy with quality and price.", 
    "the grey color makes the bed and even my bedroom look elegant, love it.", 
    "Bought for teenager's bedroom. Perfect for that. My daughter and I put it together ourselves in an hour and a half. Not too bad. Materials, etc are exactly what I expected in this price range. Great bed for the price.", 
    "Don't wait, just buy it. I shopped at local furniture stores for weeks and would have paid 3X what I paid. It is VERY sturdy and built to last.", 
    "This was my first purchase from overstock so I was a little nervous. The bed was easy to assemble and is very sturdy. It looks much more expensive than it is! Great value for the money. The color is charcoal grey. I reccomend this bed!", 
    "i bought this bed for my 7 year old that has a very mature taste. this bed is beautiful and the quality is good for the price. took about 2 hrs to put together.", 
    "Love this bed and happy with the purchase.The grey linen fabric is good quality. Although I thought the silver studs would've each been attached separately. When you look close, you can see they are all attached and they're a little plastic looking. I gave 4 stars only because I thought the bed would be easier to put together since it's not a platform bed. But one of the legs that attached to the headboard was cut crooked and it was difficult to assemble. After disassembling 3x I finally got it to look decent. Still wasn't flush with the headboard but can't tell once the bed was all set up with mattress and box spring. I've had it for a month now. Overall great looking sturdy bed for the price.", 
    "Beautiful! and easy to assemble", 
    "At first I was a bit skeptical about purchasing a bed online but after reviews I've took a leap of faith and I made the purchase. Great quality bed. Easy installation.", 
    "This is a really neat product at a great price. I would recommend using a box spring or getting a more supportive base is if only using a mattress.", 
    "The only reason that there is one star missing is that the directions were misleading when it came to the headboard. I had extra bolts (of different size) which made the assembly process very confusing. I put the bed together by myself and I would say it took me about 1.5 hours even with trying to figure out the right bolt for the right place. It looks very classy and I love it. It took me 3 months to find a bed that I would love. I am glad that It took me that long because I finally got a good deal on it on Overstock. I love this site.", 
    "Totally obsessed with my new bed. Relatively easily to assemble and makes me feel like a queen.", 
    "Looks just like the picture! Grewt value", 
    "I am overall thrilled with this bed, the look is very classy and modern, and the color will match pretty much any color scheme in your bedroom.My only dislike is that the construction is a bit sub par, but with a little creativity, a drill and some plywood, you can reinforce the bed frame for a sturdier piece of furniture. For the budget savvy shopper, this is great buy.", 
    "Out with the King and on to a Queen! I love the texture and nailheads on this bed! My son-in-law put it together - hope you've got one as good as mine! He loved it, too! One thing I did not think about was a box spring to go under it; where was my head? That's an easy fix though. I am happy with everything except the mattress pad, which you can read about it my review.", 
    "This product was easy to assemble and was exactly as described. My husband and I love it!", 
    "This was my first time ordering a large piece of furniture from overstock and the experience was great! The bed was easy to assemble I do recommend using a power drill to speed up the process. It looks fabulous and chic for an unbeatable price. The frame is also sturdy.", 
    "We are pleased with the quality and the look of the bed!!! Love the color!! Got this bed for a thirteen year's old girl, can't wait for her too see her new room ))", 
    "LOVE LOVE LOVE!!!! we have this in our bedroom and it looks exquisite!!!!! We have dark grey and light grey and lavender linens on the bed. Very romantic!", 
    "Beautifully made. It is in my daughters room so doesn't take a ton of weight but seems to be well built. A very pretty bed for the price!", 
    "SUPRE STYLISH BED, A LITTLE BIGGER IN MEASUREMENTS THAN MOST MATTRESSES AND A BUTTON WAS MISSING.", 
    "Excellent quality and very sturdy for the price.", 
    "I have to say that I was kind of skeptical during my online purchase. I wasn't sure I really wanted to order it online because I thought I wouldn't be happy with my purchase, being that I am so picky. To my surprise this bed was so on the money for me!! It was what I was looking for but at a great price. This bed is definitely not cheap looking and its so sturdy. Definitely a Great bed and so worth buying! The makers should be proud of their product and I'm very happy to say that I'm more than happy with this purchase, not only for the looks but the assembly was really easy...My room looks so elegant now. Thank you!", 
    "great bed for the price. looks more expensive than it was", 
    "very pleased with the product. like the linen style opposed to a leather look.", 
    "We purchased a brand new full size mattress (*****) and when I saw this bed on Overstock I was so excited because it looked beautiful. We received it in within 3 days of ordering and the fabric and construction was great. I was so happy because it was exactly what I was looking for. When it was finally together and we went to put the mattress on there was so much extra space that it looked terrible. I mattress looked to small for the bed. So, we ended up returning it. I was very upset that the mattress didn't fit in the bed frame properly. There was about a 2\" gap all the way around the bed. It didn't look right."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Grace-Grey-Linen-Button-Tufted-Arched-Bridge-Upholstered-Bed/9148142/product.html?recset=ff020176-31d1-4b0b-abf5-5f6504481c28&refccid=QLOTCR77AQMJGMKEIK5W6CXZS4&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9148142/INSPIRE-Q-Grace-Grey-Linen-Button-Tufted-Arched-Bridge-Upholstered-Bed-02f684b7-47ef-4a13-a49b-565cfe4430d2_600.jpg"
  ], 
  "description": "This grey linen upholstered bed adds style and elegance to your bedroom. Featuring tufted grey linen on the headboard and matching grey linen on the frame, this bed complements most any color scheme. Rich espresso wood detailing completes the sophisticated, graceful look of the linen upholstered bed. The bed is designed for use of both a mattress and box spring for maximum comfort. Set includes: One (1) headboard, one (1) footboard, one (1) set of rails, three (3) slatsMaterials: Poplar woodFinish: EspressoUpholstery materials: LinenUpholstery color: GreyUpholstery fill: Polyurethane foam   Overall full bed dimensions: 83.75 inches length x 59.5 inches width x 52.75 inches heightOverall queen bed dimensions: 89.75 inches length x 65.12 inches width x 52.75 inches heightHeadboard height: 52.75 inchesFootboard height: 13 inchesLeg height: 4 inchesHeight from the floor to the slats: 11 inchesFull internal-mattress opening: 55 inches wide x 76 inches longQueen internal-mattress opening: 61 inches wide x 82 inches longAccommodates boxsprings and mattress, NOT includedMaterialLinen, WoodFinishEspresso FinishBed StyleRegular BedAssemblyAssembly RequiredColorGreyFurniture PatternSolid"
}