{
  "name": "INSPIRE_Q_Dorchester_Wingback_Nail_Head_Accent_Chair", 
  "price": "EUR 341.11", 
  "reviews": [
    "This is a nice-looking chair (burgundy stripe) and provides firm seating, which I personally like. Someone looking to sink into an easy chair would not find this to their liking. The fabric appears of reasonable quality; overall construction is adequate, at best---don't think this would stand up to a lot of heavy use in a family with children climbing on it daily. The major negative, however, was the challenge in assembling it. i have put together LOTS of furniture over the years---this piece was one of the more aggravating. First, the provided instructions were for another chair with a totally different hole/bolt pattern. However, rocket science is not needed to know what to do---but accomplishing it is another story. There are two bolts on the rear of the seat and two on the side. It is virtually impossible to align the side bolts with the pre-drilled holes very easily. I struggled for almost 45 minutes before finally get them to line up. Tip---insert the dowel in the back of the seat in the hole in the frame first and then align the side holes next; doing so will require a LOT of trial and error! Then assemble the bolts in the back of the seat frame last, and don't tighten anything until you have them all started. All in all, this will likely be an acceptable product but, if given the opportunity, I would not purchase it again. I think there are better values out there!", 
    "I purchased two of these chairs for a room that has virtually been an unused, adjoining living area, that I am finally trying to make functional after several years! I loved the style, color and design of this chair, along with the price point. When they arrived, I wasn't disappointed! I attempted to put them together alone, and if I'd been using my head I might have accomplished it. So, here is my advice. Use a hammer to help you! Once my husband showed me that little trick to help me align the seat with the back of the chair and line up the holes, it was a piece of cake. These chairs are pretty sturdy, substantial, and beautiful, not to mention comfy for a wingback. And the nail head accents tie in to an ottoman I purchased for my adjoining space and make the chairs look like they cost much more than they did! Very pleased with these chairs!", 
    "Once assembled (with a bit of difficulty), this chair is comfortable and sturdy. We purchased the Blue Floral and the blue is more of a greenish color.", 
    "This is a very nice chair but I returned it because the color is much more teal than the picture it shows. The color was too bright for my room.", 
    "This chair is beautiful, easy to assemble and feels solid. My only advice is to order a pillow first in fabric you want because the blue color in the picture that I ordered is more teal. It works in my room but it is not the same as the picture. I ordered the blue floral pattern.", 
    "This chair arrived within a couple of days, was easy to assemble, and has gotten compliments from everyone who has seen it. A great buy!", 
    "color was a little lighter than expected, otherwise love them", 
    "Incredible look, so elegant and beautiful. ..", 
    "Great quality, just as in the picture! Good design, and sturdy. Only thing is you need 2 people to put the chairs together. Finding the holes was sometimes challenging and required some strength to tighten them.", 
    "I ordered two of these chairs and Loved what they did forfor the coastal look in my den.", 
    "Design is nice, but has poor quality, wood brace of the seat is falling apart, soft like a styro foam. I just keep it because its too bulky to ship it back. Good for display but not for sitting. Waste of money.", 
    "I love these chairs. We bought the Earth Tonal Oval EXACTLY how I thought they would look. Bought extra pillows for sofa and loveseat and though they are only a month old they are starting to \"shred\" Makes me afraid that the chairs will do the same. Just beware !!", 
    "Sturdy accent chairs that were fairly easy to assemble. Purchased a pair in Burgundy Stripe that have more silver through the fabric than the picture would suggest.", 
    "I ordered this chair for my living room.When it came it was the worry chair! I call the company's phone number,I thought that the problem was fixed. The Ups man came for delivery and it was the same worry chair.Two times was it for me.I send it back.So I never brought it!!!", 
    "Easy to assemble, above average quality. This chair was the same as pictured online - color, pattern, etc. Not recommended as an every day, \"easy\" chair. Definitely an accent chair for occasional use.", 
    "\"We bought two of these in the teal floral pattern to fill in the far end of our family room. My husband had to do some assembly on the legs. We don't use them, so I can't say anything about durability. The chairs look great (especially for this price). The patterns are laid out to match on both chairs which makes them look a little more \"\"high end\"\"\"", 
    "The color is more of a green/forest green than blue. It looks ok with our decorations so we kept it. Definitely just ornamental as it is not super comfy.", 
    "We bought two of these. As others have noted, the chairs are difficult to assemble. It isn't hard to get the chair physically put together, but it is almost impossible to get the various pieces of the chair to line up with one another. We eventually gave up and said they looked \"good enough,\" which is too bad when you're spending this much on a chair. The quality is also just \"okay.\" The fabric bunches and the foam feels lopsided (when we haven't even sat in them yet). We have them primarily for \"looks,\" so they'll work for our purposes...they look nice (as pictured) when viewed from a neighboring room.", 
    "So I like this chair. It will serve its purpose for a year or two while looking to go all out in in price & quality. The color (burgundy stripe) is not nearly as vibrant as the picture. It almost has a more pink-ish tone to it in person. The nail heads that are on it, are like a strand of them. One side has already started to come off; so my husband had to find the nail that was lost in the SHAG carpet to nail it back in. Overall its comfortable enough, deep enough seat so you sink down a little & put your feet up."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Dorchester-Wingback-Nail-Head-Accent-Chair/9600404/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9600404/INSPIRE-Q-Dorchester-Wingback-Nail-Head-Accent-Chair-1d28119e-e768-4735-b4ed-f3d0d3bb19d1_600.jpg"
  ], 
  "description": "Take a break in this wingback chair from Inspire Q. This\ncomfortable high-back chair features foam padding that makes\nextended sitting a pleasure, and the included matching pillow gives\nyou excellent back support. The beautiful nailhead design and rich,\ndark espresso frame gives this chair a stylish look that is\nwelcomed in any living room or office waiting area. Set includes: One (1) accent chairMaterials: Rubberwood, fabricFinish: Espresso wood stainUpholstery color: Earth tonal oval, peacock Moroccan pattern,\n  blue floral, burgundy stripe, purple tonal oval, lavender ikat,\n  octagonal tile, rectangular link, chartreuse linenMatching pillow accent for added style and lower back\n  comfortFoam density: 50 poundsCushion thickness: 8 inchesSeat dimensions: 19 inches high x 28 inches wide x 22 inches\n  deepOverall dimensions: 40.75 inches high x 28.5 inches wide x 31\n  inches deepStyleContemporary, Modern, TransitionalMaterialUpholstered, WoodChair TypeAccent Chairs, Club Chairs, Wingback ChairsAssemblyAssembly RequiredChair Back HeightHigh BackColorBeige, Black, Blue, Brown, Green, Grey, Multi, Off-White, Purple, Red, Tan, YellowFurniture PatternPrint"
}