{
  "name": "INSPIRE_Q_Catherine_Print_Parsons_Dining_Side_Chair_(Set_of_2)", 
  "price": "EUR 181.93", 
  "reviews": [
    "I had waited and waited for this chair to come back available in the print that we wanted. When it finally did, I jumped on it! I ordered 4 and after reading reviews about the assembly, I was expecting to be in for the long haul. The assembly was actually quite easy. The instructions were very clear and after the first chair was done, the rest were a piece of cake. I will say that it is a good idea to stand the chair up on end once all of the bolts are in, but not tightened. Give it a little wiggle to make sure that all of the legs are level, and then finish up tightening the bolts. The overall look is exactly how I had hoped (we bought the honeycomb pattern and there is actually just a hint of light blue in it.) They were just the thing to spice up our bland dining room. They are also quite comfortable. The seat is a little firm, which I'm sure will soften over time, and the shape of the backside is supportive and comfortable for hours of entertaining. This was definitely a great purchase for the $$ and we will look to find some hostess chairs from the same manufacturer.", 
    "As we speak I am having to ask for two chair back replacements. One chair back does not have holes where there should be, the other back has holes but no threads for the screws. There is no way to put together the chairs at all. So disappointed.", 
    "The chairs are advertised as linen, but they feel more like microfiber and as such, the material acts more like a suede showing highlights and low lights depending on where it's been touched. Personally, I love the look. I have put many items together over the years, but this one is just impossible. The holes just do not line up. I am going to have to wait for my son or hire a handyman. I was so anxious to set them up right away, but unfortunately, I will have to wait. There are a few little nicks on the legs, but will be barely perceptible once put together. I'm sure a little wood touch up will cover them nicely. Just have to wait and see.", 
    "Love the fabric, comfortable, but on both chairs 1 out of each of the 4 legs was 1/4-1/2\" shorter than the other three on each chair", 
    "Beautiful chair overall but slides easily. If you want a sturdy chair, this is not it.", 
    "We bought 4 of these chairs for our dining room table. They coordinate beautifully with the Inspire Q Geneva Wing Back chairs which we purchased as our dining table end chairs. The chairs are very comfortable and provide good lumbar support--better than I was expecting. We have lingered over several family dinners now and have not been in any rush to get up from the table. I like how there is some movement to the fabric--it should help to better hide an occasional spill or stain. Just to be safe, we did Scotch Guard the chairs as soon as we got them, but we do that with any upholstered furniture we have (we have kids in the house). The fabric is very soft (almost plush?) and the chairs look far more expensive that what we paid for them. I am very happy with this purchase and I look forward to many more daily casual family dinners as well as holiday celebrations using them.", 
    "I ordered the mocha honeycomb fabric, but the chairs are much more blue than pictured, there are two tones of brown in the pattern, and the background is a dark cream. I know that colors aren't ever truly represented online, but this was a disappointment. I'll be sending these back (the quality of the chairs themselves seems fine - just what I expected). Back to the drawing board! :(", 
    "These are beautiful, sturdy but comfortable. Love the colors! One was easy to put together, one - not so easy - but when I was done - they look great!", 
    "Beautiful pieces. Very well made. Easy to assemble and very comfortable.", 
    "Very pleased with these dining chairs. I purchased six of them. They assembled easily and are very sturdy The upholstery is even more beautiful than depicted in the photograph", 
    "These chairs are great. We had no trouble with assembly. We bought 8. We wanted floral without the feminine colors. So the gray brown abstract worked.", 
    "Love the look of the chairs in our nook.", 
    "Love the chairs. Exactly as described. Look great And comfortable.", 
    "We are very happy with this purchase. The product is a good quality. I had been searching for months to find these chairs that offered a print design other than solid color. The colors are perfect in our color scheme. The price was more than I wanted to spend, but we are very happy to find these chairs.", 
    "I received so many compliments from our customers.", 
    "Nice and comfortable chairs. The color shown is perfect. The stain on the legs matched my table. The material is durable and good for the kitchen too.", 
    "The quality is wonderful, very pleased with my purchase", 
    "I love how these look and go with my decor.", 
    "I like the look of the chair but poorly made to put together. Once together they are comfortable, but whoever designed the product didn't align holes evenly. We had to return 2 and others were horrible to align.", 
    "Very nice and comfortable...love them with my dining table...lots of compliments, too.", 
    "Great value, a little difficult to assemble. They feel sturdy and held up nicely at Thanksgiving.", 
    "Ordered these chairs they arrive on Monday and today we put them together and it was very easy .....Love the pattern and the color glad I got them......", 
    "The look and feel of these chairs is very similar to that of a top notch chair but for half the cost.", 
    "Great Looking chairs. It was easy to assemble and they look just like the picture.", 
    "The chairs are sturdy and love the thickness of the cushions. Fabric is a great quality. Our only issue was lining up the screw bolts to attach the legs... took us a while to figure out an easier way to do it. Once we figured out to put the bolts through chair holes first and then match up the legs, it worked like a charm.", 
    "Love these chairs. They're surprisingly sturdy and easy to put together. I've been having them about 8 months and use them on a daily basis and have not had to tighten any screws. Pretty good I'd say!", 
    "I love the look of the chairs but not all the screws fit the holes. I had followed the instructions but I still have some screws that don't screw in the holes. I hope that when I have people sitting in all of them I don't have an issue.", 
    "These chairs are beautiful. They were not that hard to put together and feel fairly stable.", 
    "Is the fourth time I order this chairs That are great they look lovely", 
    "These look great and sit well on the floor. And they are great to sit on.", 
    "These chairs were very easy to put together. The wooden legs are a deep brown / black. The material is eye catching. Seats are a bit too firm, but I imagine that with time this will change. Scotch Guard highly recommended, especially on the light fabric when being used by young children.", 
    "Stylish and a great value!", 
    "I like the color and the size of the chairs. I had one chair that the leg was too short. The bottoms of the chairs are thick and comfy but the backs of the chairs are thin and they cheap looking.", 
    "Ordered these for my home office. Took quite a while to assemble - one of the screws did not seem to exactly line up with the hole...but finally got it :) They are pretty and very comfortable.", 
    "Had to re-drill a hole that didn't line up on one of the chairs. Shoddy workmanship on this one chair, hope it's not an indicator of overall product quality. We'll see.", 
    "These chairs are very nice for the price. Can tell they were quickly thrown together in China. The wood frame is unfinished underneath and splinter-y. But, that would not deter me from purchasing again. Price is great and they look very classy and high end. Good deal overall", 
    "Ordered 2 of these. Delivery was very prompt, however, the fabric is stated as linen and it looks far from it. It is more of a velveteen. Very shiny. At some angles, the pattern cannot be seen. They are being returned .", 
    "I love these chairs. Color, size and material. Bought light grey. Looks awesome. Have had for a while and still love them", 
    "Great great great and confortable", 
    "along with the 2 sets of wavy back chevron style chairs from Inspire Q - 1 set of this fun pattern was purchased to complete a seating of 6 for my daughter's recently remodeled dining room/kitchen. Assembly was easy, prompt and super quick delivery!!! Thank you Overstock for being the best there is!!!", 
    "This was the replacement set for expensive bonded leather chairs that did not wear well. These are light, smaller in profile and comfortable. Perfect for our room. They won't last forever but are good enough and look fantastic. If they don't last I am not out a lot of money. Great color.", 
    "These chairs were much nicer in person than how it looks on the site, adds a nice modern look to your dining room. Very comfortable", 
    "These were a great deal! They assembled easily and they are built very strong. I also purchased 2 wing back versions of this chair and they look great as well.Better price than anywhere. I also purchased throw pillows that matched the chairs. made the room look fabulous. I wont shop anywhere else but Overstock.", 
    "I'm so pleased with these chairs, especially for the price. They do require assembly and that takes a bit of time, but worth the savings versus what would pay in-store for pre-assembled chairs. Fabric feels rich in quality, real wood, etc. I would definitely buy more of this INSPIRE Q product line!", 
    "Although they do take a while to assemble, it is not hard to do. They are comfortable, and look much more expensive than they were! The instructions tell you what to do if the legs are sitting properly, and this took care of the problem.", 
    "A little bit tricky to put together since holes for screws did not always line up perfectly.", 
    "Light Gray as picture shows, soft to the touch. Padding softens out for comfort after about a week. I also purchased a couple of the wingback hostess chair in the same color. The were gorgeous and more comfortable, especially with the silver nailhead trim, but would be too much to chair to go around entire rectangular table, so just placed at the ends with the parsons on the sides. Leveling the chairs were interesting - as weird as it sounds, I do recommend following the directions that indicate to pull on the back of the chair while hitting underneath. Actually worked well. Go figure!", 
    "These chairs are great and look much better than we expected.They are comfortable and well built and look as though they should last a long time.", 
    "These are beautiful chairs. The fabric sets them apart. However, they seem pretty lightweight. I don't know if that means they will not last long but they look good.", 
    "The fabric on this chair is lovely. The seat is not completely solid so it does collapse a little upon sitting, but not bad enough to make this char unacceptable. After you sit, the chair is comfortable. I like the seat height also. I did not have any trouble assembling the chair, but did have to work at getting them level. It would have helped to have a second person push down as you tightened the screws, but I ended up using a big dictionary to help level while I tightened.", 
    "Ordered these chairs on Saturday, and I received them Tuesday! They were easy to put together, no problems at all. The fabric is very nice, and the color is a perfect compliment to my mostly neutral decor. I looked for similar chairs at several retailers and even though I found some very nice chairs, they were priced higher. These chairs seem to be of equal quality, and I feel that they are a terrific value for the money.", 
    "These chairs look great set up, and look a LOT more expensive than they were. Requires a little arm strength in getting them all assembled, but well-worth it.", 
    "Very chic and stylish! They look great with my dark cherry table and white shag rug! Only took a few minutes to assemble!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Catherine-Print-Parsons-Dining-Side-Chair-Set-of-2/8551271/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8551271/INSPIRE-Q-Catherine-Print-Parsons-Dining-Side-Chair-Set-of-2-6bc350c6-cb37-4c7e-a3bf-a68d2bcd6b32_600.jpg"
  ], 
  "description": "Offer friends and family a pleasant place to sit with this set of\ntwo Inspire Q Catherine Print Parsons dining chairs. The solid\nrubberwood frame provides long-lasting stability that is softened\nby the foam- and spring-filled cushions. The armless design of\nthese chairs gives you freedom to move around comfortably, while\nthe cushioned backrest provides you with additional support for\ncomfort.Set of two dining side chairsConstructed from durable rubberwood and fabric for\n  longevityRich espresso finish to complement the printSoft fabric and linen upholstery covers a spring and foam\n  fill cushionWide variety of prints to choose fromChair dimensions are 38.5\" H x 19\" W x 23.75\" DSeat dimensions are 18\"W x 17\"D x 21\"HSeat Height: 18 inchesSeat Depth: 17 inchesBack Height: 21 inchesOverall Dimensions: 38.5 inches high x 19 inches wide x 23.75\n  inches deepStyleModernMaterialRubberwood, WoodFinishGrey FinishChair TypeDining Chairs, Parson ChairsSeat HeightCounter HeightSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, Cream, Gold, Grey, Off-White, Tan, TaupeFurniture PatternPrintGallery RoomMagnolia Moments"
}