{
  "name": "INSPIRE_Q_Catherine_Moroccan_Pattern_Fabric_Parsons_Dining_Chair_(Set_of_2)", 
  "price": "EUR 207.91", 
  "reviews": [
    "I almost purchased these chairs (same designer) from a moderately somewhat upscale furniture store! Each chair was priced @ $299 each! & I was going to have to wait up to 8 weeks for this color! When I saw these chairs posted on OS, I was literally \"blown away\" when I compared the price! I paid about 1/4 of the price!!!! & they were not difficult to put together once they arrived....about 5 DAYS after I placed the order!Very Pleased w quality, durability & beauty of my new dining room chairs that highly compliment s glass top table that I already had!", 
    "These chairs are beautiful and the construction is far superior than any we have seen!!!! We purchased them for a host and hostess chairs in our breakfast nook, and they look absolutely amazing!!!! We are quite pleased with this purchase.", 
    "Design is stronger than most chairs of this type. Comes with dusters on each leg. Design motif appears applied on top of fabric rather than woven into covering. Overall solid value.", 
    "We purchased 8 of these chairs and they are beautiful. We purchased the black and cream pattern. They look very expensive. My husband had a little difficulty putting the first one together until he figured out the importance of the angle between the back and seat. After that, he put the remaining 7 together very quickly. They are very sturdy and the seats are well padded. We are very happy with these chairs.", 
    "Every one loves these beautiful and modern charis. They look expensive and the fabrice is just beautiful...", 
    "Great product. Pretty easy to assemble. Took a little extra time than I thought, but I just poured a glass of wine and time ran by easy-to-read instructions. Looks good. Order two additional chairs after.", 
    "I use these chairs in black as host/hostess chairs in my Dining room. the black upholstery pickup the black curtain rod and black frame on photos in the room w grey lattice rug. LOVE them. Price is great and a big impact design wise. My DR looks sleek and modern. I keep walking into the room to look at it.", 
    "I loved the chairs however the blue was brighter than pictured. They really belong in a summer house in my opinion. If I had one...I'd keep them!", 
    "Love these chairs !! They are beautiful. Only complaint is they are hard to put together alone.", 
    "Ordered the blue chairs. The color is brighter than the picture shows.Although I still really love them.They are excellent quality at a great price!!", 
    "Arrived on time and looked like the photo on the website.", 
    "Wwith this productell pleased"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Catherine-Moroccan-Pattern-Fabric-Parsons-Dining-Chair-Set-of-2/10155882/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10155882/INSPIRE-Q-Catherine-Moroccan-Pattern-Fabric-Parsons-Dining-Chair-Set-of-2-11de1f0d-fb35-41e9-951c-dace494acda0_600.jpg"
  ], 
  "description": "These striking Parsons dining chairs from INSPIRE Q create a\nfashion statement thanks to their bold fabric print. Set these\nchairs next to a traditional or industrial chic table to complete\nthe look of your dining room, or pull them into your living room\nwhen you need occasional comfortable chairs. Set includes: Two (2) side chairsMoroccan PatternMaterials: Rubberwood, fabricLeg finish: EspressoUpholstery materials: FabricUpholstery color: Sky blue, Grey, red, midnight black, orange\n  yellowUpholstery fill: Spring, foam       Seat Height: 18 inchesSeat Depth: 17 inchesBack Height: 21 inchesDimensions (overall): 38.5 inches high x 19 inches wide x\n  23.75 inches deepStyleCasual, Contemporary, ModernMaterialRubberwood, WoodChair TypeAccent Chairs, Desk Chairs, Dining Chairs, Sets, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBlack, Blue, Grey, Red, YellowFurniture PatternPrint"
}