{
  "name": "INSPIRE_Q_Montvale_20-inch_Toss_Accent_Pillow_(Set_of_2)", 
  "price": "EUR 60.09", 
  "reviews": [
    "Nice pillows, but if you're looking for that slate blue color, these are not for you. These are closer to a turquoise.", 
    "A little firm and overstuffed but good value and a nice contrast.", 
    "Nice fill, fabric thick and sturdy and beautiful in all it's purpose. Will definitely recommend", 
    "Bought these and they are falling apart !!!", 
    "I purchased the Burgundy Stripe. Instead of the deep red that was pictured, it was more of a purple hue. This will not match the color scheme of the room and it will be returned.", 
    "These pillows are beautiful. Rich colors, heavy material and the right size.", 
    "Beautiful burgundy accent pillows.", 
    "Love these pillows! Good quality!", 
    "I bought 2 sets all 4 has defects it has lots of missed stitches at the end of zipper and corners, waste of money.", 
    "I really liked these pillows. I am ordering two more. Good buy and good price.", 
    "it doesn't look like as picture. more like green than blue. not match my house now.", 
    "I have now both the kidney shaped and the square throw pillows. They look and feel expensive and the button covers are easy to remove if you need to wash them.", 
    "I had a hard time rating this because the pillows themselves are really beautiful. However I purchased grey and what you get is more of a blue green. It doesn't look like the pic in terms of color. I'm changing my decor in my living room and not sure if the color will work. I may have to return.", 
    "More burgundy than red... Quality is fine though. Ended using them in our downstairs guest bedroom instead of the living room because they are a deep, wine-like burgundy.", 
    "I love these pillows. I have a sort of dated \"pleather\" couch in ivory that I got as a hand-me-down. I needed something to modernize it and brighten it up while adding interest and contrast. These pillows did the trick, and they are very soft and well-made. The covers can be removed for washing. I highly recommend them, especially for the price.", 
    "For the price, these are great pillows. I wish there was a little more stuffing in them.", 
    "While they look okay from a distance, up close there are loose threads everywhere. I tried clipping as many as I could off but I'm now worried the pillow is going to fall apart.", 
    "These are ok. They look a little more old in person. Not as is if were used just older style. It still works.", 
    "I thought these pillows were charcoal gray but they are a teal color. It shows this charcoal color picture but it is not, being returned.", 
    "good quality, nice peacock color, more on the greenish side. it should go well with our beige sofa.", 
    "not very thick fabric, but soft. zipper on back to remove the pillowcase is a plus. nice color.", 
    "nice stitching, soft but appears durable fabric...", 
    "Good looking pillows however, they are pricey.", 
    "Not a real firm pillow but they are of great size and colors are nice.", 
    "Love these pillow it really brightens the space good quality !", 
    "Beautiful and plush. Great quality.", 
    "Colors, fabric are nice and true to description. Predominately for show. The pillow is not for use as a pillow... Loses its shape...but not as bad as the kidney shape. May need to buy new inserts!", 
    "We bought two sets of these and they're beautiful. They really are just for appearances, though: we had them on our sofa and sat against them once and the fabric wrinkled pretty badly (we had to iron it). Overall, we'd recommend them."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Montvale-20-inch-Toss-Accent-Pillow-Set-of-2/9958949/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9958949/INSPIRE-Q-Montvale-20-inch-Toss-Accent-Pillow-Set-of-2-7d17dcc2-efa4-45b6-86fb-afb8a6892e17_600.jpg"
  ], 
  "description": "Create a comfortable, contemporary space in your home or office\nwith these attractive INSPIRE Q Montvale accent pillows. These\nplush 20-inch cushions make chairs and sofas more comfortable for\nfamily members or clients. You can also place the cushions in\ndining or office chairs as lumbar support solutions.Two (2) attractive throw pillows included in each packDimensions: 20 inches long x 20 inches wideKnife-edge finish adds contemporary appealSoft cotton and polyester fillingA number of beautiful upholstery print options availableConveniently spot-cleanableStyleModern, Shabby ChicMaterialPolyesterPatternFloral, Geometric, StripeSet IncludeTwo PillowsCare InstructionSpot CleanSeason or HolidayAll SeasonsPillow ShapeSquareColorBlue, Green, Multi, Off-WhiteFill TypeCotton, PolyesterPillow TypeAccent"
}