{
  "name": "INSPIRE_Q_Darcy_Espresso_Metal_Upholstered_Dining_Chair_(Set_of_4)", 
  "price": "EUR 150.52", 
  "reviews": [
    "With three kids at home, I refused to pay a lot for new kitchen chairs. Coming out of the box the chairs looked short and cheap. Actually, they are about an inch or two shorter then my current chairs; however, when my hubby put them together and placed them under the table, I was impressed. They look great!", 
    "Assembly took about 10 minutes per chair with one person and a wall . Very sturdy so far and the tops have a velcro closure so you could easily change out the cover if you want a different look", 
    "The seats do not exactly align perfectly with the back part of the chair - but other than that - the chairs definitely look pretty good and upscale for their price.", 
    "Great for the price and easy to put together. Comfortable.", 
    "These I like alot. They are just basic without frills but are comfortable. Perfect size for getting cover sets that cover entire chair. So I can get creative for those special events. Very comfortable.", 
    "Good buy for 4 chairs. They aren't beautiful, but you get what you see. I just couldn't find what I really wanted - at a reasonable price. These work for the job.", 
    "We have these in the man cave and are very pleased. The chairs also get taken outside the walkout basement. They are lightweight and are sturdy. In the future with more use they may require tightening up. For the money, good buy.", 
    "simple chairs with removable covers. they seem to wear easy but not bad for the price.", 
    "These chairs were good and still working good.", 
    "nice chairs for the right price", 
    "Looks great at my dinning table, easier than I thought to assemble", 
    "Never opened the box but in comparison to what I found at homegoods, these didn't stand a chance.", 
    "Love the chairs. ..was scared at first..but they was not hard to put together. ..hope they last a year .", 
    "Easy assembly, perfect for my she shed", 
    "Just what we needed for Thanksgiving dinner. They are a close match to chairs we have.", 
    "cushion is very thin, becomes flat very soon", 
    "These are perfect! They gooso well with my decor!! I'm so happy with these chairs...and you can't beat the price, yay!!Thank you overstock.com, you rock!!!", 
    "love it! works well with my dining room and kids!", 
    "Love the look, love the price even more... if you're wondering what the catch is because the price is so low it's the fact that you have to keep tightening the screws like every six weeks (depends on use) to keep them from getting wobbly.", 
    "chairs look good and are comfortable, easy to assemble, modern design", 
    "tighten by hand or it will break easily", 
    "I bought two sets, one chair is in complete due to the manufacture sending a leg of another chair. I have to call Overstock and let them know, would like to get it replaced. The over all appearance of the chairs is good.", 
    "Mediocre quality, but easy to assemble", 
    "Having a hard time screwing on the seat part of chairs... i need power tool and I don't have one....", 
    "the chairs are decent quality, sitting is a bit awkward because the back is so straight, but they will do.", 
    "Easy to assemble. Comfortable and look good in my small kitchen. Perfect for the price.", 
    "The chairs are very nice now that they are assembled but out of 4 chairs everyone of them has a dip on one side or the other, not so much that they rock when you sit on them, although I did need a new set of legs on one of the chairs due to 1/2\" dip. The seat cushions are not squared to the frame of the chair so the side overlaps might be 1/4\" on one side to 3/4\" on the other. Not visible unless you turn the chairs over. Initially attaching the seat cushions to the frame was hell. On the first chair I spent an hour trying to screw 4 screws into the base of the cushion. The score was one screw in and one giant blister. I had to get a 3\" nail and hammer the nail through the guide holes into the wood creating pilot holes, then pry the nails out marring the surfaces of the frame. Once again underneath so not visible to the eye unless turned over. All screws attached easily after the pilot hole was created. The chairs are very nice to the eye and are comfortable and if you use the 3\" nail system, easy to assemble. I would even buy them again. Overstocked.com was wonderful to work with when I explained about the problem with the uneven leg. It only took 5 days for them to track down parts and ship them to me. I just moved to a new home and I think half of my furniture was purchased from Overstocked.com I like doing business with them that much.", 
    "These chairs are sturdy and look very sleek, however the way they are constructed makes them have a very straight backrest, my husband didn't mind this but it made me feel like I was being pushed out of the chair. For a rec room or a kids space they'd be great, just not for sitting for long periods.", 
    "These are great chairs at a great price.. Easy to put together and attractive. I bought these for my daughter for her first apartment and put them all together in less than an hour and they will be perfect for an apartment! Very pleased! fast delivery....", 
    "The chairs have a very sleek yet simple design that fits very nicely with just about any decor. The minor downside is that these chairs may not be suitable for larger guests", 
    "We are a family of 3 with a 4th in the way. We wanted something inexpensive but sturdy and nice looking while the kids are young. These chairs exceeded my expectations! Very easy to assemble and they look fantastic. Especially for the price. I would definitely recommend for those looking for an inexpensive set of chairs you only plan on using for a few years.", 
    "These chairs help accent my marble table. They are comfortable and sturdy. We are enjoying many family dinners sitting in these chairs :-) Two thumbs up for the price and the sturdiness.", 
    "FOR WHAT WE NEEDED THEY ARE FINE. NO PROBLEMS WITH IT.", 
    "I'm happy with my purchase. The quality is very nice for the price", 
    "the seats were impossible to attach. The batting got tangled around the screws and there were no predrilled holes. I had four people trying to attach. BAD", 
    "This was a low quality batch of chairs, I had to order replacement parts to get them set up and I sold them on craigslist because the 2 parts were coming loose.", 
    "Chairs are nice and comfortable, great for the price!", 
    "Those chairs didn't last more then a month.it all is just a nice look with a very bad quality of material", 
    "Ordering a second set soon!!!", 
    "I love these chairs and so does the family very sturdy", 
    "I needed low - cost chairs and I have to say, these chairs look better than I expected. I highly recommend them for someone looking for a modern look on a budget. They are super easy to clean as well!", 
    "We bought this set 2 - 3 years ago and the corners at the top have begun to rip off or come apart. I would not recommend this product. I guess you get what you pay for.", 
    "Purchased these chairs for a rent house. Primary characteristic that attracted me was the price. The chairs were very easy to assemble and provide an excellent value. They are very solid and \"sit\" somewhat hard but are attractive and provide a very contemporary flair to the dining area. They have a very deep espresso color both in the upholstery and the metal finish. Haven't had them that long so can not speak to how they will hold up in a rental situation long term, but so far, we are very pleased. Would recommend the product.", 
    "My disappointment came when we finally put the chairs together and discovered 2 out of the 4 chairs had rips and tears on the seat coushions. All the work to order them, wait for the delivery, find time to put them together and now deal with having to return them only to find out the item is out of stock. Not happy :(", 
    "If you just want some cheap chairs, these work, they look good, appear to be sturdy, but if you look at them for a few minutes you can see the cheap construction. When installing the only added tools I needed was a drill, and hammer to pound the seat cushion brackets into alignment with the cushion, pretty easy install.", 
    "My husband put these together and they seem to pretty sturdy. We have had them for 2 weeks. I definitely like the style and dark brown color. I don't think I could've found a better chair for this budget. Haven't had any problems with them.", 
    "Really nice chairs and extremely affordable. They look great in my kitchen.", 
    "Very happy with the chairs. Look nice. Using in family room - recreation room. One seat has small tear in it at corner. Customer Support tried to get us a new seat. No extra parts available so they worked with us to rectify the situation. They were very helpful and great to work with. I will buy from them again. Thank you.", 
    "Worth the money... I had some problems in the chairs delivered but they immediately resolved it. I love the customer service.. Overall if you are looking for a decent chair in a low budget you can definitely go for it, you won't regret...", 
    "Excellent purchase, very easy to assemble, however a support metal part was little bend I was able to fix it with a hammer. The color is deep chocolate and matches with everything, easy to clean and these didn\u0092t smell bad. One of the chair had some threads hanging but I was able cut it and like nothing happened. Delivery was right on time.", 
    "I needed to replace existing dining chairs on a budget. These chairs were a pain to put together but look decent under table and were inexpensive. They are fairly comfortable too.", 
    "We needed a few more chairs and these fit the bill."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Darcy-Espresso-Metal-Upholstered-Dining-Chair-Set-of-4/7719681/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7719681/TRIBECCA-HOME-Darcy-Espresso-Metal-Upholstered-Dining-Chair-Set-of-4-6dd5d2eb-8199-4da4-a93f-21c68ca7619c_600.jpg"
  ], 
  "description": "A dark espresso finish and simple refined style make these Darcy dining chairs a stylish addition to your home. Ideal for use around the dining table, they are equally suited for overflow seating when entertaining guests. The dark vinyl upholstery and metal frame construction gives these chairs a contemporary look that works easily in a variety of settings, and their sturdy construction ensures these versatile and fashionable chairs provide years of comfortable seating.Set includes: Four (4) chairsMaterials: MetalFinish: EspressoUpholstery materials: VinylUpholstery color: EspressoUpholstery fill: Polyurethane foamSeat height: 18 inchesDimensions: 36 inches high x 17.5 inches wide x 21.5 inches deepStyleContemporary, Modern, UrbanMaterialMetal, WoodChair TypeDining ChairsSeat HeightCounter HeightSet SizeSet of 4AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorOtherFurniture Frame MaterialMetalFurniture PatternSolidSeat StyleUpholstered"
}