{
  "name": "INSPIRE_Q_Elston_Linen_Tufted_Sloped_Track_Sofa", 
  "price": "EUR 605.36", 
  "reviews": [
    "The package arrived in two pieces and was very easy to put together. The sofa is exactly as pictured and described by OS. Assembly took less than 20 minutes. The cushions are very firm, but probably just need to be broken in. The piece is very modern looking. I'm happy with this purchase and wanted to write a review so that others would know how nice this piece of furniture truly is. I will be purchasing the matching love seat very soon.", 
    "These sofas are beautiful with modern lines and great detail. They are VERY firm but that is not a problem for me. I bought two for my living room and am very happy with the look. I didn't put them together but the person who did said it was not difficult.", 
    "This sofa is really very nice for the price! So simple to put together (it took my 13 year old son and I about 5 minutes). As posted in other reviews, the seat cushions are quite firm, but we would prefer that to something super soft and we are hoping the company is being truthful in stating that the cushions should soften over time. The back cushions have a really nice design to them. We are happy!", 
    "It took about 5 minutes to unwrap and click the sofa together. It looks great and is comfortable so far!", 
    "Reading the reviews before making our purchase really helped us so I will leave our thoughts hoping it helps someone else. We LOVE this couch! We purchased the charcoal grey. First thing I loved - we ordered it on Friday and had it on Thursday the next week. Although it did come in 2 boxes, one delivered in the morning and the other came in the afternoon - but that was a UPS thing and it did still come that same day. The material is fantastic. It is a firm couch - but we wanted a firm couch - and it is still very comfortable to sit and watch TV. The back cushions aren't nearly as firm as the seat cushions, so really you just have a nice support to sit on and a nice cushy back to lean on. The couch looks just like pictured and really gives our room a clean neat look. Very highly recommend this couch - its value is great!", 
    "I'm very pleased with this sofa. I was apprehensive about the assembly. It took my son and I literally 5 minutes to do it. It actually took longer to remove all the plastic from the cushions and pieces than to put it together.I love the color. It's a woven dark gray (more like a charcoal) with tiny hints of tan/beige. As other reviewers have mentioned, it is VERY firm. Not comfortable at this point, but I expect it will soften with time. The nice part about the firmness is that the cushions won't dent and sag like other couches I've had.One thing to note: The seat cushions are NOT covered on the bottom, so they are not 'turnable'. This was a bit of a disappointment, but I am OK with it.", 
    "Color was a bit off but the style was great for the money. Firm but not uncomfortable.", 
    "This is a very nice couch. The seat cushions are a little firm-I don't know if that'll change with use or not. It isn't a big deal either way. I love how easy the couch was to put together. Everything has slats. The fabric is nice and dirt comes off of it easily without leaving anything behind, so it's pretty effortless to keep clean.", 
    "I was reluctant to order a sofa sight unseen - kept it in my cart for weeks. I was happy to open the boxes and put it together ( no tools ) me, myself and I before my family got home. I must admit that I didn't know what to expect colorwise. When I ordered this it was called mocha - now it's tan. Light brown is more like it. But it is a firm and sturdy sofa that won't show much dirt.", 
    "I love this couch. My only complaint is that the cushions do slide off the base and need to be pushed back in periodically. The cushions seriously soften over time, which is nice. They felt too firm and uncomfortable at first, but now they are much cozier. I've had the couch about three months now and I am pleased with it. The legs of the couch did severely scratch my hardwood floors, so DEFINITELY use felt furniture pads under the legs. It looks like someone took a screwdriver and scribbled a design into the hardwood.", 
    "Sofa was easy to put together and looks just like the photo. I really like the color and the material it was made of. The reason I gave it three stars is because the pillows on the bottom are not reversible. The bottom of the sofa after you take the pillows off is cover with some type of cheap black fabric and the springs from the sofa are coming through in a couple small spots. Also, the buttons on the pillows have come off. Had to reattach them. I really like this sofa style, but, I would not purchase this one again because of these issues. For the money a good buy. I also replaced the cheap fabric at the bottom with a better piece of fabric. The springs are no longer coming through. Cost me about twenty-five dollar to get a better piece of fabric. Over all it's a cute sofa.", 
    "It took about 15 minutes to put together. The sofa came wrapped and packaged perfectly. I got the ivory and that is just as described. It could easily be something you'd see in a more expensive furniture store. The only thing I'd recommend is having two people. It would make it a lot easier to assemble when clicking the sides in.", 
    "I had read that the couch was firm, but \"firm like a brick\" would be much more accurate. It is so firm that it is not normal and the thought of family and friends sitting down for the first time makes me cringe. I am going to check into returning it.", 
    "This sofa is dark like all the reviews and ships very fast. I had it in three days! It is very firm but is already becoming comfortable and matches my apartment perfectly. However, it is not as long or tall as some couches, but the quality is wonderful.", 
    "This couch was a little firm in the beginning but it has been about a month and now it is much more comfortable. The buttons came off of one of the pillows about 2 weeks after it was delivered. Easy assembly.", 
    "I bought this sofa thinking it was a very modern and contemporary sofa and would fit in with the rest of my furniture quite well and looked well made. I was wrong. The reviews at the time were also were all very good. While it's very stylish, the quality and craftsmanship are horrible. I've had it just at a year. While I like firm cushions these make my body hurt if I fall asleep on the couch. The cushions don't fit together and there is a huge gap in between the cushions that has increased over time. Recently I picked the cushions up and realized the springs had come through the bottom of the sofa and ripped into the cushions tearing the fabric and ripping the the foam apart inside and moving the springs in the cushions. This wasn't just in one spot, but all throughout the sofa. I did buy the 5 year protection plan, thank goodness. Today the rep came out to try to repair it and said that there was nothing that could be done to fix it. It was all in how the frame was built by the manufacture and there was no way to stop the springs from coming through and tearing the cushions. He's referring it back to Overstock and the protection plan to see what can be done at this point. While it's a very stylish couch and if being bought for something like an office couch that won't be sat on on a daily basis it may work. Though I don't know that it would stop the springs from coming through the way mine did. But if you're looking for a quality investment in a sofa that will stand the test of time, I would suggest finding another sofa.", 
    "I have had this sofa for over a year and it has held up great. Spilled coke on it, and it cleaned up very well with water. The only downside is that the cushions can't be turned as the fabric is not on the other side. Bummer. Overall, however, love it.", 
    "Nice sofa but not too comfy. Nice fabric, beautiful color and good look. Perfect for a sitting room sofa, but not a family movie night type sofa.", 
    "This sofa looks great. It's not all that comfortable but I put it in the room that's more for decoration and it's very stylish", 
    "Avoid at all costs. Spend the extra $100 and get something that can hold more than 200 lbs (2 people). Aweful.", 
    "Very nice looking sofa. The cushions are firm, but have softened over time.I am concerned about how the sofa will wear. The fabric although nice, has begin shredding pieces of thread. We shall see.", 
    "much smaller than it looks. and it arrived in 4 pieces and I had to assemble it (like Ikea) -- annoying . slimmer and smaller - i would return it but too much trouble.", 
    "I'm thrilled with this couch. It was a little hard to put together by myself! I had to take it apart a couple of times but finally got it. It did arrive in 2 different shipments, by the way. I had to wait 2 days for the final couch piece. Everything was in excellent order and it looks great! I like the firmness although others have said it sits \"hard.\" I think it's great and love the color, the beige color I received matches the picture of the beige (wheat?) color of the chair picture. If you scroll on couch I think you reach the wheat colored picture. It's sturdy, it looks good, and it's relatively formal which is just what I was after.", 
    "Looks great, but uncomfortable. The back does not go up high enough and the seat cushions are very hard. This would get 5 stars based on looks alone.", 
    "We purchased this 2 weeks ago and it totally transformed our living room! The color of dark grey easily coordinates with a variety of colors (we like it because of how it plays off the slate of our fireplace. We paired it with a slightly lighter grey side chair and an area rug in a creams, yellows, light & dark greys, and dark brown which pulled everything together! The matching ottoman that has four section pillow top which flips over to trays. Nice stitching too!", 
    "A bit hard, but does soften quickly... Looks great in my living room. Added a modern flair. True to color, I choose the gray color. Just wish they'd get the matching chair in sock in the gray hue as well", 
    "Quick delivery, easy assembly, good quality, the seat cushions are quite firm, yet comfortable, and it is perfect for rising easily from the seated position...no need for help getting up! This sofa, along with the same style chairs provides an attractive contemporary, yet elegant look in combination with traditional tables in an essentially formal room. We are very pleased with this purchase!", 
    "I purchased this sofa since July but only enjoying it in a last 3 weeks due to shipment, vacation, etc... It looks elegant for the price. The color is ivory with a hue of green, not white as it said. The cushions are very firm, but the back cushions are very comfortable to rest on it. I took a few naps on the sofa and it did not bother me at all since I like firm cushion than soft. It only a few weeks so we have to see how it hold up few years from now. The inner length is 68\", which perfect for me since I am only 5'4\". It took only few minutes to put it together if you have two people to do it.", 
    "The fabric feels amazing. The sofa is sturdy and well built. I got the white linen color, and I love that it is a creamy white, which makes it look rich!!!!", 
    "Ordered the loveseat and sofa. We love them both. The quality is good. They were easy to put together. The seating is very firm, but does soften over time with use. I would recommend this product.", 
    "Needed an inexpensive sofa to fill a void in a new apartment pretty quickly. This is totally doing the trick. Pleasantly surprised by the comfort level of the couch. Even more surprised by the fact its holding up well to the beating our two-year old is giving it. We'll see how long it will maintain its attractiveness, comfort and shape, but for now, we are very happy with this furniture purchase.", 
    "This sofa looks great. Can't beat the price with free delivery. Beware, it is very firm. We're hoping the cushions will soften after some use.", 
    "I wanted it for a sofa that people seldom sit on and it looks great. It is not very comfortable. It is so firm that I tried lying on it and my hip was uncomfortable. Color is a true cream with taupe undertones.", 
    "I like that its firm but comfy. The color is exactly what we expected. And what a great price! Love seat, see you soon :)", 
    "Quite firm, but that is what I wanted. It is fairly compact so gave me some extra room in my living room. I got it in the light brown color, which is very neutral but easily livened up with throw pillows. Fairly easily put together but need two people.", 
    "I absolutely love this sofa! I needed it for my small living room with cream walls. The tufted back pillows are so cute and VERY comfortable. The seat cushions are quite firm, but I don't mind that at all. These should break in a bit. But, this is still a great couch for a den or study. I wouldn't say that it should be used for visitors to sleep on, but it is great for a lazy reading day.Very easy to put together and it was delivered in two large boxes. Took me no more than 20 minutes! Love the color and the fabric.", 
    "very nice design and arrived in great condition. the color is great and also very comfortable. (for me that is...it is very firm but thats what i like! may not work for someone looking for something more on the plush side)", 
    "Super easy to assemble. Bought the linen shade. Seat cushions are a little stiff, but otherwise very comfortable. Great value for the price.", 
    "This is a great sofa. Will it last 10 years probably not but for the next 3-4 it should be fine. Great lines, well made and fabric looks high end. Very firm which is what I wanted. Not the comfiest, as far as movie night type sofa, but well suited for nicer area of house.", 
    "The sofa wasn't what I expected, but its good enough to not send it back. Its like starter furniture, perhaps for a den...not living room quality! It wasn't very hard to put together; I had it done in 15 minutes.", 
    "I purchased this sofa and matching loveseat for my parents in the 'brown' color and they absolutely love the set. Color is as pictured. It arrived exactly as scheduled and my father was able to put it together very quickly. He loved the solid frame and great quality. What both my parents loved the most was the firmness (ironically this is pretty much the only complaint reviewers had). My parents are in their 60s so they very much appreciate firm furniture. The color is amazing and the overall look is different from what is available at most retail furniture stores. Very pleased with my purchase.", 
    "It's a very firm sofa. Great look for the price. Love the textured fabric. It's definitely off white.", 
    "The color of the Sofa matches the pic. However, after using it for less than a month it has started to make noise when you sit on it.", 
    "I'll confirm as per the other reviewers this is a very firm sofa, but that is what I was looking for. It is very nice looking and looks great in my space. I find the fabric to be of good quality. The color (charcoal) is the same in person as it appears online. The excellent rating is for the fact that this is a great value for the price. Easy to put together.", 
    "Happy with this couch. We got the charcoal color. The fabric is nice and the couch is well made. It came well packaged. Great look for our modern/rustic design.", 
    "Just as described. I am very happy with this modern looking sofa.", 
    "I purchased this couch for my formal living area. I knew no one would use this room so I ordered in white as this was also my color scheme. The couch arrived as scheduled the driver had a hard time getting it out the car and to my door step, the boxe had been ripped. I was concerned that he would damage it or get it stained. I was glad neither happened. The couch was easy to assembly and fits beautifully in the space. It is firm and comfortable. It's a great show piece and comfy for lounging as well. Great buy for the money", 
    "Easy to put together. Did it by myself after having foot surgery. Wasn't too heavy. Came in 2 boxes. Nice color, nice fabric. Little firm to start out with", 
    "I bought this couch for staging a flip house so it was exactly what I needed. It is very uncomfortable so I would not want it in my own home.", 
    "I needed to purchase a sofa that arrived in pieces, because the doors on our old house are narrow. My 11-year old and I put it together in about 5 minutes, with no need for tools. It is firm, like other reviewers have mentioned, but still very comfortable. One caveat-- the \"light brown linen\" color is cooler (slightly grayer) than it looks on my monitors. If you're looking for a very warm tan color, you might be disappointed.", 
    "VERY NICE LOOKING BUT HARD AS ROCK, NO DEEP COUCH SITTING HERE.", 
    "We bought this sofa and matching loveseat - no, we didn't spend a fortune and they are attractive in that respect; I do not however believe they will hold up to everyday use for a family of 4 long term. Material may be a little thin but overall I am happy with our purchase.", 
    "looks really good and transform the living room instantly.", 
    "This couch looks nice and is very firm. Once you sit on it for a couple of weeks and wear it down, it gets more comfortable. The legs are very easily broken, I broke mine the first day because I scooted it over rather than lifted it, but it did not affect anything. Its a good size! I wish the material was a little softer, but great for pets.", 
    "WeLove this sofa. It was everything described and more. We couldn't be more pleased.", 
    "Firm, if you that's your preference. Great color on wood floors, easy to assemble and elegant looking.", 
    "Easy to assembe, comfy, modern looking.", 
    "Easy to put together, definitely have to break in the cushions - hard at first.", 
    "I was nervous about buying a couch online, but I was drawn to these stylish back cushions. Torn between the white and light brown, I ultimately decided on the light brown for practicality and long-term use. I ordered on a Wednesday and it arrived in two boxes by Friday. It is easy to assemble with two people. The color is very close to the pictures but will probably look lighter in front of a window. Like other reviewers have said, the seat cushions are very firm and the back cushions are softer. It will definitely take some time to break in the cushions. The bottom cushions are not reversible, but all the cushion covers zip off for easy cleaning. Overall, this was a great deal through the 15% off furniture sale. I can’t wait to see how it looks with some bright throw pillows and a blanket!", 
    "Very hard and slopes back", 
    "The sofa looks great, it has a modern feel with classic lines. The cushions are perfect! Love the color. Goes great with multiple colors and decor.", 
    "Sturdy couch; cushions are firm, but not a problem for me - I don't like a \"marshmallow\" feel. I think it's pretty comfortable, and it looks great.", 
    "The quality is not as I expected for the $***USD I paid for this item. I strongly feel I could have gotten better furniture quality at *** for this price.", 
    "is quite lovely and comfortable", 
    "Sofa met all expectations.", 
    "Firm and solid couch. Looks nice in the living room", 
    "Easy to assemble. Arrived quickly. Serves its purpose.", 
    "poor quality, had to return", 
    "Easy to assemble. Looks great! The cushions are firm, but I can already feel them softening up. This couch works well with our budget and 3 small kids!", 
    "Easy to assemble and comes in 2 boxes. The bottom cushions are very firm as in almost solid.Hopefully they break in. The color is a dark gray/blue.", 
    "This sofa is a great size. When you remove the pillows it works great as a twin-sized bed. I had many guests stay on it. It is firm, so if you want a cushy couch, this is not it. But it has held up well, and is very good looking. Button came off one of the back cushions.. I took it apart and had to sew it carefully to replicate the tufted look.", 
    "We have five kids and just don't bother spending a lot of money on sofas/chairs. On the flip side, we don't want a house that looks like we didn't spend a lot of $$$. We were looking for a grey sofa with contemporary lines and the look and price of this sofa is perfect! We purchased two and are happy with them so far. The buttons came off of one back cushion, but this is an easy fix with needle and thread. As mentioned in previous posts, very hard cushions. However, they appear to be softening a little with use and the kids don't seem to mind! Overall, looks like we spent more than we did!", 
    "I knew from the other reviews that the padding was on the stiffer side but they are not keeping their form at all. The fabric is itchy and after 1 month is already making creaks and noises.", 
    "I like it firm. That's what it is but also has the tufted back seat cushions that are very comphy and rather soft. Fabulous dark blue grey. Almost dark wash denim like. Perfect for my 2 yr old and my husbands tush all day Sunday's.", 
    "SMALL LOOKS NOTHING LIKE PIC REAR PILLOWS TO SHORT PUT IT IN MY GARAGE . iTS GREAT FOR MY CAT", 
    "Love this sofa! It is super easy to assemble and looks fabulous! Definitely a firmer cushion than I am used to, but I love it.", 
    "Love this sofa but the white linen is light....not great for boys ages 10 and 13! So far it wipes off marks easily. Looks great with throw cushions and the matching chair. Nicest piece in my house right now. Great value.", 
    "Very disappointed. The fabric was poor quality and not linen, seaming sloppy and showed on the front of cushions in random places so it could not be hidden.", 
    "Very sturdy, nice to look at, and matches with everything.", 
    "It's perfect for a small space very classy If your looking for firm this sofa is it", 
    "Arm chair was torn and ripped. However its in the corner and ant be seen.", 
    "It was easy to put together. I love that it is a firm couch because we have it in a more formal sitting area. The design and fabric are very modern and slick for a great price.The only thing that disappointed me was that there was no packing slip, receipt, or care instructions in the packaging.", 
    "very uncomfortable. arrived with damaged leg. sent it right back #byefelicia", 
    "Nice, but quite firm. A bit modular."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Elston-Linen-Tufted-Sloped-Track-Sofa/8859663/product.html?recset=3039c409-e7d5-4d20-a591-bfc16f12641f&refccid=KYWHLMCCC672VTCGGYSCC6DGUI&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8859663/INSPIRE-Q-Elston-Linen-Tufted-Sloped-Track-Sofa-28a5ff4c-caef-43ff-b46e-7b86064a161c_600.jpg"
  ], 
  "description": "Relax in chic style with this Inspire Q Elston sloped-arm sofa. The\nmaterial is a soft linen that stands up to daily use. This\nsloped-arm sofa has removable cushions, allowing you to adjust how\nmuch back support you use while sitting. The cushions are filled\nwith high-density foam that cradles your body for the ultimate in\ncomfort. Removable cushionsTool-free assemblySet includes: One (1) sofaMaterials: Rubberwood, CA117 fire-retardant foam, linen\n  fabricFinish: EspressoUpholstery color option: Light brown, dark grey, whiteUpholstery fill: High-density foamFoam density: D25Seat dimensions: 18.9 inches high x 22 inches deepDimensions: 32.25 inches high x 78.3 inches wide x 35.4\n  inches deepStyleContemporary, ModernMaterialFabric, Foam, Linen, Rubberwood, WoodTypeSofaFinishBrown, Espresso, WoodAssemblyAssembly RequiredColorBrown, Grey, WhiteFurniture PatternSolid"
}