{
  "name": "INSPIRE_Q_Torrington_Linen_Nailhead_Track_Arm_Sofa", 
  "price": "EUR 925.91", 
  "reviews": [
    "This was my 1st furniture purchase on Overstock, and I'm very pleased. I was on the search for a contemporary couch with nailheads, and this fit the bill at a much lower price than other sofas I had seen in furniture stores. So I took the plunge... and the couch looks great & is a perfect fit in my city apartment. The cushions started out quite firm, but I've had it for 6 weeks now and they have begun to loosen. Liked so much that I also bought the matching club chair!", 
    "As some of the other reviews have noted, this sofa is a bit firm, but comfortable enough. The material, design, and accent \"tacks\" are great. My favorite feature is the ease of assembly and thereby disassembly. It is extremely portable as the four major pieces of the sofa are connected by slotted brackets. It can literally be assembled in 2 minutes. It arrives in three manageable-sized boxes. It was easy to unpack. Our apartment is up a tall and narrow flight of stairs. I was able to carry it up piece by piece and them assemble it by myself as well. No tools are required. This is perfect for someone who is planning to move themselves periodically. You won't need help nor will you need a truck or trailer to move it. So convenient, yet it still looks and feels like a very nice piece of furniture.", 
    "It wasn't difficult to put together, but when you sit on it the cushions move and it's very light weight so moves on the hardwood floor. My wife can lie down but is too narrow for me. Not real pleased", 
    "This sofa looks very nice. I am very pleased with the aesthetic of it. It was also pretty easy to assemble. I was able to do it alone, although having another person would have made it much easier. I was just too impatient :) However, as other reviewers have commented on, the cushions are very firm at the beginning. It has been a couple of weeks now, and perhaps they are softening up but just something to be aware of...it's not the most comfortable sofa. Also, since it is self-assembled, I find the back piece to be a little loose. It wobbles a little bit within the slide brackets. Luckily, this isn't noticeable when sitting on the sofa, just whenever the back piece is touched. Overall, for the price that I paid (it had decreased in price on the website only a day or two after it arrived), I am \"average\"-ly pleased.", 
    "The sofa is very comfortable and the fabric and nailheads look very high-end! The couch isn't very deep if that's important to you. The only issue I have is that the support in the middle is either not sufficient or mine is a bit defective - it makes a sound that isn't quite right when anyone sits in the middle.", 
    "This is my first time to order furniture online and I was so nervous! I'm so glad I did though! I ordered two sofas and the matching chair and they are beautiful! They took about two minutes each to assemble. They sit firm but not stiff. Love love love!", 
    "Great couch so far. I purchased the gray which has a lot of blue undertones, almost like a denim look. Easy to put together. I like that the couch can go with multiple decor styles since its both modern and rustic with the nail heads", 
    "I bought two, they are very comfortable. They don't sag. The fabric is great. Worried when I opened the box that I might not like it. But once the cushions were on it, my room was transformed. LOVE!", 
    "Sofa is very pretty...the cushions are a bit hard...that's why I gave It a 4 star rating instead of a 5.", 
    "came in three boxes but its beautiful super easy to assemble. It is actually a white linen. cushions are nice and firm. Great buy.", 
    "I already liked the couch, but after reading the reviews I figured I'd give it a try. Usually I only purchase what I can sit on in person before buying. The reviews of this couch are accurate. It looks great and feels perfect. Some commented that it was too firm, but for me I don't like the feeling of \"sinking\" in. Great piece of furniture and I found a doggie couch to match the style of this one for my decor. I couldn't be more pleased. Thank you.", 
    "I love this because both the back pillow and bottom cushion are easy to remove for cleaning. I don't have to worry about the back pillows being ripped from the couch, like my old one, which should help make for an easier cleaning! I like that it is firm and I don't sink into it, which makes it easier for my guests to get up from my new furniture.", 
    "I absolutely love this sofa!!!! The sofa was delivered in several pieces and required assembly. My 13-year old son and I put the sofa together in less than an hour.", 
    "Was a little skeptical because I have ordered others from another company and was not happy with it. But these are very nice very sturdy they don't fall apart love the material I would recommend this to everyone thumbs up", 
    "I got this in the grey color and it's what i wanted. Looks great in my living room and super easy to assemble.", 
    "Looks great in my sitting room - easy to assemble. Isn't a couch for everyday use as it's not super comfortable but it looks beautiful in my living room.", 
    "It took me longer to unpack than it did to assemble. Quick and easy. Seat depth is fine for me (5'2\") and all marks have easily cleaned off with soap and water. Would give it 5 stars but it's firm, hoping that changes over time.", 
    "This sofa is comfortable and priced decently for the quality you get. I love it!", 
    "It was such an easy piece to put together. Love it", 
    "We built a new house and now are broke! hahah. We wanted something that we loved and didn't just want to spend the money to fill up the house. We saw this online and grabbed it! We are so happy we purchased this and you probably will be too! This goes great with a modern open house for a fantastic price. Thank you so much!", 
    "I love this sofá is beatiful", 
    "This comfy sofa came pre-assembled, which was necessary, given my narrow staircase. Seemed stiff at first, but quickly became less so, after several sit downs. Looks great, and reasonably priced!", 
    "The sofa arrived in great condition. expect 3 big boxes. the assembly is so easy and i think very genius. The sofa is def. firm but that is something i want, so it's great for me. I give it 4 stars because there is a lot of string hanging out from the different pieces that needs to be trimmed.", 
    "Handsome linen, nice nailhead, easy to assemble.Seat cushions a bit stiff, but will probably break in.smaller-scale than you might imagine by the pictures (which is fine for my bungalow house); would fit well as apartment furniture.", 
    "A little firm, but looks great!", 
    "I love this sofa. I ordered it for my formal living room and I have gotten so many compliments", 
    "After reading mostly good reviews on this I decided to buy it for our vacation home. It came in 3 boxes and was easy to put together. All pieces were wrapped in plastic but not sealed and there was some type of black dust all over the plastic. I think it is grease and a few pieces got on the sofa arm & a few cushions and will not wash out with spot cleaning. After it was delivered ( it as suppose to show up on a Thursday but ended up arriving on a Monday) I quickly put it together and then had to fly back to my other house. I thought I would deal with the grease issue later but just read the return policy & all claims must be made within 5 days. And they want pictures but I am not going back to that house for 2 weeks. It also says if you wish to return it, it has to be unopened or the company reserves the right to only issue a partial return. I have had good luck in the past with furniture purchases online but will not do this again. I am basically stuck with a pretty expensive sofa (over $*** with discounts) that feels like cardboard. Would be great if you are only buying it for \"looks\" & to fill a space but not for any type of use."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Torrington-Linen-Nailhead-Track-Arm-Sofa/9400028/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9400028/INSPIRE-Q-Torrington-Linen-Nailhead-Track-Arm-Sofa-13917213-8d0b-4b7d-9959-f3b263bbf8ef_600.jpg"
  ], 
  "description": "Update the look of your home with ease with this Torrington sofa.\nTraditional sophistication is lent to the piece, styled with a high\nback, track arms and nail head detailing. Covered in a white linen,\nthe sofa is the perfect addition to your home.Set includes: One (1) sofaMaterials: Rubberwood, linenWood finish: Dark espressoUpholstery materials: LinenUpholstery color: White linen, dark grey linen, grey linen,\n  red linenReversible seat and back cushionCushion thickness: 7.9 inchesSeat depth: 28 inchesSeat height: 19.7 inchesWidth between arms: 73.2 inchesFoam density: 55 poundsHeight of the arms to floor: 22.8 inchesOverall dimensions: 35.8 inches high x 87.8 inches wide x 35\n  inches deepStyleContemporary, Modern, NauticalMaterialLinen, RubberwoodTypeLoveseat, SofaAssemblyAssembly RequiredColorGrey, Red, WhiteFurniture PatternSolid"
}