{
  "name": "INSPIRE_Q_Broadway_Grey_Fabric_Sloped_Track_Arm_Sofa", 
  "price": "EUR 608.07", 
  "reviews": [
    "it came with many tears and the entire dust cover underside ripped off and wholes in the lower fabric from the 6 or 7 days it was in transit. the couch was supposed to just slip together but it was not made good enough to do that easily. it took my husband and I about an hour to finally get it together. the fabric is the worst part because it is so cheap you can see through it and after sitting on it one day it started pilling. to me this is a sign of very poor quality fabric. I am always usually happy with all of our on line purchases but this one I would only say buy it but don't sit on it if you want it to last. I kept it but prob will have to have another very quickly! also the box it was in just fell off of it. I did not have to cut it or anything. nobody knew how to pack it for shipping.", 
    "We purchased both sofa and love seat for our Family room. I must say \"BAD CHOICE\".The style is nice and modern, but the comfort and quality is just not suitable for a Family of 4...This item is good for decoration only; the style is nice.", 
    "The boxes were delivered in good condition. The assembly was easy, although the assembly instructions were a bit confusing due to the pictures not drawn to look like the actual product. The color is more beige than grey. The seat cushions are firm, not soft as in the description. After about", 
    "The material does not hold up! It starts to create little fabric balls and it is impossible to try and pick out all of them. The couch does not let you easily remove stains and the top pillows morph quite easily.DO NOT BUY", 
    "Color is beautiful, very chic. Stylish, sleek style. Quite firm - but that is what I wanted. If you are looking for a squishy, soft sofa, this is not it. I love it, however.", 
    "THIS IS MORE BEIGE THAN GREY. HAD I KNOWN THIS, I WOULDN'T HAVE BOUGHT IT. IT REALLY NEEDS TO BE BROKEN IN BECAUSE THE CUSHIONS ARE KIND OFF STIFF.", 
    "The couch looks extremely nice and looks much more expensive than it actually was. I am very pleased with my purchase. I wouldn't suggest this for a family room or any area where you want to use it to lounge on, but I am using it in a formal living room that doesn't get much use, and its perfect for that. I would recommend to anyone that needs a good looking couch on a budget that isn't going to get much use.", 
    "I love this set looks nice in my small space very easy to put together and looks very nice", 
    "After searching high and low for a sleek, modern, easy-to-maneuver sofa, I landed upon this Inspire Q sofa. I really enjoyed the style of the sofa and that the back pillows were detachable. I have gotten several compliments on the sleek style. This sofa come s in two boxes that UPS delivered to my 2nd floor apartment door (which was nice). I was worried I would have to move the furniture up the stairs myself. The sofa comes in four pieces and is very user-friendly. I would purchase again. The quality is excellent and is similar to what you would find in higher end stores, such as Arhaus, Restoration Hardware, or Ethan Allen. I purchased this sofa in early June 2014. I recieved it about seven days later. It was very easy to track using the UPS and overstock tracking information. If you prefer firmer sofas that will keep its shape, this sofa is for you. If I do have any problems with the sofa's cushion ability, they have several products on the market that allow the \"plumpness' to come back. Overall, this was an excellent purchase.", 
    "incredibly easy assembly - ingenious - comes in a few pieces and you just pop together in 10 mins looks stylish, we are using in a rental apartment i'm not sure that if this were my ONLY piece of furniture i'd be so enthusiastic, but the price was great, looks good and is an overall very good value haven't noticed anything about the cushions sliding out that was mentioned in previous reviews, but that would seem to be simple enough to remedy with velcro", 
    "We had the couch for less than a month and the material started to pill. By month two the couch looked like it was about 10 years old. The cushions didn't stay in place when you sat in it. The overall look of the couch was so nice, so I was very disappointed in the quality of the material. Very cheap!", 
    "Help design the to any taste.", 
    "We love how it looks in our living room but we have found the seat cushions to start to pill after only a few months. The back cushions are rather small which makes it not the most comfortable sofa.", 
    "We bought this for our family room, we have twin boys under the age of 2. the couch stains very quickly. You can remove the fabric from the pillows and seat cushions, but cannot clean anything from the arms of the couch or the back. the fabric, after a week started to tear and form little knots/balls that you cannot remove.", 
    "Pillows are not great. The real problem is the fabric. It really is not meant to sit on! Maybe only for staging.", 
    "I am happy with this purchase but not sure it will wear well. Only a month and the fabric is sloppy.", 
    "We are using this in a living room that won't have anyone in it. The couch is fine to look at, I just wouldn't want to sit on it everyday.", 
    "I don't even want to give this sofa one star but it was necessary in order to write this review. The set up for the sofa was indeed easy and fast as previous reviews mentioned. However, I feel it was a waste of my money and I am very upset about Overstock's return policy. The sofa continuously lints up and the fabric deteriorates as it is sat on. After only 2 weeks the sofa is completely ruined. I have had to buy sofa protectors in order to attempt to preserve the sofa which has not helped much. I feel like i wasted my money and Overstock should change their refund policy. i am completely dissatisfied and will not be buying again.", 
    "Sofa looks very formal and picturesque. It's is not comfortable to lay on or really sit on. In addition it threads easily and stains easily.Although it's in my formal living room, when my dogs rub up on it, it shows immediate stains.", 
    "Love the looks of this couch. It is very easy to put together, just a matter of sliding in the sides and the back of the couch. The only negative is that the couch is very stiff and will take a little time to be broken in, but that is fairly common with new furniture. I would recommend it if you are not planning to sink into the couch right away."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Broadway-Grey-Fabric-Sloped-Track-Arm-Sofa/8859363/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8859363/INSPIRE-Q-Broadway-Grey-Fabric-Sloped-Track-Arm-Sofa-b0d01c52-29ea-433f-9bda-a0e78c9bbdc1_600.jpg"
  ], 
  "description": "Add this modern sofa to your decor to bring a contemporary touch to\nthe room. This three-seater sofa is ideal for family rooms or homes\nthat receive a lot of guests and want supreme comfort. Featuring\ntool-free assembly, this sofa is easy to put together after\npurchase for a stress-free evening quickly followed by relaxation. Tool-free assemblySet includes: One (1) sofaMaterials: Rubber wood, fabric, CA117 foam (flame\n  retardant)Finish: EspressoUpholstery materials: Polyester fabricUpholstery color: Light greyUpholstery fill: High-density foam with innerspring core to\n  help distribute weight evenly across the cushion, preventing\n  packing or saggingPillows sold separatelyFoam density: D25Seat dimensions: 18.9 inches high x 22 inches deepDimensions: 32.25 inches high x 78.3 inches wide x 35.4\n  inches deepStyleContemporary, ModernMaterialFabric, Foam, Polyester, Rubberwood, WoodTypeSofaFinishEspresso, WoodAssemblyAssembly RequiredColorBrown, GreyFurniture PatternSolidGallery RoomAndrea Downtown, Dinner Party, Good Conversation, Lorimer, Snow Dove Drive, Subtle Taupe, White Seashells, Willow Creek, Winter Cashmere"
}