{
  "name": "INSPIRE_Q_Ashland_36-inch_Print_Upholstered_Cocktail_Ottoman", 
  "price": "EUR 324.87", 
  "reviews": [
    "We have had this piece for a couple weeks; it looks fantastic: it is large, the wood looks rich, and the fabric is bright. Up close, you can see the edges of the foam are lopsided and bumpy. The fabric is \"bunched\" and pulled along some of the edges. We have this primarily for looks in a room we don't use, so it works just fine for our purposes. However, I'm not sure how well it would hold up with extended use.", 
    "Overall the ottoman is fine. The fabric quality is average. But the color came out darker than in the picture. I was also somewhat disappointed that the fabric did not line up from the top to the sides. The fabric also has a silver thread in it that I could not tell from the photo. I would have preferred that it did not have that glittery thread. From further away it looks nice, the quality however is just average, but the price is good.", 
    "I was not prepared for the sheen on the material. However, that aside, it's a nice piece of furniture and is well made.", 
    "This ottoman was very disappointing. The construction is inferior and the legs are attached to think particle board which pushed through the base on the very first day that we had it. Returned for a refund.", 
    "Awesome color and design- we love this ottoman! It is very comfortable to rest your feet while watching TV. It is so hard to find an ottoman that is not a solid color and with a nice pattern and this worked perfectly in our space."
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Ashland-36-inch-Print-Upholstered-Cocktail-Ottoman/9594571/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9594571/INSPIRE-Q-Ashland-36-inch-Print-Upholstered-Cocktail-Ottoman-427e64ab-7e5f-4bb0-8d7c-7a6de88327f0_600.jpg"
  ], 
  "description": "This contemporary ottoman adds a touch of visual interest to your\nneutrally colored living room suite, and the geometric pattern of\nthe upholstery brings a relaxed vibe to your modern room. Pull up\nthis contemporary ottoman when you need to seat a couple of extra\nguests, or place a tray on it to use it as a coffee table. Materials: Rubberwood, solid wood, fabricWood finish: EspressoUpholstery materials: FabricUpholstery print option: Earth tonal capsule, peacock\n  Moroccan pattern, burgundy stripe, purple capsule, berry ikat,\n  octagonal tile, splatter print, rectangular linkCushion thickness: 7 inchesDimensions: 18 inches high x 36 inches wide x 36 inches\n  deepStyleContemporary, Modern, Shabby ChicMaterialFabric, Foam, WoodTypeCoffee TablesShapeSquareAssemblyAssembledColorBlack, Brown, Cream, Green, Grey, Multi, Pink, Purple, Red, Tan, TaupeFurniture PatternPrint"
}