{
  "name": "INSPIRE_Q_Grace_Grey_Linen_Button_Tufted_Arched_Bridge_Upholstered_Platform_Bed", 
  "price": "EUR 493.82", 
  "reviews": [
    "Whenever reading furniture reviews, I personally would disregard any review that isn't at least 3 months old. Would I buy this bed again? No. Reason being, the slat system is truly crap. You may be saying, \"I'll just buy a new and different slat system,\" and that's okay, but what you should be asking yourself is, \"how come it doesn't already come with a slat system that works?\" The bed gets passing marks for looks, easy set up, cost, and design. The instructions are easy to read and pictures are clear, which always helps. In regard to the slats, well, they must've been designed by a talking monkey. I don't see how anyone would be supported on the mid-beam. The mid beam screws into the footboard only, and is supported with four cylindrical legs about 1\" in diameter, and 8\" in height. There is no attachment at the headboard which in my opinion is the primary flaw with the slat system. I am not an engineer but it seems this lack of headboard attachment is what allows the unsteadiness of the slats. The double-side anchoring design would fix this problem. I read some customers used a box spring, then complained that it didn't fit snug. Well, the Product Q & A states it is a platform bed and does not need a box spring. I purchased a memory foam mattress and it fits, and looks perfect. The problem began with the slats would fall individually out of their plastic brackets. I tried switching the positions of the slats, thinking maybe there were stronger plastic brackets in other sleep pressure points of the bed, but that didn't work. I then tried Gorilla Glue and that worked for a while, but eventually the slats fell again. Usually when the slats fell, the support legs for the beam would break a little. Ultimately, the legs broke and the screws were completely bent. This happened over a period of 3 weeks. After waking up in the middle of the night trying to fix the slats, and laying stiff in bed in order to prevent the slats from falling, I reached the breaking point, and came up with a solution that has worked ever since. I simply cut a 4x4 into four 9\" pieces, and screwed them into the place of the original legs. Problem solved. ****************", 
    "The bed looks nice, and was pretty easy to put together. However, we were laying (still) in bed the night we assembled it and all of a sudden we felt ourselves sinking slowly, diagonally, towards the floor. The spine of the frame attaches to the footboard but does not attach to the headboard at all. It only attaches to the wooden slats via plastic holders. Perhaps we moved a little to one side, shifting the bed - the spine of the platform is not stable and made of very cheap materials, and therefore the whole platform frame went down. It was not an expensive bed - but to not even last one night is pretty bad. It would not take much more investment to make the platform frame sturdier.", 
    "I bought the bed mainly for the style. I just bought a brand new mattress (and a good one) but held off on a box spring because I wanted a platform bed. The slats that come with this bed, however, SUCK! After one night I've ruined my mattress and its now sunken in in the middle (i'm 128 pounds). I think this bed could actually support if the slats went straight across, rather than having 2 separate columns of slats (looks like a rib cage) that are curved and week. will return my mattress to the floor until i can buy a a platform box spring or something...too bad.", 
    "The bed arrived exactly as pictured. My husband put it together by himself in under an hour. My only concern is the slat system that came with the bed. It didn't seem very supportive, so we ditched the slats that came with the bed and purchased a separate bed frame support system that we were able to slide into the big empty space. Though we had to spend extra $ to make this work for us, I still think it's a good value.", 
    "Really love this bed, shipping was great and packaged well. Bed looks great was exactly what i wanted, but only 2 nights of sleeping on it the mattress fell to the floor. the support legs gave out after 2 nights even though my husband and i are not large people. they defnately need to figure out a better support system. Would not recommend this bed to anyone unless its for a child.", 
    "I bought this about 2 months ago, and it is a fantastic value for the price! I bought this on Black Friday on a really good deal ($*** for a queen size, included headboard, footboard and rails), but I was nervous about the reviews posted on here. I will say, if you put this bed together properly, you won't have the issues that the other reviews state. The bed is very heavy (not flimsy), very sturdy, and very well made for the price. The slats actually click into the bedframe, and, when installed properly, are actually very difficult to disconnect, so I'm not sure how anyone had an issue with them disconnecting from the bedframe. They must not have attached the slats correctly. Like I said, this bed is SUPER sturdy, but we did make sure we put the bed together properly and made sure everything was screwed in tight and snapped together firmly. The bed does not wobble at all, and nothing is lose on it. You can jump on the bed and I wouldn't be worried about the slats falling off. I have a 12 inch boxspring and a 12 inch mattress on this bedframe. It is a little higher than I would have liked, but we are on the second floor, and I can't move the boxspring downstairs without assistance. So that's the only reason why I left the boxspring on it for now. My plan is to move the boxspring downstairs at somepoint so that just the mattress is left on the bedframe, which I think would look more appealing (you will be able to see more of the headboard, that's for sure). Even if we remove the boxspring, I'm not worried about the slats falling off. Like I said, I really think those individuals who had a problem did not put the bedframe together properly, or maybe they had a defective part of something. But I have had NONE of these issues whatsoever.I would 100% buy again! It is gorgeous. The color is true to what is in the picture (it may be a tad darker in person). But is is GORGEOUS. I couldn't find a queen size bedframe like this for under $500/$600, so this was a steal on Black Friday for $299. Worth every penny!", 
    "I rated the product 'fair' and not poor only because it is a beautiful bed and I love the look of it. Unfortunately we have not had a night that the slats are not popping off and we are sinking to the floor. Thankfully we have not invested in a new mattress because it would have been damaged at this point. My husband is handy and removed the planks and replaced with plywood, but the bed still shifts due to the fact that there is no stable bar across the top under the headboard. The middle beam seems to be free floating. We will probably need to invest in a separate bed frame (like another reviewer did). Would not buy this product again.", 
    "For the price, this bed is big on style. It's not truly linen, but a linen look. The biggest complaint?? The bolts that connect everything need to be coated with a sealant, otherwise it is squeaky as **!", 
    "I read the reviews about the slates and I was a bit nervous its a week so far and I have no issues with the sturdiness of the bed and My boyfriend is 6'5\" 224 lbs. So I think It passed the test. I love the bed, was not as easy to put together as described but overall I am pleased with the quality of the bed.", 
    "We have had this bed for about six months and the support legs under the slats in the middle of the bed recently have bent and given out. And we are NOT heavy people, not jumping on the bed, etc. The styling of this bed is beautiful and it looks great, but from a structural standpoint the materials are cheap and I would caution anyone before buying this bed. Maybe for an extremely light person or a child it will work better. Overall, it is an inexpensive bed so that's a plus, but I was hoping it would hold up for longer than 6 months.", 
    "The bed is MUCH darker than the photo and the nail heads are just a decoration on top (they dont actually go into the fabric). Bed looks nice but could not figure out for the life of us how to attach the final support bar. When I called overstock no one could help me and they told me to google it to find the answer.... still cant figure it out. Not sure how sturdy the slats are - was very nervous to order based on other reviews but only time will tell.", 
    "I love the design of this bed which is why I bought it but for what I paid, I shouldn't be surprised at the shoddy quality. The fabric is fine but the bulleted detail looks like it was done with a glue gun. The base is horribly made and broke from just a bit of pressure and movement and now I'm stuck with either finding a replacement base (impossible) or trying to find a box to return it to overstock. I haven't been able to find either so my mattress is on the floor. Overstock is willing to pay for a box but I have to disassemble this thing and I don't drive (live in NYC) to take the headboard and frame to a shipping store - if I can even find one - to return it. They should just give me my money back and allow me to trash it. Such a headache. I'm paying more for another quality made bed.", 
    "Bed was easy to assemble - completed it solo while husband was traveling. The fabric is gorgeous, although a bit darker than how it appears online. After reading the other reviews, I took extra precautions by adding 3 wide strips of plywood over the slats to provide extra support. My teen LOVES it. Great bed for the value.", 
    "This bed is beautiful! And it was very easy to put together. I was hesitant, given the other reviews. But, in my opinion, the slats are sturdy and the entire bed seems like it is of high quality. Definitely a good purchase.", 
    "Great bed. Read reviews about the slats/platform being unstable or cheap. We have not had any issues at all. Bed went together reasonably easily. I can't even imagine how the slats could fall out, it is such a tight fit. Great bed, we have had it for about three months, no issues.", 
    "My teen daughter LOVES her new bed. Some other reviews mentioned the ribcage support to be a little less than sturdy and I have to say while putting it together {thin wood and plastic} I was a bit worried however, it held up well to a teenage sleepover!!! There are some areas of the fabric that are not pulled tightly enough and also the \"nails\" are on a strip and in some areas overlap which up close is a little tacky. I also think it's worth mentioning that the headboard isn't snug against the wall, there's about 1-2inch gap. Also, not sure if this has to do with the bed or the mattress but, the mattress doesn't fill the space. It's not noticeable when the bedding is on but I did have to fill the space between the mattress and wall with pillows, weird! Overall at this price point I think this is a good buy.", 
    "I put this bed together in no time with help, after reading the comments about the slats i opted to forgo them altogether. i simply put the bed together ommitting the components in the middle. i used the generic metal frame that my mattress and box spring came with instead,it fit perfectly inside the paltform frame. i dont worry about the bed shifting because its sitting ontop of a carpet so everything worked out!!! the only complaint i have is that the color is off, its not the light gray you see in the pic it is actually darker, but it worked out for me !! LOVE IT!!!", 
    "we just received this bed yesterday afternoon. it only took my husband 1 and a half hour to put it together. the bed looks awesome!!!! the only thing I will say is that the color is a darker but we don't mind. is beautiful and great quality. Thank you overstock.", 
    "great for the price. It has a grey heather linen like fabric. does not look expensive, but it wasn't!", 
    "This is a BEAUTIFUL bed and the fabric is quite nice. Yes, the railheads are the type that you but where only every 5th one is nailed in, but who cares? You can hardly tell. This is, after all, a bed under $500. The real problem with this bed, contrary to what the overstock buyer's guide said, is that you absolutely CANNOT use a regular mattress and regular box springs unless you want to sleep four feet off the floor like the princess and the pea. There's no way of adjusting the height of the bed to accommodate putting the box springs closer to the floor, so right now the box springs are resting on the floor but not really visible because of the frame. I wouldn't have bought the bed if it had been made clear that YOU CAN'T USE A REGULAR BOX SPRINGS AND A REGULAR MATTRESS!!! I would return it, but returning a bed is just too much work.", 
    "Very pretty in person. Bigger than I expected. Took a while to put together. They also either sent extra pieces and hardware or I did it incorrectly. I had leftover boards and legs as well as a ton of bolts and screws, none of which were in the instructions.", 
    "Buying a bed online is never an easy choice, but this bed is worth every penny. Super comfortable, sturdy and easy to put together.", 
    "My wife loves the look. It is clean and sophisticated. Easy to assemble and very sturdy.", 
    "A nice value, very cute bed! The headboard is high and makes a nice statement", 
    "I'm happy with this purchase.", 
    "I've had this bed for two years now, and I absolutely love it! I got it in the full size and I always get compliments on the headboard. Putting it together wasn't hard at all (I was 20 years old then) and I did it by myself but I am also a pro at putting Ikea furniture together. I haven't had any problems with the slats or anything. I suggest making sure you put the bed together correctly, as the slats were a little tricky and needed to put some muscle to getting it installed correctly. Overall, I highly recommend this bed frame, and it's really nice that you don't need a box spring. If you're looking to do under-the-bed storage, I suggest getting bed risers!", 
    "The slats to support the mattress are very weak, had to rebuild them with 1 x 4's from **** *****.", 
    "not sturdy at all, very very squeaky. does not have a supportive base. do not recommend it, I'll keep this until I find something better.", 
    "The bed itself looks great, love the color and style very much. Only complaint are the directions. One of the screws is mislabeled on it but other than that I managed to put the entire bed together myself (5'5 and a 125lbs woman!) with no issue other than the one mentioned. I highly recommend this bed!", 
    "Worth every penny, most beds are made out of wood which breaks and crack over time, especially when knocking the boots. This has metal rails that come with the wood, which keeps the bed frame in place. The material of the bed is awesome too.", 
    "Really beautiful bed but it is not sturdy. Got sent out pieces twice due to bed breaking down, and it still broke down again. Horrible buy , waste of time and money", 
    "This bed looks great in the photo. It also exploded on me one night when I had a friend sleeping over, if you catch my drift. I spent $*** on expensive wood slats to replace the pieces of crap that they send with it. There's no way the midbeam securely attaches to both ends, and once it flips over, the slats all fall and you're on the ground.It's also very short. The bed in the photo has to be using a box spring, which they say you don't need.Great looking bed though! Was very easy to sell on CL :)", 
    "After reading the reviews, we decided to use a bed frame with this instead of the slats that came with it. All potential problems solved. We've had this bed for a year now and have been very happy with the purchase. (On a side note ... I occasionally catch the cat using this bed for a scratching post and the fabric doesn't show the picks.)", 
    "Love this bed. Looks exactly like the picture.", 
    "Beautiful bed. Assembly was difficult due to holes not matching up. Had to drill new ones.", 
    "Love the look of this bed! The slats however do not hold at all. So we ended up purchasing a boxspring to place down into the frame and it works well. Just not the original goal.", 
    "I love this bed! it took me an extra 30min or so to figure out the framing I needed once put together which is why I docked a star. I will be replacing the three wood slats they give with bad leg support since they do not look safe enough to support my box spring and mattress. I'm 140lbs and they look like they will snap at some point! the style and overall look is amazing! everyone comments on how pretty the bed frame is. it's very hard to find a great gray color bed frame, but this is a winner!", 
    "This bed was very easy to put together. Very beautiful and classy.", 
    "The Rails broke a month after I got the bed not very sturdy.", 
    "It was a pain to put together. And it is much darker than pictured, but it seems to be pretty sturdy so far. It's a beautiful piece of furniture. Just make sure you assemble it correctly and you shouldn't have any structural problems!", 
    "This bed is beautiful, so it gets a star for that. However, it is clearly poorly designed, as others have said, given that it completely broke less than a month after purchase. In my case, it wasn't an issue of the slats breaking, but rather, the center support rail and legs gave out, causing the legs to bend (which left gouges in my wood floors), and the center rail to buckle (I should add that both my husband and myself are average size people). I'm going to attempt to find another way to support the center rail, since the metal legs are bent beyond repair. Otherwise, I'll have to throw out the entire platform system and use a box spring in order to salvage the bed. Save yourself the headache and just buy the non-platform version of this bed to begin with.", 
    "purchase this for a move that i recently made. My boyfriend put it up for me and took him about an hour. This was an excellent purchase. Would recommend this for anyone who is looking for an upgrade to their bedroom decor.", 
    "Didn't feel substantial enough though it was very pretty. Purchased as a guest room bed...ended up donating to a friend because my guests would always comment on the low profile.", 
    "cancelled due to other reviews r/t mattress support", 
    "The bed is beautiful but the slats continued to break. I tried to call customer service and it had bee too long (just a few months) for overstock to handle Therefore, they gave me the company name but after many attempts to call no one ever answered or responded. I think the bed can be used if we use a queen bed frame instead of the accompanying slats. We ended up getting a different bed for him but have this in storage for future use with a queen metal frame.", 
    "I was a little leery after reading some of the reviews, but bought the bed frame anyway. I am so glad I did! The head board is beautiful and assembled easily. It is perfect for my guest bedroom!!! It looks well made and I have no complaints!", 
    "Looks amazing for a great price", 
    "Read lots of reviews before purchasing and have not had any stability issues with the bed. However, the nailhead detail on the bead looks cheap: shiney and fused together instead of individual nailheads.", 
    "The 'hammered nails' on the headboard are actually a cheap-looking chrome strand rather than actual individual hardware.", 
    "Seems a bit cheap overall. But still like the color and design.", 
    "I bought this bed for my 5 year old's room in a full size. The quality is good and it looks great. We get compliments on it all the time. The grey is darker than pictured and I actually like it more in person. We are not using a box spring, since it is for a little girl. I didn't want it to be too high. I purchased a firm serta mattress for it and it's great. Dad, aunt, grandma and I have all fallen asleep in the bed with my daughter and it's comfortable.", 
    "Gorgeous and high quality!", 
    "The headboard is beautiful. The frame is not creaky. It's perfect for our master bedroom.", 
    "this bed is beautiful but the support system does not work at all. after a few weeks, the bed completely collapsed and the same thing happened with the replacement parts months later. overstock did not provide any discounts or credit for a new boxspring so I would highly recommend choosing a different bed.", 
    "Looks amazing great quality for price", 
    "I wouldn't consider this a long-term item for my home. While the support/frame issue has been fixed, the \"fix\" is kind of weak. But it's working.My main concern is with the headboard and how it attaches to the side slats. Fully assembled and properly bolted, the headboard still wobbles. I don't know if this is normal for a headboard of this style, but it doesn't seem like it would be. I didn't think it would move at all. I may consider adding more screws to better secure.", 
    "It wasn't as light grey as the picture appeared on my screen. And as previous reviewers stated, the metal nailhead strip leaves a lot to be desired. However, overall it is a beautiful bed. I took the other reviewers' advice and didn't use the wooden slats- I simply purchased the Spa Sensations Steel Smart Base Bed Frame from another store and placed it inside the upholstered sides of the bed. It works perfectly!", 
    "I was just going to order the regular bed frame and it went out of stock. I have an adjustable bed frame and wanted to put it inside. It was suggested that I get the regular frame. However, the platform bed frame went on sale on Black Friday so I took my chances. It fit perfectly. I am very happy with this product. We kept the slats out and it worked out well.", 
    "I am not sure if others whose beds fell apart did not assemble the product correctly. Considering that I am very tall and a heavier build I was surprised the bed fell apart or sunk in. We not only have a mattress on top of the slats, but a box because we like a taller looking bed. At first I was also wary if the bed would hold up but it has for over two months, no problem whatsoever. So considering that I myself not really my wife am tall and heavy, in addition to a queen size mattress and box have not broken this bed not sure if its the beds fault. It could be the individuals were sent an already broken product or did not assemble correctly. Again for this price this bed is a bargain and looks great.", 
    "very nice design and the shipping was really fast... I just love my new bed", 
    "I love the look of this bed. I read all the reviews and several people complained about the product not being sturdy. I beg to differ. I haven't had any issues with the bed and have received a lot of compliments! This bed is really beautiful.", 
    "I love this bed. Overstock is great about timely delivery even in my very rural area.", 
    "This product has definitely met and exceeded my expectations! I was worried about the product from reading the reviews (regarding the quality and the bed falling through), however, I had it for a couple months and I haven't had one single problem. I think the other reviewers who had troubles with the quality didn't put the bed together the correct way.My room is a beach theme (blues, tans, and grey), and this bed is absolutely the best I could have asked! I get so many compliments. The silver tack things that line the bed frame are a cute touch, and it doesn't bug me that they are strung together rather than individually pushed into the headboard. There's also just enough room under the bed to store belongings under it, however, not high enough for my dog to hide under it, which is perfect!Overall, I highly recommend this bed and I haven't had any problems with it!", 
    "The bed LOOKS amazing! It was easy to put together. The quality of the headboard, side rails and foot board is good enough, however the slates are made of the cheapest wood I've ever seen. Almost all of the pieces of wood were split, it's been 2 days but I'm sure that they'll break as soon as we're active on the bed. Keep in mind that we're two, relatively small/medium sized people.", 
    "The quality for the price is great. Add to that the gorgeous style and this was the bed for me. I call it my fancy grown up bed because it makes me feel like my bedroom is an expensive hotel.", 
    "Bought this bed for my 16 year old daughter after re-doing her room in off-white furniture with mirrored drawers and tops. I was nervous about the reviews that said the slats were junky and the support was terrible. Either those people assembled the bed the wrong way, or this is a different design, because the support is perfect. Also, the bed frame does attach to the headboard. Everything is solid and well constructed. Assembly took about 45 minutes with two people, one doing most of the work. The directions that came with the bed, however, were not the right ones for this bed, so you need to know something about assembling if you do this on your own. The bed has made the room look finished and beautiful-- definitely one that could last into adulthood. Only other comment that can be negative or positive is that it says it is for a full size bed. We have a fairly new full size mattress and there are gaps. We also tried it with the box spring (which made it very high given we have a 3 inch gel topper too), and there were still gaps. So I am guessing you could use this bed with a queen sized mattress as well. You cannot see the gaps unless you are staring down at them. As a final comment, I am very picky about quality, and the nail heads do not look like they were glued on, like in one of the reviews. While they may be, it looks like they are not and the whole bed appears high quality.", 
    "I really love the way that this beautiful bed frame has raised the look of our master bedroom to another level. I highly recommend this bed frame to anyone who is looking for an elegant addition to their home!", 
    "I love the gray linen, and as other reviewers said it is darker in person, however this was fine for me since I was putting it against a turquoise wall. I was disappointed that the nails or buttons are really just a string glued onto the headboard, not actual nails, when you get close you can see how they are interconnected as one string like something you buy at an arts and crafts store. I do find it is sturdy and holds my weight and the weight of others so I haven't had any issues yet with it cracks or collapsing or being weak.I would've paid less for a plain headboard then glued these on myself, or nailed them individually, close up it just looks a little sloppy and homemade.", 
    "Before I ordered this bed, I read each review. I was concerned for the mix reviews regarding the support system. I took a chance and ordered the bed based on the most recent reviews. The bed arrived a week after I ordered it. No piece was missing and the assembly was super easy! I have my box spring and mattress on the bed since I like my bed high, and you can still seethe splendor of the headboard. The color is grey and the fabric is linen. The metal trimming is sturdy. The bed is really stable. I had several people sit and lay on it to test the support. The support system is a success.The bed looks beautiful and elegant. I have received so many compliments on it!! The bed fits perfectly with my decor and definitely is the focal point of my bedroom.I am going on my 3rd week with the bed and I couldn't be any happier with it. Great price, great service, great quality and most importantly GREAT BED!!", 
    "This is a nice looking, stylish bed, and exactly what we were looking for. The slat system seems to have been improved because we didn't experience any issues like the previous reviewers. One thing to note, the hardware that came with the bed was 2 washers short upon installation. It was more of an annoyance to have to go to Home Depot and buy 2 washer before finishing the bed assembly. It took 2 men about 30 minutes to fully assemble. Bed looks great! We are very happy.", 
    "This is a better quality than what I anticipated after reading some of the other reviews. The color is a bit darker grey than I assumed it would be but I couldn't be happier with my purchase! My not-so-handy boyfriend put it together- so I have no doubt you can too.", 
    "I am very happy with this product. I was nervous because people had mentioned that it was squeaky...its not at all. I went into buying this thinking i would have to seal all the screw holes to make it not squeaky. This shipping said it would take a week and a half and it arrived in 3 days. It took about and hour to and hour and a half to put together. I used my box spring and mattress because i don't like my bed to be low. I love my new bed frame.", 
    "This bed is absolutely gorgeous in my guest bedroom! The quality of the bed is excellent; true linen with the entire bed being upholstered inner and outer, even the headboard is upholstered on the back. A great value!", 
    "Great value. Have had absolutely no issue with the slates - which was my concern when I bought the bed after reading some of the reviews. There is one support bar where it was not crystal clear where it was supposed to go, but we managed to assemble the bed with three people in just under 30 minutes. I have a pillow top matress and cannot use a box spring with this headboard or else the bed sits up too high and you do not see much of the headboard.", 
    "My husband and I purchased this bed for our home and we absolutely love it! We wanted to raise the height a bit so we purchased mattress platform with slat support, so fortunately we haven't encountered any issues with that. It is stylish, comfortable and welcoming. Love it!", 
    "This bed is very pretty. As others commented, it is not as light gray as the picture.But I think it looks very elegant. I have not had any issues witg the slats like other comments say. I have had it about a month now. Seems pretty sturdy to me. I would definitely not put a boxspring on here because itd be way too high. good for the price.", 
    "Great bed! Looks nice & sturdy build. I was a little concerned about the slats because of previous reviews. The slats aren't great quality but have been fine. No additional supports needed so far.", 
    "This bed is so beautiful! Everyone who comes over and sees it compliments me. I really am in love with it. The only reason I have it 4 stars is because I worry about the stability of the support system. I have had it for about 6 weeks and it is holding up fine, but I feel like if I jumped up and down on it all the wooden planks would break. One day my husband sat on the end of the bed to put on his shoes and one of the planks cracked, it could be that that one plank was just weak, and it doesn't affect the overall support of the bed. I read all the other reviews before buying and I still think it is 100% worth it. If the support system ends up giving me problems I think it could easily and cheaply be replaced. ONE MORE IMPORTANT THING: I was very concerned about the height - based on the product details I thought it would be too low and none of the reviews I had read really addressed the height. I just have a mattress (beautyrest recharge luxury firm) on it and it is PERFECT - a box spring would be wayyy too high. I am 5'1\" and I think it comes up to my mid/upper thigh.", 
    "I had my eyes on this bed for quite some time. The item sold out and I just kept waiting for it to turn up again. The minute I received the email notice, I bought it. This is one of the best investments I've made in a long time online. The bed was easy to assemble as I put it together myself in about an hour. The material and color of the bed is close to what you see in the image displayed. It's a little bit of a darker gray, but not by much. It looks like it's worth much more than what I purchased it for and is quite elegant. The bed it sturdy and I couldn't be more pleased with the quality. This works perfectly with just a pillow top mattress. You won't be disappointed!", 
    "I was incredibly hesitant to purchase such a large product and replace a bed without seeing it in person. Although, it turned out to be perfect and I couldn't be happier with it. While I found that the other reviews were helpful-- I thought they were a bit critical of the quality, which I have found to be perfectly fine, even exceeding my expectations. If you are looking for a decorative accent to your bedroom, I would highly, highly suggest this bed!", 
    "I have to say first the color says gray but in reality the texture of the fabric is between a gray and browns.....not as grey as it looks on the picture. That really is minor for me in this case. Bed came in 2 separate shipments only 1 tracking. First one came on Monday and second one came on Tuesday. First box is about 80lbs and 2nd one is about 50lbs. It had no damages at all, only thing was that one of the screws didn't want to go in all the way, but husband quickly fixed it. It was very easy to put together. The slats seeme a little thin for a queen size bed, but so far we have not fallen off....and lets hope we don't as it looks like it was pretty secured. Overall it was a great purchase for the price we paid. I'm sure I would have had to pay a lot more at a furniture store and delivery. This was perfect!", 
    "This is a very nice headboard, bed and was easy to put together. A little lighter than I expected but the quality is good.", 
    "Bed is nice looking and was not too difficult to put together. Not sure how long the slats that the box spring/mattress rest on will last since they are a bit flimsy, but for now we have had no problems or creaking. Color is a little different than in the photo on the website - I find the grey to be a little on the brown side. It is definitely grey, but has a brownish tint. Only real disappointment is that the metal studs/rivets are not individual, they are actually attached and strung together. For the price I shouldn't be surprised and they look fine as long as your face is not right up to the headboard. Overall I am satisfied - it won't be a forever piece of furniture, but it's good for now!", 
    "I loved the style and it looks very nice in our bedroom Only downside is the support rail system does not work!! We spend extra $*** dollars to get two sheets of Wood cut out to fit and five pedals to support at the bottom. I still think with the extra spent its a good deal.", 
    "I love the way this bed looks and I love the price even more. I've been in so many furniture stores and I've seen beds very similar to this and they are all north of $****. I'm so happy I found this bed on Overstock. The only drawback is that you have to put it together yourself, but I'm a 22 y/o girl who has no idea how to make or build anything and I did it just fine. I would I definitely recommend this bed!", 
    "I love this bed. It arrived in two big boxes with lots of parts, but was easy to assemble. I have not had any problems with the support system. At first I used my box springs, but have since removed them. The mattress sits pretty high with the box springs. The upholstery is great, but one of the nail heads has popped out. Overall I am very happy with this purchase.", 
    "Very good quality and easy to put together. I used my box spring and my mattress on the frame and I don't think it is too tall at all. It's a bit tall but I like it.", 
    "We just put up our new bed and so far we are extremely impressed. The quality of the bed was more than we had hoped for and it is beautiful, exactly the right shade of grey. However, some assembly instructions that were not included in the box. We received one page of directions that told us how to attach the rails to the headboard and footboard, but there were no directions for how to assemble the headboard (so it could be attached to the rails) nor were we told how to put together the support system for the bed. Thankfully, we found the assembly to be fairly self-explanatory and after looking at all of our parts and hardware we were able to determine the correct way to put everything together. However, it would have been nice to have a detailed list of instructions.", 
    "Overall the look & upholstering is great, but the bottom piece to hold the mattress is really cheaply made. The little plywood pieces keep falling off & it's quite annoying to keep putting them back in. It also has a lot of space between the frame and the mattress. Would send it back but it's too much of a hassle!", 
    "I searched and searched for a grey upholstered bed forever...I finally decided to go ahead and get this one as I really liked the shape and style. It is my first time purchasing furniture online and was quite anxious. Many people seemed to be pleased with their purchases from overstock, however I personally will probably not purchase furniture online again. The bed looks OK from a distance, but when you get close you realize the nail heads are not real but instead a string of them held in place with a real nail head about every 5 or so spaces. Also the way the headboard attaches to the bases is quite fragile and I fully expect it to be busted within the year. Overall its just not worth $. Save your money and either go buy one at a furniture store where you can see the product...or at least find a different bed. This particular one is not worth it.", 
    "I love this bed. It is sturdy and it looks just like the picture.", 
    "I love how it looks - but it is SOOOO squeaky! no matter how many times I try to fix it, take it apart, do it again, it is SO loose and makes so much noise. I really hope they will let me return it.", 
    "THis bed surpassed my expectations! So elegant and well made and relatively easy to assemble. It makes the room look so fresh and stylish.", 
    "Great bed. The gray has a bit of a pattern to it, but it adds to its character. Great buy!", 
    "The bed we purchased was exactly as described on the website and was delivered very quickly. Putting the bed together was a very simple process which is a MAJOR bonus!", 
    "I was looking for a new headboard for my queen-sized bed. I wanted a tufted upholstered style. Most of the ones I found were to attach to the wall. I did not want this style. The other headboards I found were more expensive than the entire headboard and bed frame combined which I found on Overstock.com. The quality of merchandise and the excellent customer service made it a worry-free, pleasurable experience.", 
    "WE put the bed together in a little over an hour and a half. make sure you put all the screws in piles to ensure you are using the correct ones for each attachment. Lots of parts! The bed squeaked ( wood in head board frame)in one spot the whole time we put the bed together which made me think we were going to have to return the bed. Once all together, the bed is great. sturdy and solid. looks nice and sophisticated. Not sure how it will go with just a mattress for long term. WE may buy a low profile boxspring.....Otherwise seems good!", 
    "Great bed and highly recommended! This bed arrived in two large packages. I had help putting it together, but could have done it on my own if need be (I'm female 28) The quality is great and looks more expensive than the price. I was looking around for awhile and was delighted when I came across this product! It seems sturdy so far. I put a memory foam mattress on it and didn't need anything else since the euro slats seem sufficient. A great buy!", 
    "I found this bed and it was exactly what I was looking for, but it didn't have any reviews. I went out on a limb and ordered it anyway because the style and price were perfect. Well, it turned out great!! The bed is really gorgeous and I've gotten compliments from everyone that has seen it. FYI, I didn't actually put the bed together, but I heard that it was somewhat laborious. I think the guys maybe spent an hour putting it together? Not sure exactly, but I did hear a little complaining at the end :-) If you're unsure about purchasing it, I would urge you to get it. I think you'll love it!", 
    "I am in love with this bed. The bed arrived in two big boxes in a week after I ordered (ships from CA & NJ). The instructions were easy and my husband & I put together the bed in a short amount of time. We had no trouble assembling, and all the parts were in the box and everything slid in easily. The headboard is absolutely gorgeous, a dark flannel grey, like a man's suit. The nailheads are gorgeous, and are shiny silver, which looks great with my silver lamps and décor. The con is that the underbed space is a small opening about 5\" from the ground, which means you can't store anything underneath without lifting the whole bed (and my cat needs to squeeze to get underneath).", 
    "The bed was delivered in just a few days after purchase. It arrived in 2 boxes and I was able to lug them up stairs by myself. I also assembled the bed by myself in just about an hour. The directions were easy to follow and the parts were all there. It's the first platform bed I've ever had so the euro slat system is a little strange - but I slept on it last night and besides a few noises here and there it was very comfortable. Hopefully once there's a carpet under the bed the noises will stop or maybe I need to recheck a few screws. All in all I'm happy with the bed. It's very pretty and classes up my bedroom.", 
    "This bed is beautiful, exactly what we were looking for! It is very sturdy and well made. The only negative I have to say is that it was time consuming to put together. I was not home at the time, but it took my husband 2 to 3 hours to put together.", 
    "Beautiful bed. Very stilish, looks expensive. Sleeps well.", 
    "Love! Was easy to put together and looks good! It was a great deal for the price"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Grace-Grey-Linen-Button-Tufted-Arched-Bridge-Upholstered-Platform-Bed/7894516/product.html?recset=ff020176-31d1-4b0b-abf5-5f6504481c28&refccid=QLOTCR77AQMJGMKEIK5W6CXZS4&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7894516/INSPIRE-Q-Grace-Grey-Linen-Button-Tufted-Arched-Bridge-Upholstered-Platform-Bed-69972198-cd74-4c0e-ad63-18fc3dfbe2e5_600.jpg"
  ], 
  "description": "Enhance the contemporary look of a guest bedroom or master bedroom suite with this linen upholstered bed frame. Made from durable poplar wood, this platform bed features arched bridge curves, nailhead trim and foam filling, resulting in an elegant centerpiece for any bedroom. The complete Euro slats provide ample support for a variety of mattresses. Set includes: One (1) headboard, one (1) footboard, one (1) set of rails, one (1) complete euro slatsMaterials: Poplar woodFinish: EspressoUpholstery materials: LinenUpholstery color: GreyUpholstery fill: Polyurethane foamArched bridge top curvesNailhead trimHeadboard height: 52.8 inchesFootboard height: 13 inchesLegs height: 4 inchesFull internal-mattress opening: 55 inches wide x 76 inches longQueen internal-mattress opening: 61 inches wide x 82 inches longFull-size bed: 52.8 inches high x 59.5inches wide x 83.86 inches deepQueen-size bed: 52.8 inches high x 65 inches wide x 88.6 inches deepMaterialFoam, Linen, WoodFinishEspresso FinishBed StylePlatform BedAssemblyAssembly RequiredColorGreyFurniture Frame MaterialWoodFurniture PatternSolidGallery MatchYesGallery RoomBlues, Botanicals, Evening Storm, Hampton Tradition, Heathered Greys, Master Suite, Robin's Nest, Savannah, Simply SereneProduct FeaturesIncludes Hardware"
}