{
  "name": "INSPIRE_Q_Winslow_Concave_Arm_Modern_Sofa", 
  "price": "EUR 491.11", 
  "reviews": [
    "My hubby and I tend to redecorate every 3-5 years. So, we don't like to spend a lot of money on furniture when we just end up giving it away when we hit a new decorating phase. Thought this sofa looked cute online. Ordered it... and it basically meets expectations! It was packaged well; contained all needed pieces/hardware; and instructions were pretty clear. The only thing that was a tad bit disappointing is the color. The Overstock ad said \"cream color\" but the sofa we received was taupe (or light brownish/tan). We debated returning it...but decided that the taupe color actually matched our living room. My hubby put this together single-handedly in about 1 hour. All in all - pretty easy stuff. The sofa, once assembled, looks virtually identical to the picture shown. It's a wee bit smaller in real life but it's fine. I would not recommend for someone trying to fill a large room. In terms of comfort, I really like it. I like a more firm sofa that I don't have to struggle to get out of! This sofa has firm cushions but that are comfortable. The back of the sofa is firm, too, but comfortable. The sofa also seems very sturdy. Our kids jumped on it right after being assembled and it was fine! I don't think anyone will notice that this is an RTA (ready to assemble) sofa when they walk in our living room but I also don't think anyone will think we paid $1500 or $2000 for it! All in all, I recommend this to frugal apartment or townhouse dwellers that need a stylish sofa that is comfortable, easy to assemble, and reasonably priced.", 
    "Like other reviewers noted, this is a VERY firm sofa, which I actually prefer. I'm on the short side (5'4\"), so always challenged to find furniture that lets me touch my feet to the floor, but this fits me perfectly. This was very easy to put together by myself (30 minutes), and although the separate pieces appear light (much lighter than the 40 year old couch I got rid of), the construction seemed sturdy while putting it together, so I'm expecting a long life for the type of wear it will get (kids will not be jumping on it). I was looking for a classic looking replacement sofa, that wasn't too expensive and got very high ratings. I found everything I was looking for in this sofa. Could not be happier!", 
    "i was a bit reluctant to purchase this item because i was not sure of the quality but once I put it together I was very happy with the purchase.", 
    "We are very happy with this couch. We weren't sure how nice the couch would be given the inexpensive price, but we are very happy with it. We wanted a couch in our living room, but we didn't want to spend a lot since we won't use it everyday and we have young kids who may destroy it. It looks great, is pretty comfortable and has taken the beating from our kids too. The assembly was a little challenging but no longer than an hour and two people needed (although doing it alone is certainly possible).", 
    "I bought this couch for the sitting area in our kitchen. It wasn't noted in the description that it came disassembled, but it shipped in 3 boxes and I put it together myself. Some of the screw holes weren't exactly lined up so it made it a little challenging at times. If I had to choose between easy and hard though, I'd say it was easy to assemble. It looks really nice and I'm happy with the purchase! I would not recommend buying this couch to be the \"main\" couch in your house, i.e. where you watch TV, nap, etc. It's very firm and great for entertaining purposes, so keep that in mind. The only negative thing regarding shipping is that the little bags of silica broke open during shipment so they went everywhere! But that has nothing to do with the product itself.", 
    "I wouldn't recommend this to anyone. After 2 weeks of light use it looks terrible! I would love to send it back but will probably just try to recoup some of the money from selling it at a yard sale because it would be impossible to take it apart, package it and return it.", 
    "The only thing I can say positive about this sofa is, --it is very firm. This is not furniture for a living room. It is better suited for a den or family room The fabric is something that I have never seen on a sofa. This sofa stains very easily. The cost doesn't match the product. Who in their right mind would put this price on a very inferior made product. I need a refund ----at least half.", 
    "This is a great looking and comfortable - if you like firm - sofa for the money. I put it together by myself in about an hour. Directions were easy to follow, all the pieces and screws were there. It looks quite nice, but I can't speak to how well it will hold up as I've only had it a few months and it is in the living room so it doesn't get daily use.", 
    "o clubs return policy is really unfair, there was an error when ordered and 2 went into quantity so now i have an extra couch, we cant afford to throw money away. and oclub will not take it back under any circumstances", 
    "I regret buying this sofa. It seems even water stains the material! Okay, clearly an exaggeration; however, within two months of ownership we had a cover put on the couch because the mysterious dirty spots became an eye sore. So much for looking nice. The biggest disappointment is the spring breaking away and creating an ugly and uncomfortable large bulge on the sofa seat. I am trying to fix it, to little or no avail. This is why I am here to warn you, even the small price tag is much too expensive. Next month we will had had the couch one year, time to buy another couch!!!", 
    "Absolutely love the look of this couch, but in just a few weeks the cushions are becoming misshapen, and you can feel the springs in them as well. There is minimal use of this couch, so I am guessing it would not hold up to people sitting on it on a daily basis. The color and materials are great, and like I said, love the looks of it, but it's a couch - you should be able to sit on it!", 
    "this sofa is horrible, it stains easy, it is lumpy, uncomfortable and ugly! I wish I never bought it!!", 
    "This product had to have been defective. Three different people attempted to assemble correctly without success. finally managed to get it 'good enough' and only one side is now not completely attached. not worth returning b/c would have to take apart and ship in boxes via ups. should've known the price was too good to be true.", 
    "I've owned this sofa for 2 years now. After the 1st year a screw on the arm rest section came lose and now the couch wiggles very losely. When it arrived, it arrived in several sections in different boxes and we had to put the thing together. It was fairly easy. Nothing to it. But now the screws are coming lose. When we were building it we tightened the screws tight enough so this wouldn't happen. This sofa is definitley not made for daily use in someone's house. Maybe in the bedroom or office type of couch where people aren't going to be laying on it and using it often. It is beautiful and the fabric has resited - there are no tears, only little fuz sticking out of which takes away from it's \"elegance\".", 
    "This couch is light weight and on the \"cheapy\" side in my opinion. I thought if I ordered here, I'd be getting a better sofa for a discounted price, but NO, you're getting what you pay for. So don't expect a quality sofa. The fabric/upholstery is really unsightly in my opinion. The box it came in says microfiber, but it is not. It is a weave- very stiff, polyester looking, that resembles the upholstery covering a cheap car seat. Looks like it may snag fairly easy as well! The pictures make it look much softer and smoother looking. This is good for someone who is on a budge, doesn't have too high expectations, just something to make do with that looks fairly decent. I don't think this sofa will last long. It is not well made. This is about the same quality as the cheap futon I am replacing. A bit disappointed. I would have gladly spend a couple hundred more for a longer lasting, higher quality sofa.", 
    "We ordered a bookcase, coffee table, and this sofa from overstock and I'm not sure I'll ever shop in a furniture store again!!!! The quality can't be touched!!!!!!! Blew my mind!!!", 
    "Just received this sofa for my small condo size livingroom. It's the perfect size...not overwhelming at all. The color and look is just as I expected. The sofa seems study. It only took my husband to assemble in about 10-15 minutes!!!! The only downfall is that it is not as comfortable as my older sofa...but it's o.k.", 
    "I own several Inspire Q sofas and know they are very nice for their exceptionally low prices. The Winslow Concave Arm modern sofa is no exception. It is beautifully designed and modern and the fabric is gorgeous. I have two small short-hair dogs and a cat, so I'm used to pet hair on the furniture and have a variety of gizmos to remove it. Unfortunately, after several weeks of having the sofa in my living room, I went to remove the pet hair and found this was extremely difficult! Unlike my other Inspire Q sofas that have a microfiber fabric, the weave of this couch seems to trap pet hair and hold onto it. I tried the vacuum with various attachments, a specialty hair remover roller, a hair-removing fabric sponge, and a lint roller and nothing worked well. Eventually, I had to move the couch to the guest room (where pets are not allowed) and it took several hours of work, and an entire lint roll to get most of the hair off. That involved vigorously rubbing the fabric with the lint roller and several directions, and it was a lot of work! Again, beautiful sofa for a fantastic price but pet owners beware!", 
    "I ordered a gray sofa. Have had it now for less than one month. The box in which it was delivered said gray. Opened the sofoa and thought it was a weird color. Called customer service, they insisted I ordered a taupe sofa. The \"gray \"sofa I ordered, was in fact taupe. The sofa was really small. THe seat was not very deep. It felt like lobby furniture. Result: Looking for a new sofa.", 
    "i've had the sofa for a few weeks now. it looks very elegant. it's firm but not uncomfortable to sit on. i've had 2 overnight guests and they said it was OK to sleep on.", 
    "Do not be concerned with having to put it together. It took less than 15 minutes. Easy instructions. No extra tools needed.", 
    "I was a little skeptical about purchasing this sofa due to so many of the reviews saying that the assembly was awful. Go ahead, read the reviews! But guess what? I ordered it anyway; it was the right size, color and I loved the slope of the arms! UPS delivered it this past week - very timely shipping. The packaging was intact, no wear or holes. However, I was afraid to attempt this as a project with my husband since the reviews stated the difficulty with assembly. So, I called a friend who's really handy to do the assembly for us. He had it put together in less than 45 minutes! IT IS JUST WHAT I HOPED FOR!!! He didn't break a sweat or cuss at all! I am in love with this sofa! Yes, it does sit a little hard, but that's OK with me. It's easier to get out of a firm sofa than one that you sink into. The color is just as described. Go ahead and take a chance with this sofa. You'll be glad you did!", 
    "I was never able to put the couch together because they never sent me the arms to the couch. However, I pulled everything out of the box and found the two of the couch legs were split and glued back together. The couch pieces itself were SUPER lightweight and very poor quality. There was no substance to this couch and would probably crumbled under someone with some weight on them. I would NOT recommend this couch to anyone!", 
    "Love the sofa it took my husband about 45 minutes to assemble. Super comfy and it looks expensive and vert chic.", 
    "I love the style, clean lines. The color is a little shimmery gold with taupe base color. I also ordered the armchair and they look really nice together. It is very firm but for my living room that is fine. Check the measurement of the sofa as it is a little shorter than I expected. It took 2 of us to assemble, there are a few screws in very awkward locations, however, it all fit together and is very sturdy. My dog wiped her dirty face on the front of the sofa leaving dirt but fortunately the microfiber fabric allowed me to clean with water and no stain was left. Overall I'm very happy with the purchase.", 
    "I love this couch. The price is wonderful compared to a similar style in the furniture stores. It took about an hour to put this couch together. If I would have had someone else with me ti would have taken less. Tools were included adn I had all the screws, lock nuts and washers as needed. When I was looking at this couch online I wanted to know how deep the cushions were because I wanted my back to hit the back of the couch when my knees were at the end of the cushion and this couch fits perfect. I am 5'7\" and average leg length. The furniture does not have springs but has straps that are woven together for the support of the couch. I have not had construction like this in a sofa before so we'lll see how it holds up over time. I know the springs don't hold up. Very high end looking sofa. I am pleased!", 
    "I had been looking at this sofa on Overstock.com for many months, and finally decided to order it -- along with two matching chairs. I need a firm cushioned seat in my living room in place of the old \"squishy\" couches I had. The twilight blue color is absolutely beautiful, and the quality of this furniture is excellent -- far beyond its price. Assembly was easy according to the two men who did it for me. I am 5'2\", and this sofa fits well. I do use a throw pillow behind my back, but the height of the seat is perfect for me. I am very pleased with this purchase.", 
    "It was hard to put together. I like the color and the fabric is ok. The cushions are already getting mis-shaped and its been less than a year.", 
    "Love, love, love this sofa. I have now bought 2 of these for 2 different office lobbies. It is comfortable and easy to put together.", 
    "Looks great,easy to put it together", 
    "The cushion is very poorly constructed. After a while, it sink in and not comfortable at all .", 
    "This sofa is mostly as pictured & described. I purchased the Grey Linen color & love it! I stands out nicely against my \"greige\" walls. It's on the firm side, which I prefer, but not hard. I had an overnight guest sleep comfortably on it, but its not long enough for a tall person to sleep on. Its more of an \"apartment size\" or large loveseat. The armrests are more comfortable than I expected for the shape. The legs are a black eggshell finish. I would've preferred very dark brown, which I thought is what espresso was. They're a bit tricky to get right so that the correct angle is facing the outside, so double check before securing with screws. I would've preferred a taper with the same angle all the way around, but that's a very minor detail. The piping detail is lovely, and gives it a higher end look. It's relatively easy to assemble, but the legs aren't labelled & are all designed the same (not for specific sides). I had a problem with 1 bolt; I believe the threaded insert in the frame was defective or the angle was off, but managed to make it work. The back is out of alignment maybe 1/8\" or less where it meets the arm but most people wouldn't notice & it can easily be disguised with a throw blanket. I didn't think it was worth the trouble to exchange. The chair had the same flaw so its probably due to manufacturing. I'd recommend starting with the trouble bolt if you have the same problem. After I did this the others lined up more easily. The wood quality on the inside is very disappointing and inconsistent. Its not built for heavy wear so I'd advise against this purchase for anyone with kids or heavier folks who like to throw themselves or fall into the sofa. I had a slightly overweight guest visit who managed to crack the veneer in two of the chair legs because of this. It appears to be minor damage, but still disappointing. I've had to move many times without help so I like the idea of being able to disassemble if needed for moving. If you can get some extra discounts/rebates its worth the price and trouble of assembly. I honestly expected better quality, so I'll have to baby this piece but I did enough comparison shopping to know its a fair value for the style.", 
    "I really enjoy this sofa. It looks nice - not cheap and not expensive - and is comfortable to sit on. It is not an ideal choice for those who want to lounge or sleep on the sofa, although I've done both without much discomfort (but I'm really short and like firm support).", 
    "Not at all hard to put together. Great color, goes with everything!! Just what I wanted!!", 
    "Great sofa! The color is a bit darker in the grey but was perfect for my room. As stated in other reviews, it is a bit stiff, but that is one of the reasons I picked it.", 
    "Great color for a contemporary look that completely brightened the room. Strong lines ... very firm cushions but for the room it's used it is not a problem at all. Plus, I think the sofa will keep it's shape better with such strong cushions ...and it is not hard as a board! Great value and super easy to assemble with finished product being sturdy and strong. Great value.", 
    "I love it! It was so cool how it fit together! Thank you!", 
    "Easy to assemble. Clean lines.", 
    "Just don't do it. Spend the extra money for something better quality that will last", 
    "Firm cushions, but fine for our bedroom. If you are looking for a soft comfy couch, this might not be the one for you.", 
    "Pros: Sofa is beautiful and comfortable. Cons: When you sit at the center you sink and the cushions quickly became flat, I will have to get new sturdier foam for the seat cushions eventually.", 
    "Much better than anticipated ...well built and none to difficult to assemble", 
    "I bought this for by basement recreation room. Assembly was a mere 30 minutes. Cushions are hard. But looks good", 
    "Satisified with quality/price", 
    "Over all the couch was worth the sale price I paid ($350), but I would not say it was worth more than that really. The color and fabric are great- just as pictured. However, the couch feels more like a love seat. There is not much depth to the seat and the cushion itself is kind of...cheap (by that I mean not very plush, more like a mostly-comfortable foam base). Again, however, I would say it was definitely a good buy for $*. Also very easy to put together.", 
    "This sofa is beautiful. It is firm and the seat cushions hold shape. Assembly was required but it was easy to put together. I would not recommend for comfy lounge furniture. It is more of a show piece.", 
    "i ordered 2 sofa and we like it so muchthe colour the fabric and its easy to assemble", 
    "I ordered the grey couch because I wanted a simple, modern looking couch and did not want to spend a lot on it. The grey is darker than I was hoping for and I know you get what you pay for but this couch was difficult to put together (on my own), the screws don't fit into the couch well and it does not feel sturdy. The seat of the couch is not very deep so it's definitely not a good couch for everyday lounging and to top it off, it's probably one of the most uncomfortable couches I've ever sat on. I'm only not returning it because it came in multiple HUGE boxes and was a major pain to put together... never taking it apart.", 
    "This sofa came in 3 separate boxes and was SO easy to assemble. It literally took 5 minutes to slide in the pieces to connect the entire couch. The couch is a bit firm, but it's not a problem. We got the haze blue linen and it is such a great color. We're totally satisfied with this purchase!", 
    "After 2 khaki color couches sent I finally got the right one. The assembly is ok except they left out Allen wrench. We keep sofa covered with blanket but our puppy jumped up and had small accident in her excitement. It stains really quickly as I worked on it immediately and 2 days later it shows. Depth is a little short for tall peeps. Not super plush like a den couch. Very pretty and happy with look though.", 
    "Nice looking. I purchased the gray and it looks exactly like the picture. Fairly easy to put together but some of the screw holes were slightly off. As a result, I couldn't get one of the screws to completely go in. Because the screw is at the top of the arm of the sofa, I just put a throw across the arm to disguise it.This sofa is in a living room that is rarely used so I cannot speak to it's durability and comfort.", 
    "Very chic with clean lines. Unobtrusive for small spaces.", 
    "Great sofa for the $$. Lucky I have a friend who is handy. He had no trouble putting it together", 
    "I bought this to stage and I wish I had two, it looks great in EVERY house. It's a little smaller than many couches (not by much) and with the sleek design, it helps spaces look bigger and yet you still have a full size couch.", 
    "This item is cheaply made it cost over ***.** to send it back.", 
    "love seat size, not sofa size", 
    "Great quality, super easy to put together, a bit stiff, but perfect for the price.", 
    "Surprisingly comfortable. Took a bit to assemble, but once everything lined up it went quickly", 
    "The couch is beautiful but it isnt too comfortable. After a while the pillows/foam doesn't fluff back up. Im anticipating the replacement of the cushion foam.", 
    "Decent looking couch, but not much fun to sit on.", 
    "I really like this sofa. I didn't want to spend a whole lot of money, but I wanted something that was still modern and stylish. This sofa really delivers on bang for the buck. The only negative is that it isn't very deep, so it's not as comfortable as it could be. I use it for everyday use and it's fine for me, but it's probably best used in a sitting room. Don't expect to be snuggling on movie nights on this baby.", 
    "I ordered this and the matching loveseat. They look really well in my living room and are a nice neutral color. I would say the color Is a medium gray. Not too dark or light. It is a firmer couch but still comfortable to sit or take a nap on.", 
    "Purchased the sofa and loveseat together and they are quite nice for the price. a little complicated to assemble but I got them together and am not a handy person", 
    "I purchased this after falling for a very similar sofa from **** *** that was just way too expensive. This couch was smaller than I expected (even though I meadured) and it's pretty stiff, but it works for our formal living space. For the price I am happy with the purchase, im happy with how it looks but I am hoping it gets more comfortable over time.", 
    "Absolutely love it. great for small space and put together in 25 minutes.", 
    "A great Sofa for the price.", 
    "We've had this couch for over a year now in our formal livingroom. It doesn't get much use besides cocktails or family gatherings, but they are perfect for the room. They (the couch/matching love seat) give a structured, modern, stylish look to the room. I don't think they'd stand up great or be that comfy for day-to-day use. But if you're looking for some stylish furniture to complete a living room this is an affordable option.", 
    "Perfect for me and just the color I wanted.", 
    "We have been using this couch for less than 2 months, and the cushions are flattening out already. Very poor quality!!!! Do NOT recommend!!", 
    "Nice addition to our sitting room!", 
    "Looks great. But, careful when you flop down on it, there is a bar that is seat cushion level that will hit you. I will use it for staging properties for sale, so it works really well for that.", 
    "Liked the style but felt that this is more of a bigger love seat than full size sofa. Was concerned about this before my purchase but read reviews contrary to this so went ahead and bought it.", 
    "This couch is a great size and feel (more firm, but not too much). We love the basic modern look of this couch. Great furniture piece for the price!", 
    "I love the clean lines of this sofa, it's quite firm but it's not a problem. The top of the sofa was a little dented on both sides from the way it was packaged and I'm hoping it will pop back up over time but it's been a couple weeks and it hasn't but it's not problem.", 
    "I was looking for an affordable sofa to use for a couple of years in my new home. However, this sofa disappointed me when I sit on it, it feels like the back is pushing me off, and the seating is over firming. I'm so sad about this, looks like the wooden frame is sturdy though and the cover cloth is acceptable quality, but this is certainly not a comfortable sofa. I guess it's just barely worth the price!", 
    "I've used it for a few weeks and the cushion is already morphing. But it was cheap and looks good (overall)", 
    "The sofa comes in multiple boxes and assembly is required. The challenge with our order was that only a couple of the pieces needed for assembly were shipped and I am left with a couch back and arms… Overstock is \"checking\" and will get back to me. I'm left with a couple pieces sitting on the floor.", 
    "I got the sofa and was very excited because it looked just like the picture. However, the sofa was difficult to assembly, the wood in the back looked rotten and the one in the middle seems to have broken. In addition, the cushions sink into the middle and I literally slide down to the middle of the sofa whenever I sit on it. Do not buy.", 
    "I really love the look of this sofa and loveseat. The lines are simple and clean. I got the gray and the fabric is represented well. My disappointment is in the quality. The sofa is light. I can pick it up with one hand to adjust my carpet, and that is light! It is so delicate I am afraid to let larger guests sit on it. There were also some indentations on the front of the sofa (below the cushions) that I imagine were from the packaging. I thought these would puff back out, but after several weeks, they still have not. The wood frame behind it prevents me from trying to fluff it back out. It makes the sofa look cheap. Also, the fabric underneath where it meets the bottom cover was frayed in one area. I am afraid this will be an issue later and I have tucked it as best as I could under the bottom cover. One additional comment is on the edges. The fabric is not evenly wrapped around the edges making the ends looks slightly lumpy and again, cheap. YES, you could say, What do you expect for 500 dollars or so\" but I say, slightly more quality than this. I actually felt bad getting rid of the sofa and loveseat I had since they were real quality items and lasted 20 years. I should have just spent the money on recovering them. From a distance, my new living room looks stylist though.", 
    "The grey color looks really good and modern! It is so pretty!", 
    "The color is a little darker than pictured but other than that the sofa is firm, yet comfy and looks great with its very modern lines. It was easy to put together and seems to be pretty well built.", 
    "I ordered this for my daughter, she was soo concerned a sofa would not fit through her door, and this one came in 3 boxes, so there was no issue. she loves it! Delivery, again was right on time, so quick!", 
    "very narrow looks great but a bit uncomfortable", 
    "I was pleased with the purchase.I recommend!!!", 
    "Great price and easy to assemble! Thank you!", 
    "This sofa has great style, is a great neutral gray, and a good size....not too big", 
    "I was very, very skeptical when this sofa arrived at my house in 2 boxes. I thought to myself, what did I get myself into once I got all of the parts out of the boxes?! But I am extremely impressed with the way this thing turned out. It goes together like a breeze! Just a few bolts, washers and screws and you have a beautiful sofa ready to go. The fabric is perfect! I like that it’s not micro suede but microfiber; so you get the durability with a luxury feel. I also like the tight back and rounded top of this piece. Honestly, it looks so good in my living room. I really can’t say enough about how awesome this thing looks.", 
    "The couch fits perfectly in my main living room. The color is a very pretty gray (as pictured). The assembly wasn't as bad as I thought it would be based on the reviews I read. I put it together myself (young female) in about an hour with no issues. The seats are firm, but that's what I prefer. Love the clean lines, slope arms and higher back.", 
    "The sofa is actually what I expected", 
    "I have two large white sofas and added this gray one to complete my look and it is an amazing compliment to my living room! It was very easy to assemble and is comfortable too!", 
    "I loved how this couch looks, its in my formal living room and I have had lots of compliments already!its comfortable to sit on. The color looks just like the picture. I m 100 percent satisfied!!", 
    "Couch was pretty firm when I got it but it has broken in pretty well. The back is kind of stiff but it's comfortable enough to sit in for hours and I've slept on it once with little issue. Definitely a good piece given how cheap it is.", 
    "I endlessly searched for an \"apartment-size\" sloped-arm modern sofa that I could afford. Thankfully, I found it on Overstock.com. The shipment came in three pieces, as it requires assembly. You will certainly need another pair of hands of a patient and \"handy friend. During the assembly process, patience wore thin, so I offered and threw in a meal alone with a bottle of wine. After all was said and done, it was assembled! I ordered us Chinese. We ate and drank our wine on MY new sofa. It was worth it.", 
    "This is a small sofa (more like a love seat) that looks exactly as it appears online. Be sure to measure your space so you know how small this \"sofa\" is. I would rate it higher, but the install is ridiculous. There are two screws (one on either side) that are near impossible to thread through, much less reach with your arm. You cannot see the holes and you have to feel your way and by luck get the screws to thread through. I said so many curse words trying to get the final screw in place, and I consider myself a very even-keeled person. I wanted to throw this sofa out the window. Knowing the trouble my husband and I went through and how many hours it took, I would have elected to purchase a sofa at a local store and had it delivered already assembled. For those reviewers who reported that install was easy, all I can imagine is that they got very lucky to have those final two screws magically thread. If you are not so lucky, I pity you. You are forewarned.", 
    "This couch appears larger on the picture than it did when I received it. It is a little hard but it served it's purpose. Great starter piece for a new grad or college student....", 
    "good sofa for a family room or basement.", 
    "Everyone was telling me I was crazy for ordering a sofa online but after getting this sofa I am so happy I did not listen to them. I LOVE LOVE LOVE this sofa. I fall asleep on this thing all the time!", 
    "My cat had torn apart my previous sofa and chairs (plus they were used when I got them). The price was so right (with discounts) on this sofa and chairs that I couldn't pass it up. Putting it together wasn't too bad. I did it by myself (58 year old woman in decent shape). The sofa and chairs are firm but I like a firm cushion. The microfiber was supposed to not be liked by cats but mine has already started in on the sofa. I placed a cat scratching post between the chairs and doused it with catnip oil so he will use that instead. Don't know how this will hold up but it seems pretty well made.", 
    "I read the other reviews on this where folks said that they were able to put this together in 15 minutes - I seriously doubt that. The screws that attach the arms to the body of this sofa have one that is extremely hard to reach and with those little wrenches it's impossible to get tight. So, you put it together and the minute you sit on it, the arms come apart from the sofa. Like the chairs that I got, it's nice to look at, but probably not a good idea to sit on.", 
    "I was hesitant to purchase two sofas (we purchased two of these) for our front living room...more of a sitting room. But, they arrived promptly and my husband was able to assemble both of them in an hour. The color is a light to medium grey and the fabric is a nice linen weave. We have three cats and the fabric has been wonderful to not catch the cat fur. They are firmer, but I prefer that to a super soft couch. These look elegant. They are just the right size since there isn't a lot of arch on the back or sides. We think they are just perfect! We've only had them for about a month, but they are holding up to two kids (they know not to jump on the sofas). :)", 
    "I got this sofa because it looks nice. But the quality is really bad. It stains quickly . but it looks nice . if u need something just for the looks this is good. But for the use no no no.had to return it.", 
    "The couch was extremely difficult to assemble. The seat and back went together easily but trying to attach the sides was a nightmare. The holes the manufacturer placed did not line up to put the screws in so I had to use a tool to widen the holes from inside the couch. Not fun. I definitely like the couch but I was pretty close to just sending it back due to the difficulty of assembly.", 
    "I was looking for a simple, clean and stylish sofa as a replacement. This sofa offers a great solution as a reasonable price and matches most of my existing furniture. I purchased 2 of the accent chairs to go with the sofa in order to create a comfortable living space. Great Deal!!", 
    "Great sofa especially for the price easy to put together looks expensive", 
    "Although this sofa has great lines and overall is very stylish, the quality is extremely subpar. The cushions compress almost all the way down when seated and the back is no more than a lightweight foam pad. You can tell the fabric is going wear quickly. Since the price is fairly low, the quality level is probably to be expected.... I returned mine and spent an additional **** for a top notch quality sofa instead.", 
    "Exactly what I needed for a small living room. Perfect color to accent with yellow.", 
    "This is a great sofa. I purchased the gray linen and love it! The color is as shown I would not use this sofa for a family room, but it is a great sofa if not meant to be used as a comfy couch. Easy to assemble and clean lines look great. I purchased 2 matching chairs and feel the same about them. Delivered quickly! Always a plus!!", 
    "Our family moves a lot, and between trucking damages, and furniture \"abuse\" by our children and pets, we purchase furniture a lot more than we would like to. That said, we ordered a number of items from Overstock after our most recent move. There was a shipping delay because our billing/shipping addresses were not identical, as we had not not yet updated them. A pain, but I get it. Because we didn't have WIFI at our new house yet, my wife placed the order on her cell phone, and on the mobile version there was no option for choosing \"grey linen\" as the color - rather than the \"tan microfiber\". So, several days and phone calls to Overstock later, billing issue is straightened out, and we were able to change the original order from \"tan microfiber\" to the \"grey linen\". Or so we thought. A few more days after that, 6 boxes (for 2 Winslow Concave sofas) arrived, and our kids and I were very excited, being that we had been sitting on the floor of the new (mostly empty) home for the time being.At the time of delivery, my wife was out of town for a few days, and so I figured I would put the sofas together immediately after they arrived, and surprise her when she got back. Before even opening the boxes,. I noted that the boxes said \"grey microfiber\" but did not give it any thought, being that we wanted the GREY and not tan color, and that's pretty much all I remembered. So all seemed fine. Once unpacked, I noticed the color was off (more like light khaki), but figured the box said \"grey\" so it was just due to the lighting in the room (it was dark outside) and kept going. The next day, during daylight hours I still couldn't quite see how these were called \"grey\"'. Fast forward a week or so, my wife finally returns from her trip and flips a lid. \"How in the world can anyone call these sofas (yes, we got two identical ones!) GREY LINEN, when they are neither grey nor are they linen or even linen-look fabric\". We also purchased another \"linen\" sofa, the Dune, in the same order, and there is a night and day difference in fabric. That one we actually love - this one wee hate!!! Oh, and did I mention the sofas are tan AND microfiber. Our cats LOVE sleeping on them and using them as a scratching post, and every time the dog goes outside now, all he wants to do is get dirty, so he can come back inside and rub up against these two sofas. We have had these for about 3 weeks now, and they literally look as if they were several years old. Worst shopping experience ever!!!And if you wonder why we didn't return them... Well, let me tell you. The day after I assembled them, I put the boxes out on the curb for recycling day. Yup. So between taking the two sofas back apart and finding/purchasing just the right size XL boxes and padding to fit the sofas in order to ship them, would have been a major undertaking. I bet that is the case for most people who are not happy with their online purchases. Maybe that's just part of buying bigger ticket items at a reduced rate online. For us, it was like lighting $1000 on fire on this particular purchase of two \"Grey Linen\" Winslow Concave sofas.That said, if you are ok with the tan, slightly shiny microfiber option, and that is what you are looking for, go for it, especially if you don't have children and/or pets and are not looking for a plush kind of sofa. We like our sofas to be on the firmer side, and these fit that bill, so the firmness did not bother us. But if that's not your cup of tea, it may not be the best fit. Just be aware, and don't collapse or throw out any boxes before you are sure the item you got is to your liking, and/or matches the description when you placed your order.", 
    "After searching for weeks in furniture stores for the perfect sofa we decided to take our chances on an online purchase. We wanted something stylish and compact to fit into our basement living room/office space. This sofa was spot on with the style we liked, and while it wasn't available in gray like we had wanted we settled for taupe. For the price, this sofa is unbeatable. We sat on a few similar sofas at our local Ashley Furniture and this one is just as good as those but a far better value. I was pleasantly surprised by the taupe color, it has a very pretty sheen to it. We've had it for a few weeks now and it's been perfect for what we needed.", 
    "I ordered this sofa in gray and I absolutely love the look of it. However, one of the legs does not fit!! Fortunately the hole where the foot screws in is too big and not too small so I was still able to set it but like I said, it does not fit. The sofa came in 3 different boxes: the back, the bottom part, the arms, and the cushions. When I was assembling the sofa everything was working out and I was very excited, until it was time to screw in the arms... One of the arms screw was mis-drilled so now the top of the arm is unattached. And then there's the leg issue...I would have returned this sofa but since it was already out of the boxes it was too much of a hassle to ship it out again. If you are willing to risk not being able to assemble this sofa because the wholes were misplaced when drilled... then go for it! It's a really nice couch and I personally don't mind how firm it is. Otherwise, save your money.", 
    "I guess this is about what you get for a $***couch. Comes in three boxes, so I wasn't surprised when one went missing for a few days. The hardware pouch had burst (as had one of those silica gel sacks, so I'm still finding those little balls around my apartment) so a few of the washers were missing, and my local hardware store didn't have any in the right size. Minor annoyances, but when you've been waiting two weeks for a couch... It looks taller in person than it felt like it would be when I measured spaces, so it's hard to find the right place for it in my living room. Always feels a bit in the way. The material is weirdly shiny, seems to have come with some small stains, the legs aren't actually wood and don't look it. (They have the fake wood finish stickered on.) Having built the thing, it hardly seems durable. But it is quite comfortable.", 
    "The color of this couch is a perfect gray, not too dark so it's a great foil for other furnishings. It does look really good in my living room but It's hard and not that comfortable, and the arms are too low to lean against. It's a great buy for the price but I'd be surprised if it holds up more than 3 years. If it's a sofa you look at more than use, then go ahead and get it. You really need two people to assemble.", 
    "I originally received the wrong color back panel for this sofa - which meant a two week wait from the warehouse for the correct one. Once that one arrived, the sofa has been great. Easy to put together and a great size for a smaller room.", 
    "This sofa looks very expensive. Great vale for the price. Great design. Easy assembly. Quick delivery", 
    "Adored this sofa when I saw it on the website and couldn't wait to get it set up in my home. Put it together easily on my own, and was instantly nervous about the quality. This is a \"bare bones\" sofa - looks great but poor quality. It is not comfortable to sit on as it has very little cushioning and sags in the middle. You can feel the springs while sitting on it and if there are more than two people on it, everyone leans towards the middle and squishes the people towards the center. A real bummer now that we have bought it, set it up, and thrown away the box. I would recommend resisting the urge to buy this beautiful sofa and opt for one with much better quality.", 
    "I am so pleased with this sofa. Better than expected. Good price. Love the feel of the fabric", 
    "The style and length of this sofa is what I like the most about this. It is also very good as far as putting together. The color scheme and style of the chair makes it feel old school and modern all at the same time. Highlly recommend this product, I will probably get the other chair with it soon.", 
    "Great looking, color true, just a bit firm.....excellent value.", 
    "If you are looking for a high leg, tight-back, firm seat sofa, this may be it. The size is perfect for our small space, and the soft taupe color is attractive. As mentioned in other reviews, the moisture pack had broken apart, but was easily vacuumed up. Be advised the backing is attached with Velcro.", 
    "Great experience, delivery as expected. Good value", 
    "This couch is FIRM. But that's ok in my book. Given the sloping arm rests, if you want to take a nap or whatever, get some throw pillows so you don't get a crick in your neck. I love the clean-lined design. Perfect fit for our mid-century house. The package was missing some bolts and washers and the desiccator bag had broken in shipping (big mess). This couch was sent to us twice. The first couch was damaged (in shipping, presumably); there was a small hole punched through the packing box and the back of the couch. Overstock customer support was very helpful and sent us another one right away.", 
    "This is a great looking piece. It might not be the most comfortable because there are no back cushions, but I am using it for the look and not for the feel. It was a little difficult to put together..... took longer than I thought it would and one screw would not fit no matter how hard I worked at it.", 
    "Bought this for an office and it was nearly perfect. When putting together, however, there was a design flaw that let only 2 of 4 bolts from connecting (this holds the right edge of the couch on to the main frame). Looks great (even if not compleltey safe as of writing this) and Overstock is sending me a new side and bolts to (hopefully) address the problem. For the money, it's a great looking couch. I don't know that I'd want to sit on it much, but we're using it for a waiting room and don't want people to linger too long anyway!", 
    "It's simple to put together, as long as you have some common sense and have a little patience to read pictures. It's easier than ikea furniture assembly. All the nut and bolts came with the couch. The couch was delivered in three packages (or boxes). Seemed to be well-packaged and nothing was broken or missing during transit. Super fast delivery. It's a pretty light couch, and easy to lift and assemble for ladies out there. Insides consist of thin wood pieces and lots of foam. It's not the most comfortable thing in the world, because the support consists only of some polyester bands (like seatbelts) and some foam. But it's great for a $$$$ couch.Three can easily sit on this couch (four average sized people will fit), but I would be worried that four might break the thing. It was a really dark beige-ish color, and I wish it were lighter. I kind of feel like the darkness of the beige makes it hard to coordinate with other furniture pieces and my wall paint color. I'm not a designer or anything, but I feel like I'm limited to choosing either some accent chairs that are very light/bright vs. a dark leather of some kind. But I think the couch will still work fine for me. You can tell the fabric (microfiber) is super cheap. I think the type of microfiber that's used adds a slight sheen and grey to it. But I think you can definitely dress it up with some nice pillows and a nice quality throw. The two cushions did not fit as tightly into the frame as I would like it to. B/c the cushions don't fit as tightly into the frame, it's slightly uncomfortable for the person sitting in the midde without that much support/cushion beneath them. I don't think it's a big deal, because I still like the couch for the budget I had.", 
    "The couch feels like it was inexpensive -- not cheap, but certainly not expensive. The size of the couch with the two cushions makes the \"seat\" you take in the center right at the crease. Don't love it. It's a great sitting couch but not a great \"all day Saturday watching movies\" couch", 
    "I didn't get to open the product ,because I wouldn't be able to assemble it alone,and I need more seating capacity.", 
    "From the photo of this couch it appeared that the back might be narrower than the front. We needed that to be the case in order for the sofa to fit into a recessed nook in a narrow room. The customer service folks were great and had the warehouse measure the back of the sofa for us. Low and behold, they said the back was roughly 10 inches narrower than the front. We ordered the sofa. It turns out that they hadn't measured the full length of the back, they measured the back section without the sides of the couch attached which added another 10 and 1/4 inches and it didn't fit in the nook. As a result we have to rewire the room to move the tv and computer cables to the opposite wall so the sofa can fit on the long wall. It changes completely what we had planned for the room and is costing us money out of pocket to have the wiring done. Beyond that, there was a spot on one of the cushions about the size of a hamburger bun. It is very faint and more like an anomaly in the fabric rather than a stain, but disappointing to have on a new couch. As a result of these two concerns, Overstock offered us a full refund if we sent the couch back, or a refund of $80 to our credit card, or an Overstock.com credit of $100.", 
    "This is awful, the fabric and craftsmanship is the worst!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Winslow-Concave-Arm-Modern-Sofa/6223601/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6223601/INSPIRE-Q-Winslow-Concave-Arm-Modern-Sofa-3331cdcf-3178-4f96-b9c7-a86f022a70d4_600.jpg"
  ], 
  "description": "The Winslow Concave Arm Modern Sofa is the perfect choice for a\nden, family room or any other living space. The high back, firm,\ncushioned seats and sloping sofa arms make this sofa comfortable\nfor sitting, snuggling or sprawling. This classy sofa would be\nright at home in a modern or contemporary house. The styling of\nthis Winslow sofa is modern with a decidedly classic edge, with the\ngorgeous concave arms and elegant high back. This beautifully\nstructured sofa is comfortable and firm, and its crisp linen\nupholstery creates a retro vibe in your living room.High backTwo (2) seat cushionsIncludes: One (1) sofaMaterials: Asian wood, microfiber fabric linenWood finish: EspressoUpholstery materials: Microfiber, linenColor: Taupe microfiber, grey linen, twilight blue linen,\n  tawny port red linen and hazy blue linenUpholstery fill: 100-percent polyesterSeat height: 18 inches highSofa dimensions: 34.5 inches high x 74.75 inches wide x 34\n  inches longStyleModernMaterialLinen, Microfiber, Polyester, WoodTypeSofaFinishCherry, WoodAssemblyAssembly RequiredColorBlue, Grey, Red, TanFurniture PatternSolidGallery MatchYesGallery RoomCascadia, Family Moments, Hawthorne, Michelle's Grey Linen, Plymouth, Seaside Memories, View Of The World"
}