{
  "name": "INSPIRE_Q_Winslow_Concave_Arm_Modern_Accent_Chair", 
  "price": "EUR 333.54", 
  "reviews": [
    "I purchased two of these chairs. I love the shapes of the chairs. The chairs are also comfortable and the style fits well with my existing living room pieces. However I will probably end up having the chairs reupholstered since the fabric quality is not quite up to my standards. If the chairs had been more expensive I would have returned them for the low quality fabric, but the great price I paid makes it worth the effort to invest in upholstering the chairs in nicer fabric.", 
    "I purchased two of these chairs for my living room. They arrived very quickly and were easy to assemble. The chair looks beautiful, with great lines.The color is neutral enough to blend into any living space. I rated the chair with 4 stars because the quality of the microfiber could be improved, but the chair is sound and works great in our living room.", 
    "The chair sides and arms came separately from the body of the chair. It is supposed to be held together by 5 bolts on each side that screw into threaded metal fittings. 5 of the fittings matched the bolts and 5 fittings were different from the bolts. I went to a hardware store to buy bolts for the odd fittings, but nothing matched. I actually bought a pair of these chairs, both with the same problem. The problem fittings are at random locations on each chair.", 
    "I hesitated about ordering furniture online but since I like Overstock so much I decided to give it a chance. The chair looked beautiful on the website. I ordered two chairs and they arrived very fast( took about 3 days). They came in 4 boxes. They are not easy to assemble. They took about 3 hours of my husband's time. On one of the chair, the holes were not properly aligned so that one chair took long time to finish. On the other chair, we found out that there was no padding on one arm. We could feel the wood frame with our fingers. While assembling we could see the frames which look cheap and fragile. After all the trouble assembling them, we had to disassemble them and ship them back to Overstock. Not recommended for anyone.", 
    "Style & color was as expected. Chair would've been great, but did not ship with the arms. Customer Service was very responsive and timely with solution. Although, they couldn't get the arms in, they were great! Ordered a number of things from Overstock. This is the first time I've had an issue.", 
    "These chairs are very elegant and have wonderful lines. Great price and hope to get lots of wear out of these!", 
    "Was so excited when I pulled the pieces out of the boxes. Looked and felt great. Right arm and base went together easily. Then I tried the left arm...two bloodied knuckles and much cursing later, threw in the allen wrench and called to get a new arm which is on its way. The pre drilled holes weren't not aligned. One of the pre sunk beds for the bolts came right out of the frame. Here's hoping it's the arm at fault and not the base...then I'll have to have them resend that...disappointed.", 
    "This is our first time buying furniture online and it was great. The fabric has a nice sheen to make it more richer tone. They helped modernized our living room. It's very comfortable too.", 
    "So comfy and lovely chair and if you add a accent pillow it wil make this chair look so so rich. We love our purchase.", 
    "Taupe matches my living room look. The sloped handles add a classy touch. Slightly firm, but comfortable enough to sit long periods. Instructions to put together may need a little more illustrations. Overall set up took less than 2 hrs. Faster with two people.", 
    "Attractive chair with mid 20th century flair. Fabric is thin and it's a bit firm but overall I like it", 
    "I loved the style. Comfort is great. But the fabric is very scratchy.", 
    "Nice, easy to assemble (with a second person)..Didn't take long at all. The color is great, the seat cushion is a little shallow and not so thick so Im afraid it will flatten soon. If you have kids, scotch guard immediately because any stain will show up. Overall, perfect size for my bedroom seating area.", 
    "Nice surprise since I considered it a risk to order soft furniture without being able to sit on it. The chair(s), I ordered two, are indeed comfortable. They came knocked down and the assembly was easy.", 
    "Sent back without opening. The box was too small for the chairs to be worth the price", 
    "I ordered two of these chairs and the matching sofa in Twilight Blue -- and I love them! They are comfortable, though not squishy -- I prefer a firm cushion -- and they are just right for my 5'2\", with a throw pillow behind my back. The quality is that of a chair at twice the price, and my men said they were easy to assemble. Overstock scores again.", 
    "Great looking chair. Putting together the first chair took a while longer than expected but the 2nd one was much easier to assemble. Cushion is firm however it keeps the chair from feeling low to ground..", 
    "This armchair is mostly as pictured & described. I purchased the Grey Linen color and love it! I stands out nicely against my \"greige\" walls. It's on the firm side, which I prefer, but not hard. The armrests are more comfortable than I expected for the shape. The legs are a black eggshell finish. I would've preferred very dark brown, which I thought is what espresso was. They're a bit tricky to get right so that the correct angle is facing the outside, so double check before securing with screws. I would've preferred a taper with the same angle all the way around, but that's a very minor detail. The piping detail is lovely, and gives it a higher end look. It's relatively easy to assemble, but the legs aren't labelled & are all designed the same (not for specific sides). I had a problem with 1 bolt; I believe the threaded insert in the frame was defective or the angle was off, but managed to make it work. The back is out of alignment maybe 1/8\" or less where it meets the arm but most people wouldn't notice & it can easily be disguised with a throw blanket. I didn't think it was worth the trouble to exchange. The sofa had the same flaw so its probably due to manufacturing. I'd recommend starting with the trouble bolt if you have the same problem. After I did this the others lined up more easily. The wood quality on the inside is very disappointing and inconsistent. Its not built for heavy wear so I'd advise against this purchase for anyone with kids or heavier folks who like to throw themselves or fall into the chair. I had a slightly overweight guest visit who managed to crack the veneer in two of the legs because of this. It appears to be minor damage, but still disappointing. I've had to move many times without help so I like the idea of being able to disassemble if needed for moving. If you can get some extra discounts/rebates its worth the price and trouble of assembly. I honestly expected better quality, so I'll have to baby this piece but I did enough comparison shopping to know its a fair value for the style.", 
    "Beautiful chairs, large and comfy. Very easy to set up, however, I doubt they will be very sturdy in the long run. No screws were used to assemble, just pushing pieces into place. Overall a good buy!", 
    "Better than I expected for the price. The color is beautiful, very sturdy and took less than 2 mins to assemble. And is great for watching TV in my bedroom.", 
    "I bought four chairs for a design center and they shipped fast, easy to put together, good quality in relationship to price. Would like to buy 4 more for the next space.", 
    "I really love the look of these chairs. They look sophisticated, not cheap, but also not expensive. They are great for nestling in with a good book.", 
    "Great looking and very comfortable chair. The color is a bit darker on the grey, but as I was worried it might be too light, I was very pleased.", 
    "This chair looks really good but the legs don't connect well so they kind of shift when you sit down and it feels like they are going to fall off. Also, you can feel the springs in the seat cushion and it isn't wearing well and we've only had it for 9 months. Not worth the price.", 
    "Arm chairs seem sturdy and more comfy than sofa. A little tricky to assemble. Need long arms. Color true. Linen shows all though so don't spill anything.", 
    "Came as shown and are suprisingly comfortable. Assembly was a bit of a pain lining up screws to holes, but if you screw them all in and keep them loose and tighten them all systematically, it will be fine. Very nice piece", 
    "I dont know why this is not 5 stars from everyone. they arrived quick and although you have to attach the sides, it is easy enough to do. We bought the soft blue and they look beautiful in our master bedroom. the filling is not plush but for less than $*, I would not anticipate it to be. they look beautiful in the room and we are thrilled with our purchase", 
    "I wanted to like this chair but the pieces don't fit together well at all. It's so bad there's light visible between the side and the body, which looks really weird. It's a shame, too, because the tawny port color is really nice. I'd return it but it's such a bother to do that. I plan to put it in an out of the way corner.", 
    "Looks good but a little less than the quality I expected.", 
    "The is a beautiful chair. I have put it in my guest bedroom with a small table for reading. It look lovely. Glad I purchased it.", 
    "Great chairs! We totally love these chairs. We have had them almost 2 years and they look great. We sit in them every day and they are the most comfortable chairs in the house.", 
    "Chair is very attractive. If only the quality was as equal.", 
    "Great for a study or quiet library space to read up on the world's problems or sip a drink while chatting it up with someone as you try to solve them. Great look and decent quality. I bought 2 and we love the quality for the price.", 
    "This chair is great quality and pretty easy to assemble. I purchased my own legs and they screwed right in. It's cute and very comfortable too!", 
    "This chair comes in two boxes. The arms are in a separate box. I found the arms difficult to attach at the top. The holes for the bolts didn't line up.", 
    "We bought two of these in grey/taupe and they look exactly like the picture. They look fabulous in our living room. The only thing that kept me from giving 5 stars is that they are so firm you don't sink into them at all. Perhaps this will help them hold up over time, but they don't make them totally comfortable.", 
    "I understand the chair is pretty inexpensive. it looks great and sturdy but you won't think that once you sit in it. I would not recommend if you plan on sitting in it for long periods of time or heavy set. when you sit on it, it feels hollow inside.. I'm scared our kids jumping on these a lot will make the cushions wear out in about 2 years. fabric feels nice. i sprayed with scotch guard. was a little difficult to put together because of the placement of one of the screws inside an arm. one of the 2 chairs is already squeaking, probably because of a loose screw. we have had it for 1 month.", 
    "Great price for a great chair! Loved it! Thank you!", 
    "Easy to put together by yourself, perfect size for our living area. A little stiff, but we are not planning to sit in it daily as a TV-lounging chair. Simple, clean lines, true to color in photo.", 
    "I guess I didn't read closely enough on these and didn't realize we had to put them together. they were easy enough to put together, and look really nice. very 'Mad Men' type of look", 
    "This chair is very nice. It wasn't hard to put together at all and I'm a 4'9 130 lbs. woman. It came in 2 boxes. One for the body of the chair and the other was just the arms. I was seriously confused at first because all I received was the arms. The color is true to form and the chair is comfortable to sit in. Highly recommend.", 
    "Love the perfect grey linen on these chairs. SO easy to assemble. Very modern and adds class to the room.", 
    "was exactly like picture showed. good value for money", 
    "Chair arrived the other day. The color described on Overstock we light tan or light beige. The color I received was chocolate brown. I can live with that but the quality of the fabric is questionable. Looks like it will snag and show wear quickly. Keeping it because I really needed a chair and price was good. Comfort is amazing, so that's a good thing.", 
    "I received 2 chairs in the Taupe color a while back. They are great looking chairs that seem to be durable. I can't believe I got the chairs for such a cheap price! I was worried about the color and the texture of the chair, but I love them! It is said to be Microfiber, but the cut is so close it doesn't make those yucky bum marks when you sit. It has almost a sheen to it. The only complaint is the legs of the chair. They don't look like the picture. They are practically pink in color. I removed them, and stained them to match my floors. Other than that, the chairs are great!", 
    "These are a great companion to the Inspire Q Winslow sofa I purchased. At first I thought too matchy-matchy but then I threw in my accent color and accessories and poof...magic! I love it and it looks great! I am extrememly Happy!", 
    "I love my two new chairs! These were purchased for our master bedroom seating area and they look so good. We did have to assemble and it wasn't easy on the first chair because the allen wrench is small and it hurt our hands to tighten all the bolts. However, my husband cut the tip of the wrench and inserted it in his electric drill for the second chair and it was a breeze. They are stylish and comfortable.", 
    "The chairs are very nice for the price and look really good in the corner of our bedroom.", 
    "I am disappointed in the quality and color of the product. I never even took it out of the box. I am returning it for a refund.", 
    "The chairs are in my front room. A room that isn't used everyday but it is the first room you see when entering my home. So the quality and appearance is very important to me. I'm happy with the color and quality. And I must say even though the assembly required a bit if elbow grease I put them together easily with the pictures and step by step instructions.", 
    "I'm happy with my purchase but, the fabric is not micro fiber as I know it. Putting the chair together was a breeze.", 
    "I am most pleased with this chair. The color and shape are contemporary and fit perfectly into my decor. I had to fight a little to get som of the screws in -- my arms weren't long enough to reach inside the chair! But with the help of friends, we put it together and it looks great.", 
    "Overstock has yet to disappoint me! The shipping was fast and it was wonderfully packaged. It was very easy for my fiancé to put together. I got a big value purchase for half the price-I\u0092m very happy with my new chair! My only complaint is, it is true that the microfiber is not the best quality, but none the less, it is a very comfortable and very sharp looking chair.", 
    "Purchased two and the product was receifved on time and in good condition. One bag was missing a few of the required bolts, but I had something I coudl use to substitute. Overall, the chairs look good and are a good match for the room. Unfortunately, the fabric is not very soft and they are not very comfortable. We are thinking about buying a softer foam for the seat cushion. Because the chairs come unassembled, they would be relatively easy to recvover down the road if necessary.", 
    "The chair is easy to assemble and it looked very stylish in my bedroom. You will probably need a lumbar pillow to dress things up a bit.", 
    "very nice design, very comfortable only problems: one screw hole didn't match and the bad of desiccator balls had broken in shipping, thus making a big mess"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Winslow-Concave-Arm-Modern-Accent-Chair/6223600/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6223600/INSPIRE-Q-Winslow-Concave-Arm-Modern-Accent-Chair-58ea4827-7dc0-42c4-ae8a-748f3468c7a6_600.jpg"
  ], 
  "description": "Sit yourself in comfort on the plush cushioning and soft upholstery\nof this modern accent chair by Inspire. Concaved arms add a trendy\nand stylish flair, while completing the chair's overall comfy\nappeal. Durable and pleasing to the touch, the microfiber and linen\nmaterials resist wear and tear and offer easy maintenance with\ngentle spot washing as needed.Quality crafted from microfiber, wood, and linen to provide\n  comfort and durabilityHigh chair back and concaved arms for added reposeElegant espresso finished wood frame enhances the chair's\n  classy appeal100 percent polyester fill generously pads all resting\n  areasChair measures 34\" H by 34\" W x 30.75\" DSeat measures 18\" HChair measures 34\" H x 34\" W x 30.75\" DAvailable in taupe microfiber, grey linen, twilight blue\n  linen, tawny port red linen and hazy blue linenStyleContemporaryMaterialCherry, Linen, Microfiber, WoodFinishCherry, WoodChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Grey, Red, TaupeFurniture Frame MaterialWoodFurniture PatternSolidGallery MatchYesGallery RoomHawthorne, Michelle's Grey Linen, Plymouth, Seaside Memories"
}