{
  "name": "INSPIRE_Q_Catherine_Parsons_Dining_Side_Chair_(Set_of_2)", 
  "price": "EUR 212.25", 
  "reviews": [
    "I love the look of these chairs. They are also very comfortable. My major issue with this chair is that the bottom is unfinished. I was shocked when putting them together and realized that the seat bottoms were left exposed. Why is this a big deal? Usually there is some sort of fabric covering the bottom of a chair to protect your hands from splintering or staples. The wood used in constructing these chairs is very rough. Splinter city. In addition the huge amount of exposed staples is annoying. Some of the staples or sticking out just waiting to stab someone. I'll have to go and get my own fabric to cover the bottoms. I'd only recommend these chairs if you are patient/crafty enough to cover the bottoms yourself. I purchased 8 and decided to keep them. Not worth the hassle of returning for such a simple fix.", 
    "I purchased four of these chairs for a formal look in my dinning room and they look great. There is some assembly required but overall just a great product. I was skeptical about purchasing a chair I had not sat in but these are very comfortable.", 
    "After reading some of the reviews, I was expecting more work in assembling the chairs. I am very pleased to say we had no problem putting them together. It took my husband about 10 minutes a chair. There were a couple of things he did that made it easier. First he used his ratchet allen-head wrench which is so much more efficient than the tiny little allen wrench provided . Then when some of the holes didn't exactly line up, he got a small awl and used it to line them up - easy peazy!! The chairs are solid and don't wobble at all. They look wonderful in my dining room with my off-white table (also ordered from Overstock). They look very elegant for the price and were exactly what I was looking for. I ordered the dark grey chenille and the color was perfect. I couldn't be more pleased with this purchase.", 
    "The chairs are good quality it took me weeks to find the perfect match however I bought eight chairs two of them were patterns but in the same family and out of the eight chairs , four of them had legs that were around an inch short. Customer service was nice enough to put in a request to send me for additional legs to be replaced. Unable to give you the results on that because I had not received them yet.", 
    "Recently purchased these chairs and have only sat on them once during our Thanksgiving meal. Color is true to the picture and the fabric has an overall nice feel. Really like the slight contour of the back of these chairs, which add a nice flair. The cushioning is sufficient in the back and in the seat and felt very comfortable. Assembly was minimal, my husband attached six chairs in about 30- 45 mins. Very happy with the purchase!", 
    "We looked, and looked for smokey grey chairs for our dining room. We wanted something that is good quality, transitional design, and would work with a rustic, white, distressed dining table. These chairs work and are terrific!Very good quality, extremely comfortable, sturdy, easy to assemble, great price for the quality. I would definitely recommend these chairs.They arrived in less than a week, and in perfect condition.I would definitely recommend these chairs.", 
    "I am very pleased with the chairs. I bought 4 of them for our dining room and they look great. The only down side is that the assembly was a little tedious.", 
    "Style looks nice. Seems sturdy. Stiff feel. One part had an over drilled hole and overstock fixed it right away. Good service", 
    "Lovely accent chair for additional dinning room seating when we have additional dinner guests. Works well with our dinning room set.", 
    "I was a little unsure of these but took a chance ordering online. On arrival, I put one together with no challenges. The design of these was nice and they were even comfortable. But after a week of using, I noticed indentations from where I had been sitting and that the cushion was not holding its shape or firming back up. I was willing to overlook that because the price was so great on these and they did LOOK nice. However, when we tried to put together the remaining chairs, we had problem after problem. The screw holes weren't lining up or drilled correctly and one of the chair legs cracked when we tried to screw into it. After that, we boxed them right back up and sent back. This was a case where you get what you pay for. Buyer beware!", 
    "I guess you get what you pay for. This has to be the most uncomfortable chair and 1 month in the screws keep coming loose. Spend a little more and get a chair that will last. You may save a few bucks, but you will be replacing this very soon.", 
    "Love these chairs, I have no complaints. I searched for neutral chairs for weeks and was so happy to find these chairs. Great price and easy to assemble!", 
    "The order arrived within 2 days. The chairs were very easy to assemble. The value was great for the price. I've decided to order two more!", 
    "These chairs are gorgeous in person. The padding is nice and the chair is sturdy. I wish I need more of them because I would order them.", 
    "Very nice looking. Slightly difficult to get together.", 
    "These chairs look very high end and they are a great value for the price -- I had a broken leg due to a knot and the company is shipping one out right away !!!", 
    "Love these chairs. Bought them for accent dining room chairs and I love the fabric. They look great and are very comfortable.", 
    "Just put these together. They are very firm and comfortable. I've only had for a week but seem very sturdy and not cheap at all.They are not hard to put together.Just because I'm a little ocd I do agree that it could use something on bottom of chair but need access to that area to screw chair together.", 
    "Chairs arrived in a timely manner, well packaged and containing all pieces. The directions are poor but the assembly is not difficult. They are good quality for the price and are able to accommodate a larger adult.", 
    "Very nice chairs. Bought the brown linen and they go great with the table. Fairly easy to assemble. . had one chair that wobbled, but followed the troubleshooting directions and it worked to make it steady. Very comfortable to sit on.", 
    "very stylish and comfortable", 
    "We already had this item in a different color. The gray was what I expected. Nice product, comfortable.", 
    "excellent chairs for the money - they look beautiful!", 
    "Chairs very comfortable Easy to assemble", 
    "Where do I start... Very poor construction quality, creased material, zero back support, seat padding feels like it's stuffed with the same cheap filling used in cheap stuffed animals, not easy to build. Save your money. Go to ****** and pick something up there. I returned same day. So disappointed.", 
    "Chair very nice,i like it", 
    "I bought the chairs as extra-look good - guests reported that they were very comfortable to sit in. My husband reported that these were the easiest chairs he had to assemble and they came with good instructions.", 
    "I purchased the grey linen chairs -- they were slightly darker than I was expecting, but the color looks great in my living space -- I love the look of the chair, but they are obviously a $$$ product -- other reviewers commented on difficultly putting them together, I agree, make sure you have a hammer to fix the wobbles -- also, the fabric seams are a little off on two of the four chairs I received -- not something you would notice from across the room, but something I have noted when using the table.", 
    "The chairs fit well at our table and look good. My husband said they were hard to put together and they do bunch a little where the seat meets the back. But otherwise, we are happy with them.", 
    "Bought 8 of these for our dining room and they look great", 
    "These chairs are good value for the money if you are mildly handy and patient with the construction. They are better quality than the furniture made for big-box stores without the expense of luxury woods or fabrics your home may not need. ASSEMBLY – Overall, this took me 75 minutes, with about 10-15 minutes per chair once I started. There can be a bit of difficulty in construction, however, most people with any patience should be able to solve the problems. The majority of my issues came from their using a hot press to cut holes through the fabric. This not only caused the holes in the fabric to be undercut, but hardens the fabric as it melted. As the fabric will enter the hole, this caused a bit of frustration when screwing in the eight bolts that hold on the legs. The manufacturer, to their credit, discusses this in the troubleshooting section of the instructions. I found that by cutting away excess fabric around the bolt holes first, assembly is smoother. I did find that assembling the chairs as directed was more difficult. The instructions want you to lie the chair on its back. Instead, I elected to go with a different…position. To do this, turn the chair upside down on a table and hold the back of the chair against the table edge with your body. Then attach the seat to the back. This way, I was able to see the bolts and ensure they entered cleanly. If you do it right, you should have an easier time assembling the chairs and find yourself mildly aroused. One area the chairs are insufficient is tools. The allen wrench provided will suffice if you milk a lot of cows or are a bending robot. I suggest buying a $6 set of hex bits and using a power drill to reduce frustration. Also, be sure to clearly identify the bolts, there are three different lengths with the same diameter and heads. ADJUSTMENT -- Now, the manufacturer is correct in that you should not fully tighten the bolts at first. As the legs are attached only in this manner, they can end up at different angles and will need adjustment. Some people have indicated that the legs are different heights. While possible, it is more likely the legs are simply moving in their sockets when the bolts are tightened. You can eliminate most “rocking” issues with another erotic pose. Place the untightened chair on all four legs and a solid surface. Now lay across the seat on your stomach with as much of your weight as possible on the seat. Unloosened, you will feel the chair legs splay slightly. You will also be able to see up under the bottom of the chair and use your arms to tighten and loosen bolts, coming back to any that cause the chair to start to wobble. With eight bolts plus three in the back for adjustments you should be able to get fairly close. If not, have someone spank you while you work. For more details, pick up a copy of Cosmopolitan magazine. Any issue should do. MATERIALS -- Once together, and adjusted, the chairs were solid. The bolts included are 3/8 to 1/4 inches in diameter and hold it firmly. Although the wood underneath is un-sanded it can be – you guessed it – sanded, in case this is a concern. What you should know is that the legs are made of rubberwood, a tree that is solid but with a slight grain and lightweight. This is great if you like a smooth finish, however, the chairs will not have a lot of weight. We chose the light gray linen finish. It is nice and feels like a higher end fabric with good texture and nice color. It is smooth enough to be wiped clean but cannot be removed for washing. Also, it feels soften than canvas and stronger than wool. Think of a decent throw pillow. Do keep in mind that in different light, the lighter threading in the pattern will change in tone. In most cases this is good because it makes the chairs adapt to their surroundings. Our 2700K dining room lights makes them appear like a brownish gray, while they are more like the picture under our 4100k kitchen lighting. FEEL -- Most importantly, the cushioning on these chairs is pleasantly firm. I write this because this was the greatest concern and difficult to determine from a picture. Without a caliper, it is difficult to convey, but perhaps they should incorporate time-lapse pictures of ten year old children sitting in them to compare figit-ation and expressions from chair to chair. A person under 200lbs will not feel the frame of the chair when sitting, and find the back is well-cushioned, too. Do note, the chairs have a 250lb weight limit – a drawback of lighter woods and likely a bit low to prevent injuries. Keep this in mind in case reading Cosmo gives you any other ideas. Finally, we purchased these at around $$$ per chair. I think that is a great price for the quality. With care, I estimate these will last ten years, although if you have longer needs, you may wish to go for something more expensive. I would recommend them for those looking to introduce nicer furniture in a home with a contemporary look that is both warm and comfortable.", 
    "Quick ship, nice product, easy to put together.", 
    "Easy to put together, looks great, sturdy... but budget a while to tighten them *just so* so that they don't wobble. You need to set it up (but not tighten), then sit on it and like bounce your bottom on it (or have someone heavy sit on it) and then go back and readjust the legs. It takes awhile but pays off.", 
    "Super happy with these chairs. They match perfect and are very comfortable.", 
    "Not that easy to assemble. Not something to pass on to heirs. But looks good and is comfortable. We probably will not use these more than once or twice a months so are perfect.", 
    "Loved the chairs and gifted them to a friend who wanted black chairs.", 
    "I got my chairs yesterday! LOVE them. Well packed and easy to put together. I bought the Grey Linen and they are even better than showed on the pictures. I wish I could upload here a pic of my dining room. These chairs matched my \"Greyson Living Amia Espresso Dining Table with Removable Leaf\" perfectly....", 
    "Very easy to assemble. Looks great in our dining room.", 
    "I bought these for my new house because my old dining room chairs were broken from being moved several times. The chairs are beautiful, the material sturdy (just what is needed with young children in the house), and my family all thought they were comfortable. The only small issue that we had was that it was a bit difficult to line up some of the pieces when putting them together - particularly the seat with the back of the chair. Despite that being a bit finicky, the rest was simple and I am very proud of my dining room.", 
    "Look Great in my dinning room! Very easy to put together took about 20 min. per chair. Comfortable to sit in.", 
    "The appearance is lovely. The comfort of the chair is not what we had expected. We spend a goodly amount of time at the table because we believe meals should not be rushed. They begin to feel hard and rather rigid. They are easy to keep clean with foam Woolite upholstery spray and after it is dry I seal it with Scotch gard, Guess I should have chosen a different style. Will Next time.", 
    "The quality is great for the price and love the color", 
    "The chairs are quite comfortable in fit in very well with transitional furnishings in an Arts and Crafts bungalow. They were easy to put together, but I did have one chair with a hardware issue that Overstock quickly resolved. I am happy with the purchase and would buy again. I purchased 3 sets, or 6 chairs, along with an Art Van dining table and they look like a set, even though they were not.", 
    "These chairs are a great buy for the money. Very comfy and easy to assemble.", 
    "These chairs look very chic but......extremely hard to put together. the wood under the seat is not sanded or finished in any way, I also had to return a pair as the nail's did not line up. I am keeping my fingers crossed that the next pair work or will be returning all 4 =/ The lady I spoke with to assist me in my return was lovely!, will post and let you know how I go on....", 
    "They look great. They are holding up to messy eaters, wiggley. The assembly was challenging at times, as I had to get the angle of the hole just right. Had to request one chair leg to be replaced as the hole for the screw wasn't big enough.", 
    "I had read a few reviews that people had issues with putting these chairs together. Ours went smoothly. They are not very heavy, expensive chairs. They are extremely light. One was a bit wobbly, but I simply added one of those chair-leg-sticky-felt-pads to make all the legs even. They look fantastic and are very comfortable. very happy with this purchase.", 
    "I bought 3 sets of these chairs to complete our dining room and they look really nice. I got the grey color and I must warn you that they're a really light grey. I expected them to be slightly darker but no big deal. They look more expensive than they were and they are comfortable to sit on. So far I have no complaints.", 
    "The chairs are sturdy and love the thickness of the cushions. Fabric is a great quality. Our only issue was lining up the screw bolts to attach the legs... took us a while to figure out an easier way to do it. Once we figured out to put the bolts through chair holes first and then match up the legs, it worked like a charm.", 
    "I bought the gray chairs and they look beige not gray at all. I would send them back if I hadn't already put them together.", 
    "waiting for the color I need to order more. Once we decided on the right shade of Grey, they don't have it in stock. Hoping for it to come back! Great chair for great price!", 
    "These chairs are beautiful once they are together, however we had a huge issue with the fabrication of them. Out of 4 chairs, only 1 was pre drilled accurately. The middle screw that needs to go into each chair could not be put into 3 of them because the hole was either too low or too high. Unfortunately, at this time I cannot review their durability because we haven't had too many people sitting on them. We are crossing our fingers that no one sits down and has one collapse on them.", 
    "Decent chair. The hand tool provided to assemble the chairs are a joke. Once put together, they look alright.", 
    "a little difficult to put together (per my husband) but they look great once assembled!", 
    "Very pleased with the color and fabric. One chair took a little longer to put together. After we put soap on the screws they went in easier.Very pleased with them.", 
    "Nice chairs for the price. Not the easiest to put together but it got easier by the time I finished the 4th chair. The fabric seems nice but the stitching on the back is not even and in one corner the stitching seems about to come undone and there is a rip in the fabric on the front corner but it is small and for the price I paid it was not worth returning them. The frames seem sturdy and I should get several years use out of them. If you are picky and expect perfection then pass on these chairs. If you are looking for a comfortable chair that feels good and looks good unless you look too close then this is a great chair especially for the price.", 
    "I love them! The quality is good for price. matches and height is perfect!", 
    "I sometimes disregard the reviewer whom posts a 1 stars, but don't. These chairs are absolutely not worth it if you care about quality or appearance at all. I can’t imagine what the various other reviews are referring to when they say \"good quality\". I wish I could have uploaded a picture of the bottom of the chair. Sales would stop!It only took 1 minutes to open, the surprisingly small box for 2 chairs, to realize I was returning these chairs. The first thing I noticed was the splintery split low density (what I thought was pine) seat frame. You would think the wood would frame the seat, extend to the corners, and try to be a piece of furniture to last a few weeks. Instead, after turning the seat around a few times to look at how these assemble I noticed foam blocks in the 2 front corners. Not a high density foam, but a 1-1/2”x1-1/2” block of the bead foam type that will break up and leave small white kernels around your house. Between the foam and the fabric of the seat is soft very flexible plastic. The corners are the most important and likely to be damaged areas of furniture and it is made of plastic and foam. The description does not mention the seats structure is made of foam and plastic.The color is also more dark-blue-gray than dark-gray. Sometimes I have seen this color called “sharkskin”.I am so astonished I am really nervous about trying anything else from Overstock.", 
    "easy to assemble and great quality. good price.", 
    "We ordered 12 of these chairs for our new place and they look great. Assembly is fairly easy.", 
    "Other than there being a few flaws in the fabric....these were great chairs", 
    "I loves these chairs. They look great with the glass table I purchased. They are good quality and look very nice. The only reason I am not giving these a 5 is that the assembly was somewhat of a pain. The screws didn't screw in very well in the pre-drilled holes.", 
    "Received these in grey fabric and they look great with my dining set. (Got them to contrast with the INSPIRE Q grey chevron bench and chairs) The fabric is not itchy or irritating to the skin and the stitching in the back is tailored well enough not to look bad from that angle. In fact, we've been sitting in them in the living room while awaiting a sofa for the past 2 weeks and they've held up well with decent cushioning and back support. You have to attach the legs yourself when they arrive. It took us 45 minutes to put together the first one, but only 10 for the second one because we picked up some tips: Flip the chair over. place all the legs in the holes BEFORE screwing any of them in. This makes it easier to line them up to the holes and make sure you have the fabric laying the way you want. After attaching the legs, they may seem very uneven, but flip the chair over and SIT in it for a while. Your body weight will allow the chair to settle and you probably won't even need to do the mallet trick that is included in the instructions to even out the legs. Great value, sturdy, easy to move.", 
    "I looked so hard online to find the perfect chairs for my dining room. I'm glad I chose these chairs. The color beige against my dark bamboo flooring made the room elegant and cozy. The chair is light and easy to move around. Fiber is linen and looks easy to clean by just wiping immediately with a damp cloth soaked in dish soap and water in case you accidentally spill food or beverage on it. It's everybody's favorite place to hang. The price was great!", 
    "Nice, clean lines. Comfortable to sit on, but not incredibly sturdy. I think I'm going to have to tighten the bolts periodically.", 
    "very nice chairs...love them", 
    "For the price I got them, it's amazing. Very happy", 
    "Nice looking inexpensive chairs. Construction quality is so-so, but easy to assemble. My major complaint was a musty, moldy odor. The odor permeated the cardboard cartons, the plastic inside and the chairs themselves. Three days outside in sunshine and air helped.....then Febreeze, which did the trick.", 
    "The color was much darker than the picture and not what we expected. The fabric looked cheap and of poor quality. We returned them.", 
    "These chairs don't assemble. Holes don't line up so you can't even assemble them. Of the 2 chairs in the one box both had the same issue in different places. Defective. Save yourself the trouble of bulky item returns and don't bother.", 
    "Beautiful and inexpensive. The test will be how well they hold up before I have to retighten the legs etc... but for now they look great and are very comfortable.", 
    "Very comfortable. Nice lumbar support. Easy to put together. And they look great. One of the chair legs came with a defect and the vendor was quick to send a replacement.", 
    "The chairs were a good price, but I ended up returning them due to color. The description listed them as light gray, however to me they looked like black and white denim. I did not assemble the chairs so I cannot attest to their durability, etc. They seemed like fine chairs, just not what I was looking for.", 
    "Nice looking. A bit of a pain to put together"
  ], 
  "link": "http://www.overstock.com/Home-Garden/INSPIRE-Q-Catherine-Parsons-Dining-Side-Chair-Set-of-2/8551231/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8551231/INSPIRE-Q-Catherine-Parsons-Dining-Side-Chair-Set-of-2-7eb38ce2-93a5-4c38-9d2d-53a0b7574f4d_600.jpg"
  ], 
  "description": "Combine these Inspire Q Catherine Parsons dining chairs with any\ncontemporary table for an inviting dining room decor. The beautiful\nlinen upholstery and espresso finish on the wooden legs create a\nmodern look that adds a touch of luxury to any dining area. This\nset of two side chairs feature soft upholstered cushions for\ncomfort and a high back height for support. Set includes: Two (2) side chairsMaterials: Rubberwood, fabricFinish: EspressoUpholstery materials: LinenUpholstery color option: Dark grey fabric, light brown linen,\n  grey fabric, dark grey chenille, tan chenille, beige linen, dark\n  grey linen, grey linenUpholstery fill: Spring, foam       Seat Height: 18 inchesSeat Depth: 17 inchesBack Height: 21 inchesOverall Dimensions: 38.5 inches high x 19 inches wide x 23.75\n  inches deepStyleModern, NauticalMaterialLinen, Rubberwood, WoodFinishGrey FinishChair TypeAccent Chairs, Dining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBeige, Brown, Grey, TanFurniture PatternSolid"
}