{
  "name": "Insta-Lock_Queen-Size_Glided_Bed_Frame", 
  "price": "EUR 75.80", 
  "reviews": [
    "I liked that this bedframe came with stationary feet instead of wheels, which helps the bed stay in one place. However, it looked a little flimsy when It was all put together. Really, putting the box springs in the frame seemed to help strengthen the frame overall. The feet are plastic and I was a little worried about the quality, but so far so good. I've been using it for a week with my queen sized bed and I've had no trouble with it so far. One thing, though...just like another reviewer said, the middle stabilizer bar needs to be bolted to the bed frame and the bolts/nuts did not come with the frame. Luckily I had some laying around.", 
    "This is a new frame for me. All my prior frames had a weird bolt system the held the cross bars into place where you had to slide on the L-shaped bolt and then tighten a screw with pliers. Lots of trial and error in the beginning because you had to make sure you didn't set it too wide or tight for your mattress. It would loosen every few months and the frame never felt sturdy. Simply, this is just a snap and lock crossbar system. It has a diagram on the frame to tell you where to set it for a queen bed, so no guess work or measuring to get a perfect fit. Once locked, it doesn't wiggle or rattle. Once the frame is locked into place, you do have to add a center bar that attaches at the ends with a stardard nut and bolt, but it is very easy to attach. The added bonus is the attractive and sturdy leg caps that offer height, a sturdier platform and help prevent the old standard hard metal stub legs that are part of frame from harming and digging into any floor, and scratching surfaces, such as wood or tiled floors, beyond repair. A must have frame for all beds. Even if you already have a beautiful bed set, but have the old style frame, I recommend an upgrade to this frame.", 
    "This does the job. I like that it has a support in the middle and that it is on feet rather than casters. It was very easy to put together, but it was a little crooked. It doesn't really affect the bed, but there is a little space on the top of the right hand side and bottom of the left hand side (picture the frame as a parallellogram instead of a rectangle) You barely tell and a bedskirt hides it completely. I believe it still holds the box spring securely. Also note this bed frame is adjustable to Twin or Full size.", 
    "This bed frame is well made, easy to assemble, and It was shipped quickly", 
    "Frame is as advertised! A simple but (at least for now) durable frame. It was very easy to assemble,sturdy and the feet fit well with no problems. Hope this helps.....", 
    "Easy to put together, cheap, and worth it.", 
    "Very easy to assemble. I'd prefer rollers. Sometimes the plastic feet shift which means they can actually come off.", 
    "For the price and what I need it for it does the job.I feel like it's sturdy and it was very easy to put together.", 
    "Super easy set-up, great frame that works well.", 
    "Bed frame was very simple to put together. Fits on headboard perfectly. No issues.", 
    "the frame would not fit a queensize mattress which I also ordered from you.We had to take it to a machine shop and have new frame constructed.Needless to say, It was an expensive venture.", 
    "Put it together in 5 minutes and attach to any headboard. Works great, although pretty low. I will probably buy risers.", 
    "The bed frame arrived twisted/bent at one end and the coating was flaking off of the metal. After some rigging it was functional but still not level.", 
    "Needed one fast so bought one at Big Lots. Same price, so that is why the value is \"good.\" It is so simply to put together and does its job.", 
    "Very easy to install and assemble.", 
    "great find hold the bed up", 
    "Very pleased with this frame. Well made too.", 
    "The frame is sturdy and very simple to put together!", 
    "Very sturdy fits my bed perfectly", 
    "Came in a timely matter. Easily put together works fine.", 
    "Very easy to put together and fast delivery.", 
    "This bed frame is solid, assembles in minutes, and connected easily to the headboard I purchased through Overstock.com (Christopher Knight Home Bingley Adjustable Beige Fabric Headboard). No problems with the mattress set fitting. The complete bed feels strong and doesn't move around when used.", 
    "Just what we were looking for.", 
    "The item is as ordered and it came very promptly!", 
    "this was simple and easy for my college student to put together on heer own-the way they move around so much it's a cinch for her", 
    "Sturdy, 2 wheels lock-can't beat the price!", 
    "Would recommend to anyone. Sturdy.", 
    "Excellent Bedframe and better price than all brick and mortar stores!", 
    "I needed a old school metal frame, So I bought this one from overstock, it came way sooner than I expected it price was the same a everywhere I looked, the quality is great, it's quiet and solid.. I'm happy with my purchase before I had a wooden frame (which is not good to sleep on) that had me in bad back pain and the wood broke...", 
    "Very happy with my decision to purchase this frame. Easy to put together and well made.", 
    "Has worked well. Was easy to put together.", 
    "Seems like sturdy frame, have had no problems with it.", 
    "Has extra bars for strength. Easy to assemble", 
    "Easy to put together and great price", 
    "Husband put together in no time. It holds our mattress in our guest room perfectly.", 
    "This frame was really easy to assemble. It is very sturdy.", 
    "Best frame ever!!!!! love it the support is amazing . It does not move around who you are moving in bed!!!", 
    "I bought this for a queen size headboard. It went together quickly and fit perfectly..", 
    "It's a bedframe. It was easy to assemble and works the way it is supposed to.", 
    "Good quality; sturdy; plastic leg tips though and easy to break...", 
    "This was exactly what I wanted but I am familiar with these kinds of frames. Helps to know how to assemble.", 
    "Arrived quickly with all required pieces. Easy to assemble. Would recommend this product.", 
    "just a peach of a frame. I sleep on it everynight. can't wait to get back in it tonight. a real honey of a frame.", 
    "Sturdy bed frame ease to assemble.", 
    "Standard frame. Easy to assemble", 
    "Do not purchase this frame! The leg bent within 2 months of use- terrible quality.", 
    "Easy to put together, sturdy frame!", 
    "I purchased this frame to attach to a headboard and it is well made and I'm quite pleased. set up was easy.", 
    "Very pleased with this frame a great value.", 
    "We purchased two of these for our shore house. They do not make any noise and work nicely. I would highly recommend this item.", 
    "This arrived quickly and there is enough room now to put tubs of items you don't have room to store.", 
    "Decent bedframe and easy to put together. Missing a nut, gave me extra bolt instead, had to hunt for an extra nut in my tool box to secure the support. Over all good value for the money.", 
    "Easy to assemble and move about the room. My queen sized box spring and mattress fit perfectly. It was missing a screw but that's nothing that couldn't be fixed. I would repurchase this product again", 
    "i replaced my old bed frame with this one and it feels like I have a new mattress.", 
    "I needed a bedframe and this one works just fine if you need something simple and easy.", 
    "Basic frame -- great for college boy. It was quick and easy to assemble.", 
    "I was very disappointed to find product was bent once I removed it from packaging", 
    "Solid and Secure. Easy to put together alone.", 
    "Does the job! Easy to put together.", 
    "not one of those cheap one's. glad to have it", 
    "Seems to be working great", 
    "Just what I needed to set up my grandsons new bed!", 
    "Not sturdy as queen. Wobbly.", 
    "Previous experience with standard metal bedframes has been squeaking, but this one really does lock in place and stay there, thanks to the plastic (albeit kinda ugly) feet. We used a 16-inch bedskirt to cover it, which was about an inch too long. It is rather low to the ground.", 
    "No problems with this! Easy to set up, no problems since. I have not tried to connect a headboard or footboard, so I can't speak to how well it works with other pieces, but by itself, it's great!", 
    "Product As expected. Costco sells similar product. Overstock had a better price.", 
    "When I put together and placed bed on- the end of the bed (Queen) sticks out. The frame does not support enough- and when you sit on edge it bends a bit. It is for a guest bedroom, so it is ok. I wouldn't buy again.", 
    "It serves its purpose. Good job", 
    "Easy to Assemble and sturdy.", 
    "We found this frame easy to put together and it connected to our headboard without a problem. We have been using it now for about 6 months in our guest room. Very happy with our purchase.", 
    "Extremely easy to put together!", 
    "Easy to assemble and queen mattress fits perfectly.", 
    "Took me and my boyfriend 5 minutes to set this up. Its very sturdy and looks great!", 
    "This is a perfect frame for me. I love that it doesn't have the coasters. If you need to move it it's easier for it to glide across the floor/carpet than to roll. When you hit your toe on this it doesn't hurt nearly as badly either. :)", 
    "The wooden slats on my son's bed broke, so instead of replacing them we got this. Much sturdier. He and I assembled fairly easily. If you're putting it inside an existing frame, be sure to measure. Just fit within ours.", 
    "Sturdy. Well worth the purchase.", 
    "Great service, delivery, setup.", 
    "Was really easy to put together & Holds my bed in a firm position", 
    "I like it much better than the metal frame on wheels.", 
    "While this bedframe is easy to assemble, it is not the best quality. Also, it doesn't stay firmly in place when you get in bed. It shifts all the time and I find myself constantly pushing my bed back into place. Ultimately this may ruin my floor and I'm not too happy about that. Stay away from this dud.", 
    "This is exactly what is described. The bed frame was easy to assemble (a lady by herself in about 20 minutes). It seems sturdy. It's all metal except for the feet you insert at the bottom.", 
    "It took less than 5 minutes to set up. Nice quality!", 
    "Easy to put together. Shipped quickly.", 
    "It is what i expected. Simple but does what you need. So far seems durable. Adjustable in size if with the middle beam changed", 
    "Nice frame easy to put together.", 
    "I put this frame together and it took no time at all. It is sturdy without being inordinately expensive. Definitely got my money's worth. Shipped quickly and arrived fast.", 
    "Average, was missing a part.", 
    "The item arrived beat up, missing screws and bent at the right corner, we weren’t able to use it. Obviously this was a mistake when it was sent out. I called Overstock, they apologized and sent out another one.", 
    "Arrived on time, in reasonable condition, box was a bit beat up, but overall frame was in good shape. One flange where headboard attaches was a little bent, but could be straighten by bending with pliers. Weight seems a little flimsy and footings are plastic, so I hope they don't crack. But in general, easy to assemble, and hopefully will serve it's purpose reasonable well.", 
    "No problems with delivery or assembly.", 
    "So this frame offers a couple of ways to connect to a headboard. Problem is, they don't send you the hardware that fits the frame!! So I had to go to a hardware twice to find something to fit! Assuming I bought the headboard and the frame from here, I was more than ticked I couldn't assemble! Who sends a bed frame with no hardware that fits the frame? UGH", 
    "Bedframe is adequate. No frills will do until new bed frame is purchased.", 
    "It was worth the money, worked great. Just wished it had wheels.", 
    "I like the fact the this frame did not come with wheels but I was expecting some thing a bit more sturdy . Once set up, it did the job and holds the the bed frame and bed firmly in placed . Unfortunately, the delivery staff was somewhat reluctant to set up the frame.", 
    "The extra bar in the center really helps support the mattress and box spring and makes a big difference. Easy to set up. Fast delivery.", 
    "Works fine and easy to set up.", 
    "GOT IT TOGETHER IN FIVE MINUTES", 
    "The bed frame is very convenient, easy to install and not expensive. I am pretty much satisfied with this purchase.", 
    "Needed a new bedframe when I got rid of the head board. This is sturdy and was easily assembled", 
    "Perfect. This was exactly what we wanted, easy to put together.", 
    "Good frame for the money. Easy set up. Feels sturdy.", 
    "This bed frame is a great value, easy to put together and sturdy enough to hold my boxspring and mattress,", 
    "Easy to set up and use right away! Definitely worth the price.", 
    "We bought this frame for my daughter's third floor apartment bedroom. It arrived before schedule. It was packaged nicely.It was easy to move upstairs and set up.", 
    "This frame is solid, sturdy, and very easy to assemble. I just upgraded to a queen-sized mattress and was looking for a basic frame to use. This gets the job done. I would give it a higher rating, but when it arrived, the end pieces where a headboard would attach were badly bent. I decided to keep it because the frame is still usable and I'm not planning on attaching a headboard to it anyway, but i wish it had arrived in better shape.", 
    "One would expect a heavier, better made product for the price paid on this item.", 
    "Easy to assemble, however, the metal heads that join head board are not made to fit properly. I had to hammer my unit to fit a head board I bought through overstock. The only reason why I am giving this a low review was i had asked overstock product \"customer service and they advised that it was going to work with the unit I was buying. It still worked but I don't think I can use piece again.", 
    "Never had a steel frame before, but, I am very pleased with this one. Very sturdy and the middle bar gives you that added stability. It doesn't creek or make noise. Very happy with purchase.", 
    "This arrived earlier than I had expected and took no more than 5 minutes to setup. The Insta-Lock is the only way to go.", 
    "A very sturdy bed frame, a good value for the money", 
    "The only reason I didn't give this a 5-star rating is that it squeaks at the END of the bed. (Like if you sit or even lean on the end of the bed.) It seems solid and sturdy and definitely stays in place.", 
    "The quality of the metal in this frame if good. Not flimsy. Easy to set up.", 
    "Nice frame, easy to set up. Seems a little expensive, but I like the footing vs. wheels...", 
    "SUPER EASY TO ASSEMBLE, GETS THE JOB DONE = ) LOVE LOVE LOVE", 
    "Bedframe was exactly as advertized and fulfills intended function. Was dubious about strength of plastic floor supports but they are doing the job with approximately 500 lbs of sleep load. Easy to assemble and box spring fit exactly. Bed is perfect height off floor according to my wife. Would recommend this product to others.", 
    "This frame is easy to put together and works just great.", 
    "This bed frame is a good buy, I was surprised that the quality is really good for the price.", 
    "Missing bolts to make it functional. Too much trouble to return.", 
    "Unfortunately, even though this item had good reviews - the actual bed frame I received looked like it had been used - maybe for a mattress made of concrete perhaps. All of the paint or finish on the frame had been scraped off, and the corners which support the mattress were bent. Maybe they were supposed to be bent, I am not really sure. There were also metal spurs here and there, and so I decided to return it and buy one from another company because I was not sure that the replacement would be any better. I feel that if they let this one go in this condition, the possibility of getting another dud was pretty good. PLUS, I now have to hold onto the one I received for two weeks until UPS decides whether or not they want to see it, and after two weeks I have to dispose of it. I am going to bring it to good will because I don't want to pay to bring it to the local dumping ground. This transaction was the first \"pain\" in a long time. Otherwise Overstock is still pretty good.", 
    "While the bed frame itself feels sturdy, the main reason I had for choosing this model was that the information stated this would accommodate both a headboard and footboard. Technically this is true, but you have to purchase footboard extenders separately to attach to the frame if you have a footboard that you want to use. Had I known this in advance, it would have saved me much frustration.", 
    "I had gotten this because my husband and I just moved into our first apartment together and had virtually nothing. This frame was so easy to assemble and it looked exactly like it did in the picture on overstock. This frame feels solid and not flimsy at all and we of course use it every single day! I love this! The price that I paid for this item was totally worth it and I am sure that I will have this for a long time to come!", 
    "The bed frame was delivered before we expected it! It was easy to put together, even tho it didn't include directions, and it only took a few minutes to get it together! We are very happy with this purchase!", 
    "I had this bed frame delivered to my son in Fla. It arrived on time he had no problem in assembling the frame.", 
    "Had this for 7 months now. Works fine. So far so good. Easy to assemble. When I have to change sheets for the bed or move it, it's easy to push/pull.", 
    "This bed frame was nice and easy to put together, and does exactly what I needed it to do. I'm happy with it.", 
    "Needed heavy duty, so far fits the bill. Easily assembled and durable.", 
    "This is a nice frame. Very easy to put together and its very firm.", 
    "the center support leg does not touch the floor when unoccupied. I couldn't tell you if it hits the floor when I am in the bed", 
    "I am very happy with this bed frame. It is easy to put together and is very sturdy. Shipping was prompt. It fits my queen size mattress and box spring perfectly and is also adjustable. The glides don't scratch my hardwood floor, and they also stay in place. Highly recommended.", 
    "Was exactly as described. Same product the mattress stores sell for over $100. The only thing I wish would have been included was caster wheels. If you don't plan on moving your bed around, this is perfect as it keeps your bed stationary. This is a nice, sturdy frame.", 
    "I went to Lowes Home Improvement and bought 5 swivel bed casters, and mounted the head up high enough to clear the carpet and i can move it out by myself to vacuum under it", 
    "The frame is well constructed and easy to set up. Good value.", 
    "This is a good quality frame. Nothing too exceptionally wonderful, but a good buy.", 
    "I had to set this up by myself and I had no problem. I used bed risers as well with the frame and have had no problem. I am not sure what the other reviewerr who said this item was not sturdey is talking about. It is plenty sturdy. Overall a good value.", 
    "this was so easy to put together. the middle support keeps the mattress firm with no sagging.", 
    "I was within a week of moving and last minute decided to order this bedframe. I ordered it on Monday and Wednesday it arrived. I'm very pleased with the simple, sturdiness of the frame and the ease of assembly. Once again a wonderful product and superb customer service with Overstock!", 
    "This bed frame was similar to many other metal bed frames we looked at. Simple to put together and put in place, seemed supportive. However, we have a split queen boxspring and this frame did not support it, our fault. Description stated it was only 70\" long which we didn't catch, so there was no support bar at the end of the boxspring as a result when we sat on the edge of the bed it tipped up and the boxspring bent at the split.", 
    "great frame for the price. iam a big believer i the big O. i keep returning every time i need to purchase anything. we just relocated from texas to NC and bought a new house-needless to say -lots of stuff to do.", 
    "Works for me...compared to my old frame which made me feel like I was sleeping on an angle.", 
    "I would strongly recommend this product. It was very easy to assemble. I am a 61 year old female, and not in great physical condition. It has been very sturdy also, as I am about 100 lbs overweight. I am very happy with this purchase.", 
    "Very quick shipping, very easy to put together, nice sturdy feel. I bought this frame and a 4 inch memory topper to add on to my existing 15 year old mattress and box spring, Can't beat the price . Like having a brand new bed. Best sleep ever. Highly recommend--", 
    "Easy to put together. My frame came with all parts needed to assemble. Other reviews described that it did not. Pleased. Thanks!", 
    "easy to put together I added extra bigger sliders on legs for easier moving", 
    "This frame is very solid and easy to set up. Price is cheaper here than anywhere else I found.", 
    "Goes together easily, I did it by myself in about 7 minutes. Works perfectly and any headboard can be added at a later date and attached.", 
    "Nice price point for this queen size frame. Frame has center support which is good for larger beds. Frame does not have wheels, but included plastic slides which work well on carpet, but not sure how this would hold up on a hardwood floor. Height of frame base is about 7\" above floor, leaving the mattress at about 24 inches high.", 
    "This product is very easy to put together and has a very good fit to a queen mattress set. The only thing that was not included was material to contact to regular headbroad had to come up with these nuts and screws to finish.", 
    "This is a good frame and would buy it again. Easy to set up and make fit the box springs.", 
    "Very easy to put together. Seems to be very sturdy. Very happy with it so far.", 
    "My son was able to put the bedframe together in a few minutes. He love the sturdiness and support the frame give to the mattrew. Highly recommend other to purchase the product.", 
    "it was just what I was looking for, easy to put together and arrived quickly", 
    "This is a wonderful mattress frame. It arrived within two days of ordering, as is always the case with Overstock.com! It was quick to set up and I love the ease of moving the bed with the rolling casters. Great buy.", 
    "THIS BED FELT SO COMFORABLE AT FIRST THEN AFTHER ABOUT 3 MONTHS I STARTED TO HEAR SPRINGS POP AS THE SPRINGS STARTED POPING THE BED STARTED TO SAG SAGGING SO MUCH I HAD TO PUT PILLOWS UNDER THE MATREES SO I WOULDNT ROLL OUT THE BED THE CUSHION IS NOW BUBBLEING UP I BELIEVE IF THEY WOULD HAVE PUT BETTER QUALITY SPRINGS THIS WOULD OF BEEN A VERY NICE BED"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Insta-Lock-Queen-Size-Glided-Bed-Frame/5770652/product.html?recset=0033ba65-6466-4b07-bdbb-5908a477f947&refccid=YOWH5SWMM26YN2CFP4G5MAXVE4&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5770652/Insta-Lock-Queen-Size-Glided-Bed-Frame-8795faf9-1b6c-4122-a0f4-cb6bd1126737_600.jpg"
  ], 
  "description": "Give your bed optimal support with this Insta-Lock Queen-size bed\nframe. The frame is crafted from solid, durable plastic with a dark\nbrown rust-proof finish, offering style and function. The\nQueen-size bed frame features three sturdy cross-to-cross support\nbars that glide easily to make adjustments before locking securely\ninto place. Convenient glides on the bottom of the frame make it\nsimple to move the bed around your living space. Size of bed frame: QueenType of bed frame: Insta-Lock with side-to-side cross\n  supportColor: Dark brownMaterials: Angle iron, five (5) 2-inch plastic glidesFinish: Rust-proofDimensions: 7.5 inches high x 60 inches wide x 70 inches\n  longDelivery options: UPS GRND, 1D, 2D, 3D SelectMaterialMetal, PlasticFinishBrown FinishBed StyleRegular BedAssemblyAssembly RequiredColorBrownFurniture PatternSolid"
}