{
  "name": "Jai_Ash_Sofa", 
  "price": "EUR 309.72", 
  "reviews": [
    "I am so disappointed, I bought this for my daughter and her husband for their wedding gift and after less than a month it looks awful. It was very difficult to put together, sags already, cushions can not be flipped because they are only covered on one side....horrible. I would love to get my money back and try something else. I have purchased other furniture from Overstock, and all has been great. This one fails all test. Such a waste of money and it saddens me the kids will not have a quality couch for awhile. I am not usually one to be so upset, but just horrible.", 
    "The in-person version of this couch doesn't look nearly as cool/glam as the website makes it appear. It is a very dull gray and it is made super on the cheap. The cushions are already showing signs of wear after only a few days of owning it. The arms are only padded on the inside and completely hollow on the outside. The wood is also super cheap and arrived slightly dinged up which didn't help. I bought this couch because my other one wouldn't fit in my new apartment and I plan on tossing this one after I move but if you are looking for a couch to last you a while, I wouldn't recommend this one.", 
    "We love our new sofa! It is exactly what we were hoping for when we ordered it. It arrived in 2 boxes with good picture instructions on assembly and my husband and I had it assembled in about 10 minutes. The color is quite nice, a tad darker than the picture online, but very similar. Cushions are very fim. Since we are not a fan of smooshy sofas, this suits us perfectly. We feel it is very comfortable in a supportive way, if that makes sense. We are a pet household and are happy that hairs come off easily. The material seems to be easy to keep clean. Although the bottom cushions don't have matching material on the bottom so they can't be flipped, the back cushions do and are not attached, so they can be turned. Also, all cushions and pillows are zippered so they can be taken off to be washed. We feel this sofa was a good deal and will be serving us well for a long time. Thanks, Overstock!", 
    "Very pleased with it....easy to assemble and looks great in my brown and tan color scheme. The seat and back cushions are very firm but should soften with wear. Matched this with two Riverside Charcoal Recliners....", 
    "I just woke up from a nap on my new couch, if you take off the back pillows very comfy for naps. The couch showed up quickly in two easy to manage boxes. Super simple to put together about 15 minutes, no tools needed. I've been shopping for six months, looking for just the right couch at an affordable price. No delivery charge, no taxes I saved over $100 buying from Overstock.. This couch is not a sink into couch, it is very firm. This couch looks good with/without the back pillows makes it very versatile. Very pleased with this purchase.", 
    "I ordered this sofa because I needed something that would fit through a 26 inch door. The sofa came in two boxes and was fairly easy to assemble. It took me about 30 min. Considering the cost this sofa is a great value and looks very nice. I have a small NYC studio and it fits very well. Not too deep, to long or to wide. Just perfect. It does not look cheep, like the ikea sofas that also come in pieces. As for comfort, I would give this sofa a 7. It's fine, but not super comfortable....unless you like a firm sofa and and a very upright back. This is a nIce sofa for a small apartment or more formal living room. However, this is not a family room/ kids sofa. I am so pleased with my first online furniture purchase!", 
    "I would like to start by saying I almost never write reviews. You have to be either pretty good or pretty bad to get me to spend a minute online. In this case, it was pretty bad. The package came in two boxes as expected. There werent that many parts so it looked simple to assemble. The base of the sofa is constructed by the side arm panels and the front and back panels. These articulate using PLASTIC knobs with a interlock and secure with a plastic peg mechanism. It seemed questionable as to wether it would handle the weight but what turned out to be the real problem was that the knobs would not articulate enough to allow the peg to be placed in on one of the 4 corners. Upon closer inspction, it was because the knob was cracked and the lower screw fixing it to the wooden panel was missing. They provide a spare knob set with peg but no extra screws. SO after learning the hard way that it was cracked, I replaced it with the spare and used a regular screw of my own, determined to not have to go through the hassle of returning this mammoth. Turns out the original was also afixed upside down and that is why it would not articulate. SO we got a upside down, cracked non-articulating knob on one side and three sufficiently working knobs on the other corners. OK, no problem. the last part is \"dropping in the back \" into the slots along the arm sides. Except the slots to drop it in are so shallow that the back falls out of place if you pul the back forward. So, for now, I have it propped against the wall just so that it is not a hazard. The cushions are firm and I dont appreciate the velcrow on one side that keeps them afixed. The fabric is a little rough. But that is all tolerable. What isnt is the fact that the back doesnt stay put, and I had to recalculate the whole thing in order to even get the base started. Not worth the money and if I hadnt already bought it and torn apart the boxes, or if I had a handy man to put it all back into the box, I would return it and get something else. I dont think it is a reflection on over stock- I emailed them and they were fantastic about setting up the return shipping with ups and giving me a refund. But You still have to figure out how to get it back in the box and it is a pain in the rear to pull apart once it is put together. If you can call it being put together. All in all, not happy with it. It wont deter me from buying off over stock but hopefully it will deter you from purchasing this sofa.", 
    "First, the POSITIVES - The sofa arrived very quickly (less than 4 days from my order)! Kudos to Overstock! The finished product looks decent and works really well in a small apartment/ room. The NEGATIVES - I am very concerned about the quality of this product and whether it will hold up over time. The frame is held together by these interlocking plastic loops (picture plastic rings stacked on top of each other with space in between for you to insert other plastic rings into) and you insert a round plastic tube to hold the plastic loops in place. One of the interlocking plastic loops was cracked/chipped when I opened the box. Luckily, they did provide a spare plastic loop. This was my first suspicion on the quality of this product. There were numerous reviews on the ease of assembly. That was contrary to my experience...It took my husband and I 45 minutes to put the sofa frame together. I am convinced my unit is faulty because it should not have taken this long. The instructions (both text and picture) are very high level. It took us awhile to figure out that when you interlock the plastic loops on the front and back boards to the left and right arm boards, one side has to go over an under and the other side has to go under and over (sorry if this description sounds confusing). This important part was omitted from the instructions. It was also very difficult to push the front and back boards into the side arm boards so that the plastic tube could slide into the interlocking plastic loops to hold the pieces together. My husband had to hammer down on the plastic tube (like you would with a hammer to a nail) to force the pieces together. Again, I suspect I received a faulty unit. Perhaps the measurements are a bit off and that is why it took us so long to get the frame set up. Once the frame is set up, the rest only took 10 minutes. The seats are pretty firm, and I hope it will soften with use.", 
    "This is now my main sofa in my living room. It is a great length to stretch out and is firm so you don't sink in too far making exiting difficult. I would say the color and fabric remind me of a nice men's grey wool suit. I am enjoying the color, fabric feel and shape a ton. I am so glad I selected this sofa and it fits my style perfectly. Order this sofa today for your Gentlemen's Lounge!", 
    "i got this sofa for my living room because i was tired of the faux leather sofas i had before (in trash now)...it is not very hard to assemble....a bit heavy but not complicated at all...you need a man to help you assemble this....color and material great as mentioned...its a big sofa....it fits 3 ppl comfortably....it is what i expected except that wood on one side of the sofa had major scratches...i colored them with a dark brown pencil to hide the scratches and it worked!!", 
    "I ordered this sofa to complete the look that I was going for and it fit the bill perfectly! It's nice and sturdy, was easy to assemble even on my own and looks fantastic in my livingroom! The only thing I don't like about this sofa are the matching pillows that came with it, but they're easy to replace and I already knew I didn't like them from the photo online. This sofa is great and I plan on getting some good use out of it!", 
    "I love the design of the sofa so I thought I would give it a try. I do like that the assembly was not difficult with no tools required. The only thing that bothers me is the fact that the corners of wood trim don't quite align with the feet as they are supposed to. The wood trim at the bottom of the sofa was actually falling off so I had to turn the sofa over and nail it into the baseboard. And the corner of the wood trim was chipped so I had to color it in with a furniture marker. The cushions are firm but comfortable. For an inexpensive couch I think it serves its purpose.", 
    "Perfect if you like a \"not too soft\" couch. Great back support and great color. Fits perfectly in my tiny apartment living room and doesn't stick out too far from the wall.", 
    "We had to throw this couch away after one year of purchase. Keep in mind it was hardly ever used. It was purchased for our formal sitting room for our new home. (you know that nicely decorated room you never use). After a year we decided to hire a decorator who redid our sitting room, and moved this chair into our family room. Within a month the chair started separating at the seams (where the arms connect to the seat) One of the legs broke off and the support beam at rear back that goes across the length of the chair broke, when we looked at the wood where it broke, we discovered that the wood was rotten and falling apart in splinters. We couldn't even return this chair because it had been a year since we purchased it.", 
    "I got this couch and sat on it a couple of times and now its low in the middle", 
    "Beautiful look and color, however broke within the first day of using it, when an average person literally was just sitting on it. Plastic shallow pieces hold together the corners with a plastic pin. I was very disappointed as this really is a beautiful looking couch. Overstock customer service took good care of me, so I would still shop with them though.", 
    "this arrived without instructions; in 2 boxes. I found it very intuitive to assemble, after unpacking and lining things up about 20 minutes was dedicated to assembly. I put it Together myself with two toddlers underfoot.I like the wool flannel look of the upholstery. This is a great looking piece that I won't feel bad replacing when the kids are older or worry too much about cleaning. We're not couch loungers, so I find this couch comfy enough- springy and firm and long enough for a cat nap!", 
    "Almost 8 weeks and it broke. You get what you pay for. I was hoping to make it a year.", 
    "Great couch. No complains. Very comfortable, sturdy, and easy to build.", 
    "This sofa was very difficult to assemble as it was poorly made. It looks cheap -- there are visible flaws after assembly.", 
    "Not to mention that this sofa is beautiful, but also very easy to assemble! It took me and my boyfriend 10 minutes from opening the box to actually sitting on the new couch. And also, it comes with the decorative pillows! My favorite item I've gotten from Overstock so far!", 
    "After a hiccup with Overstock, the couch is now here! Went together with no problems. Looks good, and sits well. Will see about durability as time goes on. Fits into family room decor. Good airflow under couch. Remember, this comes in TWO boxes!", 
    "There were plenty of reviews warning of the stiffness of this sofa, so I was prepared for it--and it's actually really not that bad with the inclusion of the pillows! I love that the back cushions are completely movable/removable because it allows the sofa to become deep enough to be used as a spare bed. It looks great in my medium-sized apartment and guests compliment the contemporary style often. My only qualms are that it didn't arrive with any assembly instructions and it's not super, super sturdy--sometimes if I flop down on it too hard, it feels like it might fall apart (I should probably just me more gentle with it...). Thanks for another great purchase, Overstock!", 
    "This couch looks great in any setting. It did come grey with a hint of blue tones. I have a couple more throw pillows on it because it keeps you pretty up right. It wasn't too hard to put it together...I friend put his together by himself. The trick is using a hammer to get the pegs in.", 
    "The sofa arrived damaged - the wooden frame was all scraped and it looks disgusting. This was a gift for my sister and I am disappointed and will NEVER order furniture from Overstock again!!!!!!!", 
    "I have actually purchased this sofa for another project before a couple of years ago and did not have any issues. I purchased it again recently for a project and did not have the same luck. It arrives in two boxes; however, I only received one of the boxes. It took a while (and following up) to get the other box to me. Once it arrived, it was missing more parts that were essential for putting it together. Luckily, this was for a model and not for every day use, so we were able to use some creative rigging. I wouldn't suggest this sofa at all. Totally wasn't worth the hassle this time.", 
    "Very easy to put together. Inexpensive but the seat cushions are extremely firm. This is not a comfy couch you would lounge on all weekend watching TV", 
    "This is the worst couch ever! It comes in a million different pieces. When I received this couch it was missing pieces so it couldn't even be put together and when I called customer service they were extremely unhelpful and said that the piece wouldn't get to me for another 3-5 business days. I don't even want to wait for the piece I just want to send the couch back and get my money back! DO NOT BUY THIS!! SEEMS LIKE A GREAT BUY FOR THE STYLE NOT WORTH THE GRIEF!", 
    "Arrived fast but missing a key part. Fabulous customer service got the missing part to me fast. Had a very hard time getting the back to slide into the metal channels and finally took the seat panel out, that made it possible but still not easy. There were no instructions provided for this part of the assembly. What should have been a 1 hour assembly job tops got dragged into several days and a 1 hour wrestling match with the back. All's well that ends well but I wouldn't dare recommend this to a friend. well maybe if I was really mad at them. Wow, I think I need a nap.", 
    "I purchased this sofa for my parents who complained that it was nearly impossible for the to get up from plush (soft) sofas. It was clear they needed a firm constructed sofa. I searched Overstock for just such a sofa and decided on the Jai Ash because it fit their requirements. My father assembled the sofa in less than an hours' time. They love it. It has a nice contemporary flair, sits high enough to easily sweep underneath it, and us just the right height to prevent blocking the window behind it. Additionally, it came in two boxes and was wrapped well with no damage whatsoever.", 
    "Keep in mind that this sofa is being shopped in many pieces. The engineering is amazing. I wouldn't recommend it for a spot where it will be used hard. The fabric is nice but it's not all that comfortable and will wear quickly because there aren't springs or traditional materials. Great for apartments or upstairs spots where moving a full sofa would be hard. Easy assembly and great looking.", 
    "I'm a big fan of gray, and am redoing the family room...so I thought this sofa would be perfect. Well...far from it. The sofa itself is of moderate to poor quality, lightweight, doesn't seem very sturdy. Pieces \"slide\" together ...So i cant imagine it could withhold much daily wear and tear. However, I never reached the point I full assembly. Upon removing the parts from the boxes, I realized the sofa had extensive damage. Scratches, chips, holes, tears, and broken parts. You name it it, this sofa had it. I truly can't understand how this sofa could have possible passed inspection of any sort, it was truly in deplorable condition. I contacted customer service immediately, sent them about a dozen images of the damages and they issued an approval for return. Can't wait to get this thing out of the house.", 
    "Lovely couch, not a true charcoal color.. a little more blue. I like that its taller than I thought.. I am tall 5'9\" and I am very comfortablwith the height. Material is strong and the quality is great. Constantly getting compliments and getting asked where I got it.", 
    "This is a great purchase for the price. So decorative and pretty comfortable for the style. I change out the accent pillows and it is perfect. :)"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Jai-Ash-Sofa/6393735/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6393735/Jai-Ash-Sofa-cc2a9951-9f2d-44df-8e68-d9a22ac7d60f_600.jpg"
  ], 
  "description": "Have a cuppa with family and friends on this stylish and solidly constructed Jai Ash sofa, which also serves as an eye-catching focal point in your living room. Finished in dark espresso wood, this sofa features clean lines that sit well with other contemporary furniture. The polyester fabric blend on this piece is easy to clean, even after your pets kick their paws up for a nap on it.Materials: Wood, foam, fabric and hardware Finish: Espresso Upholstery materials: 100-percent polyester Fabric upholstery color: Dark grey Scoop Arm 3 over 3 Comes with 2 throw pillows Seat height: 20 inches 34 inches high x 35 inches deep x 79 inches wideStyleContemporaryMaterialFabric, Foam, Polyester, Polyester Blend, WoodTypeSofaFinishEspresso, WoodAssemblyAssembly RequiredColorGreyFurniture Frame MaterialWoodFurniture PatternSolidGallery RoomBlack Walnut, Breakfast In Bay Meadow, California Cool, D'Amico, Grand Tradition, Laney Avenue, Leticia, Magnolia Tea Time, Manhattan Mod, Old Town, White Tulips"
}