{
  "name": "Janette_Dining_Chair", 
  "price": "EUR 102.86", 
  "reviews": [
    "We purchased two of these chairs for a sitting area in our living room. Both chairs were defective in different ways! Neither came with directions. The first one had mislabeled screws, causing my husband to put a hole in the chair when he put a long screw in a short hole. For the second chair, the legs didn't fit into the leg holes. We ended up returning both of them. These chairs are total garbage. They are cute and a good price, but it's not worth it!!!!!!!!!", 
    "This chair is very comfortable. Assembly was easy for one chair, but on the second chair, the holes did not line up so I had to drill them out to assemble.", 
    "No made of good quality. Could not even use it to sit down. Have it as a display unit because it feels like is going to break !!", 
    "Corners a bit sloppy. Fabric could have been pulled better to make corners neater. For the price - its ok.", 
    "I use this chair as an office chair for my desk. It is a beautiful chair with a good height for my desk. The first chair I received had a crack in it and was returned promptly but the second chair I received was fine. It was easy to put together and overall I am happy with it."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Janette-Dining-Chair/7683872/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7683872/Janette-Toast-Accent-Chair-724ce58f-9c8b-4689-8f27-0af0236d457b_320.jpg"
  ], 
  "description": "Old-world charm meets modern style in this stunning Janette, Deco-inspired accent chair. This chair is constructed with sturdy, espresso-colored wooden legs and a toast-colored polyester fabric upholstery.Materials: Polyester/hardwoodFinish: EspressoUpholstery material: PolyesterUpholstery color: ToastUpholstery fill: FoamSeating comfort: MediumSeat dimensions: 18 inches high x 23 inches wide x 20 inches deepDimensions: 31 inches high x 25 inches wide x 23 inches deepStyleModernMaterialFabric, Foam, WoodFinishEspresso, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightLow BackColorBeigeFurniture PatternSolid"
}