{
  "name": "Jasmine_Accent_Chair_with_Solid_Wood_Legs", 
  "price": "EUR 101.25", 
  "reviews": [
    "Easy to put together, great looking!", 
    "This chair took me less than 10 minutes to assemble! The pattern is nice in person, the seat is wide and surprisingly comfortable to sit on", 
    "chairs were super easy to put together. nice fabric, very sturdy. look very nice with the rest of the furniture. Just found these on sale at Kohls , com for much more than i paid. i'm a new customer to overstock and i highly recommend your price and quality to my family and friends.", 
    "Great looking piece of furniture. Easy to put together. We thought some of the hardware was missing but found it in the wrapping. Only negative is that hardware should be put in a small package so u don't have to hunt for it.", 
    "Beautiful!! Puts more life in my room and colors blends with all of my furniture. Nice chair to have. The price was right. Easy to assemble!!.", 
    "I love how sturdy the chair is", 
    "Never bought any big item on line before but I must say it was a great buy for a great price. it was super simple to put together and omg I can sit and read for hr in this chair. Had a bit of an issue with the delivery but it was fixed with one phone call. so thank you customer service", 
    "These are awesome! So easy to put together and kids love them too!", 
    "I was very pleased with the design, comfort, and ease of putting the chair together. Arrived in perfect condition. I love it!!!", 
    "Excellent buy and love the colors!! Husband said good quality as well when he assembled.", 
    "These chairs are very sturdy very pretty exactly as you see you'll be very satisfied", 
    "Thank you Overstock for providing this great chair for such an affordable price, Love it.", 
    "For the price you cant go wrong with this chair. This chair complemented the other chairs in the area."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Jasmine-Accent-Chair-with-Solid-Wood-Legs/10676740/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10676740/Jasmine-Accent-Chair-with-Solid-Wood-Legs-0c387144-c606-49b4-b152-e2c6083c59eb_600.jpg"
  ], 
  "description": "\n                    StyleCasual, ContemporaryMaterialFabric, Upholstered, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorMulti"
}