{
  "name": "Madison_Park_Whitman_Blue_12-piece_Bed_in_a_Bag_with_Sheet_Set", 
  "price": "EUR 151.60", 
  "reviews": [
    "We received this bedding very quickly. The quality of the set is very good. The actual fabric was a bit of a surprise as it is more satiny than I expected. It looks beautiful, however. The brown doesn't appear to be as rich as it shows in the picture. I would not recommend it if you have pets that go on to the bed. I think it would snag easily.", 
    "The pictures really do not do this bedding justice. It is jacquard, and the paisley pattern is stitched. It's absolutely gorgeous. The blues are a pale blue and st. tropez blue the latter of which appears silver in the light. But it's still true to the picture's colors. I'm very happy with this purchase. It looks like a premium bed set one would find at Neiman Marcus. Thanks Overstock for a great product for a great price.", 
    "The quality is great. The sheets are very soft, as is the comforter. The design on the comforter is actually a stitched design which surprised me as I expected a printed design but it is still very soft. We have a cat that gets on the bed occasionally and so far, no snags. Everything is well made and is very nice quality. The picture on the site brings out a little more blue in the comforter than is normally seen but the colors are so beautiful anyway. The comforter length is just fine for our Queen size, when the top of the comforter is pulled to the top of the mattress it hangs down to the dust ruffle. Overall a very good investment for the price. We are very happy with our purchase", 
    "I found this set at *** for $60 more, only the set at *** was a 7-piece rather than 12 pieces. The quality of the comforter and pillows is great, the sheets are okay. I received my order in just a few days as compared to the two-weeks it would have taken from ***. I am very satisfied with my purchase.", 
    "I needed something with blue to keep my husband happy. He loves the way it makes the bedroom look which is saying a lot for someone who really doesn't care about these things. The quality is very good and we have not had any issues with the pulled threads from our cat or use. (I purchased this 5 months ago.) Bed sheets are very smooth and so far no signs of pilling. This is just a really beautiful, serviceable set. Colors are true to the photo. Sheen mentioned by others is not distracting.", 
    "It's a beautiful set and the sheets are very comfy. However, I wish I would have ordered a king-sized set, even though my bed is a queen. The comforter BARELY covers the sides of the mattress.", 
    "I really like the look of this set. But it seems very delicate. I have to be careful when making bed fabric is a little too delicate.", 
    "Beautiful pattern and colors. I love the color scheme. Unfortunately, there are some quality issues with the fabric- fraying on the comforter and then small holes on the sheet in the repkacement set. Overstock is great, but this bed set is not excellent quality. I have kept it for the general appearance, but I have serious doubts that the bedding will stand the test of time.", 
    "I washed and dried the sheets before putting them on my bed. There was hole in the fitted sheet after the very first wash. I didn't get the chance to sleep on them. The comforter looks nice but snags easily. This set is not worth the money.", 
    "This is a very nice looking comforter, however, if you have dogs or cats that sleep with you (or lay on the bed at all) the comforter will snag because of the stitching on the paisley pattern. My first snag occured within a week and now just 4 months later there are several. It doesn't look too bad yet, but this comforter will not last more then a year or two unfortunately.", 
    "I read ALL the reviews before making this purchase. I hate buying something and then having to return it. I shopped all the big box stores first and could not find what I was looking for. This comforter set was perfect. Like all the other reviews say, the pattern is stiched on, not printed on. The sheets are light blue and very pretty and soft. The only thing I wish I could trade is the dust ruffle for curtains. My bed cannot use a dust ruffle so I wish there was a set with curtains. The fact that this one includes Euro shams and two throw pillows is a huge plus. That is where you usually end up spending most of your money. I really like this one and don't see why anyone would be disappointed. You can't go wrong for the money spent. The colors are great...my walls are the color of chocolate milk and the set looks beautiful. I bought Dk. Brown drapes but tried several Tiffany blue also, they all looked nice.", 
    "Lovely colors but it snags easily. Watch out if your pet is allowed on the bed.", 
    "This set is absolutely beautiful. Completely transformed my room into a elegant grown and sexy look. Happy customer here", 
    "This product turns your bedroom into a 5-star hotel room.", 
    "I bought this set back in September of 2012 for a guest room. So beautiful and is holding up very well. My guests love it.", 
    "We recently purchased a new queen-sized mattress set, downsizing from a King secondary to space issues. So, all of our bedding was too large. I wanted to purchase a new comforter set but did not want to spend a lot of money. I chose this set because the colors were perfect for our bedroom. In general, I am very pleased with the product. The colors are as represented in the photos, it comes with not only two pillow shams but two oversized square shams as well. The downside to that is that the only place I could find inserts for these were at Bed, Bath and Beyond and they were sort of pricey. You don't have to use them, however, to enjoy the rest of the set. It just gives a nicer look to the made bed. The bedskirt which came with the set was NOT the correct size, however. It was definitely a KING. I contacted Overstock and they offered to refund me a portion of the price of the set as it was not possible to exchange it for the correct size, per the manufacturer. This was not a problem as I was able to find and purchase an inexpensive bedskirt in the same color to replace it. Overall, I am quite satisfied with my purchase. Because of the fabric texture, however, it appears that it might snag easily. Some fabrics just do. I would not recommend allowing pets to sleep on the bedding without covering it to prevent snags.", 
    "What a beautiful set! Well made and very expensive looking! I was worried a bit about the material on the comforter since my dogs do tend to jump up on the bed, but, even after an illicit wresting match by them on the bed, there hasn't been a pull or a scratch on the material at all. The sheets that come with the set are quite soft and comfortable. The Euro shams are a little bit too big.....I have standard Euro pillows and there is a lot of extra room in the sham. All in all, I would recommend this to any of my friends!", 
    "This is a high quality set and looks good. As a man I wanted to get something nice yet not effeminate. Well, it's not manly at all but I think with the blue it works okay. It didnt ship as quickly as they promised however overall it came about when Id expected when I ordered it.", 
    "This is a beautiful set and quite a good value for the price. It looks just as you would expect it to look based on the online pictures. If you like paisley, you'll probably really like this set. The sheets are comfortable, but not the most luxurious sheets I've ever slept on - but again, this was essentially what I was expecting for what I paid for the set. I would highly recommend this!", 
    "I am really pleased with my new bedroom set. The color is as I hoped it would be, being that I had already painted my walls blue, this was a very good representation of what actually came. The sheets are comfortable, much softer than I figured they would be, with oversized pockets to easily fit. The comforter is short, by design, so it is not one you pull all the way up the bed and tuck under pillows. I suppose the extra pillows are to take up the space. The euro shams are nice, slightly quilted. The regular shams don't have crsip edges so they fall over a bit. I have just a couple thread flaws in my comforter, but they are unnoticeable because of the nice paisley-type design. The main reason I only gave 4 stars is that the comforter top tends to get caught and pull threads somewhat easily. I have caught my rings several times, and pet nails may get caught. On the upside- it has not damaged the comforter even though I've caught it with jewelry- yet. I am overall very pleased!", 
    "I am really happy with the product. Have to buy pillows for the shams and blue square pillows.", 
    "The bed in a bag was exactly as described. The colors looked exactly as advertised and matched perfectly it's the curtains.", 
    "Colors were true to monitor and it looks fantastic with the curtains I already had. Very soft, nice quality sheets included (some of the nicest I've owned) but they barely squeezed only my 14 inch thick mattress. A great value with all the accessories.", 
    "nice coloring, comforter a bit short on width when you have an extra deep mattress; barely covers the sides", 
    "This set is absolutely gorgeous! I couldn't be happier. It's soft and I can't believe the value with all the pieces it comes with. 100% recommend this.", 
    "The material smells heavily of chemicals. Reminds me of poor quality silk from China that smells like rotten eggs.", 
    "This set has made our bedroom look like a bed from the magazines, and I feel that the quality for the price is excellent. Make sure that if you have a king size bed to have king sized pillows for the shams.", 
    "Love the comforter set, great material, my only disappointment was the sheets. I ordered the CA King set and the sheets are not the deep pockets so they are popping off the bed. It is a very tight fit on the mattress. I found a beautiful picture to accent the colors in the comforter. My first purchase with Overstock and I am very pleased.", 
    "Love this set. I've coordinated the whole room to the colors. Not too busy or too garish. I love the cover. Just the right weight and feel. Would have rated this 5 stars if the sheet quality was better.", 
    "Very nice indeed. Makes our bedroom look like something out of a Better Homes N Garden magazine. Martha Stewart would be proud. It is just right!!!! Two of the decorator shams are square....so, we ordered two white stuffed pillows to put inside those two shams and wow, we are instant professional decorators. Awesome purchase.", 
    "Product is exactly as shown in picture. Quality is even better than I thought. Only thing I will say is the sheets are not as comfortable as our old ones, but then, these are only 200-thread count. Notwithstanding, this is still an amazing purchase and the price is more than reasonable for what you get. I've noticed a couple snags in the comfortable, but we do have cats who jump up on the bed. I would highly recommend this bedding set. It looks beautiful in our master bedroom, and even my husband is pleased with the color scheme and quality. Not too flowery, not too feminine.", 
    "Very nice. Nice quality. a lot for your money.", 
    "This should be priced at $$ for the quality. I gave it two stars for the cute design The sheets are very thin and flimsy and get worse after you wash them. The comforter is cute and we will keep it because we purchased the curtains to match. Lovely design, and I call it the fake it till you make it, but it's definitely not the best quality. I would never ever pay this price again for this quality, overpriced!", 
    "The colors were exactly as depicted and I feel like this was an incredible value for everything that was included.", 
    "Feels & looks like luxury at a reasonable price", 
    "very nice. Color is just as shown. A little concerned about snagging when making bed, but so far, very pleased.", 
    "I have had this comforter for 2 years and it still looks new. The comforter has been cleaned twice and the shams and sheets wash up very well.", 
    "I love this product! It's so many things included for a great price. The colors are so beautiful together. It looks just like the picture. It's also really comfortable!", 
    "I was so pleased with the quality of this set and the colors and style is beautiful. Looks beautiful in my new master bedroom make over.", 
    "I love the colors in this set. And for the price, I was very surprised at the quality of the whole set. Especially the sheets, they are very soft. The only thing that I would've liked is for the comfortor to be more fluffy and just a little longer on the sides. When I fix my bed, the sides come about an inch short of showing the sheets. But, my mattress is thick so that could be the reason for it. Otherwise, I love it!", 
    "I love this Bed Set. Especially for the money paid. We got so much product. I love the look of the comforter. It was a great compromise for me and my husband. Beautiful yet masculine as well. There are a few threads that needed to be trimmed, but no pulls or issues with the comforter set. The sheet set is a nice color and fits well, however, it is a low thread count. We purchased a higher thread count set to match and use that one as a second set. ! am extremely happy with our purchase!", 
    "I bought this set for my Mother and she loves it! She had been to all of the dept. stores and could find nothing that she really liked. This was her first experience with Overstock. I told her of my many, many purchases ( with only one return due to breakage) and \"O\" customer service handled that one great! The color, quality is really good. She loved that it was a complete set. This is not meant as a negative, but I would like to see more curtain/drape options/pairings that might go with these bed sets. Many elderly people would find it helpful/easier to put it all together. A dedicated \"O\" customer.", 
    "Love the comforter. Very fancy and classy looking. Came with sheet set and 2 pillow cases. Also got long round decorative pillow, smaller 12\" x 12\" decorative pillow. Got to shams to match comforter, king size. Also got two 24\" x 24\" shams in solid blue color to match the set. Also got dust ruffle. Really happy with quality of the set, it is beautiful, makes the whole room look fancy and elegant. The comfortor is embrodered and nicely made. Would buy again, excellant delivery time. No problems and great price.", 
    "This set is beautiful! It's not too girly, and not too manly. The tones of browns and blues are so pretty and it comes with a set of sheets that match the blues in the print! I love it and it looks gorgeous in my room!!!", 
    "Ordered curtains rug and bed covers.... Had to pay $$$ to return all due to color abnormalities. **", 
    "I actually purchased this set for a guest bedroom and absolutely love it. I liked it so much, I purchased it again as a gift for a needy family we sponsored for Christmas where the Mom had asked for a \"new comforter for her bed\". She loves it as well. It is very high style for the price. Also the fabrics are nice and everything is machine washable. The only part of the set I did not use was the sheets, as I am extremely picky about sheets. But, the rest of the set is just awesome. A GREAT value for the price.", 
    "As stated before I was disapointed in the quality and finish.", 
    "Nice colors,decent quality, a lot of pieces for the money. I don't plan to use the sheets as already have a high thread count set but they do feel pretty soft and sturdy for the price range. This set blended into my existing color scheme (dark brown and steel blue) beautifully, a silvery muted blue with a shimmery finish.The bed skirt and border are a more taupe cocoa color but very attractive", 
    "Looked great in packaging. Unthinking, I unpacked everything and washed sheets - company coming - I have a 16\" Queen mattress - sheets show about 1\" on both of sides of bed. But King would have been too big. Kind of disappointed, but my fault. \"Quilting\" on comforter puckered the fabric in a couple of places, but a little tug broke the threads and it looks better. On the positive side, the comforter comfortable to sleep under and is warm. Looks great with my metal bed frame.", 
    "I am MORE than please with this bed set. The colors are beautiful, and very well represented. It is not a print, but instead a stitched/embroidered paisley pattern. Considering the cost, I am incredibly surprised with this set. I am very happy with my decision to purchase this and would recommend this to others.", 
    "omg!! This bedding is so beautiful, the colors are exactlly what is displayed on the screen. The quality is superb. The design is a classic, and the sheets to my big surpirse are not too shabby. I'm extremely pickie when it comes to sheets and I tell you these sheets are not bad at all. I love this set, does not look \"gaudy\" at all. An excellent purchase.", 
    "Looks great but not the best quality. the blue fitted shit after a wash has become old and ratty looking, and i am very careful and specific about washing my goods. I would recommend it, but i would telll my friend to buy spare sheet set, but it does look beautiful!!!", 
    "This is a nice set. It looks more expensive than what you pay for it. The colors in the picture are accurate. The set is a sky blue and light brown. It is beautiful. Only problem is the design on the comforter is raised so it is easy to snag. Otherwise good buy!", 
    "I read reviews on everything before I buy and liked what I saw on this set but was disappointed with what I got. Has a cheap feel to it, way too satiny feel, seems cheap, and the blues do not match. The comforter and one of the pillows has more of a sky blue and then the cheap satiny decorator pillows and the shams have this aqua. And the sheets do match at all. Thought it was my obligation to put my review up here because I know others will be disappointed if they are expecting quality set. This should only be about $70 for what you get.", 
    "I bought this for a gift for Christmas, but once I saw the quality, I had to return. It would be very easily picked and was very thin material. Not what I expected it to be.", 
    "This set is beautiful!!! I purchased it for my son in his new house. It works great for a guy. The brown is not a dark chocolate and the blue has a gray tent to it. I plan to buy another one to go in one of my bedrooms. Great price for all the things you get. Works great with dark - expresso, cherry or mahogany furniture. The only thing -- I wish there were matching drapes to go with it.", 
    "The set was nice, only returned it because it didnt match the colors of my walls.", 
    "This was an excellent bed ensemble which included everything from sheets to decorative pillows.", 
    "I absolutely love this. It is holding up very well. And it is gorgeous.", 
    "This bedset is absolutely beautiful. The paisley pattern is exquisite and is actually stitched -- not printed -- onto the fabric of the comforter and pillow shams resulting in a nice brocade-like texture. The brown and white thread used in the stitching is on the shiny side, the latter creating a silvery blue, almost reflective effect under certain lighting conditions that makes the pattern really stand out against the matte brown of the underlying material. For the price, I was pleasantly surprised.I would have given five stars, EXCEPT for the fact that I purchased the Cal king set, and although the bed sheets fit the mattress properly, the comforter does not -- it's the same comforter of the same dimensions as what's included in the regular king set. Area-wise, a standard king mattress is actually larger than a Cal king, but the Cal king is longer and narrower than a king mattress. I cannot speak to how the comforter fits on a king-size bed, but on my Cal king, it's 2-3 inches too long on the sides and to get the corners to look right with sufficient length hanging off the end of the bed so that the mattress is not exposed, I wind up with 8 inches of the mattress/bedsheets left exposed at the top. This practice of using the same sized comforter in both king and Cal king bedsets is not unique to Madison Park (not the first time I've run into this situation) but it still annoys me -- I would gladly pay a few extra bucks for a comforter that is properly sized for my Cal king bed. If I'd noticed the comforter dimensions beforehand, I probably wouldn't have ordered this set; that said, it's so pretty I opted to keep it and have basically learned to look past its (literal) shortcomings.", 
    "Very bad quality for the price", 
    "This set is lovely and looks very expensive. I love it.", 
    "I like it, but the fabric is not the quality that I hoped", 
    "Was prettier than pictures. And delivery was awesome", 
    "Our new quilt set is luxurious and soft.. The sheets are comfy, the bed skirt is long enough, the quilt fits our king size bed with enough side coverage, the pillows are such a rich touch. .", 
    "Made well! I love it! Looks wonderful and washes well! Thank you!", 
    "Very beautiful. Love it fast shipping thank you", 
    "It is a good value and I get a lot of compliments. However, I'm not in love with the feel of the material.", 
    "Excellent!! Really nice quality. Nice collors", 
    "This is a beautiful set. I was very pleased when i received this and open it.The set has a sheen to it that is very classy. I just love how it looks in my bedroom.", 
    "Very soft and comfey,. Pretty colors and true to the picture.", 
    "It all looks so good got the matching window curtains and valance. I recommend it", 
    "Beautiful, but the comforter is not a generous size.", 
    "Pretty thin but nice looking.", 
    "Beautiful soft colors. Perfect size.", 
    "quality doesn't match my expectations..i already gave this to suebation army. .waste money.", 
    "The quality is great. Colors are blues, beige and darker brown. Had curtains with a gold tone that it didn't match, but glad I bought it.", 
    "The brown colors stood out on the online photo. In person the set appears to take on a lighter blue color dominance.", 
    "Very good purchase. Couldn't be happier", 
    "VERY NICE AM KEEPING IT, WORTH HIT", 
    "This set makes my room look like i am in a five star hotel bedroom.I sleep much better with the comforts of this set.", 
    "Beautiful - love it all. Soothing colors.", 
    "I love this. It matches perfectly with my bedroom decor. Very happy with this purchase", 
    "I purchased these for my bedroom . they look great .also go matching curtains. thanks", 
    "Beautiful, very nice, you will be pleased.", 
    "Well made, beautiful. Will order more bedding from this site.", 
    "This comforter is of a higher quality than expected for the price. The pictures on the web page do not it justice. The design is very attractive and of a good weight. I discarded the sheets due to low thread count,but I did not by for the sheets. Overall, I am very pleased with purchase.", 
    "This is a great deal has all the items you need to complete a stylish bed. The print is a good contrast between dark and light. A nice texture.", 
    "The colors and quality of the comforter fabric are wonderful. The fabric is prettier than it looks in the picture. Beautiful brown tones with light blue details. The bedskirt is very lightweight, but is still beautiful. The sheets are even better quality than I expected in a set like this. The throw pillows and shams are of high quality and beautiful. Very happy with this purchase!", 
    "The quilt is beautiful and fits the size of the bed just right. The entire set including pillows looks great the quilt is a good weight. The sheets are like sandpaper but it is still worth the money for everything else you get with the set.", 
    "Love it. It's what i wanted. J. Ryan", 
    "The pattern is beautiful, it's eye catching as soon as you open up the box. I'm glad it came with all the extras. Great purchase for the price.", 
    "High quality and beautiful!!", 
    "Received this beautiful comforter set a few days after ordering it and am extremely happy with it! Soft, well-made, beautiful fabric and design. Great value for the price!", 
    "Silver is metallic blue is satiny light tea list color. brown is more smoke than mocha. Matched with teal/blue curtains", 
    "This is a very nice set. We just painted the room and are setting up the furniture. I can't wait to put this on the bed. ;)", 
    "The comforter set is beautiful. The colors are perfect for the room I purchased it for. The sheets are a higher quality than what I have purchased before in bed and bag sets from other stores.", 
    "Just as it is shown. Very pretty. Could not be happier with this purchase", 
    "Very nice color combination of taupe and pale blue. Although I kept it, I would have preferred the fabric to be less shiny and silky.. it creates static.", 
    "I really like this set! I ordered a Cal King and it fits and covers well. As a matter of fact, it looks just like the picture.", 
    "Beautiful set. Nice quality. Love it.", 
    "Nice and thick comforter. Having a hard time finding pillows for the large blue shams though, but I love the set.", 
    "Beautiful bedding set. Nice weight..not too heavy and easy to fold up and remove. Love the colors.", 
    "Beauitful bedroom set. Wonderful material just gorgeous.", 
    "Beautiful love it so much!", 
    "Lovely bedding set. Good value for the price. Colors are a very soft blue and soft brown. It is a delicate fabric. I would not recommend if u have pets.", 
    "I was looking to lighten up our dark master but wanted some color. This fit the bill. Nice quality and it has a shimmer I love. Color is as shown, love it!", 
    "I purchased this item for our spare bedroom and it is just lovely. I painted the walls a light blue and it makes the brown in the spread and pillow shams pop. Very good quality, and arrived in no time at all. Love it.", 
    "Sheets fit great and feel luxurious and the bed looks like it came from a 5 star hotel.", 
    "I love this set. It looks just as good on the bed as it does on the site. You can't go wrong! The sheets aren't that great as I'm used to a higher thread count, but the comforter and pillows are awesome!", 
    "Love the set so much nicer than expected this was a true value and would recommend with complete satisfaction", 
    "Looks exactly as pictured. Colors are accurate. Sheets fit deep mattress.", 
    "excellent quality more than I expected", 
    "This is what a comforter should be. Happy with the color and the warmth it provides. The only thing I was disappointed in was the size. I ordered the King but I have the extra thick mattress so it does not cover the sides well enough. Would be perfect if I had a normal mattress will be moving to another room to put on a queen size bed.", 
    "This set is very nice. Everything they state about it is true and the quality is really good. The colors match my room perfectly and it was like the frosting on the cake to make my bedroom look like it was in a model home.", 
    "I would recommend this product.", 
    "Great quality, looks very elegant. Soft sheets.", 
    "This is better than it looks online...love it", 
    "Saw the same set on another website for over twice as much", 
    "This product is more than I even expected. It's very good quality. My only disappointment is that I couldn't get a window curtain to match it in the right color!", 
    "Looks great! Just received it yesterday so really can't give a great overview.", 
    "This luxurious set was almost perfect. The comforter is light weight and comfortable. I love all the extra pillows although the inserts I ordered did not fit the Euro pillows. The sheets were nice but not as soft as I like.", 
    "Great price & beautiful detailing. Looks lovely in my bedroom", 
    "This set is beautiful and exactly what I was looking for to finish the look in my master bedroom. The comforter fits my queen size bed perfectly and keeps us nice and warm. Would definitely recommend this set!", 
    "The bed spread is nice, sheets are cheap,", 
    "I was very pleased with this set, can't wait to paint that room lol I kinda bought prematurely", 
    "Finally, I have a comforter that fits my regular King mattress set. I totally LOVE it and I love the comforter set (this Is a California set size). And I am so glad vey glad that they are true to their sizes, thank you, because now in days not many of have money to waste and I can turn my friends on to your site, cause it is worth it to shop your site, again thank you.", 
    "nice to use, comfortable and light", 
    "Love this set! I had looked at what seemed like hundreds of others, but kept going back to this one. Glad I finally made my decision and chose this!", 
    "This bed in a bag is exactly what I wanted. It is gorgeous and the subtle pattern and colors are very stylish. The comforter gets pulls on it a little too easily, but I have 2 dogs that I am constantly shooing off the bed. Most animal free people would have no problem.", 
    "I love this set. The sheets are soft and comfortable, and the comforter and shams look beautiful! It was a great bargain.", 
    "love it looks great and very warm.", 
    "I ordered the King Size Bed in a Bag...The comforter only hangs about six inches over each side of my bed. It seems more the size of a Queen than King.It really is absolutely beautiful...the backing is so soft and the color is just what I wanted. There are so many pieces to it that it makes me feel like I am on vacation at a fancy hotel.I will use it because it has been on the bed for a couple of weeks and I am not sure they would take it back. If the comforter were the right size, I would have given it five stars in a heart beat but unfortunately I am unable to. It is BEAUTIFUL!", 
    "Received bedding and from picture, item looks like it could be flat cotton or even with a satin finish however when I received it -- it was all tapestry and I have 2 chihuahuas that could dig their nails into it so this wasn't working for me. I think item description should have been better detailed.", 
    "Have had this for about 2 years, it holds up pretty well, though the comforter stuffing crinkled up alot even with gentle washing, overall good value and looks like expensive set, good value i love it", 
    "I am creating a master suite and this set is perfect.", 
    "Sheets are low thread count so they are just ok. But the quality of the comforter, pillows and shams is great. Very pleased with purchase!", 
    "Great colors and good value!!!!", 
    "Great comforter! The only drawback is the sheets are a little thin.", 
    "This is one of THE most beautiful bedding sets I've ever seen. This product is even more gorgeous in reality than in the picture!~", 
    "comforter material integrity doesn't last long. Easily Shows wear with Washing & dog laying on it.", 
    "I purchased this set for my daughter for Christmas. It is really a nice set for the price. She is very happy with it.", 
    "Great Quality for the price", 
    "Love the colors, texture and fit. All was perfect. Highly recommend.", 
    "Beautiful great material. Matched perfect with the painting in my walls", 
    "This is a very nice set to have.", 
    "Good quality and quick shipment. Wish there were curtains too!", 
    "Great set. Pillows are very pretty. The colors are rich and looks very nice", 
    "Love the color combination. Bedspread weight is just right. Really dresses up the room.", 
    "Sheets seem to be holding up, though I rarely use them since I love my InBalance sheets from Select Comfort. The comforter, however, did not hold up & we finally tossed it after less than 4 years. It spent the summers in a blanket chest, and the winters under a dog blanket, but still managed to shred & stink. Yes, it was cared for according to the tag.", 
    "This set is very nice! It'll keep you warm in the winter.", 
    "Love the set colors are great snags a little be careful", 
    "Very nice. Just what I was looking for.", 
    "Loved it!!! Just what I wanted.", 
    "Bedspread and pillows are extremely nice. Sheets are VERY poor quality!!", 
    "The comforter set was what I expected. Well made and the colors just like what was in the ad. Washed the sheets before using on the bed. Shrunk up a bit, disappointed that the sides are not made longer to put under a deep mattress top.The comforter top was longer and wider, that was good.Too many shams and pillows, just used the 2 main shams of the set. Would recommend this item.", 
    "Ordered this comforter set for my spare bedroom. I wanted to have something somewhat elegant, yet functional. This fit both of my needs. Very happy with this purchase.", 
    "i have been very pleased with my purchase,it matches the color in my bedroom very well.", 
    "I love this set. The sheets are so soft and comfortable! It is so pretty in my room.", 
    "Have to be careful,or it will picks in it", 
    "These are very pretty and durable.", 
    "Very good quality bedroom set.", 
    "Looks very nice in our bedroom. Have not used sheets yet so not sure of them. Fabric feels like it may snag but am careful with it and do not have children climbing all over it.", 
    "Bought this for my mother's guest room. great price for all the pieces you get. well made. Luxury set. Looks like a model home, 5 star hotel lookmy mother has received many compliments,..one problem...now NO ONE is allowed to stay there!!", 
    "Love it. Love it. My little dog has been on the comforter numerous times and has yet to snag it. Everyone that saw my bedroom during the holidays couldn't believe what I paid for the set. It looks very expensive.", 
    "This set looks great in our beach house on a big white headboard. The sheets are nice and soft too.", 
    "It looks like a pretty poly cotton but is actually a shiny boy ke look", 
    "I gave this to my son and his wife for Christmas. They absolutely adore it!!", 
    "This purchase was a gift for a family member. They went on and on about how beautiful the gift was and that again I had spent way to much money on such a lovely bed set. Thanks for helping me be the hero.", 
    "I Purchased this has a gift for my boyfriend. He loves the color blue and thought this was classy looking but yet masculine for a man. Boy was I right. Couldn't believe it when I was over his house and he had put the entire thing on his bed to include the dust ruffle and pillows. He loved it right down to those annoying extra little pillows. And fellows that wasn't him trying to be nice to please me. And besides the smart look of it it, the comforter is very warm and the entire set is super good quality. Very pleased with the purchase!", 
    "This bed set is absolutely beautiful in my bedroom. The quality of the material is wonderful too.", 
    "Very nice bedding set. Looks better in person than in the pictures.", 
    "Looks just exactly pictured.", 
    "Excellent purchase-Love it", 
    "Everything is great but the sheets are kinda cheap.", 
    "Sheets pill quickly. loose strings on comforter. Nice color.", 
    "King is a little bit small than expected", 
    "I loved this bed set the moment it arrived, wonderful packing, the perfect bed set", 
    "Good quality for the price", 
    "I had to return it as it did not match my color scheme.", 
    "feels great . very heavy, would keep you warm in the yukon.", 
    "The colors and the design on this set are very rich looking. I am giving this four stars because the sheets are very thin... But for the price and all the pieces included, it's a great value and looks very nice when set up .", 
    "This is beautiful! Upscale look. Queen size fits a queen bed perfectly! I am so pleased.", 
    "This is a very luxurious bed set. Colors are beautiful.", 
    "I only have this a few months now and when I got them I was very excited when I open the package as the comforter and accessories were gorgeous. I soon discovered, much to my dismay, that the smallest things snag the comforter ands shams and give them a tattered look. I was hoping this would be the last comforter set I would have to purchase for quite some time, but if this keeps up I'll have to replace it in no time at all", 
    "This is a beautiful bed set; nice feeling to the fabric and the sheets were also very nice. I have bought two Madison Park sets and love them both!", 
    "I have been looking locally for some time with no luck so I was concerned \"how could something on line be nice enough\". I was wrong. Very Nice. Even nicer then the description!", 
    "Ok I am giving this an average, but was temped to give it just two stars. It is attractive, no question and price is such a good value, that aside the Queen comforter is very short when it comes to width and I do not have a big thick mattress. I am not one of those people that can pull in down on the side of the bed you see and have it way to short on the wall side. (Not that person) I want it to fit properly. Also, you have to pay to return it, so heed the warning.....", 
    "This set is luxurious and well made. I ordered the King size which has two king pillow shams and two king size pillow cases. The bed skirt is of much better quality than the expensive set I took off the bed for this set to replace. The Skirt is actually made of fabric even the piece that goes between the mattress and box springs. I was impressed because the one I took off was a fabric/paper that had torn.", 
    "I bought this for my son and it is just the right touch for his new bedroom! It is masculine, the colors are great and the price is wonderful.", 
    "Great value. High quality at a very reasonable price. This is a true Overstock deal.", 
    "I love this set. it looks wonderful on my bed. The sheets were a little cheaply made, so I bought a nicer set to go with this comforter and I just love it. It looks very classy.", 
    "Fits my cal king bed perfectly, colors are beautiful, but after a couple months the fabric gets these annoying fuzz balls. This is my second set.... I won't purchase this again", 
    "I have bought a new bed everyday. Room and absolute beautiful", 
    "After two washing on delicate and the comforter is falling apart.", 
    "I was delighted when this bedspread arrived. I have it in my guest bedroom and the quality is excellent and it looks fabulous on the bed.", 
    "We ordered this awhile ago but are very happy with the quality", 
    "Very happy with the set! Comforter is thick. Pets have snagged it up a bit, but that's to be expected. The color is very pretty.", 
    "One word. Elegant. You won't be disappointed", 
    "I love the colors in this to match my blue-painted room. The quality print is a very pretty paisley design. It looks a lot more expensive than what Overstock offered it for. The only con, is you have to be careful not to snag it with a fingernail. Definitely would not recommend a pet to be on top of the comforter. I found the bed skirt to be of better quality than what I've gotten with other 'Bed-In-A-Bag' packages. Worth the extra money over the cheaper sets. Very satisfied with this purchase.", 
    "This set is well made and designed. The pieces work together to make a luxurious looking and feeling bed.", 
    "Excellent quality and service", 
    "Nicely made, silky finish nice drape but not limp. I'm a pet free , child free home, so I cannot attest to durability...but I did not buy it for that. I had to buy special size pillows for accent shams. Easy enough. Will purchase matching draperies too. Fit my standard queen and covers top matress completely.", 
    "A beautiful set. Thrilled with this new addition to my room.", 
    "I was pleasantly surprised at how nice this set was. Great price and good quality.", 
    "I really love this set. Looks pretty, and so convenient coming with sheets, pillows, and shams", 
    "Love the colors and the quality.", 
    "Worst bed set I've ever brought , cheap material, arrived with shredded corners on 3 sections. Pillow shams were a different color from the comforter. Very disappointed. Should have waited and went to a department store ! What a waist of $**.**", 
    "very luxurious. great feel.", 
    "We have had this set for two weeks and every, single day, my husband tells me over and over again how much he likes it. It looks like a much more expensive ensemble. Very pleased with the quality and the price.", 
    "Great, looks perfect. Looks exactly like the advertisement.", 
    "I am pleased with the purchase. I would not recommend this set if you have animals, especially cats with claws as the finish allows claws to catch. Otherwise I am pleased.", 
    "The problem is, it has an odor to it. I have been trying so hard to get the smell out and still can not. The cur tons have the same odor. It smells like old oil, that same smell you can smell by train tracks. It's enough to give you a head ach. I have taken these items to the cleaners then put in my washer. Still it remains and gets really bad when the sun hits it. It's a nasty smell! I don't know what to do.", 
    "Sheets are cheaper thread count. Excellent sale price. Pretty. No defects.", 
    "Looks can be deceiving! 12-pc. bed in a bag w/sheet set, looks good, but quality is lacking. Don't believe this cotton set will last.", 
    "We are very pleased with the comforter. The sheets are not as smooth as we would wish, but at this price the set is well worth it.", 
    "Very warm and love love the color", 
    "Absolutely beautiful, great quality.", 
    "Love everything about this set!! Beautiful and comfy. Did go ahead and buy a throw to keep cat from snagging. Was concerned about sheet set as other said how terrible they were, but I think they are very soft. This is exactly everything I hoped it would be. BTW... I took a sham shopping and find that either silver or golden goes well with the set.", 
    "Love it, be careful it snags easily.", 
    "Love the quality of this be set! My only problem is I wish it was slightly larger. I don't have a California king bed but I do have a pillow top so one side is shorter then I like.", 
    "Least expensive out of all retailers with the same quality.", 
    "We've had this for a while and it still looks new.", 
    "I saw this set on another site and kept waiting for it to go on sale. Found it on overstock for less with free shipping. The blue is not exactly what I was expecting. It's really more aqua, but I like it anyway. In fact, have found many accessories for my bedroom in aqua. I have also ordered the drapes but not received them yet.", 
    "Very nice comforter set,my wife was very satisfied with this set.", 
    "I purchased this for my parents. Very nice set though the fabric does catch easily. I wouldn't hold up well in a home with pets that get on the bed.", 
    "The comforter an sheets are very well Mae. The colors are very calming. Love it!", 
    "Gorgeous bed set, missing the 5th star because it snags too easily.", 
    "I am pleased with this order. Very good value for the money. Looks like picture on website. The sheets aren't great quality but I did not expect that for this price. They are cotton and I am using them.", 
    "A little small in the width leaving the sides a little short for my queen size bed. Good quality, nice pattern, wish the blue was a little brighter but overall happy with it", 
    "Loved the bed set. Looks very high end and even the sheets feel good.Really updates my master suite!", 
    "This comforter set is exactly what I was searching for. The colors are a perect march for my bedroom decor. The entire set is very well made. I have a yorkie that loves to jump on the bed and thankfully it doesn't snag. I shopped several stores and online for this comforter set and Overstock definitely has the lowest price. Once again, thank you Overstock for a quality product.", 
    "this set is really nice. looks great on my bed! It washes nicely.", 
    "I did not realize how heavy this comforter would be. It can definitely only be used in the winter. It is so heavy that it is very difficult to make the bed and it tends to work its way off the bed every night. I would not purchase this one again. The sheets are only so-so.", 
    "I love this bed set it's looks so nice stylish and perfect it's will nice the sheet set is very soft feels nice I like so much it's will doworth wwhat you pay.", 
    "Beautiful set for the guest bedroom..", 
    "After looking at tons of bedding to redo my college student's room, this stood out. I also wanted matching curtains which was available with this set. I was quite impressed with the quality of this bedding. In fact, when I opened the bedding, I was pleasantly surprised at the richness of the material. I used an iron to remove unwanted folds which was simple to do. This bedding lends a very sophisticated look to a once teenage girl's bedroom. This bedding will not be used everyday, so I cannot comment on the durability at this time.", 
    "This set fell apart in 3 months. Not worth it!", 
    "I was a bit doubtful about it - but thought what the heck for the price. Well it came and I have to tell you I was pleasantly surprised. Colors were right on and work excellent together.", 
    "I just love my new bed in a bag! Everything you need to decorate the bed is all there in one bag. Great quality.", 
    "Love the design and feel.", 
    "This was for a guest bedroom, pretty", 
    "It's a beautiful bedroom set.", 
    "Quality is very good. Colors are just what we wanted. We are very happy with the very fast delivery.", 
    "Nice quality went well with light blue paint. Good value came with sheets and shams.", 
    "It is beautiful, but did not hold up well to daily use. It showed wear within a couple of months. Perhaps just not the right fabric for our home.", 
    "This comforter set is the best bargain I've ever purchased!", 
    "It look very good on my bed.", 
    "Fantastic price & we LOVE it!!!", 
    "This item was beautiful! Very rich looking . I was pleased.", 
    "Warm, love the texture, well worth the price.", 
    "Has held up well to our 2 dogs, there are a few threads pulling but still looks very nice.", 
    "Quality of sheets is cheap. The comforter set is very nice, but not as expensive looking as I expected.", 
    "Fantastic bedding set and an exceptional price! Looks great on the bed and I have received tons of compliments! If any negative, th comforter is short on my bed because I have a very high mattress, but my tucking in the top sheet I have made it work!", 
    "Fits my cal king bed perfectly, looks pretty nice as well.", 
    "Very Disappointed. Gave it away! Never again!", 
    "I always worry when I order things on line simply because I can't feel the quality. This is very nice! The color is exactly what it looks like on line and the sheets are wonderfully soft.", 
    "all my expectation !! very happy", 
    "This is a very nice ensemble and completed my bedroom perfectly. This comforter gets pretty warm in the summer time so should only need to add a light weight blanket for winter. Very pretty.", 
    "The colors are beautiful and very classy. The blue is a little darker than the picture, but still as beautiful. It's a great price for such a great set. Get ready for beauty and comfort. A must buy!!!", 
    "So impressed with the quality and look of this comforter. Sheets - maybe not the very best but an added bonus! Love Overstock!!", 
    "Perfect color blue for my bedroom. The offsetting brown is subtle enough to not overpower the blue. And the pillows and pillow treatments are the perfect icing on the cake. A winner all around.", 
    "This is an excellent product. It was more than I expected it would be for the price. It is so warm and comfortable. The sheets are so soft. It enhances your sleep experience. I really love this set. It is not only an eye pleaser but comfortable all around!", 
    "I was very satisfied with the rich appearance and the quality of the sheets. Great find!", 
    "Beautiful and very good quality. Love my comforter", 
    "Love, love, love. Very elegant looking, great material.", 
    "the set is true to the picture. it is for a guess bedroom, and looks really nice. only complaint is that it is a bit short from side to side, and long from front to back on a full size bed.", 
    "I ordered this bedding because it appealed to my sense of traditional. It is gorgeous. I have not used this product yet, however, when I do I will add to this review.", 
    "Looks great on my cherry king-sized bed. Reasonably good quality for this price.", 
    "This was an unbelievable deal and great quality", 
    "Arrived in good condition and the color matches the product picture. Very nice comforter, sheets are a bit cheaper quality. I am very satisfied with the purchase.", 
    "I ordered this for my guest room and I love the colors. The colors are in line with colors shown on the website. I don't think that the sheets are a high quality, but they are good after the first wash and can easily be replaced later if needed. I am very happy with my purchase", 
    "Bought this for an overnight, rental cabin! It looks beautiful in the loft of the bedroom, overlooking The Great Smoky Mountains! Rustic log interior with a touch of class, on the bed! Love it", 
    "This set is a great deal. The comforter is extremely detailed, it looks like it is hand stitched (I don't know how that would be possible for this price though). I will warn cat owners that if your friends have claws they will snag this comforter (I have cats, so I don't let them in the guest room where I put this comforter). I bought the full set and the comforter hangs nicely over the side of the bed. Lets see what else... oh it is a very thick comforter, so maybe not so great during a hot summer. All in all, this is a great set; beautiful and soft. (but I wouldn't recommend getting the matching curtains, they are very thin and don't hang well)", 
    "Arrived in a timely manner, fits our cal. king bed perfectly.", 
    "Cheap fabric. Comforter frayed within weeks.", 
    "very happy with the fit and look", 
    "This is a lovely set. My only complaint is the thread count in the sheets, but that is clearly indicated online so I knew what I was getting. It looks great in our home.", 
    "I could not figure what color to paint the bedroom until I bought this! Now the room just flows and looks elegant! If you are looking for something to make your room look great, buy one of these!!!", 
    "Cute, but I returned b/c I didn't like the color that much", 
    "The decorative part of set is absolutely beautiful. The sheet set faded, pilled up and the pillow cases shrunk. The value of the set would have been good without the sheet set but it really bummed me out to give it to the local animal shelter as it is unfit for humans.", 
    "The bedspread and decorative pillows are beautiful and appear to be excellent quality. The sheets and pillowcases are another matter. They are rough and scratchy. I kept them on my bed for two days and took them off. My daughter says I am a sheet snob but I do know what is comfortable and these sheets are not.", 
    "The colors are the same as the photo. Fabric is perfect. Cannot think of a negative.", 
    "I am very happy with this package. You get everything you need in one order. And it looks great! No need to spend more time to find the matching sheet or pillow case. Only one thing is that the sheet and pillow case are not wrinkle free.", 
    "This is a great bedroom set. The sheets are super soft and cozy. The comforter is warm and the decorative pillows add just the right touch. Would buy again for sure!", 
    "The sheets in this set are very low quality and are almost like sleeping on sandpaper. We had to go buy another set of sheets just to get to sleep well.", 
    "Love it! The only complaint is that the sheets seem to be fading, mainly the pillows.", 
    "Stunning. Made my bedroom look smashing. Love this!", 
    "The 2 pillow shams I received do not match each other. One looks like the one in the pic with the dark brown trim.....the other is brown paisley (no blue in it like the rest of the set) and has no trim. Disappointed they do not match.", 
    "I just received my Bed in a Bag with Sheet Set today. They are just perfect for our bedroom & look just as good as they did in your picture. I am washing the sheets to put on the bed tomorrow. They are beautiful in our bedroom & really makes our room POP!! Good quality especially for the price. Will make our 55th Wedding Anniversary even that much better when so many people come & visit. Thanks", 
    "If you are looking for an exact color, this one is misleading. I took color in picture shown and got paint for my bedroom. Did the computer thing with paint. When I got the set, color was not at all like picture. It's actually a teal color. It did not work at all. Sent it back.", 
    "Very well done, good quality.", 
    "Very nice staff for a good price, highly recommend it!", 
    "the bed in a bag with sheets is ok but the sheets was the wrong size", 
    "Just built a new house and wanted an update for guest bedroom. Loved the colors, loved the fabric. Really loved the price!", 
    "Good quality & price was right!", 
    "The color and design are true to the picture, and it is very attractive, but this is a very lightweight comforter and thus doesn't hang off the bed well without needing a moderate amount of pulling and smoothing. The sheets are also really thin. Overall it is a decent set but not overwhelming.", 
    "This is such a beautiful set. I have seen similar sets for up to $1800.00. if this is the color you want, buy it!", 
    "BEAUTIFUL SET, I PURCHASED FOR MY GUEST ROOM AN HAVE HAD SO MANY POSITIVE COMMENTS ON HOW INVITING AND WARM THIS SET HAS MADE THE ROOM LOOK.", 
    "I ordered this based on the beautiful depth of color in the photo. However, the weave of the fabric causes a light reflection which gives an overall appearance of solid gray. Also, the fabric seems somewhat \"fragile.\" Time will tell how it holds up.", 
    "This is a nice bed set. Sheets are only 200 thread count, which is pretty low but was as advertised. Main issue is that the color is not really blue as shown on the picture. It's more of a blue-green. It didn't go with my decor so I had to use it in a different room.", 
    "I am always shopping for my bedding sets on overstock and this purchase has been the best so far. The quality is excellent and it has a very classy and elegant look and feel. I would purchase again.......", 
    "Bought this for our guest room and it is gorgeous.", 
    "I love this bedspread! The blues and browns are very nice. The sheets aren't great quality but the comforter is nice and has held up after months of use.", 
    "Overall, a decent and well made comforter. The extras items, like the bed skirt and pillows definitely add to the overall value. By Minnesota winter standards, the comforter is a little thin, but nothing an extra blanket can't fix. I will echo a statement another reviewer mentioned...if you have a dog or cat that sleeps on your bed, plan on having this comforter trashed. The \"embroidery\" just can't stand up to their paws and hair.", 
    "Not going to be the nicest set you're going to see, but worth the money. It looks just like the picture.", 
    "high quality bedding! very happy!", 
    "The Madison Park Whitman Blue bedding set is lovely. I am very pleased!", 
    "The entire set looks very nice. It feels very soft and has a luxurious look. Although it isn't as nice as posh sets found in high-end department stores, it is still nice for the price.", 
    "Everyone I've gotten this wants to know where I got it from and how much its a great set esp for the money it realy looks rich", 
    "Beautiful. Just as pictured. I looked this exact product up at **** and the price there was close to $***. I love it. It is not too girly but not real masculine. Love the muted colors in it.", 
    "I have had the set for about a year now. The comforter looks so much more expensive than it is. I found the color to be true to the web site. I wash it about every 2 or 3 weeks. It doesn't need ironing and fits the bed perfectly. The accent pillows and shams complement the comforter and my room décor. I thought the sheets were a bit light weight and so don't use them. I prefer a heavier thread count. All in all this was an excellent value.", 
    "Love it - never disappointed on any bedding I get from Overstock", 
    "Love this would absolutely recommend to buy it again.", 
    "I get lots of compliments on this set. Very nice set. Washes nicely too.", 
    "This set is beautiful and nice quality. I just love it!", 
    "This was not a print but a woven design!! Lovely!! Well made!! The sheets are soft and the pillows are adorable! We are very happy with this purchase!", 
    "The amount that you get for this bag was great for the price! I liked the whole collection.", 
    "Love it. Plain and simple just love it. True to color on monitor. Everything fit very well. Love that the design is embroidered and not print. Has no snags and hopefully will stay that way. Very good product for the price.", 
    "Love this set, beautiful and has everything I needed", 
    "Beautiful color and great material at a great price!!", 
    "This set is pretty, but it does seem kind of delicate. The paisley stitching is beautiful, but I worried about snags. I ultimately returned it because, after looking at it on the bed (just out of the box), I thought it looked too \"old ladyish\" to me. Too much paisley...and I decided to get something more contemporary looking. I think the quality is good for the price and the decorative pillows that come with it are really nice (I would have considered keeping them!). It just wasn't the set for me.", 
    "Colors are so beautiful and the set looks great in my room.", 
    "Love this. Quality is excellent...better than expected. Sheets are so amazingly silky and soft.", 
    "Very elegant design. Well made. I have bought all the additional pieces to match.", 
    "We love this bedroom set - the print and colors are perfect and exactly what we were looking for in our master bedroom!", 
    "looks gorgeous in our room... modern, soft.. nice fabric", 
    "Got it on the day it was promised. Just as beautiful as I thought. The light blue is not a Carolina blue but more of a very soft blue. The color pops and sets the room. I really like it.", 
    "For the price, the set it not bad. However, I cannot seem to find California King size that is accurate. The top quilt is too short for my bed, and the top sheet is also too short. It seems you are just sending king size top sheets and quilts, not taking into account that the Cal-King is longer than the standard king. The fabric is very inexpensive, and will not hold up, but at least it will do until I can find a quality replacement.", 
    "I bought the whole set with the sheets and cushions it looks fantastic. Good quality/ price product", 
    "The bed in a bag set is really beautiful! I am somewhat concerned though about how easy it is to snag jewelry, etc. on the comforter.", 
    "Great Set for the Winter, loved the decorative pillows.", 
    "I love this set! So much included for a good price, especially the fancy pillows they are my favorite! The only thing i wasnt in love with were the sheets, but its just because I live in Phoenix. The sheets are very warm so I bought a different kind to use in the summer. But I will be using the warm ones in the winter.", 
    "This set is even nicer than it looks in the picture. I think it looks much more expensive than it is, and so does my husband! I specifically bought it for two reasons: we have large dogs that try to jump up on the bed (even though they're not supposed to) and I figured the pattern wouldn't show as much dirt. I also was looking for something machine washable. After a wash, it still looks great! Very impressed with it and will look for another set by the same manufacturer. Well-made, sumptuous, elegant feel. It's a win!", 
    "Love the comforter & shams. Great quality & look very classy. I am not impressed with the sheet set, wrinkles really bad when washed. The sheet set is also very thin & see thru.", 
    "I love this set. Good quality. Even the sheet that came with the set are good quality which is usually not the case.", 
    "This set is comfortable to sleep in and looks great too.", 
    "This duvet is not nice at all. The fabric is horrible and it will not look like this in your bed. I have a very high quality comforter so that is not the issue.", 
    "It was purchased as a Christmas gift for my sister and she immediately fell in love, which is no small feat. The colors and texture of the fabric are beautiful...and the price was great too. All around a win-win.", 
    "This is very beautiful. I actually had to give this away shortly ofter this purchased this I changed my bed size.... Well my mother could not be happier. Very pretty.", 
    "The sheet set that comes with this Bed in a bag are not the greatest quality..they shrunk after 1 wash.", 
    "WOULD BUY AGAIN ARRIVE ON TIME JUST AS DESCRIBE", 
    "I have owned this set for 3-4 years now. Great bedding set. Washes well.", 
    "I bought the comforter set and the curtains to go with it. It keeps us very warm and looks great in our bedroom. It makes the room look polished.", 
    "Very happy with our recent purchase. The bedding is of high quality and includes all of the sheets and pillowcases. It's definitely a step up from typical bed in a bag sets.", 
    "Bought this for my mom to go with the matching shower curtain. She lives it. Very good quality and we'll made. Beautiful set.", 
    "over price and not recievedno discount cupon", 
    "Great Price, chose to go with the matching curtain in my bedroom. I changed my paint color in my bedroom to tony taupe. The colors in the set of taupe, light blue and beige look great.", 
    "Love this item!! Very high quality!", 
    "I love the color and design of this comforter but material is cheap. The comforter is thin and very light.", 
    "This bedding is very pretty! I ordered it because you can't beat getting everything it comes with for the price. I do wish it didn't have the satin sheen on the comforter...The sheets are super soft! and I love the deco pillows it comes with!", 
    "Beautiful..very rich looking...great price!!", 
    "Received my 12- piece Whitman. Was amazed at the quality and the beautiful color. The set looks like it will last for years..Very nicely constructed..Shipping was fast", 
    "The color scheme lightened our bedroom and gave it a more pleasant energy. The bedding is the most comfortable against your skin.", 
    "Not happy with the size...it is too short lengthwise and widthwise...looks pretty just looks like it is not the right size", 
    "Just moved so the bed isn't completely made but the bedding us lovely just the same.", 
    "You can never truly tell what you're buying from a computer screen, so I relied on the reviews before purchasing, and they were right on!I am so happy with this set. It is beautiful. Good quality. Pretty colors. Matches my new decor perfectly. The brown is a lighter color not deep chocolate...like a mocha.I am very happy with this purchase. My only complaint is I wish you could buy extra bed sheets, and maybe extra decorative pillows that match the set.:)", 
    "The colors were pretty and what I wanted, but the comforter snags easily when washed (need to use a large commercial machine) or if you have pets. I don't have a cat (which I think would be awfully hard on this comforter) but I do have a dog who has snagged it a couple times when she's jumped up on the bed. The comforter also snags easily on jewelry or other items that may come across it. I've had this set a year now and comforter is badly pilled and worn. I decided to buy a new king size duvet in the same pattern to put over the comforter when company comes--so I now have extra pillows--but just didn't want to throw out the whole set!", 
    "This sure is a pretty bed ensemble", 
    "Really like this. A lot of stuff for the price!!!", 
    "Looks better in picture. The blue shams were sleeping bag quality. I am too embarrassed to use it. Will probably give it to someone who had no taste. Haha", 
    "I love the comforter but the sheets could have been a little better in quality!!", 
    "Love it at first but it's not holding up as well as I thought. I love the colors but seems cheaply made.", 
    "Comforter is nice, sheets are poor quality and VERY stiff after washing twice and using fabric softener,", 
    "This was a wedding gift for my granddaughter and she was very pleased with it...Loves the colors", 
    "Looks great, but thread started coming after after wash", 
    "this was a gift but i really love how it looks", 
    "Colors are accurate and looks lovely with pail blue walls.", 
    "Not expensive so wasn't expecting much. Fabric had a bit of an odor. Washing/cleaning fixed that. Didn't use sheets included other than to cover the box springs on the bed. For guest room, the look is attractive.", 
    "This cost me over $100 & it is very preety BUT it snags easily & is very delicate,my kids & hubby already messed it up just by laying on it", 
    "It looked good online, for the most part the reviews were good. I remember on particular review saying I have cats and it doesn't snag. Well I have to say from the moment I took it out of the package, just the way it was designed looked snagged. My cats within two days had it totally snagged all over the place. I didn't want the hassle of packaging everything back up and shipping it back or I would have returned it. It will suffice for now, but don't expect a very long life span. First wash and dry of the sheets and I could hardly get them on to the bed again.", 
    "I absolutely love the set. Goes perfect with the colors and picture i choose for guest room.", 
    "The comforter set is classy and suits us to a tee!", 
    "Looks very classy. Colors are perfect. I have the curtains too, so my bedroom looks very well put together.", 
    "the bedspread fabric catches on everything and pulls. The sheets are not the best quality. There are lots of pillow shams. This is probably worth the $$ I paid, but not much more", 
    "I am very pleased with all components of this ensemble.", 
    "Order this set and when I got it I loved it...however after being on the bed for a couple weeks at the top of the bedspread the matting is bunching up and the bed spread catches on most things...call overstock said I'd have to talk to company and I did, they wanted pictures sent pictures have no to this day hear a word so now I have a bedspread that looks cheap and messy... would not recommend this item... having trouble trusting Overstock now to purchase anything else ...didn't stand behind product.", 
    "Cheap materials, never again", 
    "Comforter fabric snags easily!", 
    "The comforter is beautiful but was cut wrong for a Cal King Bed - the head is on the short length when it should be on the long. But because of the hassle of repacking to return I made it work. The shams and accent pillows are great. The sheets ARE HORRIBLE!! Even after washing as instructed they are not at all colorfast and were ruined before I could even use them.", 
    "love my bedspread good excellent quality", 
    "Love this bed in a bag set. It is well made and an excellent value! Definitely recommend buying this!", 
    "This was exactly as advertised. It is elegant and great quality for the price. We have a dog that jumped up on it a few times and I freaked out because of the others saying it caused it to pill or get snags. Nothing happened and disaster didn't occur. I don't allow the dog on it though since I suspect it would. Also the small pillow got on the floor and the kids stepped on it and got black mud on the white pillow. I had a tantrum and threw it in the trash. My oldest daughter got it out and washed it and it turned out beautiful, so I was thrilled. Sorry to give you TMI, but I'm so happy with the purchase.", 
    "This comforter set has been wonderful. Full and heavy enough through the winte. Washes fine too. No snags like other reviews I had read prior to purchase", 
    "Product was perfect in fabric and color. Able to get full headset with cover at a very good price", 
    "Beautiful set, looks greats and has held up with my dog jumping on it. Only complaint is the one set of shams is an odd size to get a pillow to fit it. I would purchase again.", 
    "I was really surprised by the quality...for the price it is wonderful. I washed the comforter and it turned out perfect. I will definitely purchase an item like this again. Price was fantastic!", 
    "Love this set and would have given a 5 star if it didn't snag so easy and sheets weren't so rough, true color as picture shows and can't beat the price", 
    "Nice quality set but the sheets are a bit scratchy. We love the colors and the comforter is a nice medium weight.", 
    "nice quality and great colors and comfort. Only wish it had come with pillows. The two solid light blue pillow cases are for square pillows and I've not yet been able to take time to try and find them somewhere", 
    "Nice comforter. Really like the set. My only complaint is that the comforter I received measures 90x104 instead of 92x106 which is what it advertised. Since our bed is a little higher than normal that extra two inches would have made a big difference.", 
    "This is much better than I anticipated! My favorite colors--just like it was pictured!", 
    "bought this for my boyfriend for a valentines gift. He really likes it", 
    "It's wonderful how something new can change the feel of a room completely. Mine was a solid blue look. Now it has great color, yet subtle. It has a totally \"new\" touch. Now--the fabric, although colorful, could be a touch more sturdy. Mabye too much poly? I don't know. Right now, I love what I bought. It was certainly priced right.", 
    "Bought this for my daughters room and its a perfect fit and color. Love the paisely pattern.", 
    "There was no dissapointment in this spread! It's a BEAUTY!", 
    "As I took the comforter out of the package, I noticed some pulls in the fabric and it has not even been used yet. Looks like it will snag very easily-looks very nice but because of the quality I will only use it for show and use a different comforter to sleep with. Got the matching curtains and valances and painted to match so I was hoping for something that would hold up over time-doesn't seem to be the case.", 
    "Very nice set for the price. I've been looking for 15 months to find something perfect for my master bedroom. This is almost perfect. I wish the brown was richer. I thought this came with 3 decorative pillows but is was 2. Bummer. I'm happy with it but not exactly what I was expecting", 
    "Great quality. Well crafted. Colors are lovely.", 
    "I love how elegant this bedding looks! I also like that when I took it out of the bag it didn't have big creases where it was folded.", 
    "This is very pretty and looks great on the bed but I ordered a California King and the sheets barely fit my mattress (this is a common problem with other sheets I have bought). Also, the bed skirt ripped very easily when I pulled it to straighten it up. It ripped on the part that is covered by the mattress so you cant tell but it was still a little disappointing.", 
    "This is my second Madison Park comforter set and I'm very pleased! This set has a romantic feel to it. Colors are taupe with an icy light blueish (almost aqua) grey on the comforter itself and the bedskirt is solid taupe. True to size and really comfortable. Not impressed with the sheet set, but they match the 2nd set of pillow shams (icy aqua in color) Decorative pillows are beautiful, would like to have the ability to purchase more of them. Colors on the comforter set are odd, but pretty- it would be nice to have matching towels and rugs to go along with the shower curtain that matches this comforter set!", 
    "I am very pleased with this comforter set. It is well worth the money.", 
    "Beautiful. Bought it for my daughter and son-in-law. They love it and it looks beautiful in their room. Will definitely buy again", 
    "This set is very comfortable. The comforter is not the color that it appears in the picture. The colors are a lot lighter than shown and it is almost silky. I also do not recommend for people with pets, as at times my fingernails can snag on the material. Overall, I like it.", 
    "Very pretty set. I love the colors! Material was a bit silkier than I thought but still great. Makes my whole bedroom more beautiful", 
    "With have a very thick mattress does not cover the whole side of mattress also the cover snags easy. Would not buy again", 
    "The material, the look of the ensemble is lovely. I like the quality of material and the colors are true to what was pictured. The fact that the comforter is not heavy is one of the nice features...very easy to make the bed.", 
    "can't complain bedding is as described.", 
    "THIS ADDS A LOT TO MY BEDROOM. WHAT A BEAUTIFUL BED SETE AND WHAT A GREAT PRICE. COULD NOT BE MORE SATISFIED.", 
    "We absolutely love this purchase. It looks great in our room and is soft and warm. Would buy again.", 
    "I just love the bedding. It is so pretty and has qualities that both men and women could agree on. Only two little issues so far. The sheets I got had two small holes in the fitted sheet. I didn't bother returning just the sheet. My main concern is that the comforter can snag a bit. It isn't too bad, but we have kids and pets and so I'm not sure how long it will last us. It is just the type of fabric but I am still very happy I purchased it.", 
    "Really nice comfortable set. Looks very expensive.", 
    "This bedding set is very beautiful and soft. Great Quality product.", 
    "The length needs to be longer for king size", 
    "Perfect colors for my fresh look & Not too bulky", 
    "Looks nice but material snags easily. It also didn't come with a pillow that was pictured with the set. It is attractive but should have been better quality for the price.", 
    "Excellent quality and looks beautiful in the Spare Guest room Ordered two sets for both full size beds. Fits great", 
    "I liked the price and the look but it snags very easily. I keep it protected with a coverlet but now I can't see it to enjoy it.", 
    "I needed a new comforter set and this is it.", 
    "The colors are beautiful and it's very plush.", 
    "Love love love this comforter set. Beautiful colors and just like the picture. Very soft.", 
    "Couldn't be happier with purchase.", 
    "This set is a great price for the number of pieces and is good quality. However, the fitted sheet is way too small for my cal king bed.", 
    "Love this set for our guest room. The matching curtains gives a decorator look. So happy with this purchased!", 
    "The comforter is beautiful. The sheets are very soft and comfortable. This is a high-quality set. Definitely worth the money. I have never had a more attractive comforter set. The first night I slept in it, I felt like I was at a 5-star hotel. It even made my bed feel more comfortable.", 
    "I love this comforter. It really made my bed look fabulous!", 
    "Beautiful set... great value!", 
    "Very warm.....................", 
    "Even nicer then the picture!!", 
    "I purchased this set for my guest bedroom, so I didn't want to spend a lot, but Iwanted it to look good. This set does just that. The fabric is beautiful, and thepillows are gorgeous. The sheets are super soft, too. I am very pleased at whatI got for not a lot of money!", 
    "Great quality. Exactly as pictured. it shipped quicker than expected...", 
    "The color was a little darker than pictured but quality of fabric was EXCELLENT and it beautiful! LOVE THIS ITEM! Looks like a $600 comforter", 
    "This is a very elegant set, but lacking in any pop. I think the comforter is going to snag very easily, but it's in a quest room so it will work out ok. I wouldn't use it on bed for everyday use.", 
    "I am very happy with this bedspread on my bed. Love the color. One of the problems with this set is the very back Euro pillows. It just came with two of these and I need a third one badly. This does not cover the bed when I make it up. I have a queen size bed and I need 3 euros. I have tried to find this brand online, stores, no success. Any info on where I could purchase one of these would be helpful. This material has the tendency to pull just a bit, I have to be careful that I do not have anything in my hands or on bed that could contribute to this.", 
    "Poor quality sheets and the rest is just average. Not worth the money.", 
    "Just received it and sent it and it looks great. Very detailed stitch work. We had another comforter that we were sending to the dry cleaners so we sent this one as well. Haven't had a chance to sleep with it yet though", 
    "The comforter is a little scratchy at first, but it looks fabulous!", 
    "Beware of purchasing this item! The stitching on the comforter seam fell apart after less than 5 washes. The manufacturer, E&E Company, refuses to stand behind its product, and when I finally tracked down their customer service dept, I was shocked to hear the representative initially claim they do not provide any type of warranty. (They also stated that they had no control over the quality of their product since they \"purchase\" it in China, and then they admitted there was a 30-day warranty which isn't saying much considering Overstock already has a 30-day exchange policy.)If a company doesn't have faith in its own products, why should you?Save yourself the money, time, and hassle and go with a product that's backed by a manufacturer that understands how to treat its customers and more importantly, takes pride in the product that it sells. There are plenty of other comforters out there that will last you at least five years, not just five washes.", 
    "I love the way this set looks, and it works well for me and my husband in general, but it isn't perfect.Pros: -- It looks very nice. It looks somewhat elegant, I think. I like the slight sheen. -- My husband didn't feel it was particularly feminine-looking -- he likes it, too.-- It was a good price. It is available elsewhere, but I comparison-shopped and the price on overstock was better than anyplace else online when I made the purchase.-- It comes with throw pillows and euro shams, which is great. -- The comforter is soft, and it is a comfortable weight -- it is somewhat fluffy without being too heavy. (I live in Texas and it is winter; I can't speak to whether it is too warm in the summer yet.)Cons:-- It snags easily. We've only had ours for a couple weeks and it is snagged in a few places. Now, when we sleep we put a sheet over the top of it. That prevents the cats that sleep with us from snagging it as much, but I wish that covering it wasn't necessary.-- The king size set really needs 3 euro shams to look right, but it only comes with 2. I'm looking around to buy another one, but I haven't found any just like the ones in the set so the 3rd one we'll eventually have won't match the other 2.We have not washed it yet, so I can't speak to that aspect.All in all I'm glad I made the purchase, but with the snagging I'm not sure it is going to last as long as I'd like.", 
    "This set is absolutely elegant. The price is unbelievalble. The same set at a competitor dept store was well over $***. I love it and will always go to Overstock.com before shopping anywhere else. The bedroom looks fantastic!!!", 
    "This set is exactly what I wanted. All the pattern is machine stitched. Colors as shown.", 
    "This comforter is better than I imagined. Great quality & beautiful! You cannot find it cheaper anywhere else! Trust me, I searched a lot of stores!", 
    "Beautiful. Just what I was looking for", 
    "Comforter for king bed is a little small, sheet set feels on cheaper side. Throw pillows look great.", 
    "VERY WARM AND RICH LOOKING. I LOVE THE COLORS AND THE ENTIRE ENSEMBLE, HOWEVER, THE COMFORTER HAS EASILY GOTTEN SOME SMALL PULLS DUE TO ITS MATERIAL.", 
    "This arrived on time. It was beautiful when we opened the box. The fabric looks like a satin. The colors are beautiful. It makes our room look elegant.", 
    "Got it for the wife. She loves it.", 
    "Lovely set. A lot for the money. Nicely made. Looks very rich.", 
    "Quite a pretty set. Still looking for pillows for the big square shams", 
    "Great quality and fantastic price and the pattern and colors are perfect", 
    "Beautiful ensemble. It looks exactly as pictured, very well made and luxurious. The sheets are soft, wash well, and really don't even wrinkle. I am extremely pleased with this purchase and highly recommend this set.", 
    "Love this 12-piece bed in a bag with sheet set. Very nice looking.", 
    "this bed set is beautiful the blue color makes it look fancy.", 
    "Colors are as pictured. Quality is good. Nice package of everything to make your bed look nice. One decorative pillow was missing and Overstock wouldn't send it. I could have sent me he whole order back and re-ordered but that was too much trouble. Sheets come out of my he dryer slightly shrunk, but okay. Overall a good price for good quality.", 
    "Beautiful comforter set. Bought as a gift to my Mom and she loves it. Great value for 12 pieces - the comforter is a very good quality.", 
    "but wish it wasn't such a slippery material, but it does look great", 
    "This set is beautiful and better than I expected. The blue pleaded shams require larger square pillows that I will have to buy. Regular Queen or Full are too small.", 
    "Light weight but very warm bedspread. The color brown was lighter that expected.", 
    "I love the bedding stuff, they are very comfortable and of good quality.", 
    "I bought this comforter for a guest room, and was very pleased with the look and feel of the product. My concern was that it had an odd smell… much like petroleum. Washing it and time have now diminished the odor.", 
    "Gave as a gift and was impressed as to the detail and beauty of the item. Made a nice impression.", 
    "They loved it....for Christmas....", 
    "Nice colors, good pattern, fits well. Happy with my purchase!", 
    "Absolutely love the colors and the comfort of this set; very cozy! Only thing I would have to add is that if you are a \"hot\" natured person you definitely don't want to add a blanket underneath the comforter!", 
    "I purchaed this set a few months ago and I'm very happy with it. The fitted sheet is oversized so it fits the corners of the bed with stretching it. The comforter is nice and fits my King bed perfectly. The pillows is a nice touch to finish the bed.", 
    "Great buy for set that had so many pieces and the quality was great.", 
    "I'm happy with the comforter", 
    "I love this comforter and accessories. Very happy with this purchase.", 
    "Nice for the price. Color are rich. Sheets are generous for deep mattress", 
    "Great price for a 12 piece set. Looks elegant and timeless.", 
    "If you are looking for an inexpensive brightener for your bedroom then this is it. For the money you pay, you get value. The quality is not the best, but, it really looks nice. Even if it only lasts 6 months, it was worth it!", 
    "The color was not the same I know colors on different devices can look different. I used three different ones to make my choice. It had that must smell some of you mention, it look like it had been open and repacked, misunder stood the twelve pcs. It is surposed to be Christmas present for daughter, not sure to keep or send back.", 
    "I love this set. It is beautiful. The pattern is not a printed pattern, which is awesome. But, I gave it 4 stars only because it can be snagged semi-easily. Shoes, dogs, or kids. The snags aren't large and barely noticeable but it is important to know, I think.", 
    "I love the colors. It is excellent!! Fits perfectly on a queen size bed.", 
    "I love this bedding set. It has beautiful mutes colors of brown, light blue and creams. It looks like the picture. I bought the matching drapes too. You won't be disappointed with this set if you choose to purchase.", 
    "Bed in a Bag set arrived as advertised and fits the decor of our bedroom perfectly. The only issue was with the package arriving late was not due to Overstock, but due to a late arriving truck of UPS'.", 
    "Very pretty colors, true to the picture. Sheets are decent for the price. Comforter is easily snagged, so just be careful! We have a very deep mattress and the comforter just barely covered down to the bed skirt. We looked everywhere for a blue and brown bed set and this one was just the best color, pattern and set anywhere. And you can't beat the price.", 
    "Colors are true to form and very stunning looking. Well made, comfortable and warm in the winter. I wasn't aware that all sheets/pillow cases came with and was very happy with their light blue color. What a buy!", 
    "This bedspread is beautiful along with the pillows. the sheets are even of good quality. I have a small and large dog that jump on my bed. They have made a few pulls but it is holding up pretty well. Very satisfied with my 1st Overstock purchase!", 
    "Alot of complaints of this item.Shipping took forever.It did arrive safe boxed ok.The fabric appears to be quality of seconds not first line by any means.The bed skirt is 4 to 6 inches inches too big for the mattress.The sheets look as if they came from Goodwill.The comforter has built in wrinkels in it.Pillow shams don't seem to fit King size pillows too large. I doubt very much if I will be ordering from Overstock again,The shipping is very very slow and the quality of the product on a scale of 1 to 10 with 1 being the worst thats how I would rate them as a 1.I learned my lesson and it was an expensive lesson to learn.I could return them but that would only add a month of shipping to recieve the product.", 
    "The fit and quality of this comforter is very nice. I'm very happy with the my purchase. The colors are very pretty.", 
    "The pillow covers and comforter are just perfect and are exactly as shown in the picture.", 
    "The comforter is too small, it barely hangs over the sides and I have to leave it about 6\" from the top to hang oriperly on yhe bottom. The quality of the bedspread (material) is good for the price, but it needs to be larger.", 
    "Beautiful. Better than expected. Looks great in our new house.", 
    "The set is just as it looks on line. The sheets are so comfy. They feel like linen. The pillows make a great accent. You need to have square pillows to fit in the second set of shams. Overall, love the quality.", 
    "This set is beautiful and more than I expected. I am very happy with it. It is very warm and beautiful in quality.", 
    "Love the colors they look so rich. I also ordered the matching curtains.", 
    "Purchase with confidence, this set is everything it says and colors are beautiful!!!", 
    "I originally ordered the wrong size but had a no hassle return and immediately ordered the correct size. Am very pleased with the set. The sheets and pillow cases are much more softer than I expected. The blue is more of a paler silvery blue than shown in the picture on the web site and much more appealing. It is a great value for a modest price and Overstock were very easy to do business with.", 
    "We had bought paint to change our bedroom colors, etc. Had to return the bedspread (12 piece set) because the bedspread did not fit; the sheet set is very cheap and even the pillow cases would not fit a normal size pillow. Very, very disappointed. Now, since already purchased the paint, we have to find another bed set so we can still use the paint.", 
    "I am so happy with this product. After looking at and comparing so many other comforter sets, I went with this one. I was holding my breath until it came, but when it arrived and we put it on our bed I knew I made the right decision. The blues are blue, the sateen is beautiful and rich looking and the price for this set AND sheets was excellent. I was a little bummed that I had to spend about $** for pillow forms for the European pillow shams, but it was my choice. I could have not used the shams, but I really like that look on the bed. I get happy every time I walk into the bedroom:)", 
    "Excellent quality. Exactly what I was looking for.Enhanced the look in our guest bedroom.", 
    "This is really a very average quality product. The sheets are especially thin, but since they are just used for occasional guests, they are ok. I wouldn't use them for my own bed.", 
    "I love the soft light silk-like feel of the fabric. One of the first concerns I have is pulling of the thread from something catching a thread. But I don't have a cat so I'm not too worried about it. I changed comforters because my old one was too thick and heavy for my washing machine. The only concern is I wish it were more like a bedspread and came over the edges of the bed more. I bought the King sized but It'd be great for a Queen sized bed. I also would have liked the set without the sheets included. Give me a cheaper price and I\"ll buy my own sheets thank you, unless you want to include some 800-1000 ct sheets.", 
    "Nice set doesn't come with 4 needed pillows, overall I would recommend.", 
    "This comforter is absolutely beautiful! If is very elegant and looks like it belongs in a magazine...at least my bedroom does now. I highly recommend it to everyone.", 
    "I love this bedspread in fact I loved it so much that this is the second one I bought. The first one I still have I use it in florida. The second one I bought for my mothers place. It washes nicely I do recommend you use a big washing machine or a commercial washer to wash it. The more permit has to wash the better it comes out. It also Joyce well on medium heat.", 
    "Love this set. It's soft and durable at the same time. Colors are great it really enhanced by bedroom.", 
    "Love it . Its the perfect color combinations. Looks very expensive. I wish I would ave known it was going on sale the next day and saved ****, The comforter is big enough that it covers the mattress well.", 
    "Great value, beautiful product. Prompt shipping, packaged securely.", 
    "While the colors are pretty, the set is very low quality.Cannot in any way compare to a ******* set I had several years ago.I'm keeping it, but I do not feel it was a \"good deal\".", 
    "It was time for all new necessities in my new home. I read the reviews on this set and, since I loved the colors and design, decided to order it. It truly is a beautiful set and I love the design stitched on the bedspread.", 
    "This comforter set looks great in our bedroom. We prefer higher thread count sheets, but the set that comes with it is pretty comfortable after being washed.", 
    "I ordered the queen size comforter set which barely covers the side of my top mattress. Even with the bed skirt you can see my mattress. Also the size of the pillow shams were 20 x 26. I purchased pillows that size and they were too small. I purchased some more pillows, 20 x 28 and they were also too small. Very frustrated!", 
    "We've had this comforter set and pillows for about a year and a half now. We are using these in our guest room with white furniture and it all looks very, very nice. The comforter isn't very think so if you are looking for thickness, this might not be the one for you. Though I like this for our use, it is made of material that picks very easily if it gets caught on something so this is something we have to be very, very careful with. If that is an issue, you might want to look at something different. The pillows, especially the Euro shams, are very nice. Overall it is good for a room that might not be used so frequently and we are pleased with this item.", 
    "The sheer number of pieces of bedding you get with this is great value, but the colors are gorgeous and rich, Absolutely love it all in my main guest room. Looks like it should have cost more than it did. Liked it so much I bought a set for another room in the black/taupe. Also awesome.", 
    "Nice color combo - very pretty. Overall quality is good except for the sheets which are thin, but acceptable. Happy with purchase - lots of compliments.", 
    "I have not put it on my bed, but I have openef it. Even though I thought the brown was chocolate (it is taupe) it is still a beautiful set. I love it!", 
    "Photo true to color. Nice quality but the dimensions seem off. I have a deep mattress and I measured the size before ordering and compared to others it was supposed to be larger. the comforter barely covers the mattress on the sides.. could have been at least 3 inches wider to fit properly. Length is good. If you have a regular depth mattress it should fit nicely. I have a sleep number with a 2in. memory foam which makes it a bit narrow. My old one fit much better.", 
    "This is an absolutely beautiful set. It greatly enhances the look of my whole room. The quality of it is amazing. I highly recommend this set to anyone looking for great quality that is affordable.", 
    "I was excited to receive this comforter set and was worried that it would be what I expected. Well to my surprise this is a beautiful set. The comforter is very elegant looking and with the shams it looks amazing. I do have a dog and was worried his claws might catch the material but that has not happened. I do recommend this and the price is right.", 
    "Gorgeous colors, very soft. Also bought the matching shower curtain.", 
    "I truly love this bedding! It seems great quality to me especially considering the wonderfully low price. The sheets may be a bit wrinkly, but they are so soft and comfortable that I don't care... who sees them anyway? I love the colors in this bedding and the way it makes my new bedroom look. I don't have animals sleeping on my bed, but I have had NO trouble with snagging as other reviewers mentioned and we have used this for about a month now. HIGHLY recommended!!", 
    "Did not get to use but it looked lovely. Had to return as the color did not fit with the shades needed.", 
    "I bought this for comforter and pillows only.It looks so rich and luxurious. I love walking into my bedroom.", 
    "Really liked the quality of this until I had to wash the comforter frequently. The stitching on the inside of the perimeter pulled and bunched up. Had to snap the stitching to try and reshape. Unfortunately, because I have dogs I tend to wash the comforter every week and it is not up to that kind of wear. Would definitely recommend if you do not have pets!", 
    "After purchasing this & seeing how much comes in the set for such a great price, I think from now on I will only buy Madison Park comforter sets. I was a little iffy about the quality because of the low price point, but it is really fantastic. Even the sheets are \"nice\" sheets. The comforter size is perfect, and the pillow shams & decorative pillows included really make the whole room (and such a wonderful price). I highly recommend this product, and I am now shopping for a new set for another bedroom.", 
    "Very nice comforter bedding set. Is all machine washable and very nice set up. I didn't like how thin the bed sheets were but they work and the color blue is so relaxing. Threads in comforter can pull if you have a dog but is still great quality. No regrets here. Love it.", 
    "WOW!!! This bedding set is awesome. It's very stylish and chic makes my guestroom look like a spa retreat. Everyone who has stayed with us since I've purchased it has been in awe of how the room looks and feels. I'm now looking at similar products from this maker to redo the master suite.", 
    "Product of good quality. It was a good purchase. Good quality.", 
    "Pattern on this set was beautiful, however the material felt \"cheap\" and if you have a bit of roughness to your skin, was just that type of material that stuck to your skin. Comforter was very cheap feeling, not a good weight for all purpose use. Very dissapointing and also when shipping back was charged *** for shipping back, even though the terms said free returns when I ordered it!", 
    "It looks nice from a distance but up close it has that \"hey, I'm cheap polyester\" sheen. I love the color and pattern though. We will use it until we find hirer quality bedding at an affordable price.", 
    "Excellent quality and soft sheets. Great value for price.", 
    "The sheets that come with the set are solid blue and average quality. The comforter and pillows are awesome. I love the comforter. It has that shiny look to it and the shams are beautiful.", 
    "This is an elegant and beautiful set, especially for the price. With twelve pieces included and a terrific looking result, what could be better?", 
    "i love the look of the set, however, be forewarned it snags very easily. I sat on it yesterday with my lap top, just moving the mac a few inches over and it left a huge snag. I am so disappointed. I am careful not to sit on it on it and the one time it do.......sigh. Also, the sheets, after washing it once, have noticed it is wearing as if I have had it for over a year. Another sigh.......it is beautiful just disappointed i have a new, beautiful set that already displays an unsightly snag and more to come, no doubt........", 
    "This sheet and comforter set is beautiful. The colors were not quite as the picture, however; they are beautiful. The comforter and pillow shams give the bed/room a luxurious look and feel. The sheet set is soft and seems well made and put together. It does not have any scratchy feel. All in all I am very pleased with the new look of my room. Definitely worth the money.", 
    "Really love my new comforter set. Quality is good. Color was true, and very pretty. Sheet set is very soft.", 
    "This bedding is absolutely stunning! I purchased it a couple years ago. I have dogs that jump on the bed, so their nails have pulled the driving s little bit. It's still in great condition, but I know it will be ratty in a couple years so I purchased a second one to have on hand because I love it so much!", 
    "Delivered a day earlier than than I expected. WHICH WAS GREAT, gives me more time to match paint , etc for my new bedroom. Beautiful Bed Set,, shower curtain and curtain panels. Loved shopping here.", 
    "I love the look and comfort of the entire bed in a bag with the exception of the sheets. They were not the quality sheets I usually use. However I guess with the price that is what I should have expected. But I really would have liked better quality That is what kept me from rating the product as Excellent.", 
    "Do not purchase. The fabric falls apart and snags VERY EASILY", 
    "I am very pleased with the quick delivery and the quality of the product. The comforter is embroidered and feels like it is worth more than I paid. I did have to order some Euro pillows but it was no biggie.", 
    "The bed set looks great. The comforter keeps you very warm. The comforter is long enough to cover your bed pillows and tuck so that if you get fed up with al the pillows, you don't have to use them. For that, my husband says \"oh happy day\".", 
    "This comforter is beautiful, durable, and comfortable. It looks even better in person. While the sheets I do not use as they are of low quality, everything else is perfect, plus, I didn't buy this set for the sheets. I have had this set for a year and have washed it 4 times. There are no signs of wear or tear and I have 2 small dogs who lay on my bed at night. You will not be disappointed!! I love Madison Park products!", 
    "This is a beautiful set, BUT the fitted sheet is not deep enough for a thick mattress.The quality is fine, sheets are soft, nice blue color. But too bad there were not 4 pillow cases instead of 2.The bed skirt fits perfectly and the color is nice, not a dark brown.The comforter is not wide enough to hang over the sides of a thick mattress.This is a nice set but it needs a little tweaking in the size department....", 
    "This set is really unbelievable for the price! I bought it for the comforter, and I expected thin, low quality sheets - not the case!! I had other bed pillows I thought I might use instead of the included ones, which I thought might also be cheap looking since the price was so low - not the case! The colors overall are a beautiful muted shade that seem to shimmer slightly. This ensemble is very well crafted - no loose threads, poor seams, mismatched patterns, etc., that sometimes come with such a low price. I am extremely happy with this purchase. I will warn a potential buyer - this set is not designed for a \"casual\" look! My bedroom is more formal (high 4-poster bed, antiques, etc.) and this fits right in with the look I wanted.", 
    "I love the quality and look of this set. The coordinating items that came with it (shams, European shams, two pillows, sheet set, bed skirt), also great quality and look. This is a great buy! It is a truly elegant set. Even the sheets are great quality. For the price, I thought they would be scratchy and they are soft and luxurious. Can't believe I got all of these things for such a small price. I also purchased the curtain panels - which were equally as elegant and are perfect in our bedroom.", 
    "This truly is a quality product. It has a nice weight and soft color. The set looks expensive on the bed. I have received many compliments.", 
    "I had my Master painted and bought this 12 piece set. it has transformed the look of the room. its really nice quality and I do love the color.glad I purchased it and I also probably to buy matching curtins", 
    "I received my set and I was very pleased. I love the decor of the comforter set. The only thing that I noticed that could be better is that the comforter snags and the sheets could be made of a stronger thread count. My test will come when I wash it and see how it hold up. I Will follow up on this review. The the money you pay for comforter now a days, they should be made with some good quality.", 
    "Love the colors just wish the material didn't snag on everything.", 
    "This set is just beautiful in person. The comforter is embroidered, not just a printed pattern. We have a king size bed and everything fits like a glove. We really like that the sheets and pillow cases are so soft; although they are lighter in color than we expected. My husband wasn't sure he would like the pattern, but it really dresses up the room with its rich colors.", 
    "The product quality seemed ok but the colors pictured were so far off from the actual product. The \"light blue\" was really a teal blue. The picture shows the base color of brown but it is really more of a golden. I was so unhappy with the colors that i had to send it back.", 
    "this bedset is exactly as represented in the photos. the coffee brown and sky blue work well together. I was concerned that the sheets would not be very thick or substantial. boy was I wrong. the sheets have a nice weight to them and with the lovely pillows, I can't wait to dress my bed up!", 
    "The pictures of this bedding set do not do it justice. It is very nice and so beautiful. It completes my bedroom. Couldn't be happier with my purchase. High quality and the sheets are so soft. Perfect for me (and hubby even likes it too:))", 
    "Color is true to picture. Very warm bedspread. I did order a king size for my queen bed and it fits perfectly. ( I have a high bed) I wish drapes would come with this set or at least show something that would go with it.", 
    "I am so pleased. Great quality! Affordable price! Thanks much! I will surely come back to buy more products!", 
    "Beautiful looking on thebef but had a few snags in the silky fabric straight out of the bag. **** sells similar product at **** 4 pc set. ****also sells similar 7 pc set. Both are much cheaper. This is 12 pc set that includes 4 pc sheet set that doesn't show the thread count that I could find in the description. Sheets are at best 300 thread count or less based on how they feel and wash up. For the price paid don't recommend.", 
    "I have had this bed in a bag for about a year, and have just taken it out of storage and put it on the bed. I would have done so sooner but renovations took longer getting the bedroom finished. It is a very pretty set and is nice quality. It looks stunning all put together on the bed. The only complaint was the blue sheets that come with it look kind of faded. though they are soft and comfy, they just look like they've been washed and used already. I bought an additional set of sheets that are in the mauve color for a change. Over all I am happy with the set. The color looks good in my new bedroom. The accent pillows are huge square shapes and finding the square pillows is going to be necessary. I used reg pillows and put 2 inside each and it works for me.", 
    "We absolutely love this bed set. It's beautiful, good quality, warm.", 
    "I was pleasantly surprised at the quality of this set. It is very soft and plush AND really fits the bed! I have a king bed and it really is long enough on the sides! The sheets seem to be of high quality and very soft - haven't washed them yet so don't know how they'll do after that.", 
    "This is a beautiful set! It is soft and fits the bed beautifully.", 
    "I was skeptical about ordering this but the good reviews outweighed the bad so I decided to go for it. The quality is very very poor, I was shocked being that this is not a cheap set. It snags very easily to nails, skin etc... There was so much loose threading that I had to cut off. The blues are nothing like what are shown in the picture. I boxed it right back up and now I'm just waiting on my refund. I wouldn't waste my time or my money.", 
    "We love the comforter set and it is wonderful to have sheet set included!! Now I have to buy some 26xx 26 pillows so we can see the total pkg!", 
    "The quality was great but it was very very shiny and more of a silver color in person. It was pretty but not what I was expecting. I returned it", 
    "I absolutely love this bedding! The comforter is thick, soft, and the material is beautiful. The sheets are soft and almost feel like flannel, but are not too hot. This is a great deal and I am very happy with my purchase. In fact, I've told countless people about it!", 
    "I received this bedding the same week I ordered it. It is high quality and looks very luxurious. I love that it is machine washable. The colors were exactly as the picture shown. I'm glad I picked this one!", 
    "Love, love this. it is prettier in person than the picture. The bedspread is warm and light as a feather. My husband like it too. Surprise? The colors are super. Just what I wanted. The bedroom looks like a showplace. I ordered the shower curtain and am having a valance made out of it. Pretty for sure....", 
    "Beautiful bedding. Great quality, beautiful colors! Would definitly buy again!", 
    "I was very pleased with the product and would definitely recommend this product!!", 
    "The set was well made and the colors were just as shown in the photo. I like the fact that it is machine washable. I replaced a set that I loved, but it always looked wrinkled and it had to be dry cleaned. This set is very rich looking and it goes well with our décor. I am very pleased.", 
    "Very beautiful set, way exceeded my expectations. Looks much more expensive than the price", 
    "The comforter is very pretty--the colors and pattern are very much like the photo (although there is a slight sheen to the fabric, which makes the colors look much lighter when the room is brightly lit). My only complaint is that the comforter should be a little wider and longer. I purchased the Queen size--I have an OLD Queen mattress, (so my mattress is not deep or \"pillow-topped\") and the comforter barely covers the sides and end of the mattress. The photo is a little deceiving, in that it shows the comforter generously covering the mattress and the top of the bed-skirt. The only way that would happen is if the comforter is pulled down (like in the photo) and is not covering the entire top of the bed. It is still very pretty and it works for me, but beware if you have a deep mattress!", 
    "I read the reviews before purchasing this set. The comforter is thick and snuggly. Those that thought it was too thin must want a heavy blanket instead of a beautiful comforter. I was surprised that the sheets are as smooth as they are since they are only 200 count. This set has transformed my entire bedroom!", 
    "We needed a new comforter set and hubby was browsing Overstock and found just what we had been looking for. It arrived 2 days before the arrival date, which was nice as I hate waiting. So far, we've found it to be of good quality, it wears well and while it's not too heavy, it is snug and cozy so a pleasure to cuddle up and snooze. Would recommend without hesitation and the price was more than reasonable. We will pursue other household needs in the future on Overstock.com. Thank you", 
    "The comforter set is beautiful. The brown is a little lighter than in the picture, but otherwise, it looks exactly as shown. The square accent pillow is embroidered, which looks really nice with the rest of the set and gives it the look of a more expensive set.", 
    "When I ordered this BNBg I wasn't sure if I would be satisfied. Sometimes the color depicted in the pict is not quite what you are expecting, especially when it is a pattern. It actually is really nice just as pictured and warm as a sleeping bag.", 
    "This \"bed-in-a-bag\" is a screaming value. Quality is quite good. Everything well made to exact fit standards. Fabrics are a bit lighter, particularly for the dust ruffle and the sheets, than you would expect at a higher price point, but not disturbingly so. The fabrics that matter to someone sleeping in the bed, after it's removed from the bag, of course, [:-)] are quite good. I bought this set for a guest bedroom. The folks who slept in the bed over the Christmas holiday reported it to be warm and comfortable. Highly recommend for guest bedroom use.", 
    "This was a gift for my Mom, and it is absolutely beautiful. Great quality and looks better than the picture. She loved it!", 
    "redoing master bedroom, and this was just what I was looking for", 
    "The set looks luxurious and fancy. Got the curtains to go with it and they are also great. Nice fabric and color is just as shown. Love it!", 
    "I was very pleased when I opened up this set. Great quality and a beautiful use of browns and blues. The sheets are lighter weight, soft and have an organic feel to them. The comforter is better suited for warm/cool weather. I have found the need for an additional blanket in the Winter.", 
    "Ordered this after some research and it is the perfect color. Love it!", 
    "Just received my bedding set and have to say that I'm much impressed with the quality of the comforter and the sheets! Very luxurious! Looks great on my king size bed and love that I was able to buy a coordinating shower curtain! Thanks Overstock.com!", 
    "I've never purchased bedding online before so I was a little skeptical. It turned out to be a great purchase! I love the whole set. Very high quality and it looks beautiful--very elegant. I have two large dogs that like to hang out on the bed and there is no damage to the bedspread with their nails. I highly recommend this product.", 
    "This set is absolutely breathtaking! Looks very high end at an affordable price, and I like the sheen of the fabric. I plan to paint the bedroom blue to match the Euro shams. All will look exquisite with my espresso bedroom set!", 
    "This bed set has an amazingly rich presence to it. It instantly adds a sense of richness to the bedroom and the quality and feel of the sheets and pillowcases are of good measure. I've seen other sets by this brand name and have always been impressed with the product that they provide. You will not be disappointed.", 
    "When we purchased a king size bed we were in need of bedding. I found this set and was won over by the price. It is what you would expect for the price. All pieces are good quality for the money you spend but none are exceptional. The comforter is thin so depending on climate you may want an additional blanket or two for warmth. The throw pillows, standard and euro shams are very nice. The color is shinier than is depicted in the picture. The blue is almost a gray because of the shine but it works very well with our pale blue walls. There are matching curtain panels that I am considering getting because it may be touch to match otherwise. A great inexpensive complete bedding set for the money.", 
    "This was a great purchase,.It added a touch of elegance to the room.", 
    "This comforter set is beautiful, I love it!. Not as brown as the pictures show on line, more of a bronzy color but that works great with my bedroom colors. Entire set is very nice, materials are very soft, not hard and scratchy like some sets. Looks like it will hold up very well too. One of the best sets I've purchased!", 
    "We are very pleased with the bedding. It is very nice and works perfectly in our room!", 
    "It is made in China and has a shine to it that I find unattractive and cheap looking but since we washed the sheets already I am unable to return. It is lightweight which is good for sleeping but tends to slide around on the bed. This is the 2nd piece of bedding I have purchased from Overstock and was unhappy with the 1st one too. I paid*** for my last set vs. *** for this one. I sure can see the difference! Will not order anymore bedding from this company.", 
    "I was disappointed in the quality of the comforter and the blues didn't match. The sheets were not as nice and I thought they would be.", 
    "It is a X-mas gift for my Daughter. I like, so if she doesn't, I will use it!", 
    "I had put off buying this set for sometime and now I wish I hadn't. The comforter and sheets are so comfortable, it is hard to believe!! However, you do have to watch as the comforter will snag, other than that it is a perfect set!!", 
    "This bedding set is beautiful. It gave our simply decorated bedroom such a look of comfort and class. The top side of the comforter is beautifully threaded and ornate but the bottom side is VERY soft and comfortable. This is a fantastic overstock buy and looks like $1M bucks on our king size bed. When house guests have seen it they always comment \"I want to crawl in there- looks cozy\". It is!", 
    "Shipped super fast and arrived in perfect condition. The comforter is a jacquard (woven) top with a soft underside which is good because the top feels a bit scratchy. The sheet set is surprisingly soft and comfy. The really unsatisfactory part of the set is the dust ruffle. It has a slippery side that goes between the mattresses that makes the mattress slide around. Every morning I have to push the bed up to the headboard. It would have been better to make the dust ruffle out of cotton to prevent the slickness. The throw pillows and shams are cute and the comforter has a somewhat shiny/silvery pattern which adds interest to the whole bed. All in all, I am mostly satisfied with this purchase.", 
    "We are very pleased with the comforter set we purchased. The muted colors go perfectly with our bedroom walls. The sheets, however, are not the quality that I was expecting. Overall, we are very pleased with our purchase. It was a good buy.", 
    "The set is very nice and comfortable!!! It goes very well with our bedroom. Colors on the web site are very close to actual. Pleased with the purchase.", 
    "I love the set, but it seems to look a little lighter than the picture. I still loved it!", 
    "This is a wonderful set for the price. All the parts are nicely made, seams line up, etc. The colors are soft and appealing. My cat has managed to pull a few threads on the spread but that's life with a cat. The king size and euro shams work well and the throw pillow are nicely done.", 
    "We have re-done our house and wanted to get new furnishings for our bedroom. This set is beautiful and looks wonderful. As several of the others have mentioned, the blue leans toward aqua, but still looks great. We purchased an upholstered headboard in khaki and it looks great with this set.", 
    "I was renovating my daughter's room into a guest room. I chose the colors of brown and blue to go with the gray/white drapes my daughter left behind. I was pleasantly surprised to find this bed set with sheets at such a great price.", 
    "The bed in a bag comes with everything.entire fitted Sheets set, two sets of shams, dust ruffle, decoritive pillows aquare and log. Looks great, feels great.", 
    "The sheets felt very silky when I removed them from package. However, once washed, they felt like light flannel or jersey material. I suspect they will pill after a few washes. They are also very thin. Considering the price I got the set for, I would purchase again", 
    "Great comforter set! Matches curtains great! Enjoyed shopping at overstock.com!", 
    "This was just perfect for our master bedroom. The shipping, the quality, the overall experience was all fabulous. We purchased the matching panels for all three windows, too. It gave our room a whole new look and we love it!", 
    "Spreads look rich. Pillows are nice and full. Sheets launder nicely and do not require ironing if taken from dryer immediately. Spreads don't wrinkle. Great quality for the price.", 
    "although the ensemble looks beautiful, the quality is not what I expected, considering the price! The sheet set faded and peeled almost to a see through in some areas after only one washing. Gave sheet set away, had to buy new sheet set.", 
    "colors and pricing great. the ease of shopping and having delivered to house is addictive.", 
    "This bed set was exactly what I was looking for! I looked long and hard for a chocalate/blue color scheme to match my new bedroom and this one was perfect! The quality of bedding is great for the price. Sheets are also awesome! I was totally satisfied with this purchase!", 
    "Snag, snag, snag. Every time I touched to comforter I snagged the top comforter with a nail or even skin. Too, too high maintenance for life. Sheets were very nice. Could not wait to return this product.", 
    "Similar set seen in walmart for under $40. Also, one of the curtain panels has an orange flaw. Can we have a new panel?", 
    "Everything about this set is amazing! There is actual stitching on the comforter so you have to be mindful of snags (pets, rings, etc). I was concerned about the quality of the sheets since the whole set was $150 but they're very soft. I'm 100% happy with this bedding set!", 
    "Very nice set for the price! Came with sheets, 4 pillow shams, bed skirt and comforter. Looks elegant.", 
    "My bedroom now looks like an expensive and calming bedroom. This set is so comfortable. I can't wait to go to bed at night. I was really impressed with the beauty and quality of this set.", 
    "This bedding look great in my room! Love the colors, they are definitely lighter than I expected though. I thought it would be more chocolate brown but it's more dark taupe? I love it though!", 
    "We loved the sheets and the pattern,but the whole set stunk like machine oil and musk. It was so offending after a week or two, we called Overstock and asked to please swap for another. The second set was 100% same problem! Sent both back and my house still smells of the 12-piece set. Really disappointing.", 
    "Item was lighter color than the pictures on O, almost teal color. Comforter is very thin but overall good value for 12 items including pillows, shams, sheets and bed ruffle.", 
    "I love this Bed in a Bag set. The sheet set along with all the other pieces are a super deal and the quality is top notch. The colors really compliment our navy blue walls. The free shipping is always a big plus.", 
    "The bed cover and pillows are great, sheets are scratchy and uncomfortable.", 
    "I am very pleased with this Bedroom set! I like the fact that the comforter is stitched and is not just another silky comforter. If you have pets that sleep on your bed this might not be the comforter for you as i think it would snag. The sheets are very soft. I painted my bedroom iceberg blue after seeing how dull the comforter set made my room look-lol now it looks amazing! The curtains are being shipped!", 
    "Price relative to product value is excellent, would have given the product an excellent in appearance, but the product in the picture as advertised must have had the show pillows starched, to illustrate the ends of the pillow cases, the pillows that were delivered were not starched, which made it impossible to stand up the show pillow ends, washing the show pillows with starch would remedy the limp look.", 
    "Love the look of this set, however, I have a king sized sleep number mattress that is deep and it does NOT hang down far enough to cover the mattress. Length is fine, wideth at least 6 inches too narrow. One pair of the decorative shams are square & a standard pillow does not fill it up both directions. The sheets looked very poor in quality hmmm... so I washed them.... UGH!!! Aweful! Almost thin flannel pilly feeling, wrinkled terribly - even after a de wrinkle steam shot in dryer. Pillows cut & sewn so badly they twist when you hold them up, can't even fold smoothly! Throw away the sheets! On the up side of this deal - I love the rest of it (I put the short side so can't see it), the comforter feels almost cotton like, not snaggy satin, nice decorative pillows, AND A BARGAIN - the price was DOUBLE (without sheets) at JCP - exactly same set.", 
    "This is actually my second set like this! Just got a new bed so had to get a bigger size! Absolutely love this!", 
    "I would definitely recommend this product, it is true to color and size, very please with my purchase ,", 
    "I loved this comforter set visually, but it isn't practical for anyone that has pets. The material snags very easily, so any time our cats jump on the bed, they end up leaving a small pick in the fabric. There are many snags, strings of material, and picks. The colors were perfect. The design was perfect. But the material is not.", 
    "I was a little disappointed. The comforter is a little small, fits okay but not as generous as in the picture. Color is a little off, more greenish blue than in the picture. It is pretty and will work fine in my guest bedroom.", 
    "Good quality and exactly what I wanted. Would highly recommend this product.", 
    "Looks great in the guest room. Be aware that one pair of shams are Euros.", 
    "I love this 12 piece bed in a bag set. It was perfect for my needs. The comforter is so cozy and beautiful. The sheets are very comfortable to sleep on! I have been looking for a bed in a bag set for some time now. Never was able to find anything that I liked until now. I wasn't even looking for a 12 piece set so that was just a bonus for me! Made another great purchase on Overstock! Thanks!", 
    "Received our set within a week of ordering and put it on our new bedroom set in our guest room and it looks great just like in the picture.", 
    "It is so pretty and looks great. Well worth the money", 
    "Great quality. Colors are just what I wanted. Blue accents are a silver blue not bright. Great value for the price.", 
    "The color was not as shown/advertised. It was more blue-green than blue.", 
    "Product arrived quickly and was exactly as described. Sheets are not as smooth/cool as we like for summer, but will be perfect for winter.", 
    "HAVENT RECIEVED IT YET, BUT SHURE IT WILL BE FINE AS ALWAYS", 
    "The bedding is just what I ordered. The colors are lovely and I am now painting our master bedroom to go with the colors.", 
    "Color and quality as advertised but the sheets had to be returned as they did not fit my Cal King mattress and the pillow cases were also too small.", 
    "Except for the extremely slippery the material on the skirt for between the mattress and boxsprings, it's a nice set.", 
    "the 12piece bed in the bag set is beautiful. I would prefer a higher thread on the sheet set", 
    "A nice replacement set for our guest quarters. Many pieces, nice color and soft. A good value for the money.", 
    "This bedding set is really great quality and is a beautiful color. I saw this same set from a high end department store and is was twice the price of this one and you did not get the sheet set. Would highly recommend this set.", 
    "Very nice comforter. Looks great on my new King Sized memory foam!", 
    "I was disappoint in the color of this bedspread. The blue was more of an aqua than a blue. The fabric was good. The sheets that came with it were a high count cotton. The brown is taupe color. A pretty bedspread but not what I was expecting.", 
    "Although I have not had a chance to use the set yet as it is for a move, Everything looked pristine and exactly what was promised!", 
    "I was a little hesitant to order bedding without feeling the quality beforehand but am glad I purchased this bedding. It is so comfortable and even the sheets are soft. Definitely recommend.", 
    "Soft, elegant and colors are awesome! Unbelievable set for the price.", 
    "It was scary to order something when you have carpet to match...but this turned out so well! It is soft and very well made. I like the colors and all the pillows. I ordered the shower curtain which is fabric... for a window treatment. I will cut it off and also make more pillows. The design in the fabric is so nice and looks very rich. I am very happy with this set and would recommend it to a friend.", 
    "nice design, colors are true to image and good quality for the price.", 
    "I am very happy with my new Bed in a Bag!!! The actual product looks just like the picture. The material is very soft and the comforter will be nice and warm in the winter. I love the look of all the pillows on a bed...it gives it some personality. Very happy with everything", 
    "Looks beautiful - true to image on internet. Looks perfect with our light blue walls in the bedroom and definitely appears more expensive than the cost. We have 22\" deep mattress so the sheets don't fit but we can donate them. Pillows are a nice touch. Not sure about the square pillow shams but the look ok on standard size pillows.", 
    "Better than picture. Really love this on the bed.", 
    "Gorgeous fabric and looked just like the picture. The only suggestion is that the Euro pillows were not 26\" square. They were more like 30\" so I ended up buying pillows that were too small. They look kind of flat because I should have bought bigger pillows than the shams stated.", 
    "I really would have sent it back if I didn't have an immediate need for it. It had a rip in it, and it had a REALLY strong chemical odor. Love how it looks when the bed is made, and overall, the quality seems good. Luckily, the rip is in the back. Took 2 washings to get the smell out though.", 
    "The bedding is beautiful. It is true to color on the picture. It seems to be good quality. I did have to purchase euro sham pillows for it and they were difficult to find. I do not like the sheets however, they could have been a higher quality. Overall a nice product and would purchase again.", 
    "Great value for the money. The product is a bit shinier in person than in the picture, but it still looks good. And, a complete set for that price seems like a great deal!", 
    "This is a great find. The extra pillows are nice, everything is quality and it is all very comfortable and warm. The only thing I notice, is that I purchased a set for Queen size, and the comforter is just slightly too short. When you line it up at the bottom of the bed, there are a few inches missing so it doesn't reach the top all the way. Good thing there are fancy pillows and shams to avert that fact. Fold it over like the picture and it's all good. Thumbs up.", 
    "It's elegant and absolutely stunning! Colour is true to what is shown and rich. Ordered this from Australia because we can't get anything that looks as good as this for the price here. A few stray threads here and there, but overall very good value for money.", 
    "Excellent value! The perfect colors we were looking for. Sheets far surpassed our expectations in softness and comfort!", 
    "This was a great but for me. I wasn't really that surprised at the great outcome, because I usually read reviews before buying most things online, and this set mostly positive reviews. I was surprised however; in a pleasant way.", 
    "The comforter and the pillows are beautiful. The sheets are 100 percent cotton, but not as soft as I would like. I think after a second washing that they will soften.", 
    "I have received so many compliments on this bedroom comforter set. The texture is just want I expected and wanted and the throw pillows make the perfect accent to the set. I definately recommend this set. It is an A+!!! The color combinations work very well with the blue brown and beige. Now I have to find some curtains!! The sheets are very soft and just great. I am very happy with this purchase.", 
    "Loved, loved loved! It was just as presented and looks awesome. The sheets are very soft and cozy!", 
    "It is a beautiful set but the quality is very low for the price. The sheets are thin and the comforter is delicate, too delicate! It easily pulls and snags on things and after a couple of months it looks pretty bad for a bedding that costs well over $100.", 
    "I was very pleased with this set overall in terms of quality and overall appearance. It is very pretty, as others have said correctly. However, the color isn't at all as it appears. It appears to be a medium dark chocolate brown, but it is actually Taupe. The blue is pretty accurate, however. This is a significant thing to mention because Taupe is much cooler in terms of browns than the chocolate shade. So, if you are matching to walls, as I was, it is an important detail. However, I am keeping the set because otherwise I am very pleased with it. It is washable and very well made for a polyester comforter. The pattern is actually stitched and looks classy. Luckily, my walls aren't too far off in color as to clash.", 
    "I read all the reviews I could and decided to order this set. I am very pleased. Yes, the sheets are cheap and I won't use them but the set is pretty and looks so nice in my master bedroom. The brown isn't a true dark brown, but the colors work well together and it's what I expected after reading the reviews. The comforter is on the small size and is light weight, but for the price you just can't beat it. I have had many complements on it, I would order it again.", 
    "This is a beautiful set. There's lots of silver in it which adds a nice airy look to the room. It's very expensive looking and a great deal for the price. I have three dogs that sleep in the bed and there have been no problem with the weave at all.", 
    "A nice looking comforter with pillow shams and two decorative pillows. The comforter did have a couple of loose strings I needed to cut off but has a very nice look to it when my bed is put together.", 
    "This 12 pieces bed in a bad was well worth the price and came under the cost of other \"bed in a bags\" at our local retailers. I love the color, which I thought rang true to the online image and the sheets were very soft as well. I can't say anything bad about it really, it was gorgeous and worth the money. The details in the stitching is beautiful!! This is used for a guest bed so the durability isn't really a factor for me. I hope it lasts a long time, because its gorgeous! Even my macho boyfriend said he liked it :)", 
    "Great comforter but the sheets a less than desirable.", 
    "This comforter set exceeds all my expectations. I looked and looked for a washable comfortable set that was expensive looking which did not have to be dry cleaned. I have dogs and dry clean is not an option. The price was very reasonable compared to the one at name brand store near me.", 
    "I love this set! It matches my bedroom perfectly. The pictures online depict the colors very well. Not only is it gorgeous, it is comfortable as well.", 
    "so happy with my new bed in a bag, my rooms looks so much better now", 
    "This bedspread is beautiful. It's not for the dogs or cats to get on because it does pull easily. Other than than no complaints. I would order it again!", 
    "I received this product in a few days. The product is as advertised, if not better. The color is right on with the pictures and descriptions, the package contains great throw pillows. The price is amazing for the quality and amount of products you get in this set. Me and my fiancee were going to put a comforter set on our registry, but we figured that by buying it ourselves, we can spend relatively less than someone would on our registry and put that towards another item (or more!) on our registry. The product is amazing and half the price of the products at Kohls, Bed bath and beyond and Macy;s. Must buy!", 
    "The color of this comforter set it beautiful and just what I was looking for. The sheets are very soft and comfortable as well. Very pleased with my purchase.", 
    "This fabric is richer than what is shown in the picture. It is holding up well even with a pet napping on it. THe sheets that come with it are not fabulous, but the rest of the set is WELL worth the price.", 
    "Love the colors, material and fabric! Great price and value! Wish it had another set of sheets with it.", 
    "This set is very very pretty. I have just received so I'm not sure about the quality - that's the reason for the 4 stars instead of the 5 stars. I will give it 5 stars for beauty", 
    "This is a great set, especially for the price! Amazing how well it fit into my guest room with the colors I already had there. My little Yorkie sleeps on it sometimes and there are no picks or snags. I did have to press the skirt as it was very wrinkled and I like a well made bed! I'm very glad I bought this set.", 
    "I love this set, I got it in last night and am very pleased! Love the look, matched what I saw exactly in the photo! Only problem I had was that in getting the 12 piece, the sheets that came with it already had what looked like a bleach stain and could tell the sheets was of a cheap quality. I also got the round ( I call it tootsie roll) pillow, which I'm not a fan of. If the sheets had been of better quality, it would have gotten the full five stars. I'm not expecting much out of the sheets, and could have foregone the extra cost they accrued.", 
    "JUST LOVED THE SET, COLORS WERE AS PICTURED! THE QUAILTY WAS GOOD.I AM LOOKING FOR THE OTHER BEDROOM NOW!", 
    "The set looks great on our four poster raised queen sized bed. We have used the set for about 9 months and it still has kept its shape! The color blends well with my furniture and carpet! Great purchase!", 
    "I LOVE THIS COMFORTER SET!!!! IT REALLY MAKES THE BED LOOK ELEGANT. THE COLORS IN THE COMFORTER TIE IN PERFECTLY WITH MY BEDROOM AND MY BATHROOM. THE SHEETS ARE SOFT BUT THEY ARE WRINKLE WHEN I TAKE THEM OUT OF THE DRYER. OVERALL I AM HAPPY WITH MY PURCHASE.", 
    "I'm sold on buying bedding through your site! This set was perfect for the guest room! Colors were right on, material awesome! Good by retail malls!", 
    "This set was not what I excepted it to be. The bedspread snags easily. Seems to be of poor quality. Made in China!", 
    "I received this set and was disappointed to find that the color was wrong. It was green and not blue. And the brown was more of a bronze. It did not look like the picture. Returned.", 
    "Was lighter in color, especially the brown edging. Had it been a rich mocha, it would have been beautiful. Shiny look. I returned it.", 
    "Great bedding withe beautiful details. Highly recommend for any bed!", 
    "When I got this I was a bit concerned as it seemed a bit thin fabric, but it's held up fine in the past month or so and looks as good as new! Also, it is super easy to make the bed in the morning as its not a heavy comforter. It's light, but surprisingly warm as well since we keep our house colder at night. It matches beautifully and looks like a complete set. Very pleased!", 
    "Very pleased with the set....Especially for the price", 
    "My boyfriend and I looked for a bed set for months. It seemed like everything was too feminine or too masculine to please both of us. This was the perfect blend of both to make us happy. It looks great on the bed and feels even better. We bought another set of sheets with a higher thread count, but the sheets that came worth it are nice too. We bought a king size set, even though it's a queen bed, because we plan on getting a king in the near future. I thought the comforter would be HUGE but it's not that much bigger than the queen. I don't know the exact difference between the two, but if a king is much wider, I hope this will fit....", 
    "Overall, I liked the set. The colors were nice and the blanket is very warm and the sheets are soft. My only complaint was that the stitching pulled out a little bit on the blanket. This is for our guest room so it won't be used everyday and shouldn't be a problem. I wouldn't want to use this as an everyday item as it doesn't seem like it would hold up to frequent wear & tear very well.", 
    "very nice; makes a pretty bed, would buy again; I bought it for someone else and they like it also", 
    "Very pretty set. Not too feminine, so my husband really likes it too! The only issue is that it doesn't seem to lay flat on the bed. Hard to describe, but it kinda bunches up in spots.", 
    "I was very pleased to see the quality of the fabric when my Bed in a Bag came in. The colors are vibrant and the comforter has a nice sheen to it. I got the matching shower curtain to go along with it and I could not be happier with the set....just beautiful!! :)", 
    "Great buy! Every piece well made and excellent fabric . Sheets have very deep pockets and fit well.", 
    "i just love love love it.it was everything I hoped for.irecommand it very highly.", 
    "I loved the look of this online and it's a pretty good representation, excep that the comforter and shams are very shiny. Many things get stuck to the comforter and the stitching gets pulled. It's good for the price but I'm looking for something else still.", 
    "I ordered the Cal-King for our Cal-King bed and it fits perfectly. It hangs down the right amount on each side and the bottom. The top of the comforter is about a foot down from the top of the bed but all the lovely pillows cover that part up so it doesn't matter. There were a few loose threads but that is to be expected. The colors are so beautiful and look just like the picture. Please note that the rectangular pillow is not included in the set. I am only using the king size shams with the 2 throw pillows and not the blue shams as I don't want all those extra pillows to mess with but the whole set is beautiful. It is very good quality. We have 3 cats that lay on it and it is not a problem. I hung dark brown drapes and they look so nice with this set. I think that light blue drapes would also go very nice with it and they would bring out the blue in the comforter and shams. You will not be disappointed if you purchase this lovely set. The comforter is a nice weight and not too hot. My Husband is thrilled with it also and loves the way it matches our dark brown bedroom set. The sheets feel very nice. We have not put the bedskirt on yet since I ordered pin holders for that so it won't move around since our mattress is so heavy.", 
    "I am very happy with the overall comforter. I love all the colors! Be very careful it snags easily. I have four children and had to already spot clean and it cleaned up very nice as well. I keep snagging with my wedding ring and finger nails. If it was not for the snagging I would have gave it excellent.", 
    "colors weren't quite the match i was hoping for but look ok in newly repainted room - bedspread has one small flaw in pattern but not very noticable - one bed pillowcase has small hole in it - overall, it looks so much better than what i had that i am pleased - now i just have to keep the dogs off it so it will hold up!!", 
    "Beautiful comforter. Wasn't sure about print but really like it. Washed well. Perfect size and true to size.", 
    "Love the look and quality of the set. The only drawback is I found what look like black magic marker scribbles on the corner of the fitted sheet and a pillowcase. Since I didn't buy the set for the sheets, I'm not dissatisfied with the set, but that's why I rated the set as Good instead of Excellent.", 
    "I loved this online. It is way more beautiful than it looks! It looks really expensive and luxurious! I don't know why some people are so super picky and negative. I would buy this over and over. I love it! I was looking online at a major retailer and for a set like this would've been at least $1,500. The comforter and duvet, were each $***. I'd have paid $*** for just that, no shams, no pillows, no bedskirt. This collection has it all. I also bought the duvet cover, b/c it came with 3 pillows and now I have 5 pillows and 6 shams for this set. And I bought the matching shower curtain. I liked that so much that I bought more, to make window curtains, shower curtain and I have the whole set. Thanks Overstock! I just moved and I've bought a bunch of things already! Each one is better than the last. Quick delivery, too!", 
    "This set was very nice. It was a little bit lighter than the picture, but worked very well with my room. Would definitely recommend giving it a try.", 
    "this is a nice looking set, but beware of the size. I ordered a queen, I have had several queen sets in the past, but his one barely covered the sides of the mattress. Had to pay lots of money in return shipping for this item as it didn't fit.", 
    "Colors were perfect as displayed. Absolutelly love this set!", 
    "I love the colors on this set. They are a close match to what is pictured. I wasn't sure what to do with the European sham covers but finally found pillows to fit them. My dog hasn't been able to pull the threads with her paws which I was concerned about.", 
    "I love this bedspread. It's really comfortable and fits the bed well. I love how everything is included. I just have to grab some fluffier pillows to make the pillows look nicer but otherwise this is great!", 
    "It looks great and is a GREAT deal!!!! We love it!!", 
    "Very, very luxurious for the price. Elegant - gorgeous colors", 
    "This is an awesome comforter set. Love the colors. Same as the picture on the Internet. Came in just a few days. Definitely ordering more items. Thanks Overstock You Rock!!", 
    "We really enjoy the new comforter set. It is so much fuller and warmer than the one we had. It looks great with our wood bedroom set? So glad I ordered it!", 
    "This set was just what we had in mind to replace the one we'd had for 10 years! Beautiful, soft & comfortable without being overly weighty.", 
    "I originally bought a down comforter from Belk and had to return it, too warm for my husband. For less money I was able to purchase this 12 piece set! It's beautiful and warm and the sheets are so soft! I am very pleased.", 
    "I simply love this bedroom set. I got two 26 X 26 pillows at Anna's Linen to complete the set. The first comfort rec'd was in queen. Sheets and pillow cases were in King which is what I ordered. Overstock sent another set, I took out the king comforter and returned the queen comforter with the rest of the items. Overstock made the return effortless. I am completely happy. The colors and quality are exactly what the description stated.", 
    "If you like a very traditional look, this set is for you. The embroidery was beautiful. I liked it, my husband did not--he felt it made the room feel like my grandma's room. Returned it for something more contemporary.", 
    "The comforter was well made and very attractive. Plenty of pillows and shams. wish the comforter was bigger b/c I can't use the skirt b/c we have a posterpedic bed which makes it almost impossible to put a skirt under the mattresses. Otherwise very pleased. Would like to see this pattern in other color combinations.", 
    "It looks very pretty in our room! The comforter is very warm and a very nice size.", 
    "I had the hardest time finding an attractive looking comforter set that also matched the colors of my bedroom. This was perfect! The design of the set looks very classy - not one bit gaudy. I also love the extra pillows that came with it.", 
    "I chose this set mostly on reviews. Our bedroom set was a dark brown, and I wanted either blue/brown or red/brown to compliment it. I chose this set because of the great reviews, and I'm happy to add another one! This was great quality for the price. After purchasing king/euro pillows to fill this out....our bed looks just like the picture! The sheets are super soft, and even the fancy pillow cases are soft enough to take a nap on without snagging. Speaking of snagging...we have a cat & a 45lb dog....This set is safe for pets. I feel like we got a great bedroom set for a great price!!! I love it!! And it is really easy to decorate with...I had no trouble finding a swirly art piece to accent this bed set!! Animal owners you will be happy. My dog has slept on the bed every night...comforter still looks beautiful!", 
    "Initially I was not sure what to think of the color, not quite as it appears in the picture but now I love it. The material does feel as though it will snag easily but so far it hasn't been an issue. Sheets were too thin for me but that's what I expected for the price of the set. All in all glad I bought it.", 
    "We love this set! Overstock had a great price and it came in perfect condition. Colors are beautiful and true to what I had expected. It is very soft fabric and warm and cozy without the weight of some comforters. Sheets are very soft and comfortable. I would recommend buying square pillows at the same time for the euro shams, as they have been difficult to find in our area.", 
    "This bedding set is beautiful, but the quality second rate. Straight out of the box I've had to cut stray threads everywhere. On the inside of the square decorative pillow there is a large tear and the seams will have to be taken apart to be mended. I have to say I'm disappointed with it and wish that I had gone the more expensive route and purchased this set from ***. If it weren't such a hassle I would try to return it.", 
    "This bedding set is beautiful and great quality! Fantastic value for all that comes with it!", 
    "The quality of the bedding is very good......very rich browns. The only small complaint is that the blue is more of an aqua color.It still works very nicely but if you want a true \"baby\" blue it may not work for you. I have not used the sheet set that was included, so cannot review that portion of the purchase.", 
    "This is a very nice set.. The bed skirt ripped a little but I do have a very heavy california king mattress which made it hard to put on. But the comforter is beautifyl,,its all embroderied.. not cheap print.. Its thick and heavy.. the sheets are soft.. its very attractive.. Looks like I spent a fortune :)", 
    "It's a pretty set, but it does not look like the picture and not what we were expecting. It has a silky, silver sheen which is not obvious in the picture here. The blue is pale, the brown is more of a dark tan. It's very light and thin, but it manages to make me sweat. I have a King size pillow top mattress with a thin protector, the comforter does NOT completely cover the mattress...sides or bottom. The sheets are softer than expected, which was nice. The decorative pillows are cheaply made and the \"euro\" shams are useless unless you already have those giant square pillows which I have been unable to find at any store. I bought the matching shower curtain for our bathroom and was equally disappointed with that. This was not such a great deal***", 
    "Love this set! Bought the same style at another place and it didn't include the comforter (duvet cover), bedskirt or sheets, and it cost me almost the same amount I spent at Overstock. Bought it because to acquire the other pieces I needed to complete it would have cost just the same amount as I paid for the whole thing here. Wish I had seen it on Overstock first.", 
    "Fabulous quality--coverlet is like a could and the all cotton sheets are SO soft!", 
    "Love this bedding! Colors are great and it washes very well.", 
    "I was not expecting such nice detail and soft/satin feel comforter. Comforter is the perfect weight and stays on the bed well. I am very happy with my purchase and the delivery time was excellent. Haven't been able to locate pillows to put in the square shams..may have to make some..but overall a beautiful bed..", 
    "Just received the bed in a bag today, looks great and the quality looks good All items have a chemical smell upon removal from the bag which I am sure will go away in a few days. Looking at the picture I thought there were multiple pillows with the order but you only receive two pillows and a number of pillow covers.", 
    "I recently moved and needed a complete bed set for a queen bed. Good quality, and included the skirt, pillow shams, sheets, etc. A full bed at a reasonable price. The thread count was not high, but for my needs, this fit the bill. Recommended.", 
    "Nice workmanship, good colors. However my sister did not like it.", 
    "This comforter has a perfect weight for sleeping with it over you. The sheets are soft and comfortable. I enjoyed the fact that everything was already included in the package, that is: shams, coordinating pillows of various sizes. The fabric is rich and the colors are vibrant. I am so pleased with the set. It's the first time I have used colors other than my usual roses and mauves. I am not disappointed. Great doing business with you.", 
    "The picture is exactly as it looks when delivered!! Very happy with the quality and style and most definitely the price!", 
    "Fash shipping.. great product.. would highly recommend", 
    "I have been looking for a comforter that is beautiful and durable as my puppies sleep at the foot of my bed. This set is perfect! I was worried about the potential for snags, but so far that has not been an issue. I think the set is far more attractive than it appears in the picture. The sheet set is very nice. I have spent months searching for the perfect set, and I could not be happier with this purchase.", 
    "Set looks just like the picture. Very beautiful. Sheets are slightly scratchy but after washed with fabric softner a few times it is better.", 
    "The sheets are nice quality, they are soft and cozy from the sheets to the comforter. I was super pleased with my purchase.", 
    "We received the set very quickly and it is so much better in person than online. The brown is almost a gold color and the set looks very expensive. The quality is so nice. This set looks like something that you'd buy at a pricey retail store for two to three times more than you'll pay here. I like a nice heavy comforter and this one is a little lighter than I like, so we're going to add a blanket between the sheet and comforter. The material is not like it looks on screen...it is not just a printed on comforter, but more of a woven material. Highly recommend.", 
    "Colors were pretty much accurate as was the quality....I feel like I got a good product for the amount I paid for it.", 
    "It looks like a hotel! A fancy hotel! I've washed the sheets and they didn't shrink.I bought pillows for the shams. They fit. We purchased the California King size. The spread falls nicely over the skirt. The top sheet is wide enough. The fitted sheet fits the mattress. It is truely the dementions of a California King. The skirt is wrinkled and the wrinkles haven't fallen out yet. I'm nervous about ironing it. The fabric that covers the springs is slick. The matress is slick. They slide around too easily. All in all we are satisfied with the product.", 
    "I purchased this for my mother as a Christmas present and she is very happy with it. The material is very soft to the touch, but the color is a little more mutted than what the picture shows. We did have a scare when UPS delivered this to the wrong house. Overstock was very helpful, and were going to send another comforter, but the neighbor brought the package to my parent's house a few days later.", 
    "My only complaint is that the material does seem to be the type athat would tear easily,(I have a cat) and that it should be a little larger for the king size beds of today. Most of us have 15 inch mattresses, and the quilt just barely covers the matress. It is warm and cozy on our cool nights though.", 
    "Just recieved the comfort and I LOVE IT! Thick, Beautiful Color, I just might order another one to put away! Sheets look alittle thin and are lighter than I would normally buy, but the comforter makes up for it!", 
    "I have been searching and searching for the right bed set and I found it! I can't wait to paint the room and put it to use! It's gorgeous (better than expected) and very well priced!", 
    "Really nice set with a lot of extras for the price.", 
    "I really like the set. Very beautiful and colors so pretty. Am glad I ordered it. Material is good. So pleased with all the extras. The pillows are very pretty and colors prettier than picture. I am very pleased with this purchase and would recommend to anyone. I have not used the sheets.", 
    "This set was a gift for our daughter. She loves it and mentioned it was as pretty as the photos I sent her. Great value for the price especially for King Size Set.", 
    "This set is very well made. Color is as described and it arrived quickly. The width of the comforter is just long enough to cover our bed rail. The sheets are actually surprisingly comfortable.", 
    "I'm using this in a seldom used bedroom and looks very pretty. Not sure how it would hold up under wear and tear of daily use.", 
    "This bedding set is well made. There were no flaws that I could see. The throw pillows are beautiful. The coloring is muted yet the design is crisp. Abosolutely thrilled with the product.", 
    "Perfect elegant looking set! Especially love the pillows - they complete the look.", 
    "What a great set and great value. Looks very elegant on my King Bed. With the Euro pillows shams being included it just adds to the array of pillows scattered on top of my bed. I love this look and am really happy with this set !", 
    "I purchased this set for myself in November, 2012 and love it so much, I purchased another for my Daughter and Son-in-Law for Christmas. We both have medium/dark bedroom suits and this set is so beautiful and rich looking. As previous reviews have stated, if you have pets that get on your bed, I also would not recommend this set as it would easily be \"picked\" by claws. I have faux silk drapes in my bedroom in \"mineral\" blue and they truly add to the beauty of this set. I highly recommend if you want a tranquil, spa-like feeling in your bedroom.", 
    "Beautifully made and looks great on my bed. Would definitely order this again and give as a gift.", 
    "Looks more expensive on the bed than the cost reflects. Lots of accessories included that normally are quite costly to add to your bedding. I usually land up throwing out the sheets that come with bedding sets because they are poor quality...but not these...they are soft & fit our new mattress well. They're not high count sheets but they'll serve the purpose until I can get a couple of sets of king size sheets. Very happy with this purchase & quick delivery as always by Overstock.", 
    "The Madison Park Bed in a Bag is very beautiful and I received it in just a few days after ordering. It has transformed my guest bedroom. The brown and blue combination is a very good color for my home. I would encourage my friends to order from Overstock.", 
    "I have looked for a bedspread for months and was very happy to have found this one. The colors were true to the description and looks beautiful in our bedroom.", 
    "the quality of the sheets as well as the comforter is very good and I'm happy with my purchase.", 
    "I have to say I used to always have 2 blankets and a comforter for cold nights and with this comforter I have been fine with just one blanket and not even having the heat up any more like I used to. It keeps the heat in. I have to agree with someone's comment which was that my dry skin sometimes catches on the nice side and I'm always afraid I am going to pull the fabric but I am so happy with the set.", 
    "Redid my guest room and this set really set it off and make it look super rich and very welcoming. Love it.", 
    "I absolutely love this set. The comforter feels lightweight but it's really warm. The sheets are surprisingly softer than I expected. The colors are true to the picture. This set is exactly what I was looking for. LOVE IT!", 
    "A great price for the entire ensemble. A true bed in a bag! I love the colors and the description accurate.", 
    "Love this comforter set and the sheets are extremely comfortable.", 
    "This 12 piece bed in a bag set is beautiful, warm, cozy, and great for the money. The fabric of the comforter is soft and thick and fits great on my king size bed. Can't beat getting all of this including the 2 pillows and Euro shams for the money. Should last for years, and another great thing is it is machine washable!! Very pleased.", 
    "This comfortor met all my expectations. It is well made and warm for our winter nights. The sheets are huge! I don't think I've ever had sheets-especially the top where I've had more than enough coverage. The bottom fitted sheet stays on the mattress and you don't have to fight to put it on. I'm so pleased with everything!", 
    "I would indeed recommend this set. It matches my wall perfectly and has added a very Beauitful touch to my bedroom. It is the 2 me comforter set I have bought from O. This time I went for a more girlie look in the room a d my husband even thinks it is nice.", 
    "This bed in a bag is the most luxurious I've ever bought for the price. I have not used the sheets as we like a softer sheet and the ones included in this set are a bit rough which I assumed going in based on the description.", 
    "Really happy with this purchase. Great price for a nice set. Looks luxe in room.", 
    "Very happy with the bedding! The colors are great, well made, very warm. Love having all of the piece all ready matched and ready to use. I would buy again from Overstock, received bedding in just a few days.", 
    "I was pleased with the comforter set. It was the color I wanted and looks great on the bed.", 
    "This amazing set is beautiful and elegant. I'm very happy with the quality and the price was incredibly low compared to other sites. It was at least 50+ dollars less here. If you are looking for an amazing set at a hreat price this is the one to buy!!", 
    "I really love this comforter, great quality, really great price for all the pieces that you get!", 
    "I have a pillow top king mattress and sometimes have to make do with skimpily cut linens. This set is surprisingly lovely and generously cut. The sheets aren't as soft as high count cottons, but they are 100% cotton, quite comfortable and fit my big mattress easily. The shams and comforter are very nice, and the complete ensemble makes my bedroom look quite rich. I did have to purchase sham stuffers, but they're worth it to complete the look. And sitting and reading in bed is much nicer now with all the pillows for back support. I should also mention that my set arrived without one set of shams. Overstock's customer service responded quickly to get me the missing pieces with minimum hassle. I would not hesitate to order more products like this from this company (and I have purchased many items of all kinds from them over the past several years). I value Overstock as an excellent source for merchandise.", 
    "I can't say enough good things about this bed set. I waited to make a review although all the previous reviewers are correct. This is a luxury sheet set at a fraction of the cost. Looks like something from Neiman Marcus. The embroidery is beautiful yet the sheets are so soft. My husband absolutely loves the feel. Also happens to go nicely with our bedroom decor. I couldn't be happier. 10 stars", 
    "This comforter set is beautiful and exactly as advertised. I would recommend it to anyone.", 
    "The set looks very nice on my bed. I loved having pillows and shams to match. I have received several compliments on the \"look\".", 
    "This set is much richer than it looks in the photo. You will not be disappointed with the set. Just remember to order two Euro pillow for the shams included.", 
    "I read the reviews on this carefully before I purchased it and I have to say that I was extremely happy with the quality and the size of the queen set that I ordered. I felt that it was everything the company had recommended and looks very elegant in our bedroom.", 
    "I loved the colors in the picture on here, but the colors are not as they appear. The blue in the paisley is more silver than blue and the brown is very very light. It had 2 picks on arrival, but was fixable. Also its a little shiny and I'm not a big fan of shiny. Its pretty and heavy and I will use it on the bed we do not use as it will do in there. I had to wash all of it immediately due to the strong chemical smell. I like it but its not what I expected.", 
    "I haven't had a chance to use this yet because my new bedroom furniture hasn't arrived, however, everything looks great. The sheets are washed and ready to go - they feel VERY soft. I like the quality of both the sheets and comforter. This may not be fair to say, but the colors don't seem quite as vibrant as they do on the picture. However, I haven't seen this set on my new bed yet. Aside from that, I'm very happy with this product.", 
    "This set is absolutely stunning. I can't believe how well the colors came together with everything else I had in the room. If you like the look in the picture you'll love it in person. I would say it is not the highest end fabric but it is a great expensive look for the price.", 
    "This 12 piece comforter set is gorgeous. Colors are better than shown. Just what I was looking for. The sheets are okay, could be better. If you are looking for something to dress up your bedroom this is it. There are no window coverings to match but I bought the matching shower curtains and made my own.", 
    "I love this set. It matches my bedroom perfectly!.The added pillows make my bed look like a millon bucks.", 
    "This comforter set is well worth the price. Excellent quality! The sheets are so soft and the colors are beautiful. Anyone interested...BUY IT, you will NOT regret it! =)", 
    "Nice quality.... Sheets are a little thin, but still very soft! Just heavy enough for winter, without being too weighted... The colors are true to the pictures.. Would highly recommend!", 
    "Beautiful colors and quality for the price. My bedroom is now complete with the 12 pieces of Madison Park Whitman Blue. Many compliments from friends. Absoluteky recommend this fine bedding.", 
    "Awesome set, would expect to pay over $200 for this set in a store. Sheets aren't a really high thread count but are ok, comforter quality/ size is great!", 
    "Couldn't be happier with the 12 piece comforter set. The color is exactly what I needed and it is holding up beautifully.", 
    "For the price, I was not expecting the quality to be as great as it was. I am pleasantly surprised.", 
    "I was very pleased with this set. The colors are much more beautiful in person than they appear in the picture. Can't beat it for the price.", 
    "I am very satisfied with my comforter set. It has a luxurios look and feel. Although the colors are slightly lighter than they appear, I would recommend this item to my friends and family.", 
    "I really liked the pattern and color of this set but was afraid I would receive it and it wouldn't actually be the color that it appeared to be online. I didn't want to paint my bedroom another color. But when I received it, it looks gorgegous in my room.", 
    "Shipping time was incredibly fast! Opened up my bed in a bag & it is beautiful! It all washed up so nice & it is so comfortable & cozy. Absolutely thrilled with the quality, looks, & comfort.", 
    "The madison park whitman blue are very beautiful, and feel fantastic! I have not finish remodeling my bedroom , but can not wait to put on my bed to finish up my room1", 
    "I am really happy with my Bed in a Bag. It is a beutiful color and makes my bedroom look elegant. I can't believe I got so much for the price. I would not suggest this comforter if you have pets because it does snag easily but is made very well. I was lucky to find matching curtains at a nationwide store and they match the blue perfectly. I wish they had been on Overstock but I found them after going to only three stores.", 
    "i bought this set and love it so much i would buy it again. friends look at my bedroom and ask if i am in a fancy hotel.when you slide into bed it feels like your being hugged. it looks so very pretty and it has all the comfort you could ask for.", 
    "Love this set. The sheets are really soft, the comforters design is actually stitched. The shams did not come with the pillows inside them. 2 are 28\" x 28\" and 2 are regular pillow size, so i had to buy those. After a quick ironing of the bed skirt and washing of the sheets and pillow cases it was ready to put on my guest bed. There were a few loose ends that needed to be trimmed off but you get that with anything that is sewn. just remember to cut them off and dont pull them. Im very pleased with this set.", 
    "I looked at many different internet sites for a bedding set. This set completely met my expectations in price, quality and beauty. The size for all the pieces are very generous. The comforter is very soft and thick. The accent pillows are a great addition. I was totally pleased with the product and service from overstock.com.", 
    "I am extremely pleased with this set. It exceeded our expectations. It is exactly what we were looking for and because the set is true to the colors in the picture, it fits in perfectly with our decor. We haven't washed the set yet, but we are trusting that the quality holds up. But in any event, it absolutely is what we were looking for in our Master Bedroom.", 
    "The comforter is very nice, good set of bed skirt, pillows and the sheets. Most sets are cheap but this one was surprisingly good quality and great look. I renovated my spare bedroom with this set and love it. Worth the cost and the look is soft and colorful.", 
    "This is a very good value with lots of pieces. I have something a little nicer for my regular bedrooms, but for a guest suite it works out very well.", 
    "Set was beautiful and really dresed up the bedroom. Color was true to the pic. Comforter is not too heavy so comfortable to sleep under.", 
    "Just received bedding set from Overstock, shipping was fast and set came well packaged. The bedding is very nice and I am very pleased with my purchace. The color seems to be a little off, the blue looks like the picture shown, but the brown is more of a lighter color and has shimmer to it. Over all the set looks very rich and looks like it was more money than it was priced on Overstock. A great purchace!", 
    "I absoulutley love this set! The colors are beautiful and the quality is better than I expected. Love the pillows too!!!!", 
    "After reading many of the reviews, I purchased this set and I absolutely love it. Makes my room look elegant. Very good quality. I wish the set had some type of accompanying window treatment, other than that- I am very satisfied.", 
    "Nice set but a little more than I wanted to pay. I thought this set would have more brown but the brown color is more of a golden hue. I have washed this set right out of the bag & its kind of fraying on the brown edges. VERY warm, I usually kick the covers off by the end of the night so it will be good in the winter time. This is oversized although it does not say it is, so that is a plus. Overall I am happy with my purchase even though it is not the color I expected. It does look nice on the bed.", 
    "I love this set. It has really dressed up the bedroom. It looks elegant!", 
    "Beautiful set especially for the price. Feels great and looks great! The blue color is slightly different than in the ad, but close enough for me! Best of all, this is the first comforter I have purchased in years that is washable!", 
    "We're very pleased that the colors are true to what we saw in the picture. The set fits perfectly and makes a positive change in the appearance of our entire bedroom.", 
    "This comforter set is very beautiful. It looks just like the photo. The fabric is silky with a jaquard texture on the paisley part, so it could pick easily, but so far that hasn't been a problem for me. I'm using it in my guest room which is painted powder blue. The euro shams and sheets are more of a smokey blue, but when the bed is all made everything looks great. After I ordered from Overstock, I found this comforter on several websites, but this is still the best price.", 
    "This set is beautiful! It is very luxurious and comfortable. Colors easily match accessories. This set is amazing for the price. We bought for a guest room but were so impressed we had to upgrade our set to have as nice of a bedroom. I highly recommend this set. It isn't too feminine and my husband who normally \"doesn't care\" was blown away by it.", 
    "Very nice! True to picture! The only thing that I was worried about was the how the sheets and the material would feel. It all feels wonderful, and it looks beautiful as well. The only complaint that I have is that there are several strands of thread sticking out in random places. It wasn't bad enough that I would send it back for another one, it just wasn't perfect. We do love it!!! Great price for a 12-piece set. :)", 
    "Lovely set. Great quality! Looks great in my bedroom.", 
    "Great Bed in a Bag! Came with a LOT of throw pillows, so be prepared! I use all of them, but you could definitely live without some of them and still pull off the \"look.\" Quality is great, size is perfect for my queen size bed. Fabrics are soft and comfortable. Only thing is that I wish the comforter itself was a bit thicker, but it keeps me nice and toasty anyway, so no complaints. Very happy with this purchase!", 
    "Service is good . Did return the comforter set..changed mind about the colors. Have not credited account yet.", 
    "After looking at many blue/brown comforter sets, I chose this one because of the pattern and colors. The brown is a muted, taupy brown, definitely not chocolate or mid-brown. The blue is soft. I would have loved to have curtains to match because matching the colors has not been as easy I would have liked because the colors are unique. The fabric on the comforter is somewhat satiny and feels as though it snags easily, but I have yet to see a snag. It just seems to feel like it snags. I ended up swapping out the euro shams for others that matched another comforter set because the euro shams with this set were too satiny and did snag. I like to use my euros so I had to come up with an alternative. I also purchased a king size for my queen sized bed so we had plenty of comforter for both of us. I just fit the bed skirt by creating a pleat and throwing some simple stitches to narrow it. I've done this with many sets and it worked perfectly with this. The weight of the comforter is nice and overall the set is priced reasonably.", 
    "Having recently remodeled our master bedroom and baths, I needed new bed linens. This set is just right. The rooms are grey,blue and brown so it matches perfectly. The sheets are not the best quality but for what I paid for it, the remaining pieces are great. I know we will enjoy having this.", 
    "This is beautiful in my guest bedroom. You can't beat the price! Really added some character to a dull room! Looks great with light blue walls. I would recommend this if want to transform a room into an elegant retreat!", 
    "This Bed in a Bag is a great value and high quality product. The colors are beautiful and I feel like I am sleeping at a luxurious hotel every night. It looks so pretty that making the bed is not such a chore because it is beautiful when it is finished. I definitely recommend it if your looking for a stylish, high-end look!", 
    "I have been looking for a new comforter for some time and of course the first place I looked was overstock . This a beautiful set and looks very expensive. My husband liked the sheets saying they fit perfectly. This are a great addition to my bed room and now I can't wait to order curtains to match. The colors are perfect and look just like the picture.", 
    "Very beautiful, comfortable and goes great with my new paint. The sheets are also very soft. I am very happy with the purchase.", 
    "I ordered the comforter set then pick out my paint color by taking a sham to the paint store. With my Neptune Blue walls this set looks beautiful. I like all the extra pillow covers it included. It is beautiful colors. Just what I was looking for. My bedroom looks a it belongs in a top of the line retreat center. I have been happy with every purchase from Overstock.com", 
    "Just what we were looking for. Good quality construction and a reasonable price.", 
    "This is an absolutely BEAUTIFUL set. So soft and warm. I agree with the other reviews that the comforter snags easily, but, so far at least, that hasn't been much of a problem. The best part of the deal is the fact that I was seconds away from buying this from another website when I did one last check and I found it here for significantly less than the sale price at the other store!", 
    "I've been very happy with this bed set. Colors were the same as pictured and love the fabric.", 
    "This set was a holiday gift for my stepdaughter. I wasn't sure what it would look like considering some of the sets that are for sale in department stores. I was pessimistically expecting something of lesser quality for the price. However to my pleasure, It was exactly as advertised. The Quality and Finish was great for the price. I would order the same product again for a gift.", 
    "Material, quality, colors, delivery.....everything was perfect.", 
    "I just got this set today and it's gorgeous! There are a lot of nice pieces included and the price was very fair - especially because I saw the same set in the store for a good bit more money. The colors are true to what I was expecting - a mocha color and a light blue with silver undertones. The sheets are very soft given the thread count and everything appears to be of a very nice quality. I would absolutely recommend this set!", 
    "This set is so beautiful I was very surprised when I opened the box. Even prettier than the picture. The sheets are soft and good quality. I could not have been more happier with this set.", 
    "Quality is good, picture seems accurate in color and design. I had been searching for a comforter just this color combination and had been unsuccessful till now. I love it, and it makes my bedroom look great!", 
    "Greatly disappointed in color. Expecting more of a brown/blue combination instead of dull olive green. Quality was suitable. For the amount of merchandise and price, it was an \"okay purchase\"...not thrilled, but not disappointed enough to return.", 
    "My order arrived on the exact date that it stated. I opened it and the colors matched my room perfectly. The only bad thing was the odor that cam out of the bag. With a little airing out it was perfectly fine. Now if I could only keep my dog out of my bag.", 
    "Love this set - sheets are soft, comforter is pretty & functional. So far it's standing up to both my 5 year old son & 3 yr old boxer. CT gets pretty cold at night & the comforter has kept us nice & warm. All the extra pillows make my bed look so pretty I have taken to making my bed every day, something that was unheard of before lol.", 
    "had advice from family on this and we all loved it for my new paint color in the bedroom, but not only that, the sheets are soft, the comforter is really warm, and the shams are beautiful and compliment the entire ensemble. it is really a great set at a great price, and i SHOPPED alot! couldnt find anything to touch the price and as mentioned b4- quality is excellent. i am so happy with this purchase overall!", 
    "I love this item. There are so many pieces. The set is luxurious and rich looking.", 
    "Excellent color! Beautiful qualtiy. It had everything I needed to turn my guest room into a 5 star hotel room!", 
    "This is my favorite bed set so far. It is very nice quality for the money. It is nicer than I expected it to be, actually.", 
    "Beautiful bedding set! Good quality at a much lower price than any of the same quality in the department stores.", 
    "My first use of overstock.com was a very positive experience. I am very happy with the merchandise I ordered and the timeliness in shipping. I will definitely use them again.", 
    "I realy can,t give you a review untill after christmas but what I SAW IT look great and I HOPE my daughterinlaw loves it", 
    "Ordered this set because it looked great in the picture. It looked even better in person. Comforter is super soft, as well as the set of sheets that comes with it. Great buy for all you get with it.", 
    "This comes with so much stuff for a great price. It is a lot shinier than the picture but it is a great comforter and compliments the room well.", 
    "Nice bedding. Lightweight and looks nice on bed. The only negative is that the comforter snags too easily if fingernail touches it.", 
    "I love this set.! I've been looking a long time and finally found the colors I've been wanting. I'm very happy with this purchase!", 
    "I'm very pleased with the quality, fast service, and product. It looks beautiful in my guest bedroom! I've already received lots of compliments! Love it!", 
    "We were pleased with the 12-piece Queen comforter set. We found it to be of great quality and makes for a very elegant masterbed set.", 
    "This product was the best ever. I love the way it looks on my bed. Everyone who sees it can't believe how great the fabric feels and looks.", 
    "Everything is very nice. I am so happy I made this purchase.... it makes my master bedroom look like a million bucks!", 
    "I was very pleased with the purchase. The colors are nice, and the quality is excellent. I wasn't expecting blue sheets, but they compliment the package.", 
    "For all that comes with this package I would say you are getting a good deal. I love everything about the product with the exception of the cheap sheets.", 
    "Excellent product. Would order again from overstock.", 
    "This was the first time I had used Overstock, and I will definitely order from them again. In fact, I will be ordering the euro pillows. I checked in the stores, and I can get the same quality for a cheaper price at Overstock. The comforter set looks stunning in my guest bedroom. I was a little nervous ordering online, but it looked exactly as on the picture. I could not find drapes to match the brown, but I used a beige ivory drape that matches the stitching in the comforter, on blue walls, and they are a perfect compliment to the comforter.", 
    "Well worth the money that I paid. The color was just what I was wanting. I am very satisfied with this set.", 
    "This set is really classy for the money. Love the softness of the sheet set. Lots of pieces for the money. The only thing I wish was different is the size of the comforter. Wish it was a little bigger so it would fall longer on the bed as pictured. It just covers the mattress. Cannot get bigger size because then sheets won't fit. But overall a very nice set for the money. Everyone who sees it says it looks very nice.", 
    "I love my new comforter set!!!! I shopped around for a set like this and I decided on this one. It's of great quality and the value is excellent. I would and have recommended purchasing from Overstock to my friends and I will not hesitate to purchase from them again. The only bad experience was with UPS, they did not deliver the item as promissed in the tracking information.", 
    "Love this item great product", 
    "Althought the product was nice, the colors were terrible. There was hardly any blue, the comforter was most green. The blue was dull and did not do anything for the comfortable. I was expecting mor blue like the picture. I was very disappointed because this was a home warming gift that I has shipped and did not see until 3 months later.", 
    "I have a king size bed and it fit nicely. The colors are very nice and delicate. Looks great!", 
    "This is a really nice set. The colors are as pictured. It really finished off my bedroom nicely.", 
    ""
  ], 
  "link": "http://www.overstock.com/Bedding-Bath/Madison-Park-Whitman-Blue-12-piece-Bed-in-a-Bag-with-Sheet-Set/5955642/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5955642/Madison-Park-Whitman-Blue-12-piece-Bed-in-a-Bag-with-Sheet-Set-5f620932-6eb7-4a24-a929-45d27e815347_600.jpg"
  ], 
  "description": "Madison Park relieves you of any guesswork in redecorating your\ntraditional bedroom with this 12-piece bed in a bag set.\nProfessionally coordinated solids and prints combine to create a\ncohesive bedroom design scheme that is sure to have your friends\nasking for your interior designer's number. This blue bed in a bag\ncollection includes a bedskirt and sheet set; all items are machine\nwashable. Style: TraditionalFabric detail: JacquardBedskirt drop length: 15 inchesComforter: 100-percent polyesterSheets: 200 thread count 100-percent cottonCare instructions: Machine washIncluded sheet set comes in light blue     Comforter: 82 inches x 90 inchesShams: 20 inches x 26 inchesBedskirt: 54 inches x 75 inchesFlat sheet: 81 inches x 96 inchesFitted sheet: 54 inches x 74 inchesPillowcases: 20 inches x 32 inches          StyleClassic, Patterned, TraditionalMaterialCotton, PolyesterPatternFloralSet Include12 PieceCare InstructionMachine WashColorBrown"
}