{
  "name": "Marlow_Gabrieel_Accent_Chair", 
  "price": "EUR 176.51", 
  "reviews": [
    "I don't know where to start I'm so upset. 3 of the 8 bolts are missing...these are allen wrench bolts. 4 washers missing. I laid out what I had, and put one leg on. The front left.I slipped one of the bolts with the washer on it into the first hole, and went to hand turn it until the allen wrench was needed, and got a huge splinter shoved into my wrist. The wood brace [the piece of wood connecting the sides that goes from left to right in the front of the chair] inside the chair was split. As I looked around in interior of the chair, a lot of the wood is split. As the legless chair sits upright, the right arm is higher than the left, by enough that it is apparent to the naked eye. To LOOK at the chair in the listing it is very nice. I will NEVER buy another piece of furniture online again. I don't even know how to go about returning something like this, I certainly can't return it in the box it came in. The smaller box inside, which contained the legs and the hardware, was split open. I had this idea in my head that Overstock was quality merchandise. I was wrong. Please do not waste your money, as you will either wind up out the $$, like me, or looking for a way to return the chair. I'm very upset and feel pretty stupid.", 
    "I tracked this order and it was delayed 1 day due to a train derailment. Never saw that before on tracking info but that is what it said. First of all, this chair is a nice size for a bedroom but for me, being 5'3\" when I sit on it my feet do not touch the floor. It is not at all comfortable, in my opinion. It has a long seat on it and the back makes you sit straight. It is in our guest room so it is fine for that. My husband put the legs on in less than 10 minutes. That is all you have to do. I am not sure what sky means to most people but to me it means blue. This chair, with the bedroom light on is aqua with a greenish undertone. With the light off it is some color of blue but not sure what blue it is.(I have to say more on the aqua side) I have a cream and lighter blue room size rug, also bought from Overstock, and it does not come close to the blue in that or anything else in the room that is blue. That being said, I am keeping the chair as the room has all different colors of blue so another color of blue is not that big of a deal. I saved over 40.00 on this chair with specials and my club O rewards so for what I paid for it and where I am using it, it is ok. There were no reviews on this chair here but did find it elsewhere with reviews,( higher price) and people said the blue was blue, so that is why I ordered it, Maybe it has something to do with whatever light is in your room. If you want a really comfy chair buy a different one.", 
    "The packaging of the chair was very poor - no protection at all, just a cardboard box. The chair arrived with the bottom frame broken and one of the legs had a major crack in it which looked like it had tried to be repaired/covered up. The chair frame looked like it was made out of very cheap pine wood. I ordered the chair for my hall and never expected for the chair to be used much which is why I went more for style instead of a quality piece of furniture. I liked the color of the fabric and was so disappointed with the damaged chair. Hopefully the packaging will get better because I'd be surprised if many of their chairs don't arrive damaged.", 
    "There is no quality control. The Chairs look great. but one of the chairs was and is completely not built correctly. The chairs are not really sturdy. There is no support to keep the chairs from wobbling even though the legs are in tight. As long as you don't plan on having anyone sit in these chairs they are fine.", 
    "Great accent chair. Easy to put together - looks good - perfect for a small area like guest bedroom. Well made for the price.", 
    "This little chair appears to be quite well made and is very sturdy, but not too comfortable. I think a bolster-type throw pillow would improve the comfort since there is a pretty good slope to the back. The \"moss\" is a little greener than I thought it might be based on the color on my computer. Looking around my yard, though, I have to say the green is the color of healthy moss. It works in my room, so I am happy. It arrived quickly and in good shape. No problems putting the legs on. If you want a small chair to tuck into a corner that won't be used for a lot of sitting, this is a great value.", 
    "It has been almost 2 years since I purchased these chairs for a physicians office. They are sturdy chairs and were very easy to assemble. I have had to tighten the legs once but that is easy to do. These are not used in the waiting room, but rather in a private office so I don't know how they would hold up with heavy use but with casual use they are great!", 
    "The teal in the photo was more blue. The chair is almost green and doesn't pull the room together colorize. I am keeping it because the return shipping is too much trouble But I wish It had more blue tone. A friend assembled the legs, but it looked like trouble. At 19 inches the seat is too high. I might cut 1-3/4 inches off the legs. SB", 
    "Bought this for a bedroom accent chair. Couldn't really tell exact color online and was pleasantly surprised at the teal and grey design.", 
    "Purchased for the corner of my bedroom, comfortable and looks great!", 
    "I ordered it as an office chair for visitors. It is really pretty and a great accent chair. For short legged people can be uncomfortable, but for my needs it is great!", 
    "So disappointed. The blue in the picture is so pretty and the sky chair delivered was more of a muted gray.", 
    "Easy to assemble and very pretty to look at, but not as comfortable.", 
    "Great accent chair at a great price", 
    "We purchased this for our bedroom 6 months ago. It is not used that much, but is very pretty and we have received many compliments on it. It's not the most comfortable chair and the leg holes weren't drilled well, but it serves its purpose.", 
    "Got the teal/brown ones. They were a little more \"faded\" color scheme than I think the picture leads itself, but the color was perfect for our front room. They were super easy to put together, but a little taller than I thought (I'm 5'5\" and I can't sit all the way back or my feet don't touch). They also aren't the most comfortable things to sit on -- really hard. BUt again, you aren't buying these to sit on... more for display and short sitting stints. All in all, happy with them, but not for a 'family' room -- for a entry way or more formal area.", 
    "I got these chairs for my office and my clients absolutely love them! The assembly was easily and they are a nice accent piece.", 
    "This was smaller than I expected but very pretty pattern up close. If your looking to fill a smaller space this is your chair.", 
    "I was pleasantly surprised to receive these chairs in PERFECT condition. They were well worth the money and beyond. Definitely going with Overstock on future purchases.", 
    "blue was teal not blue-returned immediately", 
    "The chair is extremely uncomfortable to sit in. Also, no matter how much we tightened the screws for the legs, they still remained wobbly. We just returned it.", 
    "Came with one leg missing and this company sent another one right away. Very comfy chair. I get a lot of compliments on it.", 
    "The chair was easy to put together and we didn't have any major problems with the quality. We may had been missing 1 screw for the chair, but we were not using it as a heavily used chair. We simply use it as an accent chair on the side of the room. It looks great, simple, and adds a nice softness to the space (we have the pearl color).", 
    "This is chair is very uncomfortable, but pretty to look at.", 
    "The chair itself is nice and I really like it, but the workmanship lacks a little.", 
    "Nice chair for the money. I was looking for this light blue shade but actual chair is more on aqua tones. Very pretty but did not match picture. I kept them anyhow as the color was really nice.", 
    "Great chair for the price! My only issue is that it's hard to get more than 1 because it keeps selling out! Looking forward to getting my second one for my living room!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Marlow-Gabrieel-Accent-Chair/8186862/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8186862/Marlow-Gabrieel-Accent-Chair-237a615f-3189-456a-bada-3117b4a7c8b2_600.jpg"
  ], 
  "description": "Available in five rich fabric colors, this armless accent chair features an attractive swoop back design for a modern look that complements any living space. The tufted back and curved, espresso stained wooden legs make this contemporary modern accent chair an elegant choice anywhere you need extra seating in your home.\nKiln dried hardwood frameTufted backCurved legsMaterials: Wood/upholstery grade fabric/high density foam seatingFinish: EspressoUpholstery color: Moss, sky, pearl, spice, stoneUpholstery fill: High density upholstery grade foamSeat dimensions: 19 inches high x 21 inches wide x 24 inches deepDimensions: 34 inches high x 23 inches wide x 28 inches deepStyleContemporary, Modern, Transitional, UrbanMaterialFabric, Foam, Polyester Blend, Upholstered, WoodFinishEspresso, WoodChair TypeAccent Chairs, Arm ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlack, Espresso, MultiFurniture PatternGeometric"
}