{
  "name": "Marlow_Bardot_Swoop_Accent_Chair", 
  "price": "EUR 177.59", 
  "reviews": [
    "This is a great little chair but the color that I bought was Platinum which to me is silver/grey. When it arrived it was definitely beige maybe greige but more tan than grey. They did not match my decor so I had to send them back :(", 
    "Gave it 4 stars, the picture looked like the birds were gray, instead, they were of a beige tone. Really like the chair, so I am going to purchase another one in the same red color. Love the splash of color it gives the room. Easy to change accessories because the color is not over powering.", 
    "Assembly: The chair is in one piece and the legs have to be attached, screwed in; they are a little wobbly. I'm not sure if I didn't screw the legs in tight enough or if chairs w/out arms are normally like this. It took me about 1/2 hour each to put them together (I purchased two).Comfort: They are very comfortable to sit in. Look: They look great! Tracking: Whoever processed the initial order didn't update the system correctly. 4 days after I ordered it, the status showed it was still in 'processing.' On the 4th day, the status was changed to shipped. Then one day I got home and it was here. So the tracking for this item wasn't done correctly. I didn't have this problem with other things I've ordered from Overstock.", 
    "Wanted an accent chair with color for my family room. The chair in crimson looks great. I am a 79 year old widow and it was very easy to assemble the chair myself with no problem. Great price, nice quality and well made. Loved the chair, very satisfied.", 
    "Really nice looking chair, loved the color and print of the fabric, but when you brush the fabric (just with your hand) in one direction it kind of flips so you can see the white under the fabric...I'm not describing this well, but the fabric looks worn. It goes back, for the most part when you brush it in the opposite direction, but not entirely. The arms wouldn't brush back so it looks like there are white spots on the fabric. Easy to set up (and take down, because I'm returning it). Others described it as firm, which it is, but I did not find it uncomfortably so. The legs did seem a little wobbly even though I tightened them all the way down.", 
    "Very pretty chair fabric but is not at all comfortable. Put in guest bedroom for a place to change shoes etc...", 
    "If you're just looking for a piece of attractive furniture to accent a room, this is for you. If you're looking for something functional and attractive, keep looking. No one wants to sit in this chair because it's so hard. Very disappointing.", 
    "This is a \"for looks\" only chair. I've had hard wood chairs that were more comfortable. Going to keep them for a couple of years until I replace with a more expensive, higher quality chair.", 
    "These chairs look great but they feel like you're sitting on a stool. Not comfortable at all.", 
    "I bought two of these to go in our family room. They are not terribly comfortable, but they look beautiful. We have one leg that screwed in at an odd angle, but it's not strange enough for us to return it.", 
    "Very cool chair, sturdy, easy to put together. Goes well with my decor, was going to woos out and go with a neutral color, but the teal goes great in my silver and blue bedroom and blends well with my mostly contemporary but a little eclectic style.", 
    "We needed an accent chair for our bedroom, to go with the new bedroom furniture we recently bought. This chair was the perfect size, as it is only being used to sit upon when putting on socks, slippers, or to drape a robe in the evening. It doesn't take up much room, and the fabric is classy, yet understated. Assembly is required to attach the legs and everything you need is included, even an Allen wrench. For the money, it is a well made chair and I highly recommend it to anyone. Great service from Overstock.com, too! We love this chair!!", 
    "Chair is very nice designer look. It is rather firm to sit on so not comfortable for long periods of sitting. I do wish the back of the chair was a little higher. Bought for my mother who wanted a chair where there would be no arms to interfere with her crocheting.", 
    "Quality is good but was expecting a lil better quality more for this price", 
    "Looks perfect in my office and is a great neutral as well", 
    "The chair is very pretty, however it is very firm, which was fine for our purposes. The front wood brace broke after a couple of months.", 
    "The chairs look good, but they are very hard. I use them in my living room as accent chairs, so they don't get used very often, so for that they are okay. I would not use them in the family room where comfort is needed.", 
    "I knew that I wanted this chair from the moment I saw it! It is very comfortable especially if you are tall. It has a deep seat and the back is shaped perfectly. For those of us who are shorter, you may want to consider an ottoman/footstool for support.", 
    "I purchased 2 of these chairs. They were exactly what I wanted. Nice fabric, pretty color, and comfortable.", 
    "I was really excited to get these chairs (ordered two in \"Platinum\"). When I saw them in person, the \"Platinum\" color was more of a light brown. My husband put them together and the screws were warped and he couldn't get the legs tights. The chair wobbled when sat in. Needless to say they are going back. Don't waste your time or money. I ordered two beautiful chairs from ******* (Threshold Brand) for less and they are amazing.", 
    "Very nice accent chair for bedroom. Colors are true to that pictured on line. Very satisfied.", 
    "Very appealing and comfortable", 
    "Chair came quickly and all I had to do was put on legs. There is a nice zippered space under the seat you could use to hide a light object. The robin egg blue is true to picture and the print is airy and light. The chair is all and comfortable and exactly right for the space in my dressing area. I am well satisfied", 
    "comfortable chairs, very easy assembly", 
    "I really love these chairs, great color, great fabric, and great product!", 
    "This is really nice chair, except one leg won't tighten as well as other 3. . Secret compartment on the bottom. Have it in guest bedroom...love it.", 
    "i purchased the chair in teal and am very happy with the color and the sturdy construction...assembly took a little while but one should read the directions first,,,,the legs do have specific locations...had i read the directions, assembly would have been about 10 minutes...there was plaster in one of the leg's screw holes so once I dug that out, all went smoothly. i also needed a chair on the smaller side and this one fit perfectly...sitting on it while typing this review!", 
    "Nice, comfortable chair for small corner spot in room...not to tall in back and make sure your okay with swoop arms before ordering. Very easy putting together...screw on 4 legs and done...", 
    "Very easy to attach legs......", 
    "This is a good chair, the only thing I have found wrong was that the holes weren't lined up good. I love the chair so far, good look, if feels good when you sit on it, nice buy.", 
    "The color was drab and the cushion was extremely uncomfortable.", 
    "I bought this chair for my office at work. I already had two chairs from Overstock in grey and teal, so I bought this one to add some variety. I will not be able to sit in this chair because it is for a tall person. I am 5'2\" and, if my back rests against the back of the chair, my feet stick straight out. I will steer tall people to sit in this chair.", 
    "Quick delivery and easy assembly. Looks pretty nice in light blue, sturdy and reasonably comfy. Fabric is not the finest, rather rough but also looks as if it would be fairly stain resistant and not very sensitive; probably easy to keep in decent shape.", 
    "This if perfect for a bedroom. Too small for any other setting.", 
    "nice quality for the price. color and design were just as I had hoped.", 
    "This is the perfect pair of chairs for my living room. Size is great did not know if I would like the pattern, I am a solid color furniture person, but this gives a great pisaz to my room. Love this highly recommend. They are very firm seats I think they will soften up after some use.", 
    "I was not sure which style and color of chair I wanted for my bedroom, but I chose this crimson and tan colored chair and couldn't be more satisfied. The chair is easy to assemble (legs) and seems to be constructed very well. The seat is very firm, but that is okay because I believe it makes it more durable.", 
    "love love love this chair in platinum waiting for restock need at least one more - cute name swoop accent chair - and they do a beautiful accent to the drapes in the bedroom"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Marlow-Bardot-Swoop-Accent-Chair/8186867/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8186867/Marlow-Accent-Chair-Bardot-Teal-Marlow-Bardot-Swoop-Accent-Chair-060dacd2-c979-4db5-bfef-7c0e8a13d2aa_600.jpg"
  ], 
  "description": "With its modern swoop-back design and classic upholstery, this\nMarlow Bardot swoop accent chair is well-suited to many decors. The\nupholstery features a lovely leaf pattern dotted with birds and\ncomes in a variety of colors. This modern chair adds comfort as\nwell as a lovely touch to your living room, bedroom or study. Heavy upholstery grade woven upholstery fabricKiln dried hardwood frameTufted backCurved legsMaterials: Wood/fabric/foamFinish: Espresso wood legsUpholstery color: Teal, Platinum, Crimson, Robbins EggUpholstery fill: High density upholstery grade foamSeat dimensions: 19 inches high x 21 inches wide x 24 inches\n  deepDimensions: 34 inches high x 23 inches wide x 28 inches\n  deepStyleContemporary, Modern, Transitional, UrbanMaterialFabric, Foam, MDF, Polyester Blend, Upholstered, WoodFinishEspresso, WoodChair TypeAccent Chairs, Arm Chairs, Wingback ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, GreyFurniture PatternFloral"
}