{
  "name": "Mega_Motion_Upholstered_Brown_Lift_Chair", 
  "price": "EUR 725.02", 
  "reviews": [
    "Excellent value! I bought this chair for my mom who is revering from a fractured hip. The electric lift is a God sent. Had some delivery issues with the outside company resulting in a delay of delivery.", 
    "easy setup, looks great with our brown leather furniture. my wife is disabled, and she is tickled to death with this chair. kudos!", 
    "This lift chair is more fitting for someone a little taller than me. Something about the head rest is uncomfortable. It works well for my grandchildren.", 
    "Ordered this for my husband. What a wonderful chair. I had looked at several stores and the quality and price did not compare. Delivered to my door. Free!!!! It is so classy looking and fits perfect in with my other leather furniture.", 
    "wife took mine, and told me to get my own'now have two.", 
    "Great for bad knees but not for short folks. My 86 yo mom is 5'3\" and in a sitting position her feet don't touch the floor.", 
    "This was my first order at Overstock and although I had heard good things about it, I was still leery because my first purchase was such a big one. But the chair was delivered as promised and the trucker even took away the big box. So far the chair had held up very well (several months), and one thing I like is the battery backup for the lift if needed. It is an attractive chair and was a good value. I would definitely recommend it.", 
    "We purchased this for my husband. He likes it and the ease of the controls. It only took him a few minutes to put the chair together. It appears to be of good quality, and solidly made. He will be enjoying it and its' features for some time to come.", 
    "I have no pain when I get out of the chair. It is amazing. Love this chair and I recommend anyone who has mobility issues to get this chair!", 
    "its good of the bones!!!!", 
    "very happy with this product"
  ], 
  "link": "http://www.overstock.com/Health-Beauty/Mega-Motion-Upholstered-Brown-Lift-Chair/9767325/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9767325/Mega-Motion-Upholstered-Brown-Lift-Chair-8eb55e98-c76e-47fb-a843-cc28fcd293f7_600.jpg"
  ], 
  "description": "Create a stately look to your living area with this Mega Motion upholstered brown lift chair. This brown lift chair provides ample comfort with pillow top polyester-filled armrests and cushions, ensuring ample seating and arm support. With its three position electric lift and recline option, this lift chair suits any desired position.\nSet includes: One (1) lift chairMaterials: Fabric, plywood, steel, electric componentsFinish: SteelUpholstery color: TobaccoSeat dimensions: 22 inches wide x 21 inches deepDimensions: 47 inches high x 38 inches wide x 21 inches deepWeight capacity: 375 pounds3-position, all electric lift and reclineFurniture grade hardwood/plywood constructionHeavy-duty steel lift mechanism Integrated battery backup Chaise pad Split back designConvenient pocket on both sides of chair to store magazines, newspapers, or a remote control"
}