{
  "name": "Mega_Motion_Reclining_Lifting_Chair", 
  "price": "EUR 811.13", 
  "reviews": [
    "we were in such need of a lift chair and everywhere we looked was so expensive not only was this chair inexpensive but met all our requirements we needed for fall prevention for our handicapped daughter the controls are easy to use and its so easy to put together just have to make sure all power cords are were they should be before you put top piece on", 
    "Purchased this chair for my 94 year old father who was struggling to get out of his XXXXXXX-XXX soft recliner. This chair has enough firmness that he has been able to stand up without using the lift thus far. He is 6 feet tall and the chair accomodates his height when he reclines. He loves it and that is the goal. It looks like most any other recliner, kind of innocuous. The controls were easy for him to learn and to operate. The chair doesn't take up any extra room over the prior recliner. Color is close to black. We are delighted with the purchase. It was delivered carefully packed to our front door.", 
    "Easy setup and easy to use. Works great for my 83 yr old mother. She loves it.", 
    "I already had one of these recliners so I knew what I was getting and wasn't disappointed. Service and delivery were excellent.", 
    "This chair was purchased for my 82-year old father with back and knee problems. He is 5'11\" and 190 lbs. This chair is perfect for him. It is quite easy to use and very good quality. Two things to note: The burgundy color is really brown and, this chair is NOT a wall hugger...so you need to have adequate space behind the chair in order for it to fully recline back. This recliner was offered at a big box store, but was actually cheaper to purchase through Overstock.com & you get free shipping and delivery! Can't beat it!!", 
    "My mother has limited mobility and thought this chair would help her. It has been the best gift.", 
    "I purchased this for my dad whom I moved in with me in 2013. It works fine mechanically. However it is now two plus years old and the head part is peeling off. It is like the material is disintegrating. Maybe I should have put a cover on it for protection.....", 
    "The chair is not that comfortable and the remote for making the chair go forward and back and the footrest up and down is not as convenient.", 
    "it is a bit narrow in the seat. What I really don't like is that instead of feet and back going up or down at same time you have to select one or the other and do one at a time.", 
    "So far so good (4 months of daily use) -- looks good, works fine and for the money is an excellent value since it is variable position for the price of 2-3 position chairs. Delivery was fast. User is very pleased and so am I.", 
    "I don't think this chair is for anyone taller than 5'8. There is a bar in the leg rest that hits my legs in a certain way that hurts a lot, I have to put a pillow there. And it must be moved far away from the wall. I would have liked to return it, but too much of a hassle.", 
    "The man of the house loves this chair as he plays with the controls. Lift great"
  ], 
  "link": "http://www.overstock.com/Health-Beauty/Mega-Motion-Reclining-Lifting-Chair/7866075/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7866075/Mega-Motion-Reclining-Lifting-Chair-3895e2b8-f110-4e3c-9035-21f244411a1c_600.jpg"
  ], 
  "description": "This dual-motor recliner chair looks great in your living room or den, or set it in your bedroom as a comfortable spot to watch TV and relax. This lift recliner chair provides great functionality through its easy-to-use remote controls, making it easy to get to your feet without effort or strain, while taking up no more space than a conventional recliner.\nStyleContemporaryMaterialFabric, Polyester, Steel, Vinyl, WoodFinishSteel, WoodChair TypeReclinersAssemblyAssembly RequiredColorBlue, Brown, Green, RedFurniture PatternSolid"
}