{
  "name": "Modern_Splitback_Linen_Fabric_Convertible_Sleeper_Sofa_Futon", 
  "price": "EUR 252.31", 
  "reviews": [
    "The style of the sofa is sleek and current but the comfort level is the worst. You can feel the wood slacks and the base frame when you sit. So if you prefer style over comfort then this is the sofa for you...", 
    "talk about nice presents!", 
    "I wasn't really sure what to expect when I purchased this futon sofa. I wouldn't quite describe it as a futon (which I think of as a dense heavy cushion) rather a kind of very lightly padded springy feel. It's reasonably comfortable to sit on and could sleep an average sized person in a pinch! By which I mean, it's much better than the floor but definitely not somewhere to sleep night after night. It's strong point is that it looks great!", 
    "Looks lovely in my small living room!... Very class & modern. It lost 1 star, though, due to the comfort-level. Very firm and the 2 halves don't exactly line-up flush."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Modern-Splitback-Linen-Fabric-Convertible-Sleeper-Sofa-Futon/10867182/product.html?recset=9f5241b4-87dd-4348-8e2a-ed273b088303&refccid=JVI5DE2PGN4IWFSHO2LEF6AVFU&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10867182/Modern-Splitback-Linen-Fabric-Convertible-Sleeper-Sofa-Futon-5eda18e0-b1f9-412d-94e4-0967bc0bdfc6_600.jpg"
  ], 
  "description": "Small space comfortable sleeper futon with split-back for\nindividual preference, features dark wood detachable legs and arm\nrests. Quantity: One (1) FutonMaterials: Hardwood / Linen FabricColor options: Beige, Dark Grey, RedDimensions: 77\" inches Wide x 31\" inches Deep x 28\" inches\n  High, Sitting Depth: 22\" inchesSeat Height From Ground: 14 inchesSome assembly required - Legs screw-in and arms slide into\n  place             StyleContemporary, Mid-Century, ModernMaterialFabric, Linen, WoodTypeFuton Chair, Sleeper Sofa, SofaThickness7 InchAssemblyAssembly RequiredColorBeige, Grey, RedFurniture PatternSolid"
}