{
  "name": "Monsoon_Voyage_Upholstered_Blue_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 167.63", 
  "reviews": [
    "I saw a similar fabric in a high end furniture store, so I couldn't resist buying a set of these chairs for my dining room. To my surprise, the fabric is the same quality as the high priced chairs I saw in the furniture store. I am glad I looked on Overstock before making a decision to buy chairs that would have cost me much more than twice the price.", 
    "These chairs added a touch of elegance to our otherwise casual dining room. Follow the assembly directions, it was very helpful to have someone sit on the chair when doing the final tightening of the screws to get the chairs to sit evenly and not wobble. Enjoy!", 
    "Love, Love, Love the look and quality of these chairs!! I love the color, but be prepared it is more blue than pictured, but it works for me as it a very pretty slate blue with a little bit of texture to it. Very easy to assemble and very comfortable! I am actually sitting in one now!", 
    "We bought 10 of these chairs for a beautiful and high-quality mahogany dining room table. I was worried that the chair legs would look cheap next to the quality table but they do not. the whole set-up looks very high end.", 
    "they are nice chairs and just what we needed to add extra seating without being a large itemthank you", 
    "I've gotten sooooo many compliments on these chairs. I've even shown some designers a picture of our antique table with these chairs and they always ask where did I get the chairs from. They are very comfortable as well. Just love them!", 
    "Great deal for pretty chairs. Not very sturdy but they'll work well where we have them as they won't be used very much. Follow the assembly directions and you won't have any wobble. Will have to re-tighten screws are the first few days then all seams tight. Color was exactly as pictured online.", 
    "I bought these chairs for my Bay house. Love the style and color. They were easy to put together. I gave a 4 star rating because one of the chair legs was scratched. I was able to repair with the furniture repair stick. I would recommend these chairs.", 
    "Love the look of my chairs - everyone is so impressed with the look and price. A heavy-set person sat on one of the chairs and the leg cracked. So bummed - but the person probably was close to 300 lbs. so I can't totally blame the chair.", 
    "These are extra dining room chairs that are rarely used...when they are seated on a rug they are fine, on hardwood they a a little wobbly. The color in the pictures is more of a gray-blue...which I would have preferred. They are comfortable to sit in and the perfect height.", 
    "I've had these chairs for over a year now. I bought 3 sets instead of replacing my entire dinning room set. They look beautiful with the old table and hutch that I inherited from my mother-in-law. Made the set look relevant again. Wish I could submit a photo. I only gave the chairs 4 stars because they are light and you would not think they are substantial when you move them but they are comfortable to sit in and have held up great. For my situation and the price they are 5 stars. They look more expensive than they are.", 
    "Not the sturdiest but easy to assemble. Big bouncy cushions too and color is true to the photo.", 
    "Good chairs for the price.", 
    "These chairs were surprizingly poor quality. The upholstery is flimsly and defective. The pattern is uncentered on the chairs.. The legs were uneven length making the chairs wobbly. They were very inexpensive, but turned out to be of such poor quality that the price was high for the value.", 
    "Chair has nice pattern, but material is cheap, but legs are painted poorly. Very obvious legs are cheap wood. Chairs are true to their origin, typical cheap chinese product imitating the beautiful work of someone else. I guess we should get used to this quality of furniture, since everything is MADE IN CHINA!", 
    "The wood split when we screwed in the bolts before the bolts were even close to tightened. The front legs also look weird... not as pictured; they don't line up with the front seat of the chair, but instead are about inch inside of the edges - it looks very funny. If I had known that the wood was going to split when we put the chair together, I DEFINITELY would not have bought these. I'm really disappointed :(", 
    "These chairs are a fine choice for this price point, but they are not as sturdy as I was hoping for. The cushioning and finishing on the fabric is well done, but they creak some when people sit in them. I purchased them to finish off the dining area in my open floor plan apartment, because they were a good deal, but I wonder now if I could have found something better. I only purchased one set and I will not be buying another. I'd rather have mismatched chairs or sell these on Craigslist. They look great, they're just not the quality I wanted for every day use."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Monsoon-Voyage-Upholstered-Blue-Dining-Chairs-Set-of-2/6660532/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6660532/Monsoon-Voyage-Upholstered-Blue-Dining-Chairs-Set-of-2-17946c09-5e88-4686-acc2-45849b6e5e9b_600.jpg"
  ], 
  "description": "Dine in comfort and style on these upholstered dining chairs. Featuring pine wood legs with a dark walnut finish complementing a blue paisley-print linen fabric, these contemporary dining chairs provide comfortable seating with an eye-catching design. Sized to fit most dining tables, these padded chairs have a fire-retardant upholstery fill for added safety and require no assembly.\nSet includes: Two (2) chairsMaterials: Linen fabric, pine woodPrint: PaisleyFinish: Dark walnutUpholstery materials: LinenUpholstery color: BlueUpholstery fill: California fire retardant foam Seat dimensions: 20 inches highDimensions: 39 inches high x 18.5 inches wide x 27 inches deepStyleContemporaryMaterialLinen, Pine, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembledChair Back HeightStandardBack RestYesColorBlueFurniture Frame MaterialWoodFurniture PatternPaisleySeat StyleUpholstered"
}