{
  "name": "Morton_Beige_Fabric_Power_Lift_Chair_Recliner", 
  "price": "EUR 790.54", 
  "reviews": [
    "failed to get review"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Morton-Beige-Fabric-Power-Lift-Chair-Recliner/10303521/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10303521/Morton-Beige-Fabric-Power-Lift-Chair-Recliner-b3999c71-159a-4165-928c-322741190100_600.jpg"
  ], 
  "description": "The Morton beige power lift recliner chair provides assistance to someone of limited mobility without sacrificing style or comfort. Constructed with a heavy-duty steel lift mechanism, this recliner features a whisper-quiet motor and integrated battery backup. Set includes: Electric power lift chair/recliner. Materials: Fabric, hardwood, steel, foam. Upholstery materials: Fabric. Upholstery color: Beige. Upholstery fill: Two pound density foam that is double wrapped in bonded fiber with individually encased pocket coil springs. FSA eligible with a physician's letter. Integrated emergency battery backup. Easy to use remote control. California specification fire retardant. Heavy duty steel lift mechanism. Provides assistance for someone who requires help standing up or sitting down. The soft, durable fabric cover is easy to clean and maintain. Smoothly and safely lifts with the push of a button. Storage pockets for magazine and remote control. Stylish tufted back cushion. Fully padded recliner for full leg support. Offers infinite reclining positions unlike conventional recliners. Whisper quiet motor. Hardwood base frame reinforced with dowels, screws and corner blocks. Features generously padded arms, backs and seats for the ultimate in comfort. Seat suspension features sinuous 9-gauge steel springs. Back suspension features sinuous 9-gauge steel springs. Seat cushions are attached. Back cushions are attached. Back can be easily removed for the chair to fit through any doorway. Chair dimensions: 42 inches high x 31.5 inches wide x 38 inches deep\nProduct Features: Power LiftChair Type: ReclinersMaterial: FabricStyle: TransitionalAssembly: Assembly RequiredColor: BeigeStyleTransitionalMaterialFabricChair TypeReclinersAssemblyAssembly RequiredColorBeigeProduct FeaturesPower Lift"
}