{
  "name": "nuLOOM_Traditional_Vintage_Abstract_Light_Grey_Rug_(7'10_x_11')", 
  "price": "EUR 269.24", 
  "reviews": [
    "I bought this rug for my dining room, but decided it went more with the living room after unrolling it. I am SO glad I went through with this purchase as it was the first rug I've bought online. It is soft and beautiful . I have a rug pad underneath. You will not regret this purchase!!", 
    "Bought two for our master. Look great!", 
    "If you're hesitating on buying this don't it looks absolutely gorgeous in my master bedroom", 
    "this rug is very soft and well made. actual colors are very well depicted in photos online. very happy with my purchase!", 
    "I have been looking for several years for a large rug that wouldn't clash with the decor of my guest room. Also needed to fit in the budget. This was a great choice and we love. Just warms up the room!", 
    "I like the soft gray & classic look. It is a thin rug however.The printed design was missing in nearly 1/4 of the rug. I made a decision to keep I anyway as it was not expensive.", 
    "This rug is beautiful and looks very expensive! The colors blend together perfectly although I was concerned about this. I needed a large rug under the dining table and didn't want it to be too colorful or too plain. This rug is perfect there and would be in any room!", 
    "This rug was exactly what I wanted! It looks just like the picture and it looks exquisite on my dark hardwood floors. I wanted something that was fairly thin so as not to trip people, and this is definitely the right rug for me. Shipping was fast and I really do love the rug!!", 
    "I ordered this rug for my bedroom. I had several patterns already in my design and was looking for something that was not a solid but didn't compete with the curtains and bedspread. This rug has just enough pattern/texture and color was just as pictured. Great quality for the price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/nuLOOM-Traditional-Vintage-Abstract-Light-Grey-Rug-710-x-11/10082388/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10082388/nuLOOM-Traditional-Vintage-Abstract-Light-Grey-Rug-710-x-11-60d163eb-f915-4059-8990-a82f0c305d67_600.jpg"
  ], 
  "description": "Illustrate your artistic talents by placing this vintage inspired\nlight grey rug by nuLOOM in your living room or family room. You\ncan create an eclectic look with the abstract rug by coordinating\nthis stunning design with contemporary, modern or traditional\nfurnishings.Material is polypropylene for easy care and comfortContemporary, transitional, classic, casual, traditional and\n  vintage style for your decor needsAbstract pattern updates your existing decorPile height is .25 to .5 thickColor of the rug is grey that coordinates well with most\n  color schemesWeave type is machine-made for durabilityStyleCasual, Classic, Contemporary, Formal, Traditional, Transitional, VintageMaterialPolypropylenePatternAbstractFeatureLatex FreeWeave TypeMachine-MadeShapeRectangleColorGreyRug TypeIndoor"
}