{
  "name": "Park_Avenue_Beige_Linen_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 362.77", 
  "reviews": [
    "The wood is a gray color not a wood tone as pictured. The fabric is also a gray color and not the beige as pictured. White paint in the grooves of the wood in an attempt to give it a reclaimed look. Not very pleasing. Very disappointed to say the least. While unpacking I noticed that some of the wood on the back of the chair appeared the brown reclaimed look I was looking for. I realized that the gray is some sort of paint or stain on the chair. I began to sand it somewhat with a low grit sand paper sponge (with an angle) to get close to the fabric. It did not take a heavy hand to sand the gray off. Lo and behold that gray was coming off and it diminished the look of the white paint in the grooves of the wood in the chair. I decided to keep them since sending them back would be more of a pain for me and the cost was not something I wanted to bear. The chairs were cheap in price so goes the saying you get what you pay for. On the plus side the chairs are sturdy, comfortable, do not wobble and fit well with my table. I justified the gray tone fabric as I have the table and chairs on an antique wash style rug that has alot of black, gray and beige background. It blends well. Had it not been for that I probably would have sent back regardless of the repacking and shipping - not to mention getting the large boxes to ***. I purchaed the coordinating bar stools as well and face the same problem but, I think that once they are all sanded they will be close to what I wanted for a very little price. Besides these barstools are at a granit counter that has a lot of black/beige/brown in it and it all blends. As to shipping - they were packed well and arrived on time.", 
    "We ordered these chairs twice as we wanted to see what they looked like before ordering all the chairs we needed. Description dimensions were accurate. The packaging was impeccable, each leg came individually sleeved. The fabric is slighty darker, but it's more of a mix of beige and taupe, very tweed looking. All in all, very nice looking, sturdy chairs.", 
    "I would give this no stars if I could, but since I have to give one..I will say packaging and shipping were great and Overstock is great about returns.For the chairs, they are not beige! They look like a dirty brown color. The chairs are also really small, they look like children's chairs. I had ordered hoping to have them on the end of my dining table but wow, they are not at all what was pictured.", 
    "I get so many compliments on the chairs - people think I paid hundreds of dollars for each but I paid a couple hundred for them all!!! Great quality, great color!", 
    "Just what I was looking for at the narrow table ends", 
    "These chairs are rough in a chic way but the color is WAY off from description. They are a green-Gray and I was happy that they were not actually Linen but again, expectations. We had to return due to extreme color misrepresentation :(", 
    "These chairs are just as beautiful as pictured. However, after owning them for less than one year, one of the chairs leg broke and another completely different chair is on its way to breaking.", 
    "A small chair, but very pretty and sturdy. (I'm 6' and 220.) Looks great at the table, but a little small when I put the extra chairs against the wall. Be sure to compare measurements against other chairs in your house. Packed well and fully assembled.", 
    "These chairs are beautiful The linen is a light grayish tan -- not creamy white. They wood is lovely. They came packaged perfectly, there is no way they could have been damaged in transit. The scale is nice for a smaller space and they are comfortable. I use them to flank the ends of my dining table.", 
    "Awesome chair. Looks great. Darker than the pictures on the site", 
    "Very high end looking. A little petite in size, but I am using in a small space - so they are perfect!", 
    "The chairs were way too small. They looked toy-like next to my dining table.", 
    "Everything came as expected and listed. They look great and are very well made. Our family is very happy!", 
    "Bought 8 chairs to match a reclaimed table bought separately. They are well constructed for the price. The chairs are very comfortable and the gentle curves provide an elegant look. The chairs do not have a particularly high back as noted in another review, but in our space this is not an issue.I highly recommend - so does the cat who loves to nap on them. :)", 
    "These chairs are a dark grayish/taupe color. They are not beige at all. Also, the wood is very gray as well. They are fairly narrow but the picture makes the backs look wider and more rounded. I loved the pic but not the chairs. Had to return them.", 
    "These chairs are a taupe/grey. Pretty and comfortable. A bit small but all 6 chairs fit well in our dining space. Hope they last a while!", 
    "These chairs are well made and fabric is nice. They do seem a little small though", 
    "the only reason I didn't rate this a 5 is because they are definitely more of a gray than a beige BUT......I like the color and am very pleased with them. shipping time was very impressive as well. they are GORGEOUS!!!", 
    "I was extremely disappointed in these chairs. They are not at all what is pictured. The fabric is a dark gray color (not a pretty gray). And the wood is not a light brown..i would almost call it black. The attempt to make it \"white washed\" is white paint splattered in the groves of the wood. I think these chairs look extremely cheap.", 
    "I purchased six of these side chairs to pair with my ********* ******* light grey washed rectangular dining table. The match is not bad, not perfect, but since the chairs have a bit of light and grey in the wood (more light wood than grey), they go pretty well together. The linen fabric seems fairly durable and thick, very earth toned and neutral so it would go with a variety of colors. The only downside I would say is that they aren't very big or tall (they sit at normal height though). They work fine for what I need, but I would definitely pay attention to the measurements. These chairs seem to be constructed fairly well, but they aren't that heavy so I worry about long term use as they don't seem to be made of solid wood and that always worries me. However, they aren't that expensive so I'm ok with that. Overall, they go with my rusric style table, very unique, very versitale, and I'm happy with how they look.", 
    "I ordered 6 chairs and 5 of them are falling apart. The back frames of the chairs are actually separating and coming of the base of the chairs. I love these chairs but have to return them. We can't even sit in them.", 
    "My husband and I love the chairs and decided to keep them for the shape & how they fit in our space; however, they are much darker than they appear online. We were hoping for a lighter beige, but instead got a very dark taupe, which looks quite grey. Same thing for the legs; much darker in person.", 
    "These chairs worked perfect for my dining needs. Quality was good and fabric was pretty close to the picture. For the price you cant beat it. I would recommend to my friends. Service at Overstock has always been great for me. Thank you for helping me furnish my new home.", 
    "Love these chairs! Quality is good! One came in damaged and Overstock sent out another one very quicky. Great service!", 
    "The color of the wood of the chair as well as the fabric is not at all what is advertised. The shape and size of the chair is also significantly different from what they are showing in the picture. Very disappointing.", 
    "These chairs were great. NO assembly and they are beautiful at the farm house style table we have. Great quality chairs.", 
    "Had chairs for less than a year and seams that one chair the leg started to bend? cant use it now cause it can not take any kind of weight or it will break off. I have it to just match the other chair but completely useless!!", 
    "Beautiful chairs and very comfortable I highly recommend", 
    "Wasn't impressed with quality", 
    "Chairs are a darker gray wood and material is gray not a tan/sand as in picture", 
    "Didn't work for me Return process was easy and reasonable Phew", 
    "These chairs are very comfortable and very well made. I would have given them a 5/5, however, as seen in past reviews on this product, the chairs are not beige as described and seen in photo. However, we did read the reviews before purchasing these dining chairs so we knew to expect a gray colored chair. We were good with that and that's exactly what they are. A light gray. Also, some reviews mentioned the chairs were small, but we looked at measurements and knew what we were getting. Make sure you check measurements because then you will know exactly what you are getting.", 
    "They fit the bill for sure. Arrived completely assembled and look even better than the pictures online!", 
    "I ordered Beige, I received smoke. So annoying as now I have a return unnecessarily. These chairs are cute but I must advised that the Smoke color I received have some hideous black fabric stapled to the bottom and you can see it when you look at the chair from the side. Praying the Beige does not or they will go back too. It is cleverly concealed in these photos.", 
    "Compact but very comfortable. Love the finish. Perfect in our dining room. More grey than beige", 
    "We were very disappointed in the quality of these chairs. One leg on one of the chairs was broken when they arrived. Overstock was great to deal with on that issue but my husband (who has built furniture) noticed the break was along the grain of the wood and felt the way the legs were cut that breaks would be a likely possibility in the future so we didn't reorder these chairs. They arrived when we had company and everyone agreed the chairs looked cheaply made.", 
    "I was looking for chairs to fit around my dining table which is a smaller space in my house. These are perfect and look great. One was a little different in color, but besides that great buy for being inexpensive.", 
    "Great looking chairs. High quality.", 
    "Well worth the price- they look a lot more expensive. Nice and sturdy.", 
    "These are very nice chairs. Although they are very small in scale. It would help if they were pictured around a table to get a better idea. If you have a tight space, then they are great!", 
    "All of the other reviews you have read about the chairs not looking like the picture are true. Luckily I like the gray color so that was not a problem for me. I think the chairs should be pictured beside other furniture so that you can get a better idea of the size of the chair. They do look larger in the picture than they are in person. Again that was fine for me, I am using them at a dining table and they worked great. If you are planning to use them as accent chairs in a living space then they might be a bit too small. I have found the chairs to be sturdy and well worth the money. Great deal!", 
    "these 2 chairs were better quality I liked them"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Park-Avenue-Beige-Linen-Dining-Chairs-Set-of-2/8682598/product.html?recset=de02fb19-904e-4a6d-9cb5-6b400c8ede3a&refccid=JVITOZ3DUJ2YMIKMFBM5ORUHEY&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8682598/Park-Avenue-Beige-Linen-Dining-Chair-Set-of-2-35097613-53fe-4288-87fc-fd220c06ab87_600.jpg"
  ], 
  "description": "Constructed from gorgeous solid wood and upholstered with handsome\nbeige linen, these contemporary dining chairs from Park Avenue add\na touch of class to any home. The neutral tones of the upholstery\nand the natural reclaimed wood finish make it easy to pair these\nchairs with a wide variety of different styles of room decor. For\nadded safety, these linen dining chairs boast fire retardant foam\ncushioning. Upholstery materials: 18-percent linen/82-percent polyester\n  (550g heavy substance - fire retardant)Set includes: Two (2) dining chairsMaterials: Solid wood/linen fabricFinish: Natural reclaimedUpholstery color: Beige linenUpholstery fill: Fire retardant foam cushioningSeat dimensions: 18 inches high x 18.5 inches wide x 17\n  inches deepDimensions: 36 inches high x 18.5 inches wide x 22 inches\n  deepStyleContemporary, Shabby ChicMaterialLinen, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembledChair Back HeightStandardColorBeigeFurniture PatternSolid"
}