{
  "name": "Parsons_Paisley_Scroll_Floral_Upholstered_Armless_Chair", 
  "price": "EUR 94.54", 
  "reviews": [
    "This chair looks exactly as it does online. It was easy to put together and if sturdy. It's not some plush pillow that you can sink into, but it's the perfect dining chair for sitting, eating, and leaving.", 
    "Colors are nice and neutral enough to add a nice touch to most decor. Using it as a desk chair in area created adjacent to Kitchen with granite top for desk use. Comfortable.", 
    "I bought two of these chairs to use as end chairs for a small vintage dining room set I have. They are great and what a good price. The quality of the materials is very good and they were easy to assemble.", 
    "I ordered 6 of these chairs to use with my glass top table. They are perfect. The pattern looks beautiful showing through the glass. The chairs are very well made and went together easily. Love them!!!", 
    "Reasonably priced addition to a guest bedroom.", 
    "Very pretty and not too hard to put together. Everything came on time.", 
    "The colors in this chair are perfect!", 
    "This chair was worth the wait of coming back in stock. We purchased it for our new office space, it is comfortable and stylish.", 
    "Beautiful fabric on this chair, although the background is a little more yellowish/ivory than I had anticipated. The chair was relatively easy to assemble, well packaged and delivered timely.", 
    "Was exactly as pictured, easy to put together, sturdy and comfortable. I actually purchased only one of these as a desk chair.", 
    "I agree with other reviewers that this chair looks exactly as pictured, but what you can't see is that the fabric is very cheap feeling. I worry that it won't hold up to even light use in a household with two large adults, a dog, and three cats. Very pretty though.", 
    "When you sit on it the first time it is a little hard but after about two weeks it has soften a bit. The color was not as vibrant as I thought especially the blues in the fabric other than that it serving it's purpose.", 
    "I love the colors and pattern on this chair. It's a little too deep because I'm short and if I sit back in order to have my back supported, then my feet don't touch the floor. If I sit up though, the cushion is very comfortable.", 
    "chair is as described, beautiful, sturdy and comfortable!!", 
    "Such a pretty chair. I am using it for a desk chair as I needed it a bit more formal/dressy than a typical \"office\" chair. The colors are perfect for the room too!", 
    "The chair looks exactly as described. It's sturdy and is well placed in our little dressing room, but would do just as well as an accent chair.", 
    "Purchased 4 chairs. They came quickly and were a snap to assemble. The fabric is perfect, the colors exactly as pictured. They are comfy and sturdy...the overall quality is excellent. I highly recommend these for anyone.....", 
    "Purchased 4 chairs. They came quickly and were a snap to assemble. The fabric is perfect, the colors exactly as pictured. They are comfy and sturdy...the overall quality is excellent. I highly recommend these for anyone.....", 
    "I just received these chairs and they are so much nicer than the picture!", 
    "This chair is not only pretty, it is comfortable. I had no trouble putting it together with the allen wrench provided. Makes a good desk chair.", 
    "I purchased this to use as a vanity chair in my master bathroom. It is even more beautiful in person! Easy assembly, very sturdy. Very happy with this purchase!", 
    "Everything was just as expected/ Neat and packaged well. Took 1 hour to put together...My only questions is how much weight will these chairs hold?", 
    "The chair is well made and easy to put together, but the main color is not as expected. Thought it would be perfect for the guest room which is taupe, slate blue and cream. The flowers are those colors with a bit of navy blue, but the background color of this chair is kind of a dingy light yellow, which gives it a completely different look from what I had hoped. If you don't need this to match something in the room, it is a nice chair for the price. Just keep in mind that the dominate color of this chair is not Cream.", 
    "Great chair. Easy to assembly and well packaged. Great fabric with sturdy base. Recommend highly to anyone.", 
    "People tell me they are comfortable and pretty. Colors as shown", 
    "Ordered two to use as guest chairs in one of our offices. They look absolutely beautiful and the quality is excellent for the price. Assembly was not too difficult and took about 30 minutes.", 
    "These chairs are comfortable and nearly match the drapes in my DR. They were easy to put together and are solid.", 
    "Nice product. Very easy assembly, good quality.", 
    "The chair is higher quality than I thought it would be. It's sturdy materials/construction and the fabric is very nice. Super easy to put together as well. I only need one chair, however, if you're looking for a set of chairs this would be great!", 
    "This chair is an excellent value and really brings freshness to the décor!!!", 
    "Very happy with quality of the chair. Comfortable to sit on. Color on Internet doesn't do it justice, colors are much more vivid and the detail is nice. Had to do some assembly but was well worth it.", 
    "I love this chair! In fact, I ordered 3 more to make a set and designed my room around them. It comes with the legs off and ready to assemble. Very quick and easy.", 
    "They are comfortable & cute! They are sturdy chairs. Love them.", 
    "I love this chair. Didn't give it 5 stars because it's quite more beige then the picture. Still looks great though. It came with a huge stain of grease in the back, but Overstock promptly exchanged it with a good one.Very satisfied.", 
    "Very high end quality, using as a computer desk chair. Have received several comments from family and friends", 
    "Exactly what I had been looking for, nice firm seat, lovely fabric and it finishes off my bedroom decor.", 
    "Really cute chair for small office space. Paisley is blue/taupe/a bit of black. Great accent piece that goes with a number of other colors and prints.", 
    "I love these chairs, I ordered 4 and the quality is very good. The fabric is good quality.", 
    "this chair is so comfortable and so pretty, I bought it for my daughter to use for her desk so she can put on her makeup and blue is her favorite color.", 
    "Very pretty and functional. My daughter says it is solid.", 
    "Pretty good chair. Colors are just slightly less vibrant but nice. Craftsmanship is a bit generic, had a couple of loose threads. Seat is stuff but I'm sure there's a break-in time. Good enough for what I wanted to use it for which was an under counter make-up chair in the bath."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Parsons-Paisley-Scroll-Floral-Upholstered-Armless-Chair/8988406/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8988406/Parsons-Paisley-Scroll-Floral-Upholstered-Armless-Chair-aca83c34-2ade-4905-beae-1b30967cc8f8_600.jpg"
  ], 
  "description": "Add simple elegance to your living or dining room with this armless\nchair. This floral chair brightens any room with soft blue,\nblooming and budding flowers. Blue and grey hues combine with an\noff-white background to make a chic statement. A deep espresso\nfinish covers wooden legs and blends well with a variety of home\ndecor. Welcome guests and family into any room with this warm,\ninviting chair. Materials: Upholstery grade fabric, foam, solid woodFinish: Deep espressoUpholstery color: Cream/taupe/white/blue floralUpholstery fill: High-quality foam, sinuous springsSeat dimensions: 19.5 inches wide x 22 inches deepDimensions: 37.5 inches high x 19.5 inches wide x 24.5\n  inchesStyleContemporary, Country, Traditional, TransitionalMaterialWoodChair TypeAccent Chairs, Desk Chairs, Dining Chairs, Parson ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, Off-White, Tan, WhiteFurniture PatternFloral"
}