{
  "name": "Parsons_Versailles_Medallion_Upholstered_Armless_Chair", 
  "price": "EUR 84.79", 
  "reviews": [
    "I was worried about buying patterned chairs online, without seeing them first, but they are beautiful in person and perfectly accent the dark browns I have in my dining and living areas. I'm so happy to have these new chairs and especially at such a great price! I likely would not have given them a try if they were regular priced elsewhere.", 
    "The hardware to put this chair together was missing. I ordered the chair 2/24/16 and it's almost a month later and still no hardware.", 
    "Beautiful light blue, almost a Robin's Egg blue. I use this chair to sit in while I teach piano. It is slightly stiff, but I only use it for a few hours at a time. I would recommend.", 
    "The fabric is not the best quality, and it's a bit flimsy - even after tightening the bolts after assembly. I'm using this as a desk chair. It looks nice in the room, but I'm sure I'll need to replace it in a few years.", 
    "Great chairs! Super easy to put together- and NO problem assembling. I tried many chairs in my kitchen and these were the best ones! I have 8 of them. They look much more $$. Just beautiful!", 
    "beautiful chair, nice quality, and easy to put together.", 
    "Easy to assemble, fast delivery, and it looks just like it did on the website. I use this chair in my home office and its comfortable and durable. I recommend this chair highly!", 
    "This chair was exactly what I was looking for for my writing desk! Just perfect and sturdy/well made too!", 
    "This is a fantastic chair, very comfortable. I put it together myself, was very easy. In my opinion, the color isn't as baby blue as it looked on my monitor, it has a little gray/green undertone. But, it's beautiful.", 
    "The chair itself is pretty, but quality is questionable. The welting along the front was not attached properly allowing the stuffing in the chair to be visible. However, Overstock customer service gets 5 stars as it immediately addressed the problem. Hoping replacement is better made. (It should be noted the pattern appears to be stamped on, not part of the fabric).", 
    "Easy assembly; nice fabric and comfortable sitting", 
    "Product was beautiful and the images on line were accurate for color and style.", 
    "I bought two of these chairs to go in a home office space as accent chairs under a desk. They came in two different shipments, one of them arrived scratched. They look fine, though I would not call it an 'expensive' look though. It's a good purchase for the price, but noticed stores like T**** sell similar chairs for the same money which comes assembled. Overall, I am happy with the purchase.", 
    "We are very impressed with these chairs. We bought these to compete a family dining set. These match beautifully!!", 
    "The chairs are very comfortable and just the color that I wanted. They were easy to assemble and are sturdy as well as pretty.", 
    "Love these chairs for dining area in new house! The fabric is stunning,durable and easily matched to accessories. Economically priced , a great deal in other words! Just perfect for our new home and next chapter in our lives!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Parsons-Versailles-Medallion-Upholstered-Armless-Chair/8985547/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8985547/Parsons-Versailles-Medallion-Upholstered-Armless-Chair-812826a3-1568-47f2-8f14-c20c12377b9b_600.jpg"
  ], 
  "description": "This gorgeous armless chair from Office Style Products showcases a stunning light blue upholstery that delightfully offsets the white medallion pattern. The fill is an unbeatable combination of high-quality foam and sinuous springs for the ultimate in comfort. The deep-espresso finish and simple but delightful visual lines make this armless chair both sturdy and lovely.\nIncludes: One (1) chairMaterials: Upholstery grade fabric, foam, solid woodFinish: Deep espressoUpholstery color: Light blue with offset Versailles white medallionUpholstery fill: High-quality foam, sinuous springsSeat dimensions: 19.5 inches wide x 22 inches deepDimensions: 37.5 inches high x 19.5 inches wide x 24.5 inches deepStyleContemporary, Country, Modern, Traditional, TransitionalMaterialWoodChair TypeDining Chairs, Parson ChairsSet SizeSingleAssemblyAssembly RequiredChair Back HeightStandardColorBlue, WhiteFurniture PatternPrint"
}