{
  "name": "Parson_Chevron_Dining_Chair_(Set_of_2)", 
  "price": "EUR 141.31", 
  "reviews": [
    "love, love, love. no problem with assembly. they look fabulous!", 
    "I ordered 6 of the multi-colored parson chairs for my dining room! The chairs arrived quickly and my husband assembled them with just a little difficulty. The chairs are beautiful and look great with my table! The price was wonderful and the chairs exceeded my expectations!", 
    "They are a perfect compliment to the rest of whites chairs in dining room. I used them at the end of table and give a touch of color.", 
    "I love these chairs, they are nicer than I expected from viewing the picture.", 
    "Exactly what I was looking for, goes perfect with my decor", 
    "These chairs are nice, easy to assemble, and the price is good. The pattern adds some pizazz to my home office. They are comfortable, too. But let there be no doubt, they are taupe. That said, the color is neutral enough to work well with my warm grey and wood decor and many added colors. I'm keeping them. Thanks.", 
    "I bought 4 of these chairs to go with a circular glass top dining table I had bought from overstock. I really like the chairs. They are not exactly grey chevron as described but more silver/goldish but I like that color and it goes well with my table. Assembly was easy. My husband got all 4 chairs done in an hour.", 
    "visually good looking. Easy to assemble. Some chair seats collapse after very short use", 
    "Yes, the color is not truly grey/white, so for anyone who is looking for the exact color match, this may not be the right chair. But, they still look great. As a previous reviewer mentioned they are more of a off white and beige color. The chairs are comfortable, sturdy and pretty if you can look beyond the color matching.", 
    "CHAIRS ARE NOT WHITE OR GRAY. THEY ARE BEIGE AND BROWN. Had to return them right away!", 
    "Very nice quality and color. Well made for price and liked free delivery.", 
    "Very nice chair but these are BEIGE; not even close to gray. Not work the effort to send back; very irritated."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Parson-Chevron-Dining-Chair-Set-of-2/9688076/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9688076/Parson-Chevron-Dining-Chair-Set-of-2-913d60b7-c49f-4b7b-ad87-1980a5385216_600.jpg"
  ], 
  "description": "Complete your modern decor with this set of two Parson dining chairs. Featuring a chevron pattern beautifully offset with a rich warm wood finish, these chairs radiate a chic polished look. Use these chairs for extra dining seating, place them in your foyer or use them as side chairs in your entertainment area.Each set includes two chairs making it easy to mix and match with another setSupports up to 250 pounds for safetyConstructed of wood and fabric for long-term durabilityFeatures a brown wood finish with upholstery in cream and warm grey chevron stripes for a modern lookOffers spot cleaning for easy careDimensions are 38\" H  x 19\" W  x 23.5\" DStyleTransitionalMaterialWoodFinishWhite FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorGrey, PinkFurniture PatternChevron"
}