{
  "name": "Pisano_chenille_Fabric_Armless_Contemporary_Accent_Chair_with_Matching_Kidney_Pillow", 
  "price": "EUR 140.77", 
  "reviews": [
    "This chair is very comfortable, and sturdy, once assembled. It does take a little patience to assemble, but wasn't bad- took maybe 30 minutes.The chair will look great in my daughter's apartment!", 
    "The package arrived quickly and was in good shape. The chair looks just as the picture shows except it is a tad bit lighter in person. It still a pretty color however. Putting it together was a nightmare. The directions are half clear, I believe they sent the wrong sets of screws and to top it off, I cannot add the extra screws in the front legs because the holes are drilled off center from the brace that it goes through. The craftsmanship is terrible. I had problems getting the back of the chair on because again the holes and the brace did not line up. It was so off I could only do 3 out of the 4 screws and had problems with the three. It took me about an hr to put together this chair which should of taken me 20 min tops. I would've returned it but that would of been a bigger headache. It seems to be pretty comfy though, for the brief moment i sat in it, to make sure it was sturdy enough to move. Luckily this wasn't for someone to sit in, it was just for decoration, so for that it looks great.", 
    "It's exactly what you would expect for the price. No surprises. Arrived quick. I don't know about the comfort. I don't sit in it much. It's in my foyer just for extra space to sit and put shoes on. I like it though. The color orange was accurate", 
    "This is a very pretty accent chair. However, it is not very sturdy.. so it isn't a good chair for every day use. I needed an accent chair that was pretty, so it's exactly what I needed. Do not buy this expecting every day use."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Pisano-chenille-Fabric-Armless-Contemporary-Accent-Chair-with-Matching-Kidney-Pillow/10858608/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10858608/Pisano-chenille-Fabric-Armless-Contemporary-Accent-Chair-with-Matching-Kidney-Pillow-3abee9bd-1405-4566-a372-5a5f1a0eafde_600.jpg"
  ], 
  "description": "The Pisano Accent Chair offers extras seating and a splash of\nbeautiful color that's a welcome addition to any room. This armless\naccent chair is as comfortable as it is attractive, as the deep\nseat filled with foam allows for ample support. The matching kidney\npillow adds a distinctive look and comfort, too. It features a wood\nframe, espresso finished tapered legs, and all fabrics are\npre-approved for wearability and durability against AHFA standards.\nYou could furnish a room with several chairs or complete a look\nwith just one. This durable chair is crafted with solid wood legs\nand a chenille fiber weave, which means it is built to withstand\nextensive use through time. The chair comes with a matching fabric\naccent pillow to complete the look. The sturdy legs is coated with\ndeep espresso finish. It's solidly made of wood frame which offer a\nsolid foundation The seat and back are padded for great comfortable\nfeeling The unique grafitti design is a nice touch of modern\ncontemporary appeal      Seat height 17.75 inchesApron height 7.75 inchesApron to floor 10 inchesPillow 18.00 x 8.50 x 5.50 inchesFurniture Pattern: SolidChair Type: Accent Chairs, Lounge Chairs, Slipper ChairsMaterial: Chenille, Wood, fabricStyle: Contemporary, Casual, TraditionalAssembly: Assembly RequiredChair Back Height: StandardColor: Blue, Green, OrangeStyleCasual, Contemporary, TraditionalMaterialChenille, WoodChair TypeAccent Chairs, Lounge Chairs, Slipper ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Green, OrangeFurniture PatternSolid"
}