{
  "name": "Portfolio_Sayre_Sangria_Red_Chenille_Arm_Chair", 
  "price": "EUR 321.63", 
  "reviews": [
    "Chair was well priced. The style works well for us. The fabric on the chair is fine but not plush chenille. The color is more rust than red which was a disappointment but we kept the chair. Not unhappy with quality for this price and chair will be used for secondary seating so it is okay. Maybe we should have bought the beige/sand instead.", 
    "Beautiful deep red color, very good quality for the price.. in love with this chair...", 
    "These chairs are the perfect match for my bedroom-the color is a beautiful brick red. The chair is so comfortable and the fabric really soft. Absolutely love these chairs.", 
    "We bought a pair of these for or living room. Great size, feel, color, fabric, and price. Very happy.", 
    "The picture correctly represented the chair's color & shape. I was very hesitant about buying furniture online, since my previous online purchases have left me disappointed.", 
    "This little chair is really comfortable. The color blends perfectly with my drapes and ottomans even though I do wish the red was a tad deeper in color. I didn't give 5 stars because one of the legs looks like it's slightly crooked when screwed in.", 
    "These chairs are exactly what I was looking for. They are shorter than other ones. I needed this size for a particular place. The fabric and color are great. I have only had them for a month, so I don't know how the frame or fabric will hold up. They seem structurally solid.", 
    "This chair is good sized for small room. Seems comfortable. But is an off color of red. Looks more rusty.", 
    "It replaced a similar chair - mostly used for decoration - not use so it's ok for price.", 
    "Perfect chair for my bedroom - comfortable and cozy. I read the other reviews about the color and they were right! A rusty red was just what I wanted and it is perfect!", 
    "This is exactly what I was hoping for.", 
    "Looks like a child's chair and was actually mauve.", 
    "Before ordering I read through all the reviews and I was delighted when the color of this chair was not too orange but a lovely shade of red that goes perfectly in my living room as an accent color. Not too bright and not too burgundy. The low back of the chair does not block the light from the window behind it. This chair will work well for casual conversations, but buyers should be aware it is not a big comfy lounge chair where you would curl up with a good book. The price was right, quality seems good, and Overstock always does a great job of quick delivery. I am a happy camper.", 
    "Worth the money. Is quite small (but the space I needed it for is small so it works) and the back is lower than I expected. Definitely more of a rust than red color. Comfortable.", 
    "nice colour and quite comfortable.", 
    "This is a very nice chair I do need a pillow behind it as I am on the short side. It is also more of a rusty red. I am not dissapointed. Thinking about ordering another one!", 
    "Received this chair last week and it was extremely easy to assemble. Looks great in my guest bedroom. Color is a little more rust colored than I would have liked but blends in nicely. Thought it would be a little more comfortable than it is but it will do for a bedroom. I would recommend this chair especially for the price.", 
    "Bought this chair for a small space in my office. It was perfect. The color is deceiving, though. It's (like other reviewers have stated) definitely more of a rust then a true red. But I read those reviews beforehand because this is the color I wanted.", 
    "The chair was exactly as described. Very comfortable. The seat is a bit deep (long) for my taste, but it worked out fine.", 
    "We were looking for a small, yet comfortable chair for our bedroom. This chair makes a perfect reading retreat when the household ruckus gets too much. It does not take up too much space, but is comfy for both my husband and me. The color is closer to rust, which is exactly right for our bedroom.", 
    "It is not as Red as the picture--a little more on the rust side. Wish it had been more red but I will keep it. It is a bit small as well but will work on the space I need it for", 
    "Perfect for the reading corner. Nice material and solid construction. Easy assembly. Only wish is that the seat cushion were separate from the chair itself.", 
    "Perfect size for our apartment living room", 
    "The chair legs were easily assembled; the color is perfect a rust red; the size complements my small living room; the delivery was prompt; the chair is comfortable. I knew the back was low but I do not see this as a chair lounge in to read or watch TV. Perfect for company. Good price", 
    "Absolutely perfect in my living room", 
    "This chair is amazing. Didn't think that it would match my living furniture because, of the color inthe picture. I couldn't really tell so, I went ahead and ordered it any. When it came it turned out to be a match made in heaven. It goes perfectly with my living room setting."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Portfolio-Sayre-Sangria-Red-Chenille-Arm-Chair/9447248/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9447248/Portfolio-Sayre-Sangria-Red-Chenille-Arm-Chair-6344465a-bbf6-4a92-9337-c03311508a6b_600.jpg"
  ], 
  "description": "The Portfolio Home Furnishings Sayre button tufted arm chair will add style to your decor. The Sayre chair features turned front legs and is covered in a beautiful and durable sangria red chenille fabric.Finish: Dark espressoFrame materials: Sturdy hardwoodUpholstery color: Sangria red chenille-like fabricUpholstery materials: Polyester chenilleLegs: Dark espresso finishDesigner Portfolio Collection offers unique styles to decorate your homeIdeal for small spaces, this arm chair works great in offices, bedrooms or living roomsPlush foam and fiber fillingAttached box seat cushionInnovative engineering and packaging design enable upholstery to be easily assembled in the actual roomTakes less than 15 minutes to assembleEco-friendly and efficient product design uses less fossil fuel based components in construction and deliverySet ships in one (1) boxInstructions and tools for assembly includedDimensions: Seat: 19 inches high x 19 inches wide x 21 inches deepChair: 31.25 inches high x 28 inches wide x 33.5 inches deepArm height: 25 inchesStyleTransitionalMaterialFoam, Polyester, WoodChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorRedFurniture PatternSolidProduct FeaturesEco-Friendly"
}