{
  "name": "ProLounger_Lya_Black_Renu_Leather_Power_Recline_and_Lift_Wall_Hugger_Chair", 
  "price": "EUR 593.45", 
  "reviews": [
    "I ordered this chair for my father, who is a 92 year old small man. In less than a week, the motor died. Overstock was gracious in sending another chair. Now, four months later, the SECOND chair has stopped working, and I see that the return option is closed. This chair was not heavily used or abused, and I feel quite disappointed that my elderly parents invested in this and went through the inconvenience of having to replace one, and now they are left with a chair that will not function. I have been a long time shopper at Overstock, but this experience is causing me to pause and consider future purchases. What a disappointment!!", 
    "This chair was purchased as a Christmas gift. We were a bit hesitant buying it without seeing it in person, but we were unable to find any leather lift chairs in stores. Other leather lift chairs we found online were a lot more expensive so we decided to buy it. We were disappointed when the chair came because although it looked great, it came without the power cord and the small bottom front feet were broken. Overstock.com customer service was contacted about the problem. They were going to send us replacement parts, but instead we received a whole new chair and Overstock.com arranged for free UPS pick-up of the first chair. The second chair looks and works great, and we are very happy with it. It is definitely a great value for the money.", 
    "Bought this for my husband whose Parkinsons is advancing allowing him to either lie flat, to relieve his back, and/or for help in his inability to get out of chair to stand.", 
    "I got this chair about a month ago. It is very comfortable. It was delivered before ETA date. However, my chair was slightly damaged by UPS. It had a large rip on the side of the chair from the UPS delivery person. I notified Overstock and they made a deduction for me since I did not want to return the chair. I was able to repair the chair myself with glue and paint. I had watched this chair for a few months before I decided to buy it. Boy, I am glad that I did. The chair works well as described. It is soft to sit in but not too soft. Just right for me. The lift portion works like a dream. I think this chair will be durable and last for years. Thanks O for this product. Keep up the good work and quality products.", 
    "It was easy came when promised and talk about nice looking only problem was that the wheels needed to be taken off (slide across the floor lol). Works like a charm.", 
    "So, I'm pretty sure \"Renu Leather\" is plastic. My body does not like to sit on plastic so I ahve had to put a towel over the chair. And it is interesting that the seat is only 18\" wide BUT will handle up to 300 LBS. You would think the seat just might have been a little wider? For the money, its not bad. With discounts I got it for about ***. They were much more locally. AND I got it delivered to my front porch. After *** dropped it off the truck to the street, but it still worked after that.", 
    "This chair is junk. Made in China. Not very strong or quality material. I was completely shocked at poor quality. Do not get this product.", 
    "I love the chair. It's not heavy to move around and also is a great fit for a small living room.", 
    "Very nice chair for the price. Very helpful for my Aunt who is recovering from surgury.", 
    "I really love my power recliner!! It's very, very soft and comfortable!! The fact that it's mobile on wheels, is an another plus!! Thank You!!", 
    "This has been a great chair so far. The quality is much better than I expected for the price and it is very comfortable. The soft leather looks and feels nice. I would recommend this chair for a person under 300 lbs.", 
    "SO FAR SO GOOD .....ONLY HAD THE CHAIR FOR A FEW DAYS .......VERY QUIET, WHICH WE LOVE...........EXTREMELY COMFORTABLE........SOFT.............EASY OPERATION & SET-UP...", 
    "This adjustible chair enables me to stand up much easier. Highly recommended for handicapped persons.", 
    "This lift chair is an excellent buy. Great for sitting, reclining and Laying back. Can push it to the wall and no need to move it to lay back!. Easy controller and great speed to lift you easily out. Bought it for my Father who is aging, and he loves it!!! recommend to anyone.", 
    "This chair is so worth every dime. Bought it for a WWII Vet that lives in a nursing home and can't sleep in a bed. He loves it. Color is great and the leather is awesome", 
    "Perfect for a medium sized space - not too big or small. Good back support. and easy for my husband to operate", 
    "Nice chair. Great deal. Extremely comfortable", 
    "I bought this for my husband and he was totally delighted with it. Looked elsewhere for pricing and Overstock was the best, hands down. I keep a cover over it because the cat loves it, also, and her claws are tough on the fabric. This chair is a good height, even without using the life, and very comfortable to sit in. It can sit near the wall and still be reclined without 'rubbing' the wall. Very nice.", 
    "Very comfortable, easy to assemble and even easier to operate. Great choice. Was worried that ordering this piece from Overstock vs. furniture store would be a nightmare if there were problems. So very satisfied with this purchase.", 
    "Was a good choice going with this pro lounger would buy it all over again if needed. It is a very comfortable chair fits perfectly in my area.", 
    "I bought this chair for my husband for Christmas he loves it. It was easy to put together, my husband has text me ,called me at work to thank me 3 time.", 
    "This chair arrived quickly, in 2 pieces, and was easy to assemble. The motorized function is very smooth and quiet and it looks great in our room.", 
    "Only had the chair for a few months and it already has problems. It doesn't want to go down. It also snaps and cracks. It also doesn't raise as high in the legs as I thought it would", 
    "This chair is easy to set up and use. It's very helpful for the aides who care for my mother. The price makes it a good value.", 
    "Easy to assemble. Comfortable. Had trouble with delivery. UPS kept leaving it at their warehouse, so I had to call and \"encourage\" delivery. It is heavy so maybe the driver didn't want to deal with it for three days. Anyway, when I got it, the box was very beat up. There was a puncture to the leather on the side pouch. Too much trouble to send it back.", 
    "Comfortable, delivered when expected.. Works as described, easy assembly", 
    "My husband has Parkinson's disease and loves this chair. He is able to get up out of the chair without any help. The seat is a little in width but it fits him at 165 lbs.", 
    "Material is soft, more like vinyl but good, cushion and arms are comfortable and the motor is responsive. Assembly was simple; simply attach the back and remote.", 
    "I love the product but I hate the service. I ordered a recliner as a gift for my parent. The recliner was shipped without the hardware. I contacted customer service & all I got was a bunch of apologies. Seems like no one is watching what goes out the door. Well over a week past before I was able to talk to someone that could actually get things taken care of for me. If it was not for the fact that I had sent the recliner to a different that I was residing in , I would have sent it back to them . First impressions are everlasting! I was so embarrassed! I wont be sending any business that way again!", 
    "Nice chair, it works well for me since I am disabled", 
    "Fabulous, best price anywhere. Now looking for a reclining loveseat.", 
    "Gave this to my mother since she has issues with standing and this chair has really helped so much. It's attractive, comfortable and narrow so it does not take up a lot of space. Would purchase again, if needed.", 
    "Easy to put together ,very Comfortable, nice soft leather.", 
    "I never got to look at it. the shipper left it at my door for two days rain snow I called and told them about it theyfinally took it away three days later I told them they can .keep it iam 84yrs oldnd don't need to play games", 
    "I am very pleased with the purchase of this chair. I have bad knees and this chair assists me with little effort and less pain.", 
    "Excellent chair at a good price. Until l found this chair I could not find a lift chair in black. Very happy!", 
    "The chair worked fine. It was easy to put together but the quality just wasn't there. The material faux leather was very uncomfortable to sit in. You stuck to it. I wound up returning it because we just weren't happy with it. Return policy was good though.", 
    "Overstock is sending a replacement, but my chair is currently stuck in the most upright position and sitting in my small living room with no one able to sit in it. The chair was unboxed yesterday. Disappointed as I bought is to aid me after a surgery that will be happening soon. Hope the replacement goes without incident.", 
    "I bought it as a present for my aunt, she had a lift chair but not one that reclined. This was a perfect fit for her.", 
    "It starting falling apart in two weeks..", 
    "very comfortable and good looking"
  ], 
  "link": "http://www.overstock.com/Home-Garden/ProLounger-Lya-Black-Renu-Leather-Power-Recline-and-Lift-Wall-Hugger-Chair/8454602/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8454602/ProLounger-Lya-Black-Renu-Leather-Power-Recline-and-Lift-Wall-Hugger-Chair-4919611f-568d-4557-81d4-ae1cbf81b43b_600.jpg"
  ], 
  "description": "Relax after a long day of work on this comfortable ProLounger power\nrecline and lift chair. With plush renu leather upholstery and\nhigh-density foam, this recliner offers comfort that contours to\nthe shape of your body. The soft chaise pad positioned between the\nchair and the leg rest provides additional support to the legs for\ncomplete relaxation.Constructed from hardwood frame with black renu leather\n  upholsterySoft chaise pad offers support and comfort to the legsChair performs a range of three positions that do not lock in\n  place for a customized positionSide pocket holds UL approved wired controllerWall hugger design only requires 4\" of space to perform each\n  positionRenu leather upholstery is a durable, composite leather made\n  of polyester and polyurethane with the appearance of top grain\n  leatherOkin chair motor is one of the best in the world and\n  efficient design uses minimal fossil fuelsSoft cushions filled with polyester fiber, high-density foam\n  and independently wrapped coils to create a relaxing seatChair supports up to 300 lbsChair ships in one package and takes less than 10 minutes to\n  assembleInfinite lift chair allows any angle because it doesn't lock\n  to a set number of positionsRecliner overall dimensions measure 68\" fully reclined, 41\"\n  from back of the seat to the footrest and 28\" from seat to the\n  top of the reclinerSeat measures 9.5\" H x 18\" W x 21.5\" D, chair measures 43\" H\n  x 35\" W x 37\" D and arm height measures 25\" HStyleTransitionalMaterialFoam, Leather, Poly Synthetic Fiber, Steel, WoodChair TypeReclinersAssemblyAssembly RequiredColorBlackFurniture PatternSolidProduct FeaturesPower Recline"
}