{
  "name": "QuickCover_Studio_Sized_Waterproof_Recliner_&_Chaise_Protector", 
  "price": "EUR 37.89", 
  "reviews": [
    "Does not have a strap to keep it secured to the back of the recliner so every time you sit down, the back falls down on top of you", 
    "This is the ideal covering for a recliner/chaise. I didn't know if I would find what I needed but I did thanks to Overstock.com. I love this article and I am using it already. It has saved the day for my recliner as I have pets and it's so hard to keep their hair, etc off my furniture. This will protect and reserve my furniture for a lot longer now. Yes, I would highly recommend this product if you have a need for it. It is high quality at a reasonable price. Many thanks to overstock.com.Sincerely,Jen ******", 
    "We really enjoyed the suede feel of the quilted fabric. It seems like it would be durable, but it wasn't long enough. Had it been 10-12\" longer so it draped down the back of the chair a bit I would have kept them. True to other reviewers, it just wouldn't stay put and would require constant adjustment. Bummed but returning.", 
    "This recliner cover has a nice feel to it and the color is pretty, but I expected it to be longer for the part that goes over the top part of the chair. The cover just barely goes over the top of my chair.The cover slides off easily, because it is too thin, and not long enough to cover the chair. I expected a little heavier weight. Maybe if you have a small recliner this might work for you, but the material is very light with nothing to hold it to the chair. Guess I will still have to use my existing cover for the chair.", 
    "It's a nice cover but it slips off easily. It does wash well.", 
    "This barely fits over a overstuffed recliner and once you sit down it will no longer fit over the back of the chair or the arms.. and the material isnt all that pleasant to sit on.. I have a different brand that fits my sofas and they are much better than this one for the chair.", 
    "Fell apart almost as soon as I took it out of the package. Incredibly poor quality.", 
    "I have vanilla color Lay-z-Boy recliners and I was looking for something to cover these light color chairs.I found it on Overstock.com for a reasonable price.It is good idea, but it does not work well in real life. This cover does not have any grip and slides down. It needs to be fixed every time before sitting on it. If the top part of these covers is made longer, it would help.I found other covers on different website with the grip on the reverse cover side, waiting for the shipment and then will see if those will work.", 
    "Doesn't stay put in recliner. Not long enough. Seems to be waterproof.", 
    "don't work so well on a lift chair.", 
    "It looks nice but when you put on the chair it looks sloppy and slouches over once you sit on chair.", 
    "Just as shown in picture. Colors could have been named more clearly (Fawn was dark brown, which is what I wanted). Top could be longer. You have to pull down the back each time chair is used. But, it looks good and does the job.", 
    "Would not stay up on the head/back top, the armrests would not stay flat on the sides, had to keep bringing forward to fit..hoped for best, but hubby did not want to deal with falling cover on back..", 
    "Slips constantly after you sit down the back falls down have to pull out of chair constantly. Not what I expected", 
    "I went and bought Velcro by the yard, affixed it to the end of the back part of the cover where it goes over the top of the chair, I put some on the sides about as high as the shoulder blades, I put in on the arm rests, nothing will keep this very thin un weighted thing on the chair. I don't have the time to return the product and I cut the Manufacture's tag off the front of it, Yes It is on the front of the cover and it is 2\" x 3/4\" and white, my cover is chocolate. This same exact thing is for sale at Amazon 1/2 the price, you might as well save 20 bucks if you want this horrible thing. I am going to the store in the morning and I am buying some elastic and sew it to both sides of the back part and strap the damn thing on.", 
    "Our recliners are small in size compared to some on the market & I was afraid these protectors would be too big. Instead they were not too bit or small but just right and do the job nicely!! We are pleased.", 
    "This is a well made protector and I am disappointed that it is not long enough for our chairs. The width is perfect but the back falls down every time you sit in the chair. Our recliners are not oversized chairs. They are normal sized recliners. So unless your chair is small I would not recommend this cover. The only reason I gave it a fair rating is because of the size not the quality. Measure your chair and make sure you measure about 1/3 of the way down the back of your chair. You need at least that much hanging over so the cover does not fall down.", 
    "I could not keep the cover in place on either the arms or head--especially the head. It would probably work fine for a pet that might sit on the chair. I saw another one with a pc of elastic holding the back together, and I will try that next.", 
    "would not stay in place. It is made well.", 
    "I believe the dimensions of this item if increased would improve its performance. As you sit on the cover the sides are pulled down, the back is pulled down. What you're left with is the back slipped behind you and the arm covers sinking into the inside of the arm. Great idea, though.", 
    "THE RECLINER COVER DID NOT FIT MY RECLINER VERY WELL. IT WAS A LITTLE SMALL SO IT DID NOT COVER ALL THAT NEEDED TO BE COVERED.", 
    "This cover slides right off my leather recliner. If your chair is fabric, it might not be so bad, but I do not recommend this item. Very flimsy... no structure to it at all.", 
    "won't fit well with overstuffed recliners, as it will just fall down on the seat whenever you get up from the chair!", 
    "Order it for my leather chair but will not stay put. Will keep for my cloth chair.", 
    "I agree with the other reviewers. Basically a good fabric, but cover is just not long enough to stay in one position on the recliner.", 
    "Terrible item! Looks great in the picture but as soon as you sit on it it slides from the back. Get up and sit again and the back portion flops onto your head! Constantly re-positioning it. Also stained my cream colored chair - don't buy this total waste of money!", 
    "I was really looking forward to using this on my elderly mothers chair. Unfortunately it does not stay in place. Waste of money.", 
    "I am going to get elastic and sew it on them to help secure the protector down better, so it doesn't fall off. I got these because I just purchased leather recliners and during the summer I don't want to stick to them.", 
    "slides everywhere not as big or as long as it looks washes bad", 
    "Looks nice but it moves when you sit on it. Have to keep putting it in place.", 
    "This was a great purchase for me. My Elderly parent sometimes has accidents and this protects the chair and gives them peace of mind. The style is for a large recliner and i have a small recliner so it would be great if the pad came in sizes. Overall great buy for me.", 
    "The back panel of this is too short to be able to stay in place. It slips forward and looks messy in no time. Am going to have to fashion some sort of extension for the back.", 
    "Needed a cover for our new recliner and this works great.", 
    "Really needs some way to secure properly in place. Constantly have to readjust.", 
    "I bought two and returned both. The top portion is exactly the length of the bottom. That means \"if\" you could get it to go all of the way up the chair (it didn't reach for me) it would fall down into the seat the instant you sat down. A good redesign would be for the top to be twice as long as the seat portion so it would hang well over the back and have some type of gripper on the back to keep it from sliding off.", 
    "Very flimsy, does not stay in place. The fabric is rough. Would not recommend.", 
    "Ugly cheap and doesn't work", 
    "Really nice throw cover for a chair. I have 2 cats. Works out well", 
    "Liked the color only disappointed the cover is stiff", 
    "Works perfectly for the mother in law", 
    "it didn't fix and didn't stay in place", 
    "A bit skimpy as far as covering the back of the recliner, but it does the job.", 
    "It is nice if it would only stay up over the part of chair!!", 
    "Really helps with pet hair", 
    "It is to short. When you sit down in the recliner the back slips down and falls over.", 
    "Nice quality, but not good for leather chairs, they slide off so I gave them to my parents, they seem to be working well on the material covered chairs.", 
    "This was a gift. They like it really well. Does the job", 
    "Nice chair cover large and comfortable", 
    "always looks sloppy, and moves to much", 
    "needs to be a little larger. a little small for my recliner, but protects from my pets.", 
    "I have a smaller recliner and it doesn't even fit that very good. It keeps falling down and it shows every spec of lint or dust. Not happy with it at all!", 
    "I tried to wash to soften but no luck. Also I have a small ladies recliner and this barely fits over the top of the chair. When you site down the top portion comes down and sits on the back of your head. Disappointed.", 
    "Love these cushions and covers. They are warm and cuddly and I love the fact that they are washable. They, all of them}could use a little weight at the over the chair backs to keep them in place better but on the whole, I would buy these again. Jill Jordan", 
    "Does not stay on. Moves around whenever you move. I wasted my $", 
    "It looks great and fits well.", 
    "Nice looking and provide great protection from our pets. Love that they're waterproof too.", 
    "Nice but it constantly falls off the back of the chair after you raise the chair after reclining", 
    "It's great with the chair. Look great too!", 
    "Good quality. Color match is great!", 
    "This protector is very large. It's comfortable but needed straps or something to keep it in place.", 
    "Not a good fit for the furniture slips off.", 
    "This arrived and I took it out of the package it came in and what I saw looked like a giant red diaper. No matter how I put it on,it did not fit my recliner. I also thought the material it was made of was very close to thick plastic. As I said...Don't waste your time purchasing this.", 
    "this product would not stay on the recliner.", 
    "Love these covers. Only wish they would not slide about so easily. My dog loves to sleep on them.", 
    "KEPT ROLLING UP ON ITSELF", 
    "Item wouldn't stay in place on chair. Always falling behind me and bunching up. Would not recommend.", 
    "this is a nice cover but is not big enough for my recliner", 
    "Don't waste your money! It does not stay put. Does not fit right. Complete waste of money.", 
    "slides around but good quality", 
    "It does the job. What more can I say.", 
    "this is for my husband's recliner.......he has been in hospital so we haven't had the opportunity to use it as yet!", 
    "Did not hold in place well at all. Had to use safety pins for back side and arms. Seat part still bunched up every time i sat down or reclined. Because other side was not slip resistant and seemed like a rough fabrice, it was not very comfortable to sit on.", 
    "This should only be ordered for cloth recliners does nor stay up on leather.", 
    "We don't have pets but this cover is ideal for my purposes. 5HE Fabric Is durable, It Looks Nice WOTH THE OTHE slupcovers. It's not designed to fit but it covets my small recliner in all the right places. Sitting on the cover will cause it to look disheveled, but it's for the family room so no prob", 
    "Slides off the recliner the moment you touch it", 
    "TOO SMALL FOR MY RECLINERS. UNFORTUNATELY I FORGOT ALL ABOUT THEM. NOW IT'S PASS THE ALLOWED RETURN TIME TO RETURN THEM...OH WELL MY FAUGHT. THEY WERE ALSO ALOT THINNER THAN I EXPECTED. WOULD HAVE LOVED TO HAVE GOTTEN A BETTER/THICKER MATERIAL.. COLOR WAS AS SHOWN CORRECT, BUT SIZE DID SURPRISE & DISAPOINT ME.", 
    "does not stay on leather like material", 
    "not as nice as other furniture covers I purchased, but it will do.", 
    "as soon as you get up you have to fix it . would not recommend it", 
    "This cover has no way to fasten it to the recliner and it is really to thin to be of service for protecting the chair.", 
    "fits the chair nicely and stays in place.", 
    "Nice and thick. Like the waterproof feature.", 
    "fits club chair better than recliner. slides all over the chair, cheap material.", 
    "Serves the purpose but constantly having to straighten. Doesn't stay in place.", 
    "Doesn't stay on the Chair. slips as soon as you sit down.", 
    "very happy with them, look really nice. Wish they had someway to keep back on chair.", 
    "Made good but didn't fix my jumbo recliners, so had to return.", 
    "Not the quality I was looking for.", 
    "Not worth the money they wouldn't stay in place", 
    "Size was off for the smaller recliner. Colors were very good", 
    "I WAS SOMEWHAT DISAPPOINTED WITH THIS COVER. IT WON'T STAY ON THE CHAIR WOULD BE BETTER IF IT HAD SOME KIND OF ADJUSTABLE STRAPS.", 
    "Back does not adhere to the chair.", 
    "Nice cover, not as plush as I had hoped and is a real pain to keep it in place with a lift chair. It is always scrunched up. Could be my husband but not long enough in the back to be tucked in and stay in place.", 
    "I wish the sides were weighted to keep the ends over the chair", 
    "Good Idea but it doesn't stay where it belongs. It always looks like an \"unmade bed\". I don't use mine anymore but my husband uses it anyway to protect the chair from farm dirt he brings in on his clothes.", 
    "Looks nice in picture but will not stay in place with use. Must constantly reposition. A blanket works much better.", 
    "Best idea and fit for durability", 
    "I have been very disappointed in these. They do not stay on. As soon as Iget up the back slips down. My friend has some and they are thicker, more plush, and look so much better than the ones I got. I would like to return the 2 Extras I got and find something that looks better and stays on the top. Have you thought of putting velcro on them? Especially the top that goes to the back of the chair.", 
    "This product works well, but does not stay in place very well. As others have reported, the back slides down when the person sitting either shifts their position or leaves the chair. This could be easily remedied by the company by either having elastic clips to snugly hold the back in place or to include velcro-type strips that attach to the cover to the recliner, but also allowing it to be removed for cleaning.", 
    "would not stay in place as soon as you sat down", 
    "Not for me. It won't stay in place and is more a bother than it is worth.", 
    "I bought this for my recliner. It does not stay in place! I will add a piece of elastic. It is made well and is good texture!", 
    "I didn't like the square look.", 
    "Maybe worth $**. I got it to stay in place with a combination of safety pins and bungie cords, not something I would want anyone to see.", 
    "I've been looking for a different protector for our leather recliner for awhile. The first protector I bought years ago didn't breathe and due to my hubby's sweaty hands we have a discoloration and rust problem. This protector seems to be working perfectly. Since it doesn't totally enclose the chair, air can get under it and let the leather breathe. It does seem to be on the stiff side, but it is still relatively new. Hopefully it will soften up with use.", 
    "The fabric and construction seems nice enough but it does not stay in place. I'm looking for twist pins to make the back stay where it should. The protector is attractive.", 
    "I would not purchase this again. Don't even come close to fitting my Lazy-Boy recliner.", 
    "Very flimsy material. Won't even stay on the recliner when you sit down. It slips down immediately.", 
    "I have cats and this product protects my valuable chair from damage.", 
    "very useful and attractive", 
    "This cover is ok but too thin and just doesn't look as good as my other furniture covers.", 
    "Was so disappointed when I received this item. Was so poorly made that I am returning it. Would only last very short period of time due to quality of the material..For sure you get what you pay for.", 
    "Wrinkles easily and looks stiff.", 
    "Would not recommend does not stay on and no way to make it stay on", 
    "It's as pictured. Exactly as pictured. It would benefit from sand weights in the ends or with some sort of strap to fix it to the chair. My cat can easily get under it, and my dog just pulls it off. Not functional to protect unsupervised.", 
    "Good quality fabric but back/head covering too short to stay up. every time I got up, I had to recover the chair . Pain in the neck. I need a cover that will stay in place at least once in a while.", 
    "Nice cover/protector but is for a smaller chair, not a larger one!", 
    "Was as pictured and works exactly like I wanted!", 
    "Will not stay put. Constantly rolls up. After several days removed and put away.", 
    "It is cheap and does not fit well. Do not waste your money. Throw in a little more money and get a good one.", 
    "Looked on line for a while before finding this brand cover for recliner for my 88 yr old father who is in an assited living facility and has had several urine accidents in his recliner due to his incontenance becaues he has dementia and I decided to ck overstock.com and found exact same item and brand at a lower price and bought it... In fact got 4 covers due to savings so he has replacements due to his incontenance... Thanks overstockcom", 
    "It looks nice when you first put it on the chair, but EVERY time I get out of the chair it falls back down and has to be readjusted EVERY TIME! And the color I ordered is MUCH lighter in shade in person than the picture showed. NOT happy! but too much trouble to return!", 
    "Cover works great and beats the cover I was using.", 
    "I got about what I expected. This thing works for what I needed. Could be a little heavier and weighted to keep in place. Overall not a bad deal if you have reasonable expectations.", 
    "Won't stay in place. Have to reposition every time I get up.", 
    "This product was ridiculously ineffective… There was nothing to keep it on the furniture and as you can imagine every time you sent out or got off it fell off the back of the chair. It made me so crazy I threw it away after one day !", 
    "Does not stay on recliner. I ordered for my father and he is 88, it isn't easy to have to fix it every time he gets up.", 
    "I don't think this will ever work because I can't get it to stay on the chair.", 
    "looks god til you sit down and get up ,have to readjust cover every time you get up", 
    "The colors fine but it seems cheap and doesn't stay on the chair very well. The big test will be when we wash it.", 
    "We bought two of these quick covers. It fits perfectly and looks great on one of our chairs. The second one fits okay but seems to crumple up after being sat upon. I would buy this item again as it looks very good and the quality is better than the price would indicate. They were a good bargain.", 
    "I chose this product to protect an upholstered chair that my dog likes to use as an observation post to view the outside world. It works very well. Covers the area that she likes to lie on, and pops into the washer and dryer for fast de-furring.", 
    "this cover WILL NOT stay on the chair... it constantly gets wadded up.. slips off... etc..... would not recommend", 
    "A good protector for a standard size recliner, not for a larger recliner", 
    "Very poor quality. Stiff as a board even after 2 washings.", 
    "Great item to protect from my puppy. And particularly glad it's waterproof.", 
    "Looks nice and easy to wash. Works really well on a lift chair.", 
    "I like the concept.. but I would suggest Velcro strips to help it stay in place.", 
    "Great product really. Good quality. Not perfect, but highly rec-commend! Many attributes, including comfort.", 
    "Ordered this with what seemed like a matching protector for a love seat, both in taupe. Loved the loveseat cover. Did not like this item - flimsy fabric, and did not cover the back or arms of our recliners. Returned - if you return there is a shipping fee - no fee for store credit, so got store credit.", 
    "This cover does not stay in its place. Once you sit down the whole cover gets messed up. Not happy!!", 
    "No way to secure to chair, keeps sliding off", 
    "I received it the next day I ordered it. I was so impressed."
  ], 
  "link": "http://www.overstock.com/Home-Garden/QuickCover-Studio-Sized-Waterproof-Recliner-Chaise-Protector/9372080/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9372080/QuickCover-Studio-Sized-Waterproof-Recliner-Chaise-Protector-f2a4a6a4-e3a0-4e78-9d3a-ab17078019fa_600.jpg"
  ], 
  "description": "Transform your favorite recliner or chaise lounge with this\nstudio-sized waterproof recliner and chaise protector. Cover your\nrecliner or chaise lounge with this protector crafted from soft and\ncushioned quilted suede and polyester with a polyurethane laminate\nlayer for waterproofing to protect against spills and stains.\nEasily integrate this protector into any variety of decors with its\nsimple solid color pattern available in multiple color options.Sit comfortably on this recliner and chaise protector as it\n  is crafted from incredibly soft and cushy quilted suede and\n  polyester with polyester lining and polyurethane laminateFeatures an easy-to-use and install design crafted from\n  absorbent and breathable fabric to protect furnitureApproved by the largest parent-testing community, PTPA, and\n  recommended for use on upholstered furniture to ensure\n  qualityWash this protector separately before usingMultiple solid color choices integrate easily into a variety\n  of home decorsMeasure the seat width from inner arm to inner arm to best\n  determine what size protector fits your needsConveniently machine washable for easy cleaning and careMeasures 67\"W arm to arm x 24\"W across the seat x 76\"D and\n  best fits recliners and chaise lounges with a seat up to 24\"\n  WStyleFurniture Protector, One Piece, Relaxed FitPatternSolidFabricPolyesterColorBeige, Brown, Grey, Off-White, RedFabric CareMachine Wash"
}