{
  "name": "Rockwell_Accent_Chair", 
  "price": "EUR 284.80", 
  "reviews": [
    "Buckle up for a thorough review. First up, assembly: Easy peasy lemon squeezy. Assembled two chairs in about 15 minutes by myself, and I'm 8 months pregnant so that tells you how easy it is. Each leg comes with two screws and one chair was missing a screw, the screw package had come undone during shipping and the screws were just loose in the box. Lucky I only lost one actually. So I just put the one in and it's still completely sturdy.Construction: It's plenty solid. It's only been two or three weeks that I've had them, but I don't anticipate a problem there. One reviewer mentioned that the back isn't smooth and rounded, I too found this a tiny bit annoying. What's happening is the frame of the chair isn't padded enough I suppose, and so it pokes through a bit, and isn't completely rounded. No biggy for me because the chairs are against the wall, but something to be aware of. When people say it's \"firm\" what that means specifically is that there isn't any springs or webbing in the seat construction, rather just a solid wood base. So the cushion itself is plenty soft, but when you initially \"plop\" down there is zero give, hence people call it \"firm\" or \"hard\". For me the initial sit was a bit disappointing, but that being said, once you're down it's plenty comfortable. I prefer it without a pillow because it's a bit shallow for a big back pillow, but I really am happy with the comfort. It's more like a padded hard chair, so think like a eames womb chair or something. Not sink in comfy (again, no springs or webbing), but still comfy.Size: I love the size of these chairs. They are really perfect for a smaller space without being super tiny. The back is lower for a taller person (my husband is 6'2\"), but he still likes sitting in them, so it's not a big deal. Mid century furniture always have low backs, so we're used to that I guess.Appearance: A+, they're so pretty. We got the grey, and love the textured fabric. The grey almost has a bluish tint. Did I miss anything? Overall I'm super happy with them, and am glad I went for them. They are functional for my smaller living room, and definitely comfortable enough for hanging out and chatting. They work great with an ottoman, and overall they're a great buy!", 
    "This chair is very, very firm, so do not expect to sink down into it. It is a nice shape and very comfortable. It hits your back quite low, so a very tall person may find it too low. For the price it is a nice chair. Orange fabric is a nice shade.", 
    "Love the teal green, love the texture of the fabric, love the 50's mid century look, love the wooden legs, love that it took less than 20 minutes to attach legs, love that it arrived in 3 days. Totally love this chair.", 
    "Cute little chair and very easy to set up. I got the orange one, which looks great in my late-'50s era home.It's not the size chair you can curl up in, but it's a good accent chair, which is what I needed for my bedroom.", 
    "Arrived in perfect condition and legs assembled easily. Seems very sturdy and teal fabric is exactly as shown in the picture. My only issue is the back of the chair is not very smooth and rounded. They face forward so you see the back when you walk into the room I have them placed. Still very cool chairs for the price, so I will live with it!", 
    "I have an ocean front Condo...wanted to add splash of color..to match the ocean ...I bought 2 teal chairs..Quality is great and VERY comfortable. I was a bit nervous ..but can tell you these are high quality and look and feel like a much more expensive chair...", 
    "Turquoise color is as pictured. While this is not a squishy comfy curl up and read a book all day chair, the firm foam is comfortable and perfectly suits my needs for a guest bedroom accent chair. Paired with the Safavieh Steelworks Chalice Aluminum Stool as a side table - this makes an eye catching accent for my desert southwestern motif bedroom. Very pleased.", 
    "As described. Quite firm but perfect for a MCM decor. Excellent delivery time", 
    "Got the grey one and the style and look is spot on. When sitting down, I realize the arms are a bit lower than I'd like and it's a bit stiff. But that's probably how all chairs are like in the mid-century style. Still happy with it since it's mostly used when we have guests over.", 
    "I loved this chair when I saw it on the website but was nervous that it wouldn't stand up to my expectations in person but it did. I love it. It's exactly what I wanted it to be. The delivery was like 2 days. Very impressed!", 
    "I got this chair in orange and it is incredibly cute! It seems pretty well-made and it was easy to put the legs on. It's not a huge chair, but I didn't want huge. The fabric is a cool nubby texture. I adore midcentury design so I am very happy with this purchase!", 
    "The great little chair is just what I wanted for accent in my living room. A splash of color was just right. Simple to attach the legs and I was good to go! Chair is darn comfortable, too! Great purchase and speedy delivery!", 
    "I wanted a small chair and this fits the bill. The material looks nicer than in the photo. For a small chair I was surprised how deep it is. I think I will have to use a pillow with it. Easy to assemble. Arrived on time and quickly.", 
    "This chair adds a beautiful pop of color in my living room. It goes really well with our gray sofa. It was very easy to assemble.", 
    "Chair arrived in perfect condition and is a perfect fit to a guest bedroom.", 
    "Great chair got it on sale very good buy.", 
    "Surprisingly comfortable for the price", 
    "Attractive, easy assembly, firm yet comfortable. It looks great in our mid-century room.", 
    "I love the color and form of the chair. Has the look of a well made chair. I couldn't afford an expensive one that looks like this, so the fabric and armature of this chair I hope will last for a few years. So far so good", 
    "This is a perfect little accent chair, we're using it as extra seating that can easily be moved wherever needed when necessary.", 
    "Easy to assemble out of the box. Fabric is nice... sort of a linen meets microfiber. Soft yet durable with nice stitching. Pretty light and therefore easy to move, perhaps too much so on a solid surface floor. Proportions are nice... not large but not too small. Armrests at the right height. The seat has decent give and soft cushion but the back is pretty solid. If you push yourself back into it there's some give and a sense that over time it may break in a bit, but its pretty firm. A small pillow or two would help both for comfort and look. For the price its a great little mid-mod accent that can accommodate a range of settings and sitters.", 
    "I was a little hesitant to buy this chair because it's cheap and had some mixed reviews, but I'm glad I bought it. It's a great deal and it looks great in the home. It's firm, but i find it comfortable and enjoy sitting on it. I might buy a second one.", 
    "The chair looks great in my living room. The legs were easy to mount and the chair looks sturdy. For the price, I think it is a great buy!", 
    "looks exactly as seen. they are very comfortable, hip and stylish. I bought two of them to make a cool little seating area in my master bedroom and put a round table between them. LOVE this.", 
    "I love the way the chocolate colored chair looked in my office. The size is also perfect, not chunky at all. The curved shape also gives my place a good feng shui feel.", 
    "I bought six of these in blue and four of these in grey for my business, and they are exactly as ordered. Easy to assemble, true to color and comfortable.", 
    "I bought the aqua chair. It has a nice retro transitional look. The fabric is a weave. I didn't know how bright the color would be. Not too bright, not sure how else to describe; also not significantly muted. It fit nice in my sitting room.You install the legs.", 
    "This is a super comfortable, really cute chair, but I purchased the gray and it is definitely not gray. If possible, I would describe it closer to navy blue than gray. Possibly even with a hint of purple. I kept it even though it doesn't match the other chair that I bought to go with it, just because it is so comfortable.", 
    "well made occasional chair just right for our client waiting area. easy to attach the legs, sturdy, funky modern color.", 
    "Love this chair. Firm, but with a bit of spring and quite comfortable. Bought the orange on a lark, and while it's bright, it's not TOO bright. Very fun and lively.", 
    "It looks fabulous and is of fine quality. I've tried it for a good five minute sit and it was quite comfortable. Have not had another try since our cat has taken up residence in the embrace of this lovely chair.", 
    "We needed a little pop of color in our MCM living room. Couldn't be happier for this little guy. Nice and sturdy and comfortable for a living room side chair. Love that the upholstery can easily zip off.", 
    "It's not bad for the money. It doesn't look any more expensive than it was. Assembly was simple and the chair is pretty comfortable. I was hoping for slightly better quality but realistically you get what you pay for.", 
    "Great for the price :)A little stiff, but these were a great option for some adult seating in my client's colorful playroom.", 
    "I have two of these chairs in my psychotherapy office and I love them! The quality is great and the blue adds just the right amount of color to the room. The chairs are comfortable for all of my clients from little kids to older and larger adults.", 
    "This chair is high quality and met my need for an accent piece for my den. Arrived in great condition.", 
    "Very happy with my purchase. It looks like it does in the picture and for a reasonably priced chair it doesn't look cheap or chintzy. Pretty comfortable and sturdy as well.", 
    "nice quality and very comfortable", 
    "Nice chair. Great quality. It's in our bedroom. Kids and hubs live sitting on it. Just a piece of advice though. Be very careful putting the legs on. It was a one in a million shot, but I somehow managed to drop one of the legs INSIDE the chair! It took forever to get out. Once assembled, it was beautiful though :-)", 
    "it's okay, not great, fairly comfortable. Could have been a little larger.", 
    "We're still loving these chairs after having them for about four months!The blue color looks great in our office... And they're pretty darn comfy. They were easy to assemble but seem reasonably sturdy also!", 
    "Love the color and design, very reasonable price.", 
    "To be fair to this chair, I should note that it was chosen to replace a well-loved leather chair that I had forever. Our Rockwell is comfortable, and very attractive. It has a bit of a mid century vibe going on, but fits well in our eclectic home. I like it!", 
    "Smaller than I expected and not too comfortable.Looks good though.", 
    "Very easy to assemble, looks great and very comfortable.", 
    "EXACTLY WHAT IT CLAIMS TO BE.", 
    "Love this. Modern and stylish. Wish they had more of the teal in stock.", 
    "Love this chair. It's not too big, but the upholstery is a little bit lumpy on the arms.", 
    "This is a lovely chair for a reading nook or bedroom. I have mine in my master bedroom. The color is as shown and the hardwood legs are a really nice maple color. Legs were super easy to attach.", 
    "This was exactly what I was looking for. Love the style. Very comfortable. Firm cushion. Good color. I look forward to enjoying this chair for many years.", 
    "I ordered the one in orange and wish I had ordered 2!! Fingers crossed that they stock more orange chairs soon. It is the perfect addition to my mid century modern living room!!", 
    "Love it - color is exactly as pictured. It's not soft and comfy - but it's \"okay\" and looks great."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Rockwell-Accent-Chair/9787772/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9787772/Rockwell-Accent-Chair-2db67746-e57d-45e4-a3c4-07de64d26330_600.jpg"
  ], 
  "description": "Add a pop of color to any space with this tufted armchair from\nLumiSource. Perfect for sprucing up the look of your living room,\nthis fabric accent chair exudes a retro vibe that adds style and\nspunk to any design setting. This chair's generously padded\ncushioning provides hours of relaxation and comfort. Set includes: One (1) chairMaterials: Wood, woven fabric, foamUpholstery color: Espresso, grey, teal, orange, beigeStyle: Contemporary, mid-century modernSeat dimensions: 18.75 inches high x 20.75 inches wide x\n  20.75 inches deepArmrest height from seat: 7.75 inchesBackrest: 16 inches highDimensions: 31 inches high x 30 inches wide x 30 inches\n  deepStyleContemporary, Mid-CenturyMaterialFabric, Foam, Upholstered, WoodChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, Grey, OrangeFurniture PatternSolid"
}