{
  "name": "Roses_Deco_Accent_Chair", 
  "price": "EUR 107.20", 
  "reviews": [
    "I promptly received my brown & teal Rose Deco chair. No pieces were missing; nothing was damaged. As excited as I was, I built it right away! There was only some minor assembly that was all accomplished with the provided Allen wrench. The directions were a bit shoddy.. our package came with more washers than described in the written portion, which with we did nothing. You need to use the larger washers for attaching both the legs and the chair back (the smaller washers were absolutely useless as they slid right through the holes and were literally unexplained in the directions). After struggling with our options, however, the assembled chair is sturdy and extremely comfortable! It is a perfect accent piece to our living room and we fully appreciate the functionality of it. I would not be hesitant to offer this seat to a house guest, or fear they would be aching to move elsewhere. I am also happy with the way the chair was engineered to hide all the connecting points via Velcro flaps; these hidden areas really keep the chair looking chic and high-end!", 
    "I am a 150 lb., 5' 5\" female and this chair makes me feel like a giant when I sit in it. It is so small! The top of the seat is only 16\" from the floor (very low) and the back of the chair stops 6\" inches from my shoulders! It looks like a child's chair and is sized accordingly! Plus, after only a few sittings, I can feel the springs already. Except for the color, I am totally disappointed and would not recommend this item. I've ordered from Overstock multiple times in the past and have been pleased, however, this was a *** loss!", 
    "I'm an artist selling my work online, so I know that all computer screens are all calibrated differently. I know that when you see a photo, there could be some slight differences in real life. So I expected there to be some differences. But I ordered the Purple Rose on light grey version of this product, and the roses in reality are not purple. They are grey. No way around it. It's like whoever named the product was doing so based on the picture, not by looking at the actual product. This wasn't a show stopping set back, since I have a lot of grey elements in my home, and it matches those nicely. I still would have liked to have the touches of purple the picture leads you to believe are there. The product looks good once assemblied. You'll have to assemble it yourself, and when you do so, you'll pretty quickly realize that it's not a particularly high end structure. Once put together, the velcro flaps and such aren't very visible if you don't know they're there. If it was my only chair, I might be worried about it's ability to last holding actual people regularly over time. But it's an accent chair so it just has to look pretty most of the time, and it does that well. When guests sit on it, they indicate that it's pretty comfortable. It's still new, so the cushion and springs are still in good shape.", 
    "Nice chair for the price. Instructions could be clearer. Comfortable chair. Soft cushion. Use as a chair in bedroom.", 
    "Color and overall construction of chair seemed to be adquate for the price, however, the dimensions of the seat of the chair and height of the back of the chair were not listed and were very unproportionate. Besides not feeling comfortable or high enough for support on your back the seat of the chair was very deep. It almost seemed like the seat and the back of the chair should have been swapped.", 
    "I was mislead into believing that this was a chair for an adult. I wanted to add this chair to my living room, but it looks like I can only use this chair for my first childs bedroom. The good thing about this chair is that it is an easy chair to put together.", 
    "Chair was just what I was looking for in my small bedroom. Fabric is very pretty. Assembly was not bad. Helpful if two people worked together, but not too challenging to do on your own. Just a bit miffed on being shorted one washer. Comfortable for my bad lower back. I was concerned about other reviews about low seat height, but fine for me a woman of 5' 9\" and will be my football watching chair on fall Sundays.", 
    "Great chairs! They look beautiful and added a pop of color in my basement. Would recommend to a friend.", 
    "The chair is very nice. For the price, it can't be beat. I would hesitate to have an overweight person sit on the chair. I needed my husband to tighten the screws, otherwise it was wobbly. The back legs are thin. I would not use this chair for everyday use. It is a nice accent piece with a pillow on top to add to an empty space. If I had the chance to purchase again I would not.", 
    "Chairs are gorgeous. I bought 2 of them for my boutique's dressing room area. When they arrived, one of the legs was broken. However, Overstock immediately sent out a replacement leg, so that was not a problem. The seat cushion is very thick and comfy. They are a perfect girly addition to my store! I love them!", 
    "I ordered a purple rose chair and this is actually gray. Not purple in any light. Natural light (took it outside), amber light... The seat cushion is nice. The back seems short.", 
    "I like the chair although the colors were not as expected. It's really hard to tell the color online....I looked at multiple sites, but ordered from here for the best price and free shipping. It is a denim blue background with dusty blue floral print. Although I had hoped it were brown/blue I will still make it work with my decor by draping a brown throw across a corner. Assembly was easy with the tool provided once I discovered that the legs & hardware were hiding in the seat under a velcroed flap. That should be more clearly marked and noted when the item is shipped.", 
    "I wanted this chair because my living room is pretty modern with shades of grey, silver and coral. I thought this chair would soften up the room with its floral pattern. When it arrived, I was shocked to see a brown and black chair. I read the box over and over to see if I chose the wrong color. Sure enough, it was the Grey Rose. I asked my friends to look at the chair to see if my eyes couldn't see the color grey. They all stated the chair was sandy beige and black. I am heartbroken because the price was right and the chair was what I needed. Now I have to go out of my way to the UPS store. My suggestion is to ensure the color is accurate. This clearly is NOT grey.", 
    "Great small accent chair. I'm using it in a small sized family area for extra seating so I did not want something large. This chair just fit perfectly, and it's comfortable as well. Would recommend it for a small bedroom or guest bedroom for seating. Liked the fabric as well. Easy to assemble for my husband, so that's a major plus. Can't go wrong with this chair. Can't get over how comfortable it is.", 
    "A moment of fear, upon seeing the boxes, was quickly dispelled with the ease at which these came together!. I love the fabric and the size, they are the perfect \"move-about\" chairs for a cocktail party. I ordered two for my living room and am very pleased, I have already received many compliments! Hurray!", 
    "The chairs are fine. A little shorter than what I expected them to be. It was a small struggle to assembly them. You have to follow the directions word by word...", 
    "I have this chair in my guest room. It's perfect! It's small so it fits in the rom perfectly. I would recommend this chair.", 
    "I really like this chair and would reccomend it to anyone who needs side chairs.", 
    "Chair was slightly smaller than expected, BUT of HIGH quality and appearance.", 
    "Sometimes you get what you pay for.", 
    "The color is excellent, it is easy to assemble and looks great in my bedroom.", 
    "The lavender chair I ordered was actually gray & dark grey.Overstock was kind enough to pick it up & send another as they I was sent the wrong chair. I received the same color chair & again,Overstock picked it up w/o charge. Some times colors are not pictured as the item really is.", 
    "Color is pretty, but not a very strong unit.", 
    "u could see the foam and staples underneathe and the color was diffrent than what it appeared online. pretty beat chair.", 
    "Looks nice but not very comfy", 
    "chair looks nice but is made very flimsy...legs don't stay tight", 
    "the chair foot not aligned.", 
    "Designed for short people", 
    "Looks just like the picture. Very nice for a bedroom. However not very durable", 
    "Very nice and neutral goes with just about anything . Would recommend", 
    "I really like this modern chair, but it is rather small. It fits my children well, but small for an adult. It works good as an extra, but as a main seating area in the room it is too small.The fabric is nice and durable, and it goes together really nicely.", 
    "Color and print is soft and elegantGoes well with my solid love seats", 
    "Easy to put together; just need a lot of strength to get all the screws cinched down tight so the chair doesn't wobble. It is definitely a low to the ground chair, but it worked great for our desk area.", 
    "Just the right accent chair for my master bedroom. Comfortable for sitting.", 
    "Easy assembly, smaller in size than expected . But happy with the product.", 
    "I love the appearance of these chairs. They are sleek and clean and add a great accent to a corner in the house. The only complaint I have is that they are not terribly sturdy. Not weak per se but ust they creak a little when you sit in them. I tightened everything and to be honest we're not a small family - I'm 5 '10\"- 170 pounds - just don't invite the football team over to sit in them.", 
    "Very nice chair for the cost.", 
    "Excellent product. Beautiful chairs", 
    "A very satisfy customer and a great price and fast shipping.", 
    "stylish with comfort for any age", 
    "Very nice chair. I looks great in my bedroom.", 
    "Very nice chair and easy to assemble", 
    "Very pleased with my Roses Deco Accent Chairs (I bought 2) for my master bedroom. They would look great in any room. The pattern is very subtle and elegant.", 
    "I love these chairs. I bought the gray chairs and they are so adorable. They were very easy to put together. I am using them with the Upton Home Cornell Cocktail Table in my showroom and they make a perfect seating area. I would buy them again.", 
    "this chair is comfortable and lovely. It was easy to assemble and adds just the right touch to the bedroom. and who doest need a place to sit down and put on your shoes, this is a perfect chair for that! And it comes in so many lovely colors too", 
    "holes didn't match up for assembly, not a very sturdy chair but works well as an accent in the guest room.", 
    "Love the roses design. FYI the chair is small but for my bedroom it is OK.", 
    "The chairs fit just right for my seating area.", 
    "Exactly as I ordered. Looks great with my other furniture", 
    "I have 2 of these chairs. The construction is less than perfect, however, they are used as accent chairs and they are not used often. They are a good buy for the price and would buy again", 
    "I bought this chair for my mother for when she has visitors at her home, she loves it and so does her visitors.", 
    "They are beautiful chairs. Took very little time putting together. Absolutely perfect for what I wanted.....have had many compliments on them.", 
    "Beautiful chairs. Jus . What. I wanted", 
    "These chairs are great value, easy to assemble and look really nice in my livings space. That being said, they were a bit smaller than I anticipated, so if you're using them to fill a large space, you may want to reconsider (or buy two). I bought two in \"Ivory Rose\" and they looked nice once BOTH were set up. When I set up only the one at first I was like, \"Whoa, that's a small chair.\" I'm 5\"4 and the chair almost reaches my hip. All in all though, I would recommend.", 
    "Unfortunately the back of the chair is extremely short so it does not match any of the other furniture. It looks like a child's chair. Quality and comfort are nice, but it does not look right as an accent chair for an adult. Great if you have little kids.", 
    "As mentioned before, this chair is smaller in dimension, then it may seemon the pictures. It suits wells as an additional chair e.g. in the bed room orliving room with rather low seating. It is not high enough for most standarddining tables. Quality is ok, it takes a few minutes to put the pieces togehter,I would say a good buy for this price.Keep in mind that shipping will take 2 to 3 weeks, depending on where youlive (shipments start in CA, we live in FL).", 
    "Legs are a little weak, quality is fair not the best", 
    "Chair is firm and useful as an \"extra chair\". Upholstery is durable and attractive.", 
    "come on. . . .are we all 4\" tall and weigh 95 lbs? These chairs are laughable. A lovely well built waste of money as far as practicality", 
    "Laughable size. A chair \"wannabe\" just never grew up Great colors, nice fabric, solid build but for children only Not even worth rerturning Will makes it way into the garage storage or the trash bin", 
    "Love the look and feel. exactly what I wanted. looks really nice", 
    "This is a great accent chair for my living room and was very simple to put together! Great value!!", 
    "Love the colors and they go with all my furniture .They are very soft and comfortable.", 
    "i have it in my bedroom and it looks beautiful, I will be purchasing another one soon", 
    "This is a pretty chair, but even after assembled, feels very lightweight. Luckily this is an accent piece in a room which does not get a lot of use, as I don't see it as being a chair that would last long if sat on daily.", 
    "The chair is very pretty, exactly the color I wanted for my bedroom which is painted gray. It's a little small/low, but I was just looking for something to fill a corner where my husband can drape his clothes on their way to and/or from the closet, not to actually sit on.", 
    "Good quality, at a reasonable price. Would recommend this to anyone looking for this item.", 
    "Upholstery pattern and color as described. Quality seems very good. Easy to assemble.", 
    "Nice size accent chair for a small bedroom which is what I wanted it for.", 
    "I really like the design on my chairs. I got the lightest colored ones for my work room. I wanted something comfortable while I work on projects around a table. They are pretty too.", 
    "We purchased this chair for an occasional chair in a spare bedroom. It was delivered quickly, easy to put together and looks very nice.", 
    "Love the fabric .. I got the blue denim ... small chairs but great where I needed them and they are comfy to set on .. really dress up the room ..", 
    "This chair was easy to put together, looks like a much more expensive chair, and is very comfortable. However, the black rose color has brown in it, which I did not anticipate. I have decided to keep the chair. Overall, Not a bad quality chair, and you can't beat the price!", 
    "Only complain is that the back is a little shorter than I thought it was going to be!!!", 
    "This is a lovely chair, which was pretty easy to put together myself. I loved it so much, I bought two more for my office. The chairs get many compliments on style as well!", 
    "I ordered the purple Roses Deco Chair, but received a gray one in a purple box. That's okay, because I like the gray one, also. I wanted a comfortable chair to sit on in my bedroom, and got a PRETTY and comfortable chair to sit on. The chair was easy to put together, and was ready to sit on in a few minutes. I really enjoy this chair, it is so pretty and comfortable!!", 
    "I bought these just a decor in my bedroom and I love them....not as tall as I would've liked but still pretty good", 
    "Absolutely love the chair. Watch a match for the design of my master bath. Easy to assemble, and wonderful quality.", 
    "i am not sure whether i am unlucky or what based on all the good reviews. The quality of this product is horrible. it seems this chair is really \"hand made\". the screw holes are not round and not lined up with screws. the wood got cracks everywhere. I am totally disappointed by this product. it is going back.", 
    "It's a little shorter than I expected, but otherwise I love it.", 
    "I'm really impressed with these chairs! Was easy to put together and very durable! The best part is the way they look, absolutely great.", 
    "everyone says how nice these chairs are I bought two.for my guest rooms.i very pleased with them.as nice as the ones I looked at for three hundred each.my daughters each want one for easter now.", 
    "We needed an accent chair for our living room.. It's a small room, and this chair fits perfectly. It sits low to the floor, but is very comfortably to sit in. It came it a VERY small box. I couldn't believe it contained a chair. It was easy to assemble, very solid, and looks great.Love the fabric & style.", 
    "Great accent chair. Looks good in bedroom. Easy to assemble.", 
    "This product is very small. The seat is an average size, but the back is very short and the chair looks misproportioned. We cannot use the chair in the living room as an accent chair because of the size.", 
    "I fell in love with this chair. Easy assembly and very comfortable.", 
    "A cute and comfortable chair. I bought this for my meditation chair and it is perfect. Not too tall and have a wide seat. Very nice!", 
    "Chair was very short and showed very small in the room", 
    "beautiful product!It was very easy to assemble and super stylish!", 
    "It came in one box that I had to put-together. It was a simple. Anyone who can use a screw driver will have no trouble.", 
    "My fiancé and I were skeptical based on the reviews but decided to give them a try. I put the together with ease, they look great in our space and they are perfect. He is just over 6 foot and thinks they are very comfy. Great find! We love them.", 
    "Very cute chairs that went together in about 10 minutes without difficulty. As was stated by another reviewer, the colours are not very accurate. I ordered purple and they truly are gray. The other thing my husband mentioned immediately was \"these are small chairs!\". True. They are not very big or high and can easily be dwarfed by some of your other furnishings. All in all, still an excellent buy for the price.", 
    "I love these chairs! they are even even nicer than they look on line! I would recommend them to anyone that asked me about them the quality for what you get is incredible .", 
    "I knew what I was buying from the onset; an inexpensive accent chair for a guest room. For the price, I didn't expect a piece of furniture that would be used daily for years. With that in mind, this is a more than acceptable piece. It is comfortable enough and is very attractive. I did take a chance on the color; the picture of the \"purple\" chair looked to be the grey I was looking for and it is. There is no purple heather undertones at all. It's grey. I am very happy with my purchase given its intended use, and was happy to suggest it to my daughter's guest room. It was easy to put together, too. You really can't beat the price for a lovely accent piece.", 
    "I was excited to find these chairs on overstock and the price was excellent so I ordered to chairs. The chairs were easy to assemble and the instructions were easy to follow, but once I'd completed assembly I thought my eyes were playing tricks on me. I thought the chair looked extremely short but just chalked it up to me being sleepy after having worked all day. I took pictures of the chair to send to family and friends to be sure that I wasn't seeing things but the pictures didn't do it justice until I sat the chair beside my couch and realized that I wasn't delusional but that the chair was SMALL!!! In comparison to a standard sized couch, the chair looked like it had shrunk, like it belonged in a doll house. I immediately called Overstock and arranged for my return and sent the chairs back the very next day. I don't know who these chairs are intended for bit unless you're using it in a child's room I don't suggest ordering them. They are gorgeous and comfortable but entirely too SMALL!!! I probably should have read the reviews before purchasing but it's a little too late for that now.", 
    "My husband just put this chair together, so simple. Took maybe 10 minutes. Perfect size for the guest bedroom. Material is nice for a chair that is not going to be used all the time, it's more for looks than it is for use. It is very comfortable and sturdy. I would highly recommend this chair to anyone.", 
    "Very nice accent chair! It was easy to put together, looks very nice, comfortable to sit on and fabric is soft and true to picture. We have the tan/beige colored chair. Lovely.....", 
    "I like the chairs but I kind of wish that they were a little bigger. None the less, this si overall a great product and the chairs look really good in my living room.", 
    "I love this chair and so does my cat, she's been lying on it a lot. I have it in my bedroom and it's a very nice decorative piece, looks great. I would buy this chair again if I had the need for another one.", 
    "The chair is a little small and in a large room, looks lost. However, the fabric is pretty and assembly is easy, but bolts need to be tightened periodically.", 
    "I bought two of these, They are on the small side and low. I still liked them enough to keep them. Should have paid more attention to the dimensions. Overall, happy with the purchase, though would have been happier if they were normal chair size.", 
    "Great product for the price. A little tricky to put together but Overall very satisfied with the look.", 
    "I got this chair for an accent chair in my bedroom. I never actually sit in it. The cats sleep on it. It looks great, was easy to put together, and matches my decor.", 
    "These chairs were easy to put together and pretty once they were. I liked the design. My only negative on these is that the chairs are smaller than I thought from the pictures. They are good chairs for small areas. It's actually difficult to find chairs this size.", 
    "Chair is good quality for the price. The color was the same as on the website.", 
    "I like this chair - it serves its intended purpose (make-up chair in vanity area). It's very short, however. I don't fault O. I'm sure I just never really paid much attention to what the finished height would be for the seat and especially the back of the chair. The chair is pretty and looks nice. Sitting in it, though, I sometimes feel like a kid at the grownups table.", 
    "Love these chairs. They're sturdy, comfortable, and a great value for the price. One of the chairs was missing an important piece of hardware that is essential for construction. Luckily my husband has a lot of tools and such, so he was able to come up with a workaround. Still, very frustrating!", 
    "The chairs matched my decor exactly. I love it. I bought these to go with wall pictures & curtains.", 
    "I'm very happy with the chair yet the back legs seem a bit flimsy other than that great quality.", 
    "This chair was small and I knew it when I saw the dimensions. I bought it for a desk because I thought it would be more attractive and comfortable than a typical office chair. It has not disappointed. But be aware of the fact that the chair is pretty short (although it is wide). If you're looking for something bigger, this isn't for you. The price, size and appearance was what I wanted, although I would have liked a taller back.", 
    "All in all, I'm pretty pleased with these chairs and the price I paid.", 
    "I really like this chair! We purchased it for a guest room, but realize that we can easily bring it to the living room if we are in need of extra seating. It went together easily and the Velcro laps seal very well. The ivory colour option has a golden sand background which sets the roses off nicely without being jarring. This chair looks a lot more expensive than it I.", 
    "Using as office/occasional chair. Not just practical but adds style and comfort to my office/den. Very happy!", 
    "we purchased six of these chairs. we had to return one because after some time (less than 1 month) the back starting to come loose and even tightening the screws would not solve the problem.", 
    "This is a cute little side chair that makes the room have some interest...love the design and feel of the fabric....it is short and my grand kids love to sit on it....for the money, it is a very nice chair...it compares to others of the same type to be $50.00 or so less!!!! love it!", 
    "I like this chair for the price and it matches my bedroom decor perfectly. It was easy to assemble and sturdy. I use it in my bedroom to get dressed in the morning so the fact that the back is quite low doesn't matter to me. If I was sitting in it reading for hours, it would be a problem.", 
    "The chair is perfect for an accent chair. It's pretty sturdy - I wouldn't recommend a 220lb man (as my husband is...) to sit in this chair... but it's great for a chair for guests to sit in.", 
    "Very prompt delivery, and the chairs are just what was advertised on the site. The colors are just what I saw in the picture online. They were easy to assemble, and the dimensions were accurate. They look great in my sitting room.", 
    "I needed a small chair for my writing desk in my bedroom, and this one fit the bill perfectly. It was easy to put together and looks great in my room.", 
    "This Roses Accent Chair is of excellent quality, very sturdy, comfortable, affordable, & very easy to assemble. Plus do not forget the free shipping.", 
    "Love it! Looks great in my bedroom, and it is very well made.", 
    "This is a very nicely made slipper chair. It is true to the dimensions listed. I don't understand those saying it's \"too small.\" It's a SLIPPER chair, they are usually low with a low back. The seat area is a good size for an average sized person. If you are a really \"big\" person, it's probably not a good choice. I got it in the Ivory color and the fabric is very close to how it is pictured. I am using it in my master bedroom, so it's not sat on much at all maybe a couple of minutes a few days a week. Not sure how long it would last if it was sat on for long periods of time. It's perfect for a vanity chair or an accent seat in a living room.", 
    "They arrived early and assembly was easy. They may be a bit smaller than I expected but I am very pleased with them. I would order them again.", 
    "I purchased 2 of these chairs and thought they were beautiful. I should have paid attention to the measurements as they turned out to be too small for the intended space. More for a second living room, guest room, or child's room.", 
    "I should have paid more attention to the measurements, the chair back is pretty short, not expected. I wanted a higher back but it looks good in my bedroom.", 
    "I ordered 2 chairs and I am happy with them. However, I do not think they are worth the price. The construction is very cheap and when I put together one of the chairs the legs were uneven and wobbly. I contacted customer service at Overstock and they are going to replace the chair. But, it took 30 mins to put the chair together and now I have to take it apart and ship it back. It took 10 days to receive the original order so now I am going to be without a chair for another 10 days. The customer service agent that helped me was not very helpful or understanding of my frustration. If will not by furniture from Overstock again.", 
    "I bought this for a bedroom, looks cute and does the job.", 
    "This is a small chair which fits perfectly under a small desk in my bedroom. Review the size, it is small but was perfect for what I neeeded.", 
    "I love love this chair, size, color quality so much that I am buying one more.", 
    "I received the first of two chairs as a Christmas gift and loved it so much I purchased a second one. These chairs are comfortable as well as beautiful. The purple is an accent only, which I love! With a purple pillow, this seat is the star of the living room.", 
    "I bought a pair of these in lavender as accents for a small-ish room. The colors match one another. They were easy to put together. They seem to be fairly sturdy for sitting. I paid $170 for the pair and I feel it was an appropriate price. I would recommend them.", 
    "Looks great and sturdy!! Color is excellent and very comfortable to sit.", 
    "THE PICTURE OF THE CHAIR WAS NOT THE CHAIR I THOUGHT IT WAS, VERY SMALL AND SHORT BACKED LOOKS LIKE A KIDS CHAIR", 
    "Got this chair, had to assemble it, one of the washers included was broken. The back of the chair is much shorter than expected, it's like a mini-chair, good for a bedroom accent chair, wouldn't use it in a sitting area or living room unless it was a small room.", 
    "Nice little chair perfect for a small space. I was hoping it would be the same color as the photo but it is more grey than purple. It still goes well in the room I purchased it to match, and it does have a lavender-ish grey look. If you want a purple chair - this isn't it.", 
    "Pretty chair. Very sturdy, easy to assemble, and beautiful fabric. The back sits low, but that is a design of the chair.", 
    "This chair is a slipper style chair and I chose a light beige fabric color. It is very pretty and well built. I find it very comfortable and great in a bedroom, den or a sunroom..which is where I put mine. My husband helped me assemble the chair. It was quite easy to do.", 
    "I bought this chair to use as a vanity chair in my bedroom. I read other shopper reviews and noted that there were a lot of people that said the chair was small. As a vanity chair it is perfect! The colors match my newly redecorated master bedroom and I am very pleased with this purchase.", 
    "This is a sweet chair. It's smallish, but perfect for the corner in my guest room with a throw pillow. I put it there so guests have somewhere to open their suitcase or sit and read. This chair is sturdy enough, yet small enough to not take over the room. The ivory color is nice and neutral.", 
    "I ordered the gray chair and it was exactly as pictured. I put it together and didn't need the instructions, it was that simple. I bought the chair for my master bedroom as an accent piece and it is very comfortable and the right size for the room. The only thing that I have to mention here is that when you sit on the chair it makes a noise. I'm not sure how to describe it except to say that the stuffing and materials it is made from make a crushing sound when compressed. It might go away with time but for what I use it for it doesn't bother me. I am glad that I purchased it and Overstock is a great company to deal with. Shipping is so fast as always.", 
    "The chair is on the smaller side but if you place two side by side they look fine.", 
    "This is a really cute chair. Somewhat smaller than what I thought, but its ideal for a bedrom or just a smaller area? I ordered the blue/brown and its just a great contrast for our room. Good quality, fairly easy to assemble and overall, its a really nice looking accent chair for the cost.", 
    "I bought two chairs and put them it corner. It really tied up the whole room. Really easy to assembly.", 
    "I like the chairs. They blended in very well with the other pieces in the room. The color was precise enough online so that my choice coincided with the accompanying furniture in the room. The chairs pulled off the decor excellently. Thank you.", 
    "I love this chair!! The only negative & it's not even that important, is that I wish it was just a little taller. However it looks great in my bedroom & I'm not at all sorry I purchased it. Awesome value too!!", 
    "Very beautiful chair and would have been easy assembly but some of the screw holes did not match up and also the wood was cracked making it hard to fully tighten some of the screws. Inexpensive chair so I guess you can't expect the best quality. Overall I'm happy with it.", 
    "This chair was purchased for the size and shape to go into our spare bedroom. Fits the space nicely and for the price it was a real deal. It appeared well made and was easy to put together in about 10-15 minutes by myself.", 
    "I like the chair but am disappointed in the color. The chair was easy to assemble. It is also a comfortable chair to sit on if you are a short person.", 
    "I love this chair... it's the perfect little pop of color in my brown and beige family room. It's quite comfy as well. It is a bit smaller than I anticipated... which is great since I am quite small. It actually fits me perfectly. I love sitting here w/my kindle and a glass of wine. It's really cute.", 
    "I ordered and received these chairs I bought two in a very timely manner. I really like these chairs they fit my new living room just perfectly. The colors of the chairs arrived and looked as good as the pictures.", 
    "It's the size that's deceptive. The top portion is too small. It looks deformed. It almost looks like a child's chair. I'm hiding them down my basement.", 
    "I love this chair. It is very comfortable and a perfect size for the bedroom. I just checked the website for another one and this color is out of stock. Hope it comes it soon because I would like to get another one. The chair is lower than a regular chair but it is great for a small bedroom.", 
    "Easy to put together, comfortable to sit on and perfect for my small guest room. Very elegant piece with lovely fabric.", 
    "Chair was a bit harder than expected to put together. Quality is cosistent with the price point. That is, this is not a fabulous deal on a great chair. It's an inexpensive chair at an inexpensive price. It is also quite small.", 
    "the chairs are very nice, quality very good for the price. the shipping was very fast. the chair are very comfortable looks very nice in my loft. I plan on buying two more for my tv room.", 
    "I love this chair. It is very comfortable. I wish I had purchased two of them while they were on sale. If they go on sale again, I will get more.", 
    "It matched perfectly as far as color goes. The rose/flower design was right on as well. Overall it will do for the inexpensive price I paid for it,", 
    "This is a nice chair. Easy to put together. Would definitely recommend to a customer.", 
    "These are good little chairs for the price. The assembly wasn't too bad, either.", 
    "I just Got them in the mail and i love them!!!!!!!!", 
    "I got two chairs to put them together in the living room of my small apartment. I like them so much I am now using them as dinner table chairs at a small table. I was worried when one review said her husband wanted to know if they were children's chairs, but that's silly as they're not that small... just rather short in height. Overall they are beautiful and I am considering buying one or two more.", 
    "I love this chair, I bought it for my dressing table. The only thing I may change would be the height of the chair. I love it", 
    "Cute chair with okay set up. We never could get the legs perfectly straight and I thought it would be more brown, but it kinda of looks greyish blue in the light. Still cute though and I've gotten lots of compliments", 
    "The chairs are comfortable and will serve their purpose of providing extra seating in our living room. However, they are weirdly tiny compared to our average sized couch. I expected them to be petite after reading reveiws and the description online, but they are even smaller than I imagined. My fiance put them together and asked if I bought childrens furniture. I do think they are pretty, and would probably be perfect in a bedroom, dressing room, or other smaller space.", 
    "cute chairs; howerver, the chairs are made for Goldiocks and baby bear.", 
    "Nice accent chair, sturdy and well made. It was a little lower than I expected but it's an accent chair in the bedroom so it works. I don't think I would have wanted it for a kitchen or dining table though. It's comfy and the fabric is nice. Easy to put together.", 
    "I love them these chairs are very good they match very good with my other furniture I love it", 
    "The chair arrived in a timely manner and was not difficult at all to assemble, the Allen wrenches were included. It is in my formal living room now and I am thinking about getting another one. Nice chair.", 
    "Much smaller than expected but for a bedroom chair it was perfect. the back is low, but it is pretty. I loved it", 
    "I was looking for a nice accent chair to put in my mostly purple guest room. This chair would be acceptable at maybe half the price. The material, while soft, is very thin and the chair came with a few snags already in it so I don't expect it to really live up to any use. So if you aren't planning to sit in it, it might work out for you. Also, the design of the chair in regards to assemble is flawed. The sides come apart with velcro for the back legs to be put on, but then the material will not velcro closed back over the chair leg once the leg is in place. They should have left more material in this part of the chair to allow for the width of the legs once they are in place. And the color is not accurate to the picture. This chair is plain and simply gray. It doesn't look the slightest bit purple in any way, shape, or form. If I had a store to return it to, I probably would, but it's not worth hassle to ship it back.", 
    "After we put our chair together we were shocked as to how small this chair is. It doesn't look right anywhere in our home, but we consider that our fault since I didn't look at the size. I am sure it would be great for a very low ceiling, small room in the corner. If it was bigger, it would have been perfect!", 
    "I was a bit skeptical of the steps required to assemble based on previous comments but found the assembly to be very easy. The chair perfectly matched the color and description on the website. The quality and design were very consistent with purchases I have made at other furniture boutiques. You can't go wrong with this purchase!", 
    "Chair is very cute and fun and very comfortable; a good accent chair.", 
    "They look nice once assembled but doubt they will stand up to much use. One of the two was difficult to assemble - things didn't fit well. The other one was easier to assemble and parts fit better. There were extra parts in the hardware package but these parts weren't mentioned in the instructions. Hope they weren't important.", 
    "This is the perfect accent chair! The chair is very low & small so I would not recommend it for an everyday sitting chair, however it works well to round out the furnishings in a room. The assembly was very easy and quick. The process was similar to IKEA furniture assembly. The colors were almost identical to the picture. The fabric is kind of rough to touch, but again if the chair is not being used every day then it is not a big deal. Overall great chair!", 
    "I purchased the chairs for additional seating in my office. They look very nice, clients state they are comfortable and are sturdy. I feel they were a very good deal, easy to put together for the most part (see above) and add detail to my office.", 
    "These chairs are as pretty in my office as seen on the website. In fact, my mom might order some for her house after she seen mine.", 
    "chair adds a punch of color and is cute. Not an everyday chair to sit in but its would be perfect for entry way or childs room", 
    "I haven't been able to put the chair together as it arrived with the incorrect front legs. I had to call the company, take pictures, and attach that to an email to show them what was wrong. The chair arrived on 24 Feb and I still don't have the correct front legs. I was dissapointed with the quality of the chair and the customer service.", 
    "I liked the design of the chairs and although I was pretty pleased by the overall look and comfort of the chairs, I was extremely disappointed in the quality of them. All four front legs of both chairs arrived very badly scratched. It looked like someone had keyed them. Although the customer service department dealt with this situation pretty well, it has been almost a month and I'm still waiting for my replacement legs from fedex.", 
    "Very short little chair, I guess I expected more. I'll let my 5 year old have it. Not what I was expecting. The color Is Avery muted purple, like a gray putty. I wouldn't recommend the piece.", 
    "this chair is very nice and it was a good price even though it went down by another twenty dollars by the time it was delivered.The small washers were a waste so dont even bother using them to put the chair together.but for the most part my wonderful husband was able to fiqure out how to put the chair together.", 
    "The chair was so small...the size of the chair would have been okay but the back of the chair was SO short. It was uncomfortable and looked cheap.", 
    "I really love the chair - it's lightweight and beautiful. It is slightly smaller than I expected, but still lovely. I would highly recommend this product.", 
    "The directions for assembly were good, the comfort when sitting upon it is wonderful, and how it looks in a room ~ is very nice! I am very pleased with this chair.", 
    "I was concerned when I first opened the box because the instructions must have been put together in China. There was no indication that the legs of this chair were underneath the cloth casing on bottom of chair. Luckily my husband figured it out.", 
    "Good for a small home office or a kids reading area in their bedroom", 
    "I 'm in LOVE with these chairs that i purchase on black friday. It fits the decor of my NEW home. They are extremely comfortable and i got it at a good deal. I Highly recommend these chairs!", 
    "Bought these chairs. Not a good buy. They look wrinkled at the seat... They are super small.. Look like kids chairs. Last straw everytime I order stuff its missing peices who wants to send this stuff back. Had to make it work in other rooms , Don't waste your money", 
    "I am happy with this chair in my bedroom. I wouldn't put it in my living room though.", 
    "We purchased two of these chairs to for our front room that our son also uses as a game room. They are light enough for him to move around (he is 11) so he has somewhere to sit while he is playing video games. When not in use, they look lovely with a small side table in between them. We did not expect much but were pleasantly surprised! I am seriously thinking about purchasing another for my makeup table as they are the perfect accent chair height.", 
    "a tiny bit tough to put together... at least for me. but a good chair for the price.", 
    "I like this chair. It was about the cheapest \"accent\" chair we could find anywhere, and it is a small enough size to be used in various ways (we are using it as a computer chair currently). The look is fine, about what it looks like online. The only negative is that the product description does not tell you that you must build it yourself from the pieces that come with it (or actually, hidden inside the cushion), and that the completed chair is held together only by a few large screws. I have noticed a very slight wobble in the back cushion due to this somewhat light structure, but have had no real issues with it. If you are looking for a nice, comfortable accent chair for use in a living room set, etc., I would not recommend this. But for a small, secondary accent chair or for flexible use, it does the job. It is pretty easy to put together, but it does not come with instructions, so if you're very bad with that kind of thing, you may need someone to help you.", 
    "I called to get help with the color b/c it appeared to be two silver rose chairs, I wanted the one right next to the white one in the photo on line, the man who helped me assured me I was getting that one but I did not. I kept it anyway, not the exact color but close enough. Okay chair!", 
    "Chair was shorter than I expected and I would not want it in a high use area. But is is perfect in my bedroom. I really like it.", 
    "Okay. I have to say the price was good on these chairs that is why I purchased them. Putting them together, especially the backs of the chairs was challenging. Apparently a couple of the screws were \"off\" a bit but we finally managed to get the backs on. One of the legs on the chairs was drilled incorrectly so I could only put in one bolt. I thought the chairs were a bit small but they work for the guest room. They also have an overwelming smell. Like formaldehyde or something. It does disapate after a week or so but you may want to keep them in a seperate room until the smell lessons. The do look nice and sit okay..not uncomfortable but not the most comfortable chair either. I guess you could say they are good for occassional use, hence a guest bedroom. Would I purchase them again? Probably not...I think I could find a nicer chair for the same amount of money. Just my two cents worth.", 
    "These chairs will kprobably goi very ery fast, i really like the chocalate, which my son took for his bedroom of choc and blue, our other on toiok the blue, and i have the ivory colored chairs, they are very easy to assembled, also!!", 
    "I like the chairs- however I have only assembled one ( of two) so far ,because it was kind of a pain . It will be nice when i get it done, but I think the assembly could have been easier (i.e. screw in legs...).", 
    "The chairs are small, and not quite as sturdy as I had hoped. The price was very hard to pass up.", 
    "Received this within 2 days of ordering! Amazing! In great shape. Haven't put it together yet but looks pretty easy.", 
    "Beautiful, sturdy chair. Looks beautiful in my bedroom. Not big and bulky. Slim line. Everyone comments on how beautiful the chair is. Perfect for rooms that don't have a whole lot of space to spare.", 
    "overall pleased. like i mentioned the colors weren't exactly what i was expecting in the brown/gray combo. but worked where i was putting them. nice size. not too big. pretty comfy considering there are no arms. first one was very easy to put together. the second didn't line up as well, but we made it work. packaging was great. very condensed, and everything included. would have given it an excellent review, but waiting to see how easy it is to clean.", 
    "I think these chairs are beautiful and especially for the price!! My only negative would be the color should be idenfified as grayish/lavendar if possible. The purple is no where near the shade in the picture.", 
    "Perfect chair for the bedroom. Wanting another but looks like the color i got is gone! The purple is more lighter then in the picture,and looks more grey in my bedroom but fits in well since its purples, greys and blacks.", 
    "This chair is perfect for me! I bought it as an accent chair for my bedroom and it looks wonderful! When the chair arrived (within the time they stated), I put it together and it took around 30 minutes. The quality and construction of this chair is wonderful. No problems at all. If you're looking for something comfortable and inexpensive - this is your chair!", 
    "The chairs are very nice for the money! They are relatively easy to put together and the fabric is good quality also. If you don't mind a few minutes of putting together the chair it is well worth the money. I love the color and style and would definitely recommend them for extra seating that is comfortable.", 
    "Chairs are very nice -look very expensive. easy to assemble- arrived in a timely manner.will re-order more for xmas gifts to the inlaws", 
    "prompt delivery, good quality excellent overall experience", 
    "Ok, after reading all the reviews we decided to take our chance and buy these ACCENT chairs. Now, I emphasized the ACCENT part because these are NOT meant to be primary seats used for sitting for long periods of time. Accent chairs are supposed to compliment (accent) your living space and add to the decor. I am a 5'11\" and 200Lbs man. These are NOT kid sized chairs. When I sit down fully with my back up against the back of the chairs, my legs are perfectly 90 degree. The back support comes up to mid back which is perfect as well. That should give a good example of the size of these chairs. They are very easy to put together and once they are set up, they add to your room's decor and look great. We've had people over and even they loved the chairs. They are comfortable as well. Again, not for sitting for hours at a time. But when you have guests and they sit, these chairs are comfortable and do not sag in. The color we ordered was the gray and we loved it. Great ACCENT chairs!!", 
    "The chair received in good condition and was easy to put together. It fits perfectly in my bedroom. The color good have been a little darker though but it serves the purpose."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Roses-Deco-Accent-Chair/5942750/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5942750/Roses-Deco-Accent-Chair-L13641920a.jpg"
  ], 
  "description": "Add extra seating and extra style to any room with this Roses Deco\narmless accent chair. This chair is crafted with durable hardwood\nwith a rich espresso stain that contrasts elegantly with the cotton\nupholstery. These floral accent chairs are available in several\ncolors to match your style. Their dimensions make them a great fit\nfor apartments or other small spaces. Materials: Upholstery-grade fabric, high-density foam\n  seating, hardwood frameFinish: EspressoUpholstery materials: Heavy upholstery-grade woven in bright\n  colorsUpholstery color options: Purple, blue, grey, ivoryUpholstery fill: High-density upholstery-grade foamKiln-dried hardwoodSeat dimensions: 18 inches high x 21 inches wide x 23 inches\n  deepDimensions: 30.7 inches high x 21 inches wide x 27.75 inches\n  deepStyleContemporary, ModernMaterialCotton, Fabric, Foam, WoodFinishBlue, Espresso, Purple, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Grey, Ivory, PurpleFurniture PatternFloral"
}