{
  "name": "Sadie_Slipper_Brown_Derby_Accent_Chair", 
  "price": "EUR 173.26", 
  "reviews": [
    "I was expecting a brown chair with a touch of gray woven in. What I got was a very blue chair. It should be called \"blue derby\" instead. The shape and cushion of the chair are fine. A little better than what you'd find at a big box store. Fabric is a little rough to the touch. Easy to put together. I would have kept it if it had been remotely close to the color described. If you are looking for a blue chair with a touch of gray at a good price than this would work for you.", 
    "I was looking for neutral-toned chairs as extra seating in my living room, to replace 2 arm chairs I moved to another recently-renovated sitting area. These chairs were well-priced, easy to assemble (took me, alone, about 15 minutes per chair), and solidly constructed. The seat is very firm, as other reviewers noted, but that does not bother me, since I don't plan to lounge in them. They are also, as other reviewers noted, quite short/close to the ground. They, at first, looked a bit strange in the living room, as the seat is a few inches shorter than the couch seating, but I added colorfully patterned accent pillows to both, a throw over the back of one, and placed a shorter end table between them so the height difference is not so apparent. Honestly, I simply did not want to pay for the return shipping and possibly pay more for a less attractive replacement set. These are fine for the purpose for which they are intended. If the height really bothers me in the future, I suppose I can replace the legs with slightly taller ones but I don't think it will be necessary. Overall, a good buy.", 
    "I was in the process of remodeling my dining room/living room combo and wanted to go a little fancier than my previous furniture. These chairs are just perfect for my seating area. They are small chairs, so please look at the dimensions before buying. I needed small ones so they work great for me. The color is kind of a blend between grey and brown, which I gathered from the description and photos. The rolled back is so stylish and cute. The only defect I found in my chairs was that one was pressed up against something in the box which made an indention in the fabric. Over time it has almost gone back to normal. Certainly not a big enough issue to return it. For the price, speed of delivery and style, you can't beat it.", 
    "Very nice chair, just a little shorter than we were expecting. We threw a pillow and blanket off the side of it and it makes it look \"taller\" as it's across the room from a more formal (taller) chair. Comfortable and color matches online picture.", 
    "These chairs have blended well with different settings by just adding a touch of color with a pillow.", 
    "Excellent value. Description was right on, and matches our decor perfectly!", 
    "I ordered two of these and both boxes were missing the front legs! And the chairs looked cheap.", 
    "We bought this as an accent chair for our living room. Husband had no problem getting it together, and feels very sturdy!", 
    "Bought this for my guest bedroom. It is mainly used to hold my guest's luggage. I have sat on it a few times. It sinks in quite a bit. I don't know how it would last with heavy use, but since it is mainly for decorative purposes, I love the look of it.", 
    "Easy assembly and sturdy result. This is a firm, comfortable chair that goes well from a living room to a bedroom. Being short, we like the lower seat of a slipper chair, but have noticed some older guests have trouble with the low elevation. Not sure I'd call this brown, but whatever the color, it blends with grey walls (grey is the 'new' neutral wall color in our area), beige and tan. Happy with this purchase.", 
    "Not yet sure about longevity, but this is a decorative, firm chair. Color is as shown in the picture. Easy to assemble. Liked it so much we bought a second one.", 
    "Looks just like in the picture, and it was easy to put together. The fabric is very nice and has a linen look. It's in my guest room as an accent piece--it's exactly what I wanted!", 
    "Nice chair and looks nice in my living room. However, it's not very comfortable and I feel lumps in the cushion when I sit. It's a good accent chair and I would recommend it only for that purpose.", 
    "Great neutral chair in today's color.....somewhat lower to ground but fits nicely in a small guest bedroom.", 
    "I purchased two of these for our home office. They are elegant, assembled easily, and a quality product. The color is closer to grey than brown, but fits my decor beautifully with a nice touch.They are comfortable to sit in when conversing, and overall, a terrific purchase!", 
    "item was shipped on time and arrived with very clear and easy to follow instructions on how to assemble. there is not much to it... took 5-10 minutes. Chair looks great and fits perfectly in the space i reserved for it.", 
    "easy to assemble. came quick! love the fabric too.", 
    "After looking for chairs for quite some time, I saw these. They are for a \"reading nook\" in my bedroom and they are perfect! Bought two with an accent table between them. BEAUTIFUL. For the price you can't beat it.", 
    "Very stylish and fits well in small guest bedroom. Average comfort.Excellent price.", 
    "I just into moved into my new house and had a pretty specific style in my head for our living room. We have the \"restoration hardware\" look going on so I thought this chair would help tie the look together. I originally wanted two chairs but chose to purchase one just to see how it was. I loved it when it arrived and was put together! The color is the same as picture and it isn't your typical \"lounging chair\". It's good for what it's used for, accenting whatever room you put them in!", 
    "It is what it is.It is a little hard to sit on, but it looks great and that is what I bought it for. It is a great accent chair.", 
    "Color is just like picture grey/brown. Very nice for the price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Sadie-Slipper-Brown-Derby-Accent-Chair/8134112/product.html?recset=2c3cae50-c967-4bc8-ae33-f236aa883551&refccid=SOXV5PDN6RWL64SE3W5SVUJQRU&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8134112/Sadie-Slipper-Brown-Derby-Accent-Chair-c7f01e20-a39c-41e0-9265-aa477fc87ce5_600.jpg"
  ], 
  "description": "The casual elegance of this upholstered slipper chair is\nunderstated excellence. The classic slipper chair is both\ncomfortable and practical, with nonmarking foot glides for easy\nrelocation and pretty upholstery that adds a touch of color to the\nroom, making for great additional seating for any sitting area at\nhome or in the office. Solid rubber wood legsHardwood and plywood frameNon-mar foot glidesStylish rolled back, classic grey/brown linen look\n  upholsterySet includes: One (1) chairMaterials: Rubber wood/plywood/fabric/foamFinish: EspressoUpholstery color: Grey-brownUpholstery fill: FoamSeat dimensions: 17 inches high x 25 inches wideDimensions: 31 inches high x 25 inches wide x 33 inches\n  deep      StyleContemporary, TransitionalMaterialFabric, Foam, Linen, Rubberwood, WoodFinishBrown, Espresso, WoodPatternSolidChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBrown, GreyFurniture PatternSolid"
}