{
  "name": "Safavieh_Gramercy_Indigo_Floral_Motif_Armless_Club_Chair", 
  "price": "EUR 312.96", 
  "reviews": [
    "This is a very nice chair. It arrived in great shape even though the package box was destroyed and was held together with strapping tape. It fits in the limited amount of space that I have - no room for wide chairs in my small office. The legs had to be screwed on, so it was not fully assembled. The legs weren't hard to do and they included the tool. However it took 45 minutes for 16 locking bolts, nuts and screws to be inserted. The upholstery is very nice and the color is a rich deep purple just like the picture. The seat is very cushy. The back is very straight, so I use a portable back pad in the chair to give it a little more lumbar support.", 
    "Love the color of chair. It is an amethyst color as stated in description (I motice they have it as 'indigo' ....it WAS listed as amethyst when I purchased). Nice chair, but not top fabric wieght quality.", 
    "the description said the chair is assembled - not true the description said super soft thick cushion - not true love the fabric and the color the cair seat is hard", 
    "The box arrived in wrecked condition but luckily the pieces inside escaped damage. The legs took a bit of finagling to get them on just right but once put together this little chair is very sturdy, heavier than expected, with beautiful upholstery. It's perfect in our bedroom as an accent and I would not hesitate to buy this product again as overall its quality is higher than we thought it would be.", 
    "These accent chairs were good. I love the look and it works in my living room perfectly. The three of the legs were a little damaged but overall I\"m very happy with this product.", 
    "The chair came exactly as expected per description and pictures.I have it in my purple themed bedroom, for my vanity table area.It's really gorgeous and soft, the pattern on the chair really makes it look glamorous.Highly recommend it. I have not sat in it for long periods of time but it is very comfortable.", 
    "Used it in a model for a pop of purple...perfect!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-Gramercy-Indigo-Floral-Motif-Armless-Club-Chair/6990937/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6990937/Safavieh-Gramercy-Indigo-Floral-Motif-Armless-Club-Chair-36b3f54a-1c9b-4dd8-a427-c8d8cc10342b_600.jpg"
  ], 
  "description": "Featuring a lovely indigo-and-purple floral pattern and wood legs with a black finish, this club chair by Safavieh adds a lively look to any room in your home. Relax after a long day on this chair, which features thick cushions and an angled back for maximum comfort. The armless design of this chair gives you freedom to move around as you please.\nColor: IndigoMaterials: Wood and rayon blend fabricFinish: BlackSeat dimensions: 25.6 inches wide x 21.7 inches deepSeat height: 16.9 inchesDimensions: 37 inches high x 25.8 inches wide x 29.1 inches deepStyleTraditionalMaterialWoodChair TypeClub ChairsAssemblyAssembledChair Back HeightHigh BackColorPurpleFurniture Frame MaterialWoodFurniture PatternFloral"
}