{
  "name": "Safavieh_Vintage_Light_Blue_Viscose_Rug_(6'7_x_9'2)", 
  "price": "EUR 245.82", 
  "reviews": [
    "The rug is soft, thin, light blue, better in picture than online.I read a review that said it had hints of purple, but trust me it's not a big deal it's what makes the rug look aged.Also, the rug looks amazing in different lighting throughout the day!If I could upload a pic, I would.", 
    "This is the third carpet of this style I have purchased. The quality is great and very soft to walk on. Has a somewhat worn look. I would buy another! Just Love this style!!", 
    "This is called light blue but it is more green and pink", 
    "looks great in our living room. Wears well...even with pet hair and occasional pet accidents.", 
    "This is one gorgeous rug. The only problem is that it sheds a lot and it's also a bit difficult to vacuum because it's thin and delicate, so we clean it with the hand held vacuum attachment.", 
    "I was very impressed when I received this rug. Very rich looking and fits my living room perfectly."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-Vintage-Light-Blue-Viscose-Rug-67-x-92/8076939/product.html?recset=436fc4e7-127f-4e9b-bf3f-df0111274873&refccid=JXPSUCHGY3RYC5SJHTURGYSAS4&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8076939/Safavieh-Vintage-Light-Blue-Viscose-Rug-67-x-92-e303d1ba-e75d-41c7-95fd-5292821f7f2e_600.jpg"
  ], 
  "description": "Brighten up your living room or dining room with this light blue rug from Safavieh. The tone is vibrant enough to add a pop of color while still muted to prevent overwhelming your existing decor. Patterned in a vintage oriental style, this rug feels right at home with traditional decor. Its antiqued look complements furniture in rich, dark colors.Viscose material is durable and softLatex-freePile height is 0.25 for easy vacuumingTransitional style fits well in living or dining roomsLight blue Oriental pattern gives a classic lookStyleTraditional, Transitional, VintageMaterialViscosePatternOrientalFeatureLatex FreeWeave TypeMachine-MadeShapeRectangleColorBlueRug TypeIndoor"
}