{
  "name": "Safavieh_Handmade_Heritag_Blue_Beige_Wool_Area_Rug", 
  "price": "EUR 90.84", 
  "reviews": [
    "The rug was nice. It was soft under foot. I returned it because the color was more of a Williamsburg Blue, and the overall look of the rug was darker than the photo online. I'm thankful for the easy process of returning the rug to Overstock. I ordered another, lighter rug on Overstock after returning this one.", 
    "The rug itself was beautiful and soft. However, there was a terrible odor to the rug that smelled like mold. Because of the foul odor of the rug, I returned it. Overstock was great and gave me no problems with the return.", 
    "I love this rug. It is truly beautiful and the colors are exactly as shown on the web page. I couldn't be happier!", 
    "GREAT RUG FOR THE MONEY, BUT THE BLUE WAS A LOT DARKER THAN I EXPECTED.", 
    "3x4 sq feet rug that I got was much more dull than 10x8 heritage rug . Since it is a small rug, I will keep it .", 
    "It's a beauty -- the colors of rich light brown, tan and light blue are really delightful. We placed this rug in our master bedroom and it sets off the other colors in the room perfectly. Very satisfied!", 
    "The colors do not look anything like the picture. The blue is much darker than the picture suggests which was a disappointment. Still we kept the rug because overall it was a nice looking rug and for us it was going under the bed so it wasn't as much of an issue. (Also, b/c we got a large rug it would have been an enormous pain to return)", 
    "I feel the rug was a great value for the price. Only thing is it was darker than shown in photo.", 
    "This rug is gorgeous. It's a bit darker that the shown but I like this even better.The quality is outstanding and I am very happy with it.", 
    "The rug itself is a nice quality, but the colors on the website are not dependable. This rug is light blue and dark burnt orange with a small ring of light brown.", 
    "Great rug - lovely colors - plush"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-Handmade-Heritag-Blue-Beige-Wool-Area-Rug/7502376/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7502376/Handmade-Heritag-Blue-Brown-Wool-Rug-1d07bd38-eef8-4428-a9b8-c38be861433a_600.jpg"
  ], 
  "description": "A classic floral pattern spreads across this handmade wool rug from Safavieh, creating a timeless look. The intricate pattern features soft, neutral colors so the handmade wool rug enhances your decor without becoming the focal point. Choose from a variety of sizes and shapes to suit any area of your home.Durable cotton canvas backingPrimary materials: WoolPile height: 0.5 inchesStyle: TraditionalPrimary color: BluePattern: OrientalStyleClassic, TraditionalMaterialCotton, WoolPatternBorder, OrientalWeave TypeHandmadeShapeRectangle, Round, Runner, SquareColorBlueRug TypeIndoor"
}