{
  "name": "Sean_Black_Power_Recliner_Chair", 
  "price": "EUR 324.33", 
  "reviews": [
    "First, I knew that for $*** I wasn't going to be getting a genuine leather, top-notch chair. It's okay for what I'm using it for; in my bedroom for reading and using my Fire tablet. Based on how the chair looks and feels I don't expect it to last very long.BE AWARE THAT THE BACK RECLINES AND THE FOOT-REST RAISES AT THE SAME TIME; you can't just raise the foot-rest. Bummer! My own fault, I should have done better research.The chair came with four \"chunk-o-plastic\" feet but installing them made the chair too high for me (5'7\") and my feet would not touch the floor. I removed them and now it's just right.", 
    "I'll start with the positive...it was delivered before the original due date. The chair is the right size for my frame (5'4 and 125 lbs). The color is nice and true to color. Now, the not so good news... the back of the chair when taken out of the box was smashed on the bottom - the box was not damaged, therefore I can only conclude the chair was damaged when it left the company. The padding on the chair is cheap foam - but I did know I was buying a cheap chair! Honestly, I only purchased the chair because I'm having surgery and need the recliner chair temporarily. So, if you are OK with a below average to average cheap chair, I recommend this product. If you are looking for comfort and a long lasting piece of furniture, this is not the product for you!", 
    "Received the recliner and set it up. It comes in one box. You have to put on the casters, slide in the back, and put on both arms. The plug in us obvious and all in all is an easy setup. I only give 2 stars because it makes my back ache. There is little or no lunar support. Something is wrong with the configuration for comfort. It is very narrow. The arms are solid and have little padding. They are so sharp that they put my Arma to sleep. If I have to buy another chair, I'd spend twice the money and get one that has padded arms. This one is cheap and feels cheap. I got what I paid for. The mechanism works fine.", 
    "You get what you pay for!", 
    "I like the power recliner. For the money it worked well. However, last month it stopped and now I have to see if Overstock will stand behind their product.. . . to be continued.", 
    "Not strong enought .Poor quality", 
    "Ordered this item in Black Leather, it arrived in Brown Linen Fabric, with a broken bottom piece of cross wood, but two days earlier. They decided to keep it because it was for an elderly gentleman that had just had a hip replacement and he needed the chair to sit in.", 
    "No instructions in box. One side of back went in the groove, but the other side did not, and it was impossible to release the back to reset. Brute force worked, but it wasn't pretty. The chair works, but the incremental positions are not optimum--the leg rest does not extend fully until the back is in the farthest recline position. Sometimes you want to sit UP but have your feet elevated. I did not buy the black fake leather. The fake ultrasuede is fine and would work with lots of décor. Not oversized, which is what I wanted. Back is too low for my 6' height."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Sean-Black-Power-Recliner-Chair/9596321/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9596321/Sean-Black-Power-Chair-e4b3bebf-e922-470d-a906-f244d8214dd2_600.jpg"
  ], 
  "description": "Constructed with a heavy-duty steel mechanism and including push-button power control, this chair provides the perfect resting perch after a long day or for a relaxing afternoon nap. Featuring a side pouch for storage, this recliner is ideal for storing remote controls and other devices requiring safe and easily-accessible storage. \r\n\r\nSet includes: One (1) reclinerFrame material: Wood, metalFinish: Black, brownUpholstery material: Wood, metalUpholstery color: Black, brownSeat Dimensions: 18.5 inches high x 19.5 inches wide x 21 inches deepDimensions: 29 inches long x 29 inches deep x 39 inches highStyleContemporaryMaterialWoodChair TypeReclinersAssemblyAssembly RequiredColorBlack, BrownProduct FeaturesPower Lift, Power Recline"
}