{
  "name": "Seville_Linen_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 123.76", 
  "reviews": [
    "Just got these chairs today! Was a little afraid because there were no reviews! I always take into account reviews, but felt at this price I couldn't go wrong. Chairs came packed well. 2 per box. All came with no injuries or discoloration. I ordered 2 sets -so 4 chairs to add to my dining room. Tired of borrowing from others! Color is exactly like online! Linen is soft and neutral. Dimension are exact too. My 5 year old son helped with the assembly-not a joke. all notches and holes matched up and had no problems. Its just bolts and washers. Maybe 10-15 minutes per chair. Just to get hang of each size-then a breeze! Each chair comes with appropriate allen wrench. Chairs are sturdy, but they aren't made of hard wood. The wood could be better, ,but for the price and the description said exactly what they were Poplar wood- not a perfect wood, but it works! They did great with my 6 1 190lb husband. Also if I ever wanted to they are perfect for recovering-bottom seat cover is velcroed on and easy to remove. Go and get them they are great chairs and comfy!", 
    "These chairs came quickly and are the best deal around. I looked around a long time before finding these and the price was right! they look a lot more expensive than they really are. LOVE them.", 
    "These chairs are great. I've never put chairs together before so I was a little nervous that they wouldn't be sturdy or they would be wobbly. That is not the case. The color of the chair is better in person. In my computer it looks like there is a sheet or something on the seat of the chair. In real life the chair is a very nice tan linen. They are very sturdy and the assembly was easy. My biggest concern with putting the chairs together was finding that the holes didn't line up. That wasn't the case with any of the for chairs, thank goodness. I would definitely recommend these chairs to anyone. I wish they had an arm chair version so I could get them for the head of my table.", 
    "I love these chairs and have received many compliments. They are sturdy, were easy to assemble and look great at the head of my dining room table.", 
    "Prompt delivery, great quality chairs, nice fabric, strong. Would purchase again.", 
    "The chairs are perfect to head my dining room table. The color is perfect. They aded.class to the room.", 
    "I'm happy with this chair. Very inexpensive and the quality is good. The shipping was fast which i expected from overstock.", 
    "I ordered these chairs for the breakfast area in my kitchen and they look great. They were shipped on time and they looked great once put together.", 
    "We were looking for a set of affordable chairs for our new dining table for the holiday season. We purchased 8. Assembly was quite easy. The chairs are ok. Nothing special. Personally, I think they look a little on the cheap side. The chair legs are very very thin. The chairs have minimal (if any) padding on the actual seat cushion, so they aren't very comfortable to sit on. We have purchased similarly priced chairs elsewhere with better quality than these (from tj maxx and target). I think these chairs may actually be a tad overpriced for what you get. Or maybe it's just that I don't feel like I got a \"good deal\" on them. If the chair was slightly more substantial (thicker wooden legs and a little more padding), I think I would be happy. But instead I feel like a got some rickety, poorly-made chairs. I guess my expectations were too high. All in all, I wouldn't buy them again. If I had seen them in person, I definitely would have kept looking. Hopefully they will hold up for a few years and then we will buy something different.", 
    "These are very nice chairs and the price was right. They look great and the material feels durable.", 
    "They look really nice in my dinning room. Can also use them in the other rooms in the house for extra seating.", 
    "I was worried after reading some of the reviews but once i got the chairs i was very happy. I bought them because of the low price and hoped i wouldn't have to return them. I would buy these again.", 
    "I ordered 4 boxes and was very happy with the look and quality. I am very happy with these chairs!", 
    "I did a lot of research before deciding on these chairs. They are exactly what I was looking for! I would recommend this purchase to anyone who is looking for a neutral \"linen\" chair and dark wood legs. Don't let the polyester fabric describtion turn you away. Easy to put together, just make sure you turn the legs nice and tight to prevent wobbling. They look great with our harvest table!", 
    "I had been wanting fabric dining rooms chairs from the deisgner strores, but I couldn't justify the cost :/ These chairs were better than I expected! The color is beautiful and looks like a linen with subtle white and tan threads. The fabric feels durable. My husband has back problems and he expecially loves how comfortable they are. Because you have to assemble them, take care to make sure the chairs are level! I like the narrow profile. I'm even going to order two more!", 
    "These are the most beautiful chair, they look great with my dark wood dining table.", 
    "We completely renovated our dining room and had already spent a lot on a table, rug, curtains, and end chairs. I was able to save a little money by purchasing these chairs on overstock for the middle seats and everyone just assumes I got them from the same store my more expensive purchases came from. They look really elegant, are sturdy, and I am very pleased with them! They don't get used everyday since they are in a formal dining room, but I would probably not recommend them for high use areas such as a kitchen table, because I wouldn't think the seats would clean very well for frequent spills. We haven't had any spills yet to know.", 
    "the backrest of the chairs is not solid... so when you sit back it pops in and when you sit up it pops out... its annoying. But i needed a lot of chairs for not a lot of money i guess you get what you paid for. They are pretty to look at. Havent had a lot of sitters, so not sure how they will hold up. I probably wouldnt buy them again... just save until i could splurge on better ones.", 
    "I bought these chairs because I'm 25 and poor and my husband and I needed a set of dining chairs in our new condo. Let's just say, they're totally fine and fulfill the purpose of dining room chairs, but they feel kind of cheap and lightweight, and the worst thing is is that many of the chairs are wobbly, as the legs are of different lengths. This is what drives me crazy and I'll have to figure out something to make them level. We did have a dinner party last weekend and our guests commented on how it was nice to sit on a padded chair, but it's not really a nice padding. It's like a cheap foam padding. I'm not too worried about it because they look fairly nice from afar and they weren't a huge investment and I can easily reupholster them and turn them into little side chairs in our future childrens' bedrooms one day, or as extra furniture in the basement/hangout area. Hopefully I'll be able to splurge on the dining room chairs of my dreams in the future!", 
    "Easy to build, great for the price. The wood is lighter than in the picture.", 
    "Love them! Can't beat the price.", 
    "I bought 6 chairs and they were very easy to put together and have held up good.", 
    "These chairs are super comfy! They also look great. Had a problem with missing a set and OS sent them immediately. We had just bought a new home and furnished it with quite a few pieces of furniture and decorative items from OS.. Very happy with these chairs!", 
    "These were exactly what I wanted and the description matches perfectly. Linen material that gives a very casual look. The legs are a beautiful brown. They were a little tough to put together so get some helpers if you purchased 6 like I did!", 
    "I have an older dining room set and some of the chairs have broken. These actually go with my older ones and look very classy. Easy to assemble. Great buy!", 
    "Love them.... very comfortable...", 
    "Theses chairs are a good but for the price. I was a little hesitant based on other reviews. Easy to assemble and it came with all the parts. As noted in other reviews some of the legs are uneven. We just put small felt pads underneath a few legs and it was good. The cushion is a little firm but still comfortable.", 
    "very comfy and modern looking.", 
    "These chairs are a great deal. Easy to assemble and look very nice.", 
    "I love these chairs. They look far more expensive than they are. They gave my dining room an elegant update for a great price. Very easy to assemble. I would definitely recommend these chairs.", 
    "Just moved to a smaller home and wanted a less traditional chair for my open floor plan/dining room. Bought two of these chairs to see if I liked them right before the holidays. Loved them so much that I ordered two more. Changed and modernized the feel of the whole room and gave my very expensive Thomasville table a facelift....and the color of the wood chair legs matched perfectly. Received lots of compliments on them, and they are very sturdy and comfortable. Easy to put together and you can't beat the price. Definitely a great buy and value!", 
    "Love my chairs! Easy assembly. Did not have issues matching up the holes/screws as some reviews stated. Sturdy quality and good amount of cushion. Couldn't have asked for much more for this price! Ordered 4 originally thinking I would find 2 coordinating chairs for the heads of the table... Decided to just order 2 more to complete my table!", 
    "We needed to dining room chairs to complete our ensemble...these would be the head chairs. I was a bit hesitant at first (simply b/c of the price). I could not be more pleased, however. They arrived in fantastic condition. The material is nice and the legs, sturdy. I would highly recommend these. Love the color as well...it would be hard for these not to accent any dining room!", 
    "We were looking for a simple chair for our dining room. These chairs were the perfect fit! You have to put the chairs together (seat to back and attach legs) so there was some fumbling as we loosened one leg and tightened another so the chair did not wobble. Other than that, we are very happy with the purchase.", 
    "Was very pleased with the quality and sturdiness of these chairs. Not too difficult to assemble, remember start all fasteners before tightening any. Be certain the floor is level when you are trying to square up the chairs. If your surface is uneven and you tighten the fasteners, the chair will wobble. Ordered 10 of these for our dining room and have many compliments. Was expecting to have to contact Overstock about either missing parts or damage because UPS demolished the cartons in shipping. Fortunately, no harm. By the way, the hardware is strapped under the lining, under the seat bottom.", 
    "I love the chairs and assembly was simple . I would recommend buying these chairs.", 
    "Seem to be pretty cheaply made. Lots of loose thread on side seam and bottom of chair. Very thin pad on the chair seat. Otherwise, they look very good with my table.", 
    "We bought 2 chairs for a guest room at our new Bed and Breakfast. My husband was a bit challenged by assembly because the support brackets were not lined up and he had to redrill new holes. He is handy so it was no problem, otherwise would have taken ~20 minutes per chair or less.", 
    "Excellent buy. Easy to assemble. Love the upholstery. Quick shipment.", 
    "They are good quality for the price. They look much nicer than the price would let on. We are very happy with them.", 
    "Nice color,comfortable. May not be durable for everyday, but in formal dining room work nicely.", 
    "I bought 6 of these, and they look great for the price paid. As long as they are screwed tightly (not TOO tightly), then they don't wobble and were pretty easy to assemble.", 
    "Great deal, looks nice but they aren't very sturdy if you are going to use them for every day use", 
    "The chairs are good especially for the price. When you lean back on the chair it makes a sound. Not sure why or what it is, but I think the quality is good for the price. The color is what we wanted as well.", 
    "Nice chairs. Good price.", 
    "I purchased 4 of these chairs about a year ago and even though they were a bit challenging to assemble at first, overall they are definitely a fantastic value for what I paid. I use these in my dining room and they are quite striking against my dark table. Only downside is that they are not the most comfortable to sit on for any length of time. Fortunately I don't use my dining room that often so this is not a problem for me. That's the only reason I gave them 4 stars instead of 5.", 
    "These were super easy to put together and the impact that they make is GREAT! They are really beautiful, especially with my handmade farmhouse table. I get a lot of compliments on them. The price cannot be beat. They were super easy to put together. I will tell you that I have had to go around to each of them and tighten them again after just a month of non-frequent use. I'm single but have people over about once a week so they're really only sat in once a week. Everyone seems comfortable in them, but they legs do get a little loose and I've had to tighten them. Not a huge deal, just pay attention to that.Again, for the price and the look/feel of them, you can't beat them. I'm happy with my choice!", 
    "I purchased these chairs for my office and absolutely love them! I am hoping to buy more for my dining room table as I am moving in a week and need new chairs.", 
    "love these chairs very comfortable", 
    "Looks more expensive than they are!", 
    "The chairs look great. They are not very \"heavy duty\". I have them in my formal dining room that we do not use daily. My husband put them together quickly. There are some wabbly legs. But for the price and the amount of time that we would actually use them - I am ok with that.", 
    "Can say enough about this chairs, high quality, price is unbeattable.", 
    "Just what I wanted - legs are a little lighter that color shown but they are nice and firm.", 
    "Looked high and low for suitable dining chairs and still wasn't sure when I ordered these. But they are lovely! Color is a warm beige, maybe just a bit darker than the picture as I think they look very light in the photo. Seem to be well made. Would have given 5 stars but had to buy additional screws as the shortest screws did not work. Therefore had to use the longer ones to screw legs in and ran out of those for the other slots in attaching the legs. The screw holes on one chair were not aligned so hubby had to redrill it. There was also some small damage to 2 of the legs. Might not be worth sending back so waiting to hear back from overstock...", 
    "easy to assemble, good quality", 
    "I love the look of these chairs. They were very easy to assemble (legs) and are sturdy enough. I wouldn't recommend them for children or lots and lots of use.", 
    "WAS ABLE TO PUT THE CHAIRS TOGETHER EASILY. WHEN THE PACKAGE ARRIVED, THERE WERE LOOSE WASHERS AND SOME OF THE CHAIR LEGS WERE SCRATCHED. I ENDED UP HAVING TO GO TO HOME DEPOT TO GET ABOUT 7 MORE WASHERS TO COMPLETE THE SECOND CHAIR. OVERALL, THEY WERE A DECENT PURCHASE, COMFORTABLE CHAIRS THAT ARE PRETTY SOLID. THE LEGS ARE LITTLE LIGHTER TONE THAN I EXPECTED BASED ON THE PICTURES BUT STILL A DECENT PURCHASE.", 
    "Received 6 of these chairs and within 1 month the seat cracked and wood was split. Don't waste your money....spend a little more to get a quality product.", 
    "Easy to put together and gorgeous alone or with slipcovers. Comfy too!", 
    "These are beautiful. They are more beige than I expected but neutral.", 
    "Good quality for the price. Nice color.", 
    "Great purchase. We have these over a year now and they still look like new", 
    "Nice chairs for the price. Totally doable. One chair needs some extra work done because one leg is too short. Just need to add extra padding so that it doesn't wobble.", 
    "These chairs definitely can blend with a lot of different wall colors and were relatively easy to assemble. For one of them, we did have to drill into one of the holes a bit more in order to make the screws fit, but it ultimately worked just fine. Have not had anyone sit on them yet for a dinner gathering, but seem sturdy.", 
    "I bought 2 sets, four chairs for our small glass dining table. The fabric is okay, not quite like the picture as far as color. The seams and fabric construction is very nice but the chairs don't seem to be as stable as I'd prefer.Right now they're more for staging as we are getting our house ready for sale. All in all, they are good for the price and will work for our situation.", 
    "These chairs are a good value. They are smaller in scale and worked well for my small dining table. The fabric was nice and they are comfortable as well. They were easy to put together. If you have trouble getting the legs to line up, stand the chair up and scree them in that way. It helped a lot! The only complaint I have is that the legs were scratched on a few chairs. It would be too much of a hassle to repackage and send them back, so I plan to touch them up with a furniture pen.", 
    "Excellent quality and value for the money. Easy to assemble.", 
    "Perhaps a little too lightweight", 
    "legs were not even and they are not sturdy", 
    "Loved the look of these chairs but just could not get them put together! And honestly even if I could have gotten them put together I didn't feel they would be very sturdy. Sent them back with no problems at all!", 
    "The chairs looked as they appeared on the website. They are of good quality- nice material as well as firm. They are narrow- but that is what I expected. It works well for my small dining room.", 
    "Ordered four of these chairs several months ago, and liked them so much that decided to order 2 more and get a larger table..total 8.In the second order one was stained and I dreaded the ordeal of returning. To my surprise the return was so easy and they even sent the Fed Ex to pick up the damaged one ...At no charge !!! I love these chairs...for the price, they are incredible ...beautiful linen look fabric and matched my other furniture so well...Wish I could send you a picture of how pretty they look in my dining room !!! Price was incredible !!!", 
    "It looks fine, but it is too hard and so not comfortable.No time to return, so I am using it now, but not happy with the products...", 
    "The chairs were easy enought to put together, however they do not stay together. The legs come loose after using the chair about 2-3 times, requiring constant tightening.", 
    "These chairs are NOT worth the money! They are cheaply made and didn't last a month in my house. I slid in to a chair at dinner time (nothing forceful or anything) and the leg broke. It cracked and split like it was made of thin wood. There is very little padding in the seat and they feel flimsy. I was very disappointed in their quality!", 
    "I have had these chairs approximately six months. My husband and I purchased eight of them to go around our dining room table. They look much more expensive than they are. However, the foam cushions have several dimples/dents. One of the legs has split and come off despite only light use (it is only my husband and I and we use them for dinner only). Overall, these chairs look nice, but are not of good quality. I wish I had just saved my money for the last six months and bought higher quality chairs.", 
    "We ordered 6 of these chairs to start. We managed to salvage 4 of them, not to my complete satisfaction, but you get what you pay for. The chairs look really nice, but when you sit in them, they don't feel the best of quality. I'll deal with that since you dont really use dining chairs all day every day. The issue we faced with two of the chairs was that that holes that were drilled for the back of the chair were too low, so when we screwed the legs in, the chairs rocked about 3/4 of an inch so all legs weren't even with the ground. This seemed to happen with two of the chairs in one box, so we decided to call customer care and we would ship two back and get two more. The other two have arrived and we put them together last night and these two are even worse. At this point I would love to return all 8 chairs that I now have, but its a headache to keep unscrewing all these bolts since it has to be with an allen wrench. Save yourself the headache and buy better quality.", 
    "Great up date to my dining room, comfortable", 
    "This chair is smaller than most parsons chairs I've seen. I did not like the legs, which were not wood, but some kind of plastic. The fabric was cheap and uninspiring and, like most furniture made in China, was hard to assemble (bolts do not line up well). I sent these back.", 
    "Chairs look nice enough and are easy to put together. However, the legs will not stay tight and must be constantly tightened.", 
    "made very poorly legs are cracked and screws not in probably very dissatisfied", 
    "A little hard to put together, but look great once all the pieces are together", 
    "The chairs are not very comfortable. The seats are hard. They look ok. Assembly was straightforward. One of the chairs had a screw hole that was not properly drilled. It seems secure enough without that screw installed.", 
    "These chairs are very pretty but when you sit in them the seat pulls away from the back. They are defective. The good news is that customer service is EXCELLENT. Boxes are being sent to me and ups labels to aid in an easy return.Do NOT buy these chairs.", 
    "These chairs do require assembly, but the instructions are included & clear. The finished product is nice looking, sturdy and comfortable. I chose these chairs for (1) style and (2) neutrality and (3) price. I felt these chairs were flexible enough in appearance and could be incorporated w/different decorating styles, such as Contemporary, Traditional & Transitional. I know I will be pleased w/my selection.", 
    "The quality, look and feel of these chairs are much better than they look online. I purchased 6 and love them. Only one issue, a couple of chairs had a leg an 1/8\" shorter than the other three. Not a big deal really.", 
    "These chairs worked great as extra chairs in the dining room. We are a tall family and the seat height was perfect for us. If you are short, these chairs might not work for you since the seat height is 20 inches--2 inches higher than many chairs.", 
    "love the chairs, complimented my room perfectly..they need to be tightened up better with ratchet and allen key vs the allen key provided..you also need to sit on them to level them before tightening fully. once you do there good to go. they are not high end by any means but gets the job done nicely for the $$.", 
    "purchased 4 chairs....easy to assemble. Unfortunately 2 front legs have cracked wood. Called to order replacements. Received replacements about 10 days later. Replacements are different that the original legs.....holes are drilled much higher up so I couldn't attach them. Need to call again but not very optimist this will be any better. A real waste of money!", 
    "very sturdy chairs and compliemnts our decor. I bought 6 total.", 
    "simple, elegant styled chair. easy to clean. easy to assemble. looks great with my contempory wood tablet to give it a new look", 
    "Great chairs. Color of legs are a little lighter than pictured. Thoroughly enjoying them. Great value", 
    "I bought 2 sets to have a total of 4 chairs. I moved in with my boyfriend, and his kitchen table doubles as a poker table. The table is actually a beautiful and expensive piece of furniture, but with the chairs it came with, it looked like it belonged in a \"mancave\". So I got rid of his clunky chairs and bought these, and they go perfectly! It now looks like a beautiful dining set, and my dining room looks amazing! The're great quality, and you can't beat the price!", 
    "The chairs look fine for a room that's barely used. Not sure they would hold up for lots of use.", 
    "I received 2 sets of these chairs. The color looks just like online. Only problem was one box was completely missing the necessary hardware...my husband had to get what he needed from the hardware store - I didn't feel like returning & waiting. Kind of a bummer but looking forward to enjoying the chairs once they're finished...", 
    "These chairs are quite nice! Very sturdy and relatively easy to put together. I ordered 4. The upholstery fabric is quite brown, which I expected, but I am going to have them reupholstered to match my décor. I thought the price was fantastic!", 
    "Fine chairs but you get what you pay for quality wise. We ordered 4 and one was broken... Other than that they are good. A lot more narrow than I imagined but for the price we paid I really can't complain about them", 
    "I ordered the chairs for additional seating for the holidays and I'm very glad I did. They are a nice addition to my dining room table. My other four chairs are leather so I put the linen chairs at both ends of the table it really dresses it up. They are much more comfortable then you would think dining room chairs would be.", 
    "I am so happy with quality chairs. They are wonderful. Color is so nice , picture does not show all beauty of this classic chairs. I feel so lucky today ! Lucky and so happy !", 
    "The chairs are beautiful in our breakfast room. They are, however, darker in person than they appeared in my phone. I was expecting tan, but they have more brown in them in person. Still beautiful, so I'll keep them.", 
    "Very happy with the chairs. Very easy to assemble. I purchased 6 and all were assembled by me in less than an hour", 
    "These were ok, but the shininess of the fabric made them look cheap.", 
    "These chairs were easily assembled and sturdy. The fabric is well made and exactly the same color as described. They were packaged well and were not damaged in any way. Arrived in a timely manner. I am very satisfied with this choice and with Overstock.", 
    "These chairs were easy to assemble and they look more expensive than they are. They are not super soft to sit on, but deinitely more comfortable than a traditional wooden dining chair.", 
    "These chairs look absolutely beautiful in our dining room! They are very classy looking and simple. Not exactly the best type of chairs for kids but are perfect for adult get togethers. These are in our formal dining room. Would highly recommend these chairs!", 
    "These linen chairs are beautiful chairs. Very easy to put together. Excellent instructions and very well packaged. They took my about 30 minutes to put both together and it is the first time I have assembled any type of furniture. Great, great purchase. They look way more expensive then they were. I'm totally pleased with this purchase and would highly recommend.", 
    "The legs were a lighter brown than what appears in the picture on the website.", 
    "Color is great. The padding in the chairs is firmer than I thought, which is a good thing.", 
    "I was hesitant to purchase chairs without seeing them or sitting on them but I am overall satified with them. Putting them together was another story. The reviews I read stated they were easy to assemble and that would be true if the holes lined up with the bolts. I ordered six of these chairs and only two of them had the holes lined up properly for the bolts. My husband had to drill proper holes to allow the bolts to sit in the right spot. He was not very happy with this at all. Fortunately, it wasn't a problem for him so other than that the chairs look good in my dining area.", 
    "I really like these chairs. They are a good value, however the assembly is tricky. I bought several so it took a couple chairs for me to get a routine going. They don't always end up level, even with the instructions provided. I had to buy pads to out under a few legs. That being said, I really like them and they are a perfect match for my table and decor in my home.", 
    "I like the chairs. They look great with my table and add an updated look to a 35 year old table. They seem sturdy and went together easily.", 
    "I love these chairs! The color of the fabric is very accurate and they have a very nice look to them. My only disappointment was that the legs of the chairs are much lighter than pictures - almost a cherry wood. It does state that it is not espresso, but I thought it would be true to the picture - which was not the case. So, the legs don't quite match my table, but I've let it go because I love the chair itself so much. Overall they are great for the price!", 
    "I used these chairs with a farmhouse table to make it a little more sophisticated. They worked perfectly and were fairly easy to assemble also. My assistant had a little trouble getting one of the legs to fit in. Nice neutral linen - not sure how well they would hold up with every day use, These are in a model home. Probably great for occasional use.", 
    "I am very pleased with the purchase. The six chairs look fab around my dark espresso round dinette table.", 
    "I am very pleased with these chairs. I purchased six of them. I have a dining table from the 40's that has held up well over the years, unfortunately the original chairs are more for show at this point. These linen dining chairs compliment the table nicely. They are sturdy and surprisingly lightweight! I rated the chairs good because I've only been using them for two weeks. If they hold up well the rating would be excellent!", 
    "I bought these to go with my new dark wood table and they look great! They were easy to assemble which was nice also. My friends liked them so much they are going to buy some too.", 
    "I was looking for linen/burlap chairs for my dining room table but everything I saw was so expensive. These are a great value. I puchased 2 sets. Easy assembly and they look just like ones you would get from a high end store.", 
    "First time I have ever ordered chairs online.....it will definitely be my last. Upon opening the box, I was actually quite pleased because these chairs were the exact color I wanted. Unfortunately after fully removing them from the box and attempting to put them together, I realized these were absolute junk. They are poorly constructed and trying to get the screws to line up was a joke. I bought a total of 4 chairs and after putting 2 of them together (which took FOREVER) and going to the 3rd, I saw a very large red marker stain on the side of it. On linen....that wasn't ever going to come out. So, I would recommend saving your money and maybe spending a little extra on something nicer. If you do order, just be prepared for a really cheap chair. Mine will be in the mail tomorrow back to Overstock.", 
    "These chairs are exactly as pictured. They were easy to put together. They are very light-weight and don't seem to be of amazing quality, but we bought them for company and they suit our purpose.", 
    "I searched for a long time for chairs that would be beautiful and also family friendly. I was so excited when I found these and ordered them in time for my husband's family to visit from out of town. Imagine my horror when the first time we sat on them the leg of my father-in-law's chair broke underneath him! There were also cracking sounds on several other chairs. None of the guests were overweight, the wood of the legs of the chairs was horrible!! I ended up having to return all 6 chairs I purchased and am back hunting for chairs. In short, the chairs look great as long as you don't plan to sit on them. So disappointing!", 
    "Really like these chairs, they look really nice. They look expensive. The only thing I dont like is that they are so so light in weight. But quality so for looks good. I've only had them for maybe a week so we will see how they hold up. But for the price I'm really happy with these chairs!", 
    "Upgraded my dining room chairs with these new cloth padded ones. Looks great with my existing table and corner hutch. Color of wood legs and linen color right on. Very comfortable and sturdy. Easy assembly and feel that they were definitely worth the price. Love Overstock and getting ready to order more items."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Seville-Linen-Dining-Chairs-Set-of-2/5954255/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5954255/Seville-Linen-Dining-Chairs-Set-of-2-4eda863d-94bd-4e16-90f0-70eca16ba9b0_600.jpg"
  ], 
  "description": "Enjoy these warm, simple dining chairs from Seville when you're\nhosting an intimate dinner for friends and family. These elegant\narmless chairs use the contrast between the walnut-finished solid\nwood legs and the light beige linen upholstery to create a grounded\nand classic feel for your dining room.Dark walnut finish contrasts with beige sand upholstery for a\n  stylish lookSeats measure 20\" HDurable poplar wood frame and polyester-blend upholstery\n  provide easy maintenanceTwo-chair set creates a matched lookChairs measure 40\" H x 22\" W x 18\" DStyleContemporaryMaterialLinen, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBrown, TanFurniture Frame MaterialWoodFurniture PatternSolidGallery RoomHoney GoldSeat StyleCushion, Solid, Upholstered"
}