{
  "name": "Shermer_Tufted_Bonded_Leather_Classic_Side_Chairs_(Set_of_2)", 
  "price": "EUR 107.20", 
  "reviews": [
    "This item was advertised as leather, but the box said vinyl. The boxes were so light, I was suspicious and sure enough, the legs were flimsy and hollow and the chair was too small to look to scale with our table. I'll spend more next time. The return was handled quickly and I used the credit to purchase something I hope I will love!", 
    "The quality is OK. They are fine for now but not too sure if the legs will be durable for the long haul. I am only 115#'s but I would not recommend these smaller chairs for anyone over 150.", 
    "Excellent value, for an ideal design, beautiful color, & material. The price is incredibly fair for the quality of product.These are pretty light. So, depending on how much you weigh, at times, they could feel unstable. It's not a chair I'd feel comfortable ever standing on. With that said, they are still amazing chairs for my young family especially because the leather is easy to clean. When my toddlers are older, I will upgrade the chairs to heavier & more impressive quality.I would recommend using these chairs in an informal room. Very happy with this purchase. And again, for this excellent price, a good gamble...", 
    "Good quality for the price that was paid. So far, my two rambunctious grandsons have not been able to destroy these. They look nice in my dining room.", 
    "The quality of these chairs was ok,, but they were way to small in height", 
    "Reasonably priced and look nice, but are lightweight and not especially sturdy. I wouldn't recommend for body weight over about 180lbs.", 
    "Very expensive-looking and awesome chairs, the best price anywhere!", 
    "I got these chairs to create a small sitting area in my master bedroom, good size and quality for the price.", 
    "Ordered the Gillian 8 foot pedestal dining table and wanted different chairs than were suggested. I ordered 6 (3 boxes of 2 each). These arrived quickly and, once I found the hidden legs under the seat, they went together quickly. No wobbling, feels more luxurious than they really are, and for a formal dining room, I think these will get us through for a few years. Only issue was one of the boxes had no legs. Contacted Overstock and after explaining a few times to a couple different people, they say the warehouse is shipping the missing parts. Chairs do not work well with only 2 legs! I haven't decided if I'm going to order 2 more or go with a more formal and contrasting pair of \"head of table\" chairs. Most likely, whatever I decide, will be ordered from Overstock.", 
    "These chairs first arrived damaged from shipping but overstock corrected the issue. They appear just as pictured with a cream faux leather and dark wood legs. They are very light weight but so far seem fairly sturdy. We are both light people but I am not sure they would be appropriate for someone 200 lbs +. I am very satisfied with the quality of the chairs for such a low price.", 
    "Bought 4 of these- impressed with quality and looks. May not last for years but for the price they are just right for staging our home for sale. I love the look! And they were delivered before the promised delivery date! Thank you Overstock!!!", 
    "Very good look nice, was easy to assamble"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Shermer-Tufted-Bonded-Leather-Classic-Side-Chairs-Set-of-2/9477833/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9477833/Shermer-Tufted-Bonded-Leather-Classic-Side-Chairs-Set-of-2-c855b656-2ae2-49b9-8812-90e65da227fd_600.jpg"
  ], 
  "description": "Stay comfortable during family dinners with this two-piece dining chair set that is filled with plush polyurethane foam. This leather dining chair set features a robust rubberwood structure for enhanced durability and tufted detailing on the back for an elegant yet versatile look. The legs showcase a medium-brown walnut finish for timeless beauty, while the upholstery comes in your choice of colors for easy blending into your decor.\nSet includes: Two (2) Side Chairs Materials: Rubberwood Finish: Medium Brown Walnut  Upholstery materials: Bonded Leather Upholstery color option: Black Brown or cream white Upholstery fill: polyurethane foam Tufted back on chairs Cushion thickness: 3.75 inches  Seat Depth: 17 inches  Seat Height: 18 inches Overall Chair Dimensions: 35.88 inches height x 17.38 inches wide x 23.38 inches deep StyleContemporary, Mission, TransitionalMaterialBonded Leather, RubberwoodChair TypeDining Chairs, Parson Chairs, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBrown, Off-WhiteFurniture PatternSolid"
}