{
  "name": "Simple_Living_Camden_Dining_Chair_(Set_of_4)", 
  "price": "EUR 140.82", 
  "reviews": [
    "Excellent chairs, especially for the price (came out to under $$$. ea.) These seem quite sturdy and well made, nicely stained wood. Look nice enough I'm considering replacing the table since it now looks shabby next to them :) Only warning is the instructions for assembly are not complete. The pegs at the ends of the side pieces (to put in the seat) are of two different sizes. Obviously the large pegs need to go in the large holes, etc., but since there was no mention of this in instructions it took us quite a while to figure out. As said in a previous review, once the first chair is assembled the rest should be easy. Other than that, one of the four chairs we received wobbles very slightly but can easily be fixed with a penny on the bottom of one leg. Well worth it.", 
    "This is a good deal. I was searching for blue chairs for my blue and white kitchen. These chairs turned out to be perfect - nice clean lines, sturdy and a pretty, clear blue. My kitchen is blue and white and the chairs pop. Good value. I would buy these again.", 
    "Bought these a month ago. White is really \"whitewash\", so slightly disappointed by the color, but it makes up for it in the fact that it is indeed real wood, and the hardware was all there. Assembly was long, but durable, meaning that it did take some time and work, but I am very confident that it will hold up and the screws won't be loosening and falling out all the time like so many other furniture pieces I have gotten for cheap over the years. I sit down a little careful because I am 240 lbs and I think I could snap the back if I continually plunk down in a bullish manner, but other than that, I feel these are exceptional quality for the cost and the style is what I've been dreaming of in a chair- flat seat, straight back.", 
    "The actual chairs are great. Once I got them put together, I was very happy with them. They are solid, and have a great look about them. I was drawn to them because of their resemblance to the Emeco Navy chair. There's no wiggle, they are light, and comfortable, very good chairs for the money. The color is fun, not as loud as it looks on the website, which was good for us. Finish on the paint seems good so far\u0097we have two small children who have a way of destroying anything that looks nice in our home\u0097so we'll see how long it lasts. So far it has stood up to them just fine, just wipe it clean. BUT... It took two shipments of this chair to get me a complete set. Overstock took care of us, which was good, but it should be noted that one box arrived with one of the front legs on two of the chairs being splintered to bits. The box was also missing the front half of one of the chairs and several pieces of hardware... The lesson? Inspect all pieces of your shipment very carefully before assembling. Make sure all the joints are still glued and that there are no cracks. I would still recommend the chairs, based on the final product, and the price. If you need them now, and can't wait for some back-and-forth with Overstock, I'd consider something else, but the quality of the construction and the aesthetics of the chair have made up the time and effort spent dealing with the broken pieces.", 
    "They look great! I'm so disappointed to have to return the. The quality is not the best. If there are rarely sat it, they would be fine, but for everyday they will not last.", 
    "Love this product. Purchased 2 sets of four. Shipping was free and timely. Assembly was not difficult although time consuming for the entire set of eight. All parts were included. Nothing was missing. Assembly instructions were easy to follow. End result is very satisfactory. Would definitely order more if needed. Hightly recommend", 
    "Cheap in every aspect of the word. Ordered the yellow set of four. The color was very light, nearly a natural finish. But the quality was most evident with the assembly when the wood split. Overstock was very good about returning the chairs because of a manufacturer defect.", 
    "Chairs were received within two days of ordering them. The color is not as teal/turquoise as they looked in picture but still very pleased with the chairs and quality of them.", 
    "My parents were in town and started to put these together for me and the first one was a real pain! Once they got the hang of it and we started a little assembly line, it went much faster. The chairs look really cute in my kitchen and I got a great deal. There were no missing parts or damage to the wood. Let's hope I remember to tighten the screws every 6 months!!", 
    "very disappointed after these chairs arrived. Appearance and price wonderful. Ordered 2 sets (8 chairs) for our Florida vacation rental home. But after putting two chairs together, they wobbled significantly on our tile floor. POSSIBLY would be OK on thick rug, but NOT OK for hard floors. Paid $** to return. Expensive trial.", 
    "A little hard to put together, but look great! Add a nice touch of color to a room :)", 
    "I've had these chairs for two years and they are starting to show some wear. However, we have three small children and I'm glad we purchased. I did not want to spend a lot of money on something which gets a lot of abuse. The chairs are a little wobbly now but can be adjusted and the paint has chipped off in some places, but minimally.", 
    "These started creaking a year or so into use, but they're fine. They are pretty lightweight, as well, so I don't know if they'd take much abuse in a house with kids, but they've been fine for us. Can't beat the matte gray color, actually. They go with everything! We put the seat cushions you can get for $4 at Ikea on the seats and they work great.", 
    "These are well made chairs and the price was right but they are not incredibly sturdy. Still, we're happy with them and expect them to last a while.", 
    "Great look at a great price.", 
    "Good for purpose but look cheep", 
    "Very pleased with this purchase, easy to assemble.", 
    "The chairs are turn to color, Nice sturdy chair", 
    "Was good size for a small eatimg area", 
    "The chairs themselves are super cute once you figure out the obscure directions to put them together. Ours came with NO hardware to put them together and the manufacturer of the chair was little to no help. Thankfully Overstock stepped in, however I would not support this company and purchase anything from them again.", 
    "\"BLUE\" is really more turquoise, and the \"putting together\" is really more complicated than I thought or what other reviews said.", 
    "These chairs don't appear to be able to withstand over 250 lbs. of weight; they feel sturdier once the seat's anchored to the legs. We had to purchase longer screws, as the ones sent in the package were too short to secure the seat to the legs.", 
    "We love these chairs. They are very simple to put together. Only 10 minutes to put together.We got the yellow ones!", 
    "I ordered the yellow and as other reviews stated, they aren't solid yellow. You can see the wood grain through the yellow paint, but they are bright enough for me. They aren't the most comfortable chairs, but they are sturdy. We have three kids under age 4 and these will be great for our family at this stage!", 
    "These chairs are definitely smaller and flimsier than I was picturing them, but they are attractive and have nice clean lines. Fine for the price", 
    "These chairs came in with a piece broken. You have to put them together. Malaysia. Enough said?.", 
    "Love them! They are well made and a great size for our room", 
    "these chairs are worth the price, but they are a little loose and chipped a bit after 16 months of use. good for a temporary time .", 
    "These chairs are actually sturdier than I was expecting, and with having children that is very important. I ordered the yellow color and I love them!", 
    "These chairs are not super sturdy but they look great and I am very happy with them considering how inexpensive they were. My boyfriend was alboe to assemble all 4 in an hour. Not too bad.", 
    "Packaging was excellent! All pieces were secure and protected. The screws, etc. came in 4 separate pouches (1 set per chair) which made it so easy to assemble with the Allen wrench provided and a Philips head screwdriver. I didn't even wait for my son to help me! The chairs are a good quality, strong wood. I bought the white so there is no problem with the color. VERY impressed, especially for the price!!!", 
    "Chairs look like the picture, color is very similar to what you see (we got the gray). Husband put together, took awhile but just because it was involved. Chairs are ok, especially for the price point.", 
    "very cheap colorful chairs that get are fantastic for a tight budget and a punch of color", 
    "These chairs look great and were fairly easy to assemble. The color is perfect and they are very sturdy.", 
    "These do NOT look like I paid $$$ for four DR chairs!!", 
    "Only thing I would recommend is getting floor protectors for the bottoms of the chair legs. These left gray paint marks on my wood flooring. Otherwise they are sturdy and cute chairs!", 
    "The instructions did not match the chairs. Very hard to put together", 
    "I got the chairs in grey. I am very pleased with the finish on them. I had no issues with splintering or other defects. A couple chairs wobble on my tile floor. I have a rug under my table and it is not an issue. Assembly was also pretty straightforward. I popped in a movie and had all 4 chairs done by the end of it. Helpful notes:- When installing the chair rails - pay attention to the dowel sizes they only install one way. If you find the dowel doesn't fit when you put the back on just reverse the side rail.- It takes a bit of effort to install the seats. I had my husband sit on the chair to hold the seat in place while i attached it from the bottom. My lager cat also worked for this purpose.All in all these chairs work perfectly with my dark wood table and white cabinetry.", 
    "These were great chairs to look at but not sturdy enough for everyday use. Also, they were smaller than an average chair.", 
    "I'm really happy with these.", 
    "Petty nice for the cost! Needs some chair pads to get them to be comfortable. But all in all for the money you can't beat them!", 
    "One chair the leg snapped in two and the other broke at the seat base. Junk", 
    "Nice chairs. I would recommend.", 
    "I was very surprised about the quality. It's way easier to build with an electric drill/screwdriver. Great chairs", 
    "i ordered four of these chairs in the Teal color. I love the color, they were fairly easy to assemble once you figured out the first one. They are pretty sturdy but they dent and chip easily.", 
    "got them in red - have a good red paint over \"wood\" look - somewhere between school and farm house in style. very easy to put together and very sturdy. If I had room, I'd buy some more.", 
    "We live on an island in Florida and needed a colorful blue to go with our color scheme. This set is absolutely perfect. I informed my husband that others had stated in their reviews that they were hard to assemble. I don't know if my hubby was showing off or what, but he had no trouble putting them together. They are very sturdy and will last a long time. The color is very close to what is shown. I decorate with Bahama Blues and coral and I could not be happier. They arrived in a timely manner and they look great around my rustic wooden table. If you are hesitant don't be. It is a great deal.", 
    "I spent over 3 hours assembling these cheap chairs. They are so poorly constructed that I had to sand down components for them just to fit together. I have suffered from multiple injuries both physical and psychological and all I have to show for it is 4 rickety chairs that are barely yellow and look terrible. Don't buy these.", 
    "They look great and they even left a narrow opening at the back of the seat so any spilled food or drink can be cleaned out instead of smashing up against the back.", 
    "I no longer have these, but I purchased them for my college/early twenties apartment and they were a great fit. Comfortable, pretty easy to assemble, stylish, and sturdy. I bought the blue ones and loved them for about 4 years until I upgraded to a fancier dining set.", 
    "I got these in read. They are cute but not very substantial. With that said, they're holding up fine", 
    "Purchased these chairs about 2 weeks ago. They arrived in just over a week. Everything is packed into 1 box that weighs about 56 lbs. They were packed well into the box. The instructions were hilarious. I must have received the 10,000,000th photocopy of the original instructions. I found the language they used pretty funny too. Assembly was pretty painless. I used Type III wood glue on both the male and female ends of each piece, to prevent squeaking. Quality is okay. (Can't beat the price!) 2 of the chairs wobble a half inch back and forth when they're empty. With someone sitting, they don't wobble at all. Not really a big deal. They look great next to our rustic wood table. I would recommend them to others.", 
    "I ordered the yellow. The yellow finish does allow a modest amount of graining through. The directions were clear and I reinforced the joints with normal yellow glue. If you plan on sitting for a while on the chairs I suggest you invest in chair pads. I would recommend these chairs and I would buy again.", 
    "I had no problem with assembly, though you will need a phillips screwdriver, and it goes much faster if you also have a screwdriver with interchangeable bits to bypass using the allen key. The chairs feel much more substantial and weighty than our IKEA chairs (Steffan and Kautsby) and the blue color is nice and cheerful. My only criticism is of the seat design, I wish the seat plank had been cut to overlap the framing in the back of the chair. It doesn't, so there is an odd looking gap in the back. I haven't had them long so I will revise my review if I notice any problems with them.", 
    "Good value for your money. Not super sturdy or comfortable to sit in for extended period of times. But for four chairs can't be the price.", 
    "Quality isn't great, but for the price is pretty good. We've used daily for a few months (with a toddler in the house) and the paint is chipped in a few spots. One was also very uneven and wobbles. Overall, I would recommend as chairs that aren't used often, or to a family with younger kids who just want something to get them through until the kids are older and you can get nicer ones.", 
    "This product is a set of 4 chairs which comes with no instruction manual and no hardware whatsoever. I contacted customer service and was told that this product does not come with either.", 
    "These chairs aren't very sturdy, they squeak when you put them together and sit on them. They come unassembled, but my husband is a professional carpenter and he put them together correctly. They are solid wood so I'd use these for students, and they are very cute, but not full grown large adults.", 
    "I love these chairs in my kitchen. I wish they were better made, but I guess I paid for the quality. One of them broke within the first few weeks, which was disappointing. But again I guess their quality is not what I had expected.", 
    "The minute you take these chairs out of the box you can tell they are low quality. The paint was unevenly applied and the directions noted that they should not be used by someone over 200lbs.One of the chair's legs has already snapped in half.I would in no way recommend these chairs.", 
    "Great chairs and easy to put together. Ordered the gray ones and are very happy with the color.", 
    "I was looking for a white set of chairs and there weren't any available in town. I was very happy to find these on Overstock. They look great paired with our maple kitchen table. The white does stain quickly but is easy to wipe and clean. My husband put the chairs together and it took a bit of patience. But the result works great. We have had them for over a month now and I cannot complain about the quality or sturdiness.", 
    "I bought these chairs for my daugher who recently got married. Love the color! They are a young couple and it fits their lifestyle perfectly! Great chairs for the money.", 
    "I bought four of these chairs ten months ago for daily use with three school-aged boys. The assembly was fairly uncomplicated. However, ten months after purchase, one chair has literally collapsed under the weight of an adult, one began cracking and is unusable, leaving two remaining that are in poor condition as well (wobbly). These chairs were used carefully and not abused in any way, and were assembled tightly- and lasted less than a year. Very poor investment- don't waste your money.", 
    "My chairs came with no directions but I figured it out quickly. I love the look and the color. I may order one more set! They arrived in 2 days!!!", 
    "We were looking for some basic white chairs for our dining room table and these have worked well. They were fairly easy for my partner to assemble, especially after figuring out the first one, and they feel sturdy. We're happy with them.", 
    "I purchased the chairs because they were pastel yellow and the color was very bright. When the chairs arrived they look the same color as my light stained wood table. I like the chairs but disappointed with the color. I should have bought red. My husband put them together but he used wood glue to be sure they held together. He said they would not last if he didn't use the glue.", 
    "The chairs are really very nice and a great buy for the price. The white chairs I received were not white washed as mentioned by another review. They were very white, nicely painted, so maybe they changed the color or paint. They do take a while to put together, but as said, after the first one the rest go quickly. Suggest you have a drill to speed it along at some point, but a screwdriver is mostly all you need.They are sturdy, but don't know if I would recommended them to a family with children, as I could see them loosing up if they get a lot of action.", 
    "A good and sturdy chair. Using outside so will be putting a water repellent so they will weather well.", 
    "I ordered these chairs in yellow for a beach house. They are actually more like a tan with a yellow cast. Kind of disappointing. Also, one chair was missing the screws, which proved inconvenient when I'm only in town for a week.", 
    "The chairs are pretty comfy and they are a great addition to my kitchen. Not the easiest thing to put together but I did so can't be that hard:)", 
    "Good looking, sturdy and easy to put together. Love these chairs.", 
    "Not a bright ugly yellow!! It's a darker country kinda yellow! Looks great! pretty comfy too!!", 
    "We received the chairs very quickly. They needed to be put together but after we figured out one, the rest were easy. The compartmentalized packaging of the hardware made it extremely easy to assemble without having to search and sort. The only difficult part were the brackets that attach the chair seat to the frame. You need to attach all 4 brackets to the bottom of the chair first, then center the one at the back of the chair. It makes it easier to attach the other three sides. Don't tighten any of them until you are finished attaching all screws. But overall easy. The chairs are good quality for the price. We use them daily for all meals with 2 kids. They are sturdy so my youngest doesn't fall off when climbing up on them. The sticker felt pads that went on the bottom of the chair did not stay on longer than 1 week so we will replace those, but so far, so good.", 
    "I was disappointed when these arrived to find them very dull and not nearly as vibrant in color as the photos pretend they are. The assembly is not complex but is very time-intensive. I was also MISSING multiple screws and had duplicates of the wrong ones so we couldn't complete the assembly once we got them. We had to head to the local home repair store to get similar screws to be able to finish our last 2 chairs. That is simply unacceptable quality control. They feel sturdy and the price was good but cmon, to receive incomplete parts is just absurd.", 
    "We ordered eight yellow chairs (two sets of four). Of the eight chairs, three 'chair front' pieces were badly cracked. (The packages were not damaged, and they were well packed. Looks like they were damaged before they were packed.) So we have assembled five chairs and are waiting for replacement chair fronts. We would caution anyone to look carefully at the pieces before you begin assembly. We found the assembly directions tough to decipher, not originally written in English. For example: 'Please do not discard any of the packing until you have checked all the part the of fitting.' and 'Please tie cap screw on the front leg. Attaching Side rail to front leg. Do not fully tight.' It took us a while to figure out the first chair, but after that it was quick to assemble the rest. The chairs look good and are comfortable. We are happy with them. But it was a disappointment to have 3/8 of the chairs unusable due to broken components. There is a quality control problem that allowed these pieces to be packed in the first place.", 
    "Good chairs for the price. They came fast and well packaged. I was able to put them together by myself and even got my 8 year old to help. I have had them for about 2 months now. We use (abuse) every day and they are holding up well. So far so good, but I am only planning on having them for a few years until kids get older and I can re-do the kitchen with quality stuff.", 
    "Easy assembly and sturdy! We got the blue ones, adds a great pop of color in any room! Would definitely recommend these chairs!", 
    "I wanted simple dining chairs in an interesting color at an affordable price. I ordered them in blue and they look great in my combination dining/living room (NYC apartment). I would never have been able to assemble them myself as holes need to be drilled into the seat for the other components to attach but with a handy friend, assembly went smoothly. They have a few dings in the paint, after 7 months, which I actually don't mind aesthetically but which I know might bother others. The paint chipping is probably more attributable to my sons than the quality of the chairs. I note that, inexplicably, one seat split in half during assembly and Overstock replaced it immediately, at no cost. Good experience, overall.", 
    "Chairs look great and the price was even better. Very sturdy and finish is nice. They will be heavily used by young kids so I'm not sure how long they will stay nice. After one month they are holding up well and have not tipped over or scratched easily.", 
    "The chairs are fine, but we received them in the wrong color. They are sort of \"unfinished\" and look like they're unintentionally not painted.", 
    "It is hard to sit on - could use an add-on cushion. High back is great. Solid product, decent price. Simple and elegant.", 
    "Good product however color not close to what was pictured.", 
    "I would give the review an extra star had they arrived with more pre-drilled holes and something noting the right vs. left side support. I'm not sure how long they will last, but the red chairs look great with my table.", 
    "I love these chairs. The color is bright & cheerful without being too bold & abrasive. They were fairly simple to assemble & the instructions to do so were straight forward. They are solid chairs, yet light enough to move around without trouble.", 
    "I ordered the yellow chairs and wasn't disappointed when they arrived. You can see the wood grain through the paint color, which is exactly how the item was pictured. Included were picture instructions and I had no difficulty putting these together. The most difficult assembly was using a screwdriver to assemble the seat to the frame. My hand ached by the time I had finished all four chairs...but that is probably a reflection on me and not the chairs. Other reviews made assembly seem near impossible, which is not the case. I'm a 32 year old single gal and assembled all on my own. As other reviews noted, the seats were not pre-drilled for screw holes, but you use an appropriate screw for this, so I'm not sure what the fuss there is. It's hardly the first DIY furniture piece to be assembled this way. Overall, I liked the look of the chair, nothing was damaged or missing upon arrival, it was exactly what I expected, assembly wasn't difficult, and they complement my decor perfectly. Good price for actual wood furniture - especially an eco-friendly wood (rubberwood). I would order again and recommend to others.", 
    "I was looking for a set of chairs to brighten up my kitchen and these certainly did the trick. You cannot beat the price... trust me I've looked! They are pretty solid and are fairly comfortable. They look great and are slim and stable, however they may not be comfortable for larger people. There is no curve in the back of the chair to offer extra comfort for your back, however my husband and I both have extensive back issues and these chairs don't bother us. That being said, I wouldn't want to sit in them for more than an hour or so. One flaw to note- the seat does not have notches for the back legs to make it fit flush. There is a small gap between the seat and the frame. It doesn't look terrible, but I wish they would have taken that extra step. You will need a drill to put these together. Overall, I'm very happy with the purchase. The yellow is such a nice shade, it makes my kitchen look happy! These are a great value and I would definitely recommend.", 
    "when we opened the box i was super skeptical of the color. (we ordered the white wash). It looked more like a light colored wood to me. But, we put them together (crossing my fingers the whole time) and next to our table they look a lot better. 2 chairs were pretty wobbly but with well-placed pads it was minimized. Overall, good chairs for a great price!", 
    "Easy to assemble. I put the chairs together and my husband screwed on the seats. The only additional purchase we made was coaster pads for the legs.", 
    "These were quite difficult to assemble and somewhat upsetting. There is definitive a specific right and left side to the rails and it took be three chairs to figure this out. Please be careful and pay attention to the pieces before assembly. Some dowels are too big for holes if you put them on the wronf side.", 
    "Chairs just as shown. I really like them but hard for me to assemble... I would buyt them again.", 
    "Bought these chairs in blue to go with an antique distressed white kitchen table. They are the focus of my house now. We get so many compliments about the look, and the comfort. Also excited to read other reviews prior to purchasing that said rubberwood lasted them a long time, many people stated for 10 years and still holding strong. Very wonderful product, even better for the price. Others have stated the assembly is difficult. Once you get the first one, the others are much easier. Just don't get stressed about it and it will be fine...and beautiful!!!", 
    "I have an old porcelain covered tin top table which is white with red trim. The chairs had been destroyed - hence the purchase of red wooden chairs. The color matches the trim perfectly and they went together very easily. We are considering another color for redoing another dining area in the house. Thank you!", 
    "If I had ordered from anywhere else, I would have returned them the day they came. They are cute and assembly on everything but the seat was easy, then I got to the seat part and there are no drill holes and it was impossible to attach. It almost broke my drill. They are finally together but very wobbly. I realize they are very cheap but I would have been better off with $10 folding chairs. They are very cute, I got the yellow and love the color but they are for looks only.", 
    "not bad for the price.do not think they will last regular family use.", 
    "Ordered four of the red version to fill out seating for extra Thanksgiving guests. Product came complete and undamaged a bit ahead of schedule. Assembly of the first chair took 45 minutes, others 20 each. We like them, especially a pop of color, simple lines.", 
    "I am liking my fun blue dining chairs. I like them because they are simple, sturdy, and blue! The blue color could have been a bit darker to make it less childlike, but I will enjoy this just fine. We will paint it antique white later if we get tired of this blue. The chair goes well with the warm browns we have in our dining room/kitchen, and the light blue patterned rug underneath the dining table. It throws cool color scheme the space needs to balance it out. I think I read from other reviews that it was hard to assemble, but that's not the case for my handy husband. He said it was easy, no problem, so maybe you won't find it difficult to assemble either.", 
    "I love these chairs. The color is great and they are pretty sturdy, however the assembly is a pain in the butt! I only put together one at a time and had to take breaks because it was very difficult. The tools are not helpful and the directions are even less help! Once I put them together, I loved them though.", 
    "I really do like the way these chairs look. The red is beautiful. However, I didn't anticipate it taking quite so long to assemble them. The biggest problem was that the seat bottoms don't have pre-drilled holes or markings to indicate where you should screw in the brackets to connect the chair-bottom to the chair-base/legs. It took some interesting maneuvering to figure out where the brackets should go, and then some real effort to get the screw started and balanced. I didn't use a drill. I'd imagine if you used a drill, you'd be done with that step in 5 minutes. It probably took me about 3-3.5 hours to assemble all 4 chairs. They seem fairly sturdy though, so I think it was a good purchase.", 
    "Like the chairs. Easy to assamble, one seat was split and I contacted Overstock to have it replaced. They have excellent customer service and sent the replacement right away.", 
    "Chairs were easy to assemble until the seat. Definitely needed an electric screwdriver. Pilot holes would have been helpful.", 
    "They are nice for the price. I think they will hold up and are good for larger people too. They are not very easy to put together, the other reviews are correct in that. If you have someone who's handy to help you put them together then it's worth the trouble, but I wouldn't recommend them for someone who's not good at putting things together because adjustments had to be made and my dad had to use an impact gun to get them together properly.", 
    "I was nervous to order chairs off the internet with out ever sitting in them, but they are very sturdy. They were easy to put together and the wood seems to be solid and of good quality. I am using them in my kitchen and they really brightened up the room.", 
    "Decent chairs for the price. The color is definitely not as depicted on the site, though. I ordered red hoping it would be an orange-red as in the photos, but the actual product is closer to a true red with a slight hint of orange. They were fairly easy to assemble, and they are quite sturdy with a decent weight to them.", 
    "We're happy with the chairs, but wish the company had been more upfront about the assembly required. We needed to drill pilot holes to attach the seats to the chair frames. Guessing a lot of people don't have drills at home to do this. Putting the chairs together otherwise would have been impossible. That said, when we finally did get them assembled, they looked good.", 
    "We bought yellow, blue, and red chairs....so 12 in total. They are a bit of a task to put together via my husband, but when put together are great and sturdy. They are not extremely large chairs, but will work great for all our toddlers. I would recommend this product in all colors. The yellow color is not as bright as one might expect, but still a nice yellow.", 
    "We bought the yellow color and there were no pics of it so it was a gamble--- they are very nice but a really light yellow color. Good quality, especially for the price! Really happy with them!", 
    "These chairs were exactly what I was looking for for our distressed, black farm table. I love the color, and the price was great! Once we figured out assembly, it did not take long to assemble the chairs. My only complaint is that there is a slight gap between the seat and the back legs, rather than the seat sitting flush against the back.", 
    "If I could assemble the chair, it might be fine! However, the assembly instructions are incredibly unclear. I'm at the last step and the included instructions have random pictures of L-Brackets, not indicating where these are meant to go. I cannot tell if they are supposed to attached the seat (which has no pre-drilled holes) or what their purpose is. I called Overstock who said they couldn't help - no one knows anything about assembly. They didn't even really know who the manufacturer was. I ended up doing a little investigation and found that the company is TMS (Target Marketing Systems) in Illinois. I called them and the rep told me to drive the screws into the bottom of the seat slat and the rails of the chair frame with a screwdriver, but not to use a powertool because that will split the wood. There is pretty much NO way to screw the screws in...so for now, the seat slat is just balancing on the chair frame. Luckily, the rep at TMS is very nicely asking people in her warehouse about how to put these together - we'll see if she can figure it out! I do not recommend buying these chairs unless you're incredibly handy or really great at understanding bizarre picture directions. And, again, the chairs are also a much less vibrant, less orange-y red. So, that's sort of a pain, too. Sigh. I was so looking forward to these! If I can figure out assembly, that might change my review, but for now, I'm really disappointed and also very frustrated at Overstock's inability to help or to get any further information on how to assemble these."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Camden-Dining-Chair-Set-of-4/6198706/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6198706/Simple-Living-Camden-Dining-Chair-Set-of-4-e549a9c3-c3e6-400d-8e2d-e368e3ea5eec_600.jpg"
  ], 
  "description": "Complete your dining room or kitchen with these elegant chairs.\nMade with strong and durable rubber wood, these dining chairs are\nsturdy and well-designed for many years of use. A scooped seat\nprovides a comfortable seating experience and a slated back nicely\naccents each chair and provides ample support to rest against.Set includes four dining chairs to complete your dining\n  experienceChairs are made of durable rubberwood for extensive useSlatted back design adds charm and eleganceScooped seat provides a comfortable sitting experienceSeveral color options to allow coordination with your\n  decorSeat dimensions measure 16.75\"W x 15.75\"DSeat height is 18\"HChair dimensions measure 36\"H x 16.75\"W x 19\"DStyleContemporary, TraditionalMaterialRubberwood, WoodFinishGrey Finish, White Finish, Yellow FinishChair TypeDining ChairsSet SizeSet of 4AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlue, Grey, Red, White, YellowFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleSolid"
}