{
  "name": "Simple_Living_Wing_Recliner", 
  "price": "EUR 297.26", 
  "reviews": [
    "After using for a month, here is the review: Pros: - Nice pattern and loving it. - Affordable price comparing to all recliners in the market, esp with a nice look and pattern. - Since its not white but taupe color, even if i stained it, it wont be that noticeable. - Easy to assemble: after taking it out of the packaging, it only took me 5 mins to put the back piece onto the base and screw 8 nails into 4 legs without looking at the instructions. - My bf loves it and named it his king chair right after i assembled it even if he said the pattern is girly before i ordered it. Cons: - This recliner is not Black and White but Black and TAUPE, which doesn't fit my living room's color scheme but i like the pattern. - When reclining, i always afraid that the chair will flip over as it needs great amount of force to push the back to recline, but so far it didn't flip... yet. - The fabric seems too light weight for a daily use recliner and wondering how long it takes the corners of the sitting cushion will wear off just like all our fabric computer swivel chairs that have the sponge leaking out under our left thighs.", 
    "The chair came right on time, and the assembly was easy. It looks great! We have had the chair for one month. The fabric looks expensive and durable. It doesn't sag or wrinkle. We have two dogs that shed like crazy, but the fabric seems to repel the dog hair. It is wide enough for a man to sit/recline comfortably in it yet doesn't take up too much space in our tiny one bedroom apartment. It is so comfortable, and nobody ever suspects it is a recliner! This is not your dad's Laz E Boy! I would recommend this to everybody! Everybody who cones over compliments the chair.", 
    "I love this chair. A friend of mine in Dallas bought one and since I moved to Seattle, I assumed I was allowed to copy cat. It 's currently the only thing in my living room but I am also buying a sofa from O.com this week. It took 5 minutes to put together and is very sturdy. I get compliments on it all the time and highly recommend it!", 
    "My niece had a baby and wanted a comfy chair to relax in while she sat in the living room. I had this chair sent to her and she and hubby both LOVED it. I knew she had been searching the local stores for a black and white casual chair and was looking at upwards of $400. This chair is not only a great deal, but is a purchase that looks much more expensive than the Overstock price. Great find! Very classy design and well constructed.", 
    "The fabric is nice and overall makes the chair look classy. It is comfortable because you can sit straight if you like (I do), while still having your feet elevated. Reclining back is also comfortable, and I have fallen asleep once or twice. This chair was a very good value considering the cost.", 
    "Thank goodness Overstock is awesome and issues no hassle returns- because this chair is NOT awesome. Unless you factor in the awe of sitting down and thinking \"Wow, I may as well sit on the floor.\" I seriously couldn't believe how low it was, it is really a chair for a 2-3 foot tall person. The chair did not close properly once reclined, scraped the floor when trying to close, and the fabric is CHEAP. RETURNED INSTANTLY!! Overstock gets 5 stars for customer service but this chair deserves less than one star.", 
    "I am impressed with the look of this chair and everyone thinks it is really comfortable. I don't think it looks small, it is a normal size wing chair. It does not feel extremely sturdy and I had some issues with one of the legs staying in like others. I think overall it is still a good deal for the price as I did not expect it to be top quality. I was able to clean a fairly large amount of blood off of it (my daughter had a bloody nose) and it did not leave a trace. I was shocked as I thought the chair would be ruined. The fabric has a slight quilted effect to it that I like.", 
    "I guess I am one of the only people that actually received a black and white chair, rather than a black and TAUPE chair, which I would have prefered. Color aside, this chair is totally out of proportion. It sits very low to the ground like it is for minature people. The back just slides onto two flat-iron posts. it does not lock in, it just slides on, therefore you cannot move the chair by grabbing the back, it just pulls off. Apparently, they are selling this chair with different fabrics, as the fabric on mine is a very heavy woven fabric, almost a tapestry, and appears that it (the fabric) will hold up for a long time. Since I buy mainly after reading reviews, I found this product description to be deceptive in that the fabric, and color, is not consistent. It is also very small, but the stature is the worst part. I have a bed that some people would have to use a step stool to get up on. When you place this chair in the room where you can see both bed and chair, it looks like a child's chair. The operation of the recliner is very tentative - I would say if used daily it will last about a month as it just feels woobly, and as noted, the back is not really secure. I agree with the other posters that it is not consistent with what I have formerly believed of Overstock's quality products. Haven't return it yet, so cannot yet review the return procedure.", 
    "feels kind of wobbly. not super sturdy for bigger people. it is also a shorter wingback and may be too short for someone over 6 feet tall. i am not convinced that this chair will last a very long time. love the look of it, just wish I had more confidence in the durability.", 
    "This is definitely as pretty in person as it is online. However, the material is not good quality, just average; it looks as though it might tear or stain easily. The back is nice and high and it is comfortable. But the foot rest scrapes the ground when you try to fold it back up. Assembly was easy.", 
    "This recliner sorry to say was a piece of junk. To sit in is like sitting on a rock and feeling like I was going to slide off before I inclined it. When I did reclining it with strenuous difficulty , my feet went over the edge and an extremely hard foot rest. The fabric began to stretch and separate, and forget about cleaning it either as then it shrinks. The fabric is a magnet for dirt and trust me my home is very clean. One month later the mechanism began to fall about and squeal when you opened. I was the daughter of an upholstery business and I've dealt with lots of recliners. Look all I can tell you if you're looking for cute and pretty then this is perfect. If you're looking for comfort and daily use then, buyer beware. Prior to my purchasing this recliner I read all the reviews and figured they're just a bunch of complainers. Now I wish I took it more seriously. 2 months later I gave it to the neighbors kids. Good luck with your purchases.", 
    "Shopped around for a new recliner and after comparing over 100 purchased this one. I would rate it as follows on a scale of 1-10 with 10 being best:Comfort: 3.5 (planning to add an orthopedic memory foam layer cut to size from a twin mattress pad and place a slipcover over this chair and it should significantly improve in comfort as the size and arms overall would rate higher if the seat and back were more inviting- there is support but no feeling of \"cushion\"Price: 10 Purchased for about $176 with promoValue: 10 Could not find a better buy overall Appearance: 8 The contour and design is more complimentary than many overstuffed la z boy style models- don't expect to fall asleep instantly, but because the fabric of this chair is not fit to endure heavy use well, adding a layer of gel foam support etc and a slipcover is a cheap way to get a beautiful chair that puts the ugly recliners to shame, at a great price point! Definitely recommendEase of assembly: 10", 
    "I really like this chair. Easy to assemble. However, the chair is small. Not make for tall people.", 
    "We were very excited to get these chairs to match our French style room. They are soft and comfortable, however the quality is pretty low. After about 6 months of use, the reclining mechanism is worn out. Meaning, you are either fully reclined or fully sitting up even though there is a middle setting. Also, the fabric has faded very quickly. We bought two, but one chair was starting to fade dramatically after just one month of use. Finally, they are not black and white-listen to the other reviewers and myself and know that these are black and taupe.", 
    "Easy to assemble but not sturdy, fairly comfortable but if you are short the foot/leg rest will hit your Achilles tendon which is not comfortable.", 
    "I read previous review and almost didn't buy because I thought it would be tan and not white. I got mine today and it's for sure white and black. It's not even cream just white. Very pleased with the overall look and sits fine. I got just what I wanted for the price I paid.", 
    "I WOULD LIKE TO SEND IT BACK IF I COULD. I DON'T USE IT.", 
    "This chair looked great in the pictures and even had some good reviews. The chair that arrived at my house was very poorly made - exposed staples and loose/torn fabric and places where the fabric did not cover the underside of the chair. The fabric was sort of rough and the clincher for the return was that the pattern/fabric was mismatched all over the chair. It really looked pretty bad and was quite noticeable. It also sat very low. HUGE disappointment. It went straight back to Overstock, but I was pleased with the customer service and the fact that they took it back.", 
    "The material is rough. The colors are black and more of an ivory. The material feels cheap and nubby. Not worth the $300 price.", 
    "As most that have written reviews... I am skeptical buying furniture or things that I cannot judge the quality of. I bought this with the hopes that (knowing the quality of the other chair I purchased with this) this would be not a bad chair. Shipping was quick. Box arrived without issue, arrived before my other chair that shipped 3 days earlier. Assembly: The chair arrived with no visible damage. The fabric is a good quality and well as the construction. The chair assembly is easy, the legs need to be attached then the back slipped onto the levers. This was fast and easy. The chair sits very nice and is a fully reclining chair. I do love the looks of the chair and how comfy it is. I have had a great experience with Overstock thus far.", 
    "None of the construction was discussed appropriately in the site description. Looks great on pic. The construction and materials are very poor quality. The material is jersey in appearance, stretched and not nearly as vivid.The back of the recliner doesn't meet the seat well, leaving a visible gap in the chair. The arms are constructed from cardboard. The fill in the top pillow was low, leaving a lumpy appearance. Overstock went out of their way to help me be satisfied with the return. That part went very well.", 
    "Received the product very promptly A+. The product initial appearance was poor quality, but upon further inspection it did not have any paddiing on side of chair, somewhat felt like cardboard. Furniture had a strange smell. Very poor quality. Returned product promptly. Really think overstock should reconsider if they should be carrying such poor quality product. Junk!", 
    "We are happy with the product especially for the price paid. We bought it for our 14 year old daughter for her bedroom which is black and white. It looks perfect with her b/w theme. We accented the chair with a burgundy throw. She loves to read and reads sitting in her chair all the time. Its comfy (according to my daughter). We looked at other chairs which were much more expensive. The quality is good but not great, but for the price it is perfect and a great value. We bought the warranty just in case. We joke in our house that with this chair our daughter now will never leave her room.", 
    "This chair does not look like the picture online. The black shows through to the white giving it a grey appearance. It is comfortable enough, but the frame was bent, and the stitching had come loose on one of the wings. However, the customer service was excellent. I chatted online with a customer service rep and within minutes had a return label to ship the item back. I would not hesitate to shop with Overstock again. I just think I will go pick out a chair locally next time.", 
    "Bought this chair and was surprised when it showed up at my door 2 days later. Love the fast & cheap shipping and the chair is perfect! It comes in 2 pieces so there is some very simple assembly. It's a small recliner that is comfortable & does not take up a ton of room. Very pretty fabric too.", 
    "Easy to assemble, beautiful chairs and love that they recline. I'm short, 5'2\" and the foot rest hits the back of my ankle. Wish it was somehow longer...but that would probably mess with the aesthetics.", 
    "Had to send this chair back shipping damaged", 
    "Very nice chair for the price, it is more of a show piece in guest room than everyday. It is a bit hard but overall it is beautiful", 
    "Great comfortable chair!!! It is definitely the new conversation piece in my home. :)", 
    "was easy to put together, is very comfy to sit in, even when reclined just feels a tad flimsy thought. Spend the extra and get something more sturdy", 
    "I wish it were a little heavier. I have kids and they are hard on furniture.", 
    "Small and perfect. Easy to assemble. My 6-5 teenager lays back in it though & likes it.", 
    "This chair is just as advertised and it's smaller size is perfect for my Mom. She loves it.", 
    "It is a beautiful chair but not very comfortable and small for tall people. The look is great but the reclining is average and small", 
    "Even better than expected! This chair is a perfect showpiece for any classy living room. It is comfy, quality, and easy to recline. The fabric is soft and it was delivered very very fast. Its a must buy. I might even get another for the bedroom.", 
    "Well made and comfortable. Works well in small spaces.", 
    "Very comfortable and beautiful flower pattern", 
    "beautiful chairs, they couldn't look better! BIG BIG PROBLEM was screwing in the legs. Trying to find the correct position for the screws to make contact with wood was a BIG PROBLEM. Quality Control should not have missed this obvious flaw since everything else exceeded my expectations!", 
    "Looks great & a breeze to put together - did it by myself in a few minutes, while talking on the phone! also super comfortable & great to kick back in after a long day!", 
    "Is the perfect style and colors I wanted. Excellent addition to formal living room.", 
    "The only way these have survived is with little use.", 
    "This chair looks even nicer in person. It is super easy to put together. I love that you would never know it was a recliner when it is upright. It's very comfortable, especially when reclined, and really just looks fantastic. The price is a steal!", 
    "It's small but so beautiful it looks very expensive it's small just what she wanted", 
    "For the price, this is a really nice deal. I read many reviews prior to ordering 2 of these chairs and the background color was in question. I took my chances and while I would have really liked a \"white\" white background with the black design, our hinge more towards a lt greyish white. Some reviewers mentioned cream even one mentioned mauve as the background color. Not sure how many chairs are as shown in picture, but if you can be a bit flexible with the soft background color, you won't go wrong with these chairs for an trendy, economical addition to your sitting arrangement. The chairs are covered in a somewhat heavyweight material, so I believe these will last for good while.They are very comfortable to sit in and the only negative aside from the unstable background color is that there is no handle to move recliner into position. It is not that difficult to lean the chair back but it would be nice to have that feature. I am about 5'6\" and while in the reclined position my feet do hang off the foot rest slightly. This is not a chair for very tall people unless you don't mind missing the foot support. To simply sit upright, they are very comfortable! Again, these are really nice looking, comfortable wing recliners for a great low price!", 
    "Very nice chair, easy to assemble in an hour. Definitely built for smaller people and great in a small space. The colors are very close to those pictured ( ivory and black not a taupe color like I had read in other reviews).", 
    "As other reviews state, the chair is not stark white but it's beautiful and reclines further than expected. I would recommend to anyone.", 
    "The movement needs a side-of-chair handle since it is extremely hard to recline or fold back by body movement. We are having to open and collapse while standing to the side of the empty chair. Awkward to say the least. Otherwise, style and comfort are very good.", 
    "Shipping was quick. Assemy easy. It was a chair for our master bedroom primarily used by someone 140lbs occasionally before bed to watch tv or read a book. The back started slopping to the left within a year. The arm rest didn't feel sturdy. It is beautiful to look at when it wasn't in the reclined position. The quality of the material was good enough. Wouldn't purchase again or reccomend.Wasn't well made.", 
    "Love itPretty and comfortable", 
    "These chairs are so cute and very comfortable. They were very reasonable and I love them. My 6 foot 10 inch husband sits in them. He likes them too. They are not huge but seem to accomodate eveyone.", 
    "This is a great chair, I've had it for 3 years. The only downside is that if you're tall, you won't be comfortable in this chair. If you're short like me it is a great size. I'm really happy with this purchase.", 
    "comfortable and enjoy setting I it when not reclining a great looking wing chair", 
    "I bought 4 of them and I love them, I sometimes fall asleep in them because they are so comfortable.", 
    "I have never ordered a chair online so was a little skeptical. But delivery was very fast and the chair was easy to set up. I LOVE IT!!! Lots of compliments come my way for this chair!! Very comfortable and classy.", 
    "I bought this for it's look but it is not comfortable and you can not sit in it for long but looks nice it is where no one sits on it very cheaply made.", 
    "Bought two of these to complete the look in our den. They are the perfect size and comfortable. Great Quality. looks exactly like the picture. Easy to put together. Highly recommend!!", 
    "I love this chair. The price was great and the design is great. It went well with the sky blue/black/white theme I had in my small apt living room. The reclining option is great. Prop a standing reading lamp and a matching afghan and you're good to go.", 
    "A really great chair! Wonderful delivery and easy assembly!!!!!!!!!!!!!!!!!!!!", 
    "I wanted a recliner but also wanted a stylish piece of furniture. This piece looks great in my living room. And it only took about an hour to put together by myself. The only reason I'm not giving it 4 stars is because it sit a little lower than I expected but it's still a very nice chair for the price.", 
    "From the minute I saw this chair while browsing I loved it. Saw a few reviews with questions on the colors so I was apprehensive about buying. I wanted a chair just like this for a bedroom so I bought it. It is very comfortable, love the color ( more of a black and gray rather than white)but could really go either way. I love this chair and am very happy I decided to get it.", 
    "Never bought a chair before without trying it out first but this is perfect!! Very comfortable. Fabric is nice. Love it.", 
    "This chair is gorgeous and functional. Not sure about the reviews that state it is off-white, I see black and white, perhaps the white is slightly off as to not be snow bright white. I have a grey/black/white bedroom and it blends in beautifully. Buy the chair.", 
    "Love this chair and get all kinds of compliments on it! Had it almost a year now and my dad uses the recliner every day! Still in good shape!", 
    "The chair fits perfectly in a smaller alcove in bedroom. Great with red and black gigham bedding/decor!", 
    "I waited to review so I wouldn't provide just that new excited praise that comes with a new purchase. We've had the chair for about 3 months. It's very attractive, easy to put together and very comfortable. The padding and upholstery seem durable. its not a cozy type of chair, bite definitely very comfortable. Would recommend to all.", 
    "Got this to fit in a corner of the bedroom, and it does. Easy to assemble and comfortable to sit in (when I can get my cat out of it). Only complaint is it's not that easy to recline - you have to push really HARD. It does seem to be getting easier with each use, though. Happy with purchase", 
    "This chair is black and cream. It fits nicely into a smaller space. It was easy to assemble--No instructions necessary. It has a firm seat and back, so you don't \"sink\" into it. The weight limit is 220 lbs. I don't think it would wear well in a family room with a lot of flipping and flopping around, but it is a beautiful addition to a more formal living space. Love it in mine!", 
    "She LOVES IT!!And so does her cat.", 
    "I bought 2 of these chairs,and I love them.Their comfortable, and Look very expensive.Im a good overstock customer.They make it so easy if you want to return something.", 
    "I read other reviews on this chair and still decided to purchase it. Most of the review I read were very close to spot on. The chair itself is not white but actually I think it has a great look to it. It isn't the most sturdy chair I have every purchased it I think for the price and what I needed it was a great option.", 
    "Bought two of these recliners. Assembly was a bit challenging because the instructions were confusing but once I figured it out, I put it them together quickly. Overall I'm pleased with the look. Make sure you either have something to cover the seat or do not let anyone sit with dark clothing that may rub off on the fabric otherwise the white portion will get dirty fast.", 
    "Read the product info, the photo looks black and white but the background is actually off-white, possibly a light mauve although that is masked by the black pattern. Not the most comfortable or well-padded chair ever but fantastic for the price.", 
    "The chair is very comfortable and everyone sits in it when they come over, perfect size for my living room as well.", 
    "love this chair beautiful addition to my room", 
    "I love the look of the new chairs. They add just the right accent to the room. However, the chairs are very rigid and not very easy to put the foot rest in the up position. Also, the top of the chair (the pillow portion) is not stuffed very much and is already starting to flatten.", 
    "The recliner was very pretty, but much too small for my living room. I returned it due to a pull in the fabric in the seat cushion. Basically not that great of a deal.", 
    "Chair was perfect for my living room! Small, yet comfortable, with a thicker quilted material than expected, very Sturdy if you have dogs! Mine was white and black, some said that it looked cream colored, but it's white to me! Pull out leg rest was a bit shorter than I expected, but I am 6' and it's still comfortable. Well worth the money!", 
    "I was wanting both a chair and recliner to match my black couch and this is it! It is very firm, but I love it for my back. I've fallen asleep many times as it reclines into a great position. I was pleasantly surprised and would buy it again!", 
    "Excellent chair that reclines way back. Color is just like the picture. Very comfortable. Just what I've been looking for. Very easy to assemble.", 
    "This chair is one of my favorite pieces of furniture. It was very easy to put together and is definitely comfortable. I've been using it for about a month now and haven't noticed any problems. The reclining part of the chair works well for me and doesn't scratch the floor. The fabric has a nice feel to it, like a quilted texture, though a little rougher than your average quilt.", 
    "Great chair , a bit small for a male but great for females/kids...High end look, for peanuts!Thanks Overstock", 
    "I use this chair every day. I love how it feels and how it looks. Great purchase for the money!", 
    "Nice and firm for the seat and plush and comfortable on the back. Also a good size for a smaller room but would probably hold it's own in a bigger space than I have.", 
    "Perfect cottage size recliner. Not the most confortable but looks cute!", 
    "only thing that i wish i knew before buying was the white fabric of this chair is very cheap looking up close. from afar, the chair is beautiful, but up close, the material is not very flattering nor is it very soft. but its very beautiful in the corner of my room.", 
    "however gets dirty really quickly because of white background but really comfortable everyones favorite chair", 
    "The Chair was awesome and easy to put together.", 
    "This recliner fixes prefect in my dressing room to provide a great escape", 
    "I was kind of worried that I wouldn't like them (I bought a pair) or I would tire of them or they would be loud in the small room. I couldn't be more pleased. They are so comfy & look great.", 
    "chair is attractive, functional and fits well in my space", 
    "Purchased this recliner for our new family room space and just love the look of it. When it arrived and we put it together I was immediately sure about it because it looked perfect. It is just my size! I am 5'3'' and am normally swallowed up by a regular recliner. My feet touch the ground, its comfortable and the fabric, a beautiful print. It goes with everything. I can easily operate it so that I can actually lean back and doze or read a book. I can 't be happier with this purchase and the price was one I could not resist!!!! Love it!", 
    "This chair is beautiful, sturdy, and easy to put together. I originally ordered it for the living room as an \"accent\" chair but have since moved it into the bedroom because it matches in there better. Great chair for the price.", 
    "Although I love this chair and it looks great in my sitting area of a guest room. I must say, it sits lower and the back isn't as high as I had hoped. I was a little disappointed with that but the chair is solid and was a piece of cake to assemble!", 
    "Love everything about these chairs (bought 2)...easy to put together, comfortable, stylish....EXACTLY what i wanted", 
    "I am very pleased with my purchase. It was a good price for the value. It is sturdy and the coloring is perfect just like described. Some people call it more like a beige on black, I'd say it is true to color and maybe an off-white. It is stylish. There could me more cushioning and the recliner part is not well made it seems because it is stiff and doesn't go down with your legs?? Otherwise, I am happy with my purchase and would recommend it. Also, delivery was on time and easy to assemble.", 
    "This chair is comfortable and very sturdy it's color blends in with our other furniture. we love it.", 
    "This is a great purchase. I wanted a comfy chair for reading and relaxation, but also a piece that would look great in the room. This chair gave me both. Comfy, great texture, and reclines well. Also, a great price. The room is white and black, so I wanted the chair to blend in. Some reviews were saying the white was more like beige. Although the white is a little darker (maybe closer to off white), it still blends really well with my black and white curtains and white furniture.", 
    "The recliner was very comfortable and just as described", 
    "Chair is decent, but quality is not as good as expected. Fabric Geels cheap and the chair seat height is much lower than expected. Color is more like gray and black, not white and black. But, it arrived on time and in good condition. It assembles easily and is fairly comfortable. It looks almost miniature next to my other furniture.", 
    "I am really happy with this chair. The colors are true. It is not a big chair. It fits in a small area. It is a great chair for smaller people. I don't think it would be sturdy enough to support a lot of weight. But for an apartment or low use area I think it is great.", 
    "The black floral design is not as high contrast as the picture makes it seem. It's more of a very dark grey rather than black. Subtle difference, really. Assembly involves jinstalling the legs with wood screws that are supplied, and placing the back on the reclining base. The reclining mechanism is fully assembled and works great.", 
    "This turned out to a very nice chair.", 
    "Nice looking, easy to operate, comfortable; and well priced.", 
    "This was picked as a gift , however the color is NOT black and white as stated , but taupe in fact .", 
    "loved the way it looked on line.Looked the same when arrived. would order again. love it.", 
    "It looks OK but I think it's a little busy I do not find it as comfortable as my other recliner !", 
    "Beautiful chair and very comfy but not very sturdy !", 
    "For the price this is a terrific recliner! It's a beautiful addition to the living room. I should have paid more attention to the dimensions, as it doesn't supply head support (the back is too short) but it's my fault that I missed it, and it can be easily remedied with a pillow. Love this chair!", 
    "Have had this chair in our master bedroom for a little under a year. It is comfortable and funtional. This is not the highest quality chair, but it is perfect for light duty. The colors are black and white, not creamy.", 
    "This chair was easy to put together and the perfect accent piece in my living room. You cant tell its a recliner at first, which I like. Its a super comfortable chair too. Overall great product for the price.", 
    "I was skeptical about the chair & price when I ordered it. Turns out to be a perfect addition to my home. The color is a bit off, but in a good way. Makes the chair look more modern, despite it's classic style. Love this chair!", 
    "Love this chair very easy to put together and came in a timely manner the material is great love the color the more I use this chair the more comfortable it gets well worth the money if I had more rooms I would buy more this product is great.you can sit up straight and still recliner legs in the upright position very easy to use", 
    "The Simple Living Wing Recliner is just the trick for relaxed reading. The back leans back just a little, when the foot platform comes out. I need a neck pillow for reading, but other than that extra, it is a very comfortable chair. the foot platform is a little tight pushing back in, (I am sixty eight and don't have the strength in my legs as i used to) but is not that difficult. The chair seat cushion is a little stiff, but in time will soften up, I am sure.Putting it together is a charm. You have to screw in the four legs, and secure with two screws each, all included. The put the back on, by sliding onto two brackets on the seat. Very easy, again, I did it without any help. the color is black and off white, Love the chair.", 
    "Disappointed with the sturdiness and comfort of this chair. It is more squat than what it looks like in the pictures and the pattern is off center. The recliner mechanics wiggle when extended and feel like they are going to break when compared to a $20 recliner bought at a garage sale.", 
    "The chair came un damaged and was simple to put together. Sits firm and comfy. Only wish it stood a little taller", 
    "This is a beautiful chair that goes perfectly in my den. Comes in two pieces and is very easy to put together. Now I have my own little quiet spot to enjoy a good book or watch TV.", 
    "Chairs look nice in out living room, but already showing signs of wear after one year.", 
    "I have gotten many compliments on this chair. It's comfortable and looks nice. It is small and not the over sized chair I thought I was purchasing. Overall. i am very satisfied with my purchase.", 
    "Classic pattern that can be mixed and matched with many different color schemes.Decent chair for the cost. Happy with my purchase.", 
    "Quik delivery, easy to assemble (though instructions left much to be desired) It was just easy to figure out It's a small reclinier which is what I wanted but no 300 pounders please Was NOT disappointed with the pattern I have a very old cat who has taken over this chair & he is very discerning!", 
    "I got this expecting it to be a little stiff and uncomfortable...needing a throw pillow or two...according to other reviews. It started out a bit stiff but after a weekend of use...it's great...nice and comfy...doesn't need anything.", 
    "Chair is very good looking but very uncomfortable; need two pillows behind back to keep neck straight. Otherwise, my neck hurts and gives me a headache. To get the foot rest out takes all my strength and to get it back have to pound it with my heels. I am very sorry I bought it and would return it if possible.", 
    "I bought this for my mother when she visits me in FL. She sits in this all day to watch TV and quilt. So easy to put together, just slip on the back and attach the legs. When she is not here I put in the guest bedroom. Very nice and excellent price. Thank you O.", 
    "This chair was easy to assemble (just the legs and back need attaching)The packaging did not include the 8 screws needed, but I had 1-1/2 screws, so that was not a big deal.The back of the chair attaches a little weird, but the beauty and comfort of the chair greatly outweighs those quirks. I only have had it a few weeks and so far it's holding up well. The size of the chair is a medium. It's not a small chair as some reviews have claimed. It's replacing a small arm chair I had in my office, and in comparison this chair is almost twice the size in height of the back & seat space. The reclining feature is very relaxing.This is a beautiful chair in style and comfort. I highly recommend it.", 
    "I had 2 issues with the recliner: 1) the fabric was bad quality to the point where is get an allergy touching it 2) the design looked faded and fabric had crossed lines making it look a bit cheap It was a bummer because the size, structure and design was exactly what I was looking for.", 
    "We were looking for a recliner chair that was stylish and not too bulky. This wing recliner works perfect in that sense. Its very functional and stylish so it does not look like a recliner chair at salons etc. The design is very very stylish. It was very easy to put it up. The only thing that one should be aware of is that while this is a great recliner, its not very heavy duty. So while it works perfectly for us and our needs, it will topple over if you try to push it too far back. So you have to be a bit gentle with it when pushing back. But at the same time, it does need a little extra push to get it to the recline position. Once in that position, it will slide back smoothly.", 
    "I wish I could give this chair 5-stars but alas! It looks great and I can't help but fall asleep in it practically every time I sit in it. But it's not for everyone. I am petite 5'1\" and it fits me perfectly. My husband even likes it, even though his feet completely is off of the end of it when it's reclined. I bought it to finally have a chair that would be my little size, though, i kind of wanted a higher winged back, but as it doesn't support my head fully if i sit up straight. It came in 2 pieces plus the feet. It can be tricky to put it together alone, but easy enough to slide the back into the base together once aligned properly. As for usability... I've had it for half a year and use it fairly frequently as it is in my office. But from the get go, there is an annoyance with it, that doesn't bother me enough but it may bother others. The motion of reclining isn't good. When it is closed it is fine and when it is open fully it is fine, but the in between stages isn't quite smooth, in fact it's quite 'loose'. It will want to close if not all the way back but it doesn't close all the way automatically either. As for durability... I would say be careful with it. i can see it loosen with time as it already feels a slight wooble. Not designed for quality. Despite all that, I still love this chair. P.S. the pictures shows it to appear black and white, but it is more silverish than white. It is not a smooth fabric either, which you might be able to see in the picture. The design is as nice as it appears in my opinion.", 
    "I needed a small recliner for my bedroom. When I found this one I was elated! The pattern was excellent for my decor. It's so comfy, and just perfect.", 
    "This was easy to assembly and firm but comfortable. Am buying a second chair.", 
    "I am so happy with this purchase! It was so easy to put together and it is perfect for reading a book, watching TV, taking a nap... I love this chair. It was the perfect chair for this price and looks so great in my living room.", 
    "Great accent chair! Very firm at first but has softened nicely. Looking for a second one to match.", 
    "Love the fact that I got one that was \"black & white.\" It's a perfect match for me and for my room. . . Feels very \"Paris\" just what I wanted.", 
    "The chair arrived right on time, as promised. It was easy to assemble (two steps) and it looks and operates great! It is everything the ad promised and I love it!! I looked for weeks for a chair that compared to this one's style and quality - and found none, even at twice the price!", 
    "This chair is very comfortable for sitting. I am a senior without a lot of strength, therefore I personaly difficult to use the recliner part. Might be a way to loosen it up? The fabric appers to look as though it will wear well and the design goes with most everything.", 
    "firm, well made, excellent value. needed something other than leather this chair was perfect. a little light on the arm foam and would have liked arm protectors.", 
    "Bought this chair for my daughter.She wanted a recliner for her nursery.She loves everything about it.", 
    "Cannot believe the quality of this chair and comfort level for **. The delivery was in two days. Love Overstock", 
    "I bought these chairs because of the pattern. I still love that however the quality is poor even for the price. The material is so thin you can see the black threads through the white. Also other reviewers mentioned the chair is more taupe then white. Mine are more white that has gotten dirty then anything. That may just be because you can see the black poking through. Another thing the pictures don't show is the material is quilted from some reason. It makes them look less modern then I wanted. Having said all that, I bought two because of the price and they are still the prettiest patterned recliners I could find. Unfortunately I needed regular use furniture in my living room so I have already started to save money to replace them.", 
    "was a present for the hubby, he loves it and already takes naps in it. was easy to put together as well.", 
    "I purchased this chair for my office so I would have something to relax in over lunch that wouldn't look \"out of place\" in an office. Chair is more of a creamy white than a true white but a nice looking chair none the less. Fabric appears good quality and comfy (firm) to sit in. Does not feel flimsy at all. Great buy overall.", 
    "I ordered this recliner because of the style and size. The minute I opened the box, I was amazed at the quality of the chair. The fabric is great and the recliner is well made. I absolutely love it!", 
    "Every time I would go to order these chairs would sell out! I finally got my hands on two of them and they arrived SUPER fast! They are a nice size a little bigger than expected but they are Seriously gorgeous! They really bring a room together, all my friends walk in and fall in love with my place ever since I've added them! Do yourself a favor and pick up this chair it is a classic patter and isn't going anywhere!", 
    "a little disappointed in the quality..but for the price it is nice and will do till I can upgrade, a bit.", 
    "I am thrilled with this chair! I spent a great deal of time trying to find the best chair at the best price, and this was it. It is a very attractive chair, and it's even more comfortable than I had hoped. It was very easy to assemble with just a screwdriver, and I've been enjoying it ever since.", 
    "DAUGHTER LOVES IT, BOUGHT IT FOR HER BEDROOM...LOVE THE STYLE! LITTLE TOUGH TO RECLINE, FABRIC IS NOT TOP QUALITY, BUT LOVE THE COLOR & PRINT...VERY STYLISH & COMFORTABLE.", 
    "I would be careful with overuse by children. The is a great value for the money looks great, but can tell it's made a bit cheap, but that worked for me.", 
    "Love my chair It is small sized and does not look like a recliner.just what I have Been looking for ***", 
    "A lot of the review said that they had received a chair that was more of a taupe color with black, I really wanted that combination, but received the black and white which was just fine . Its a great size for me Im 5 foot nothing and its perfect,,Im sure my 6 foot plus husband wont like it,,but I bought it for me... I have it in our office, I needed a chair to fit in a small place and something comfortable enough for me to sit in while I watch tv. the only bummer thing is my dumb cat started to sharpen his nails on it and the fabric frayed easily ,I was in the room and it was just seconds when I yelled at him, it will not hold up to that kind of abuse,, the cat is locked out of that room.... I have already had complements on the chair, my daughter wants to steal it from me !", 
    "These were not bad chairs for the price. The fabric is a bit of a loose weave but the design looks nice. They are a bit stiff in terms of the reclining function. This may loosen up over time. It's too early to tell whether they will last very long or become easier to use. I would put these in a bit of a you get what you pay for category. They were not too expensive, and we do not plan to use them heavily, so for our purposes, they are fine. They are a bit small, but I'm also a bit small, so I actually was pleased with that.", 
    "Overall, the chair is nice. I had hoped for a cream background, but mine was white. Also, I found the leg rest to be a bit short. I am only 5'6\" tall, but my legs are long, and the end of the leg rest strikes at my Achilles tendon. After a short time that becomes painful, so I have to put a pillow on the leg rest.", 
    "This recliner was perfect for our room. It came at a great price and the size is ideal for our application. As usual, it arrived quickly and in perfect condition.", 
    "This recliner has great curb appeal for the deal. The chair is not oversized, which is what I wanted.. I am using black / white stripes to accent, and the only negative is that the color is more of a gray than a white or bone, but it still looks nice with my accent stripes. The other \"con\" is that the foot rest has a very thin padding so when you recline your ankles kind of rub against the frame on the rest. Not a biggie though and you could easily place a small pillow under your ankles if you plan on spending any amount of time reclined. Overall a great little bargain which packs a powerful decorating punch. As always, the customer service at the \"O\" can't be beat. I had to change delivery address mid stream and they couldn't have been more helpful and pleasant in getting it changed for me. Thank you Overstock!", 
    "I bought two of these recliners for pedicure chairs in my nail salon. I was concerned because so many of the reviews said the chairs were not black and white, but black and taupe. If they are taupe, it's very slight, and does not affect the black and white look I was going for. Overall, the chairs seems to be of good quality, and my clients love them!", 
    "This chair is absolutely perfect for what my husband and I have set up in our little house. My husband has a recliner and I wanted one as well but more feminine than what he has. When I was reading more reviews after I purchased the chair, I started to get nervous thinking that it was going to be too small and look like a child's chair, and that it would look cheap. The chair is very sturdy and it does not look like a child's chair at all! I am 5ft 11in and my feet do hang off of the foot rest but it keeps my legs up which is exactly what I wanted. This chair is VERY EASY to put together. I just received it today and I absolutely LOVE it!", 
    "OK It is not perfect but for me and my room it is. I wish I could enclose a picture. I am so happy with this purchase. I did hesitate due to the reviews of the color. My bedroom has a gray rug, black furniture and black and white spread. I accent with red, lime, teal and orange depending on the season. I had my wonderful glider chair in the room but it was brown. My 2 year old room is now complete. The chair has nice seat height and width, firm seat and back lumbar cushions, and soft fabric. The only negative is the large pattern in the back of the chair is not centered, it is off to the side by about an inch. My chair sits at an angle so I had to stare at it awhile before I realized it. I do not expect this chair to last as long as my quality living room furniture but for this price I will donate it when I change the décor in my bedroom. I have bought a lot from the \"O\" but this chair is my best buy for sure!", 
    "I just love this chair! I ordered it for my living room. It's really comfy...I am 5'9\" and have fallen asleep several times in this chair. Also great for reading! The construction is a little flimsy in some areas, and they should have taken the padding completely around the chair, but it looks so good that I can easily forgive those faults. I am very happy with this chair and plan to buy another to have a pair. The pattern is great and I have gotten lots of compliments.", 
    "This was a good buy. Looked all over for a recliner that wasn't too bulky so this was a great buy and the cost was less than the department stores. I love it!", 
    "This chair is perfect!!! It looks just like it looks on the site, it was easy to put together. It looks fantastic in my room. So happy with this purchase.", 
    "very nice chair. i love it. its not bulky and have plenty of space for it. the chair goes with anything.", 
    "It is a very nice chair, easy on the eye. Looks like a custom upholstered fabric. If you want to match black and white decor this is perfect. I don't think it's meant for everyday use though. It's a casual piece in my room that I use from time to time. I would definitely recommend it, especially at the price O has it for.", 
    "I have had this chair for about 1.5 years now and I Love it! I love the reclining function and it is easy to recline and return to sitting. The chair is very cozy to curl up and read. I think it is best suited for a smaller person. I think it would wear out faster and be much less comfortable for a taller or larger person. (I am 5'4\"). But it's perfect for me. It's my favorite chair and I use it daily. It does have some loose threads I need to cut off after this amount of time, but overall it has held up well and looks wonderful. The white is not bright white, more off-white or linen/natural.", 
    "Ordered the chairs for a nook in our bedroom. They are very comfy and recline easily. They are not used a lot so for the price they were a great value.", 
    "This is a gorgeous, comfortable chair. I put it together out of the box by myself in about 10 minutes. The other reviews are true, it's not a stark white, but it is very pretty and very comfortable. Highly Recommend", 
    "I wanted a recliner for my bedroom, but I wanted something different and not the same ol' leather ones. After searching for long, I finally found this one. I read the reviews and it sounded like a good deal. The price was reasonable and the chair looked really pretty. I didn't want a leather recliner as I wasn't too comfortable with how it easily adapts to the surrounding weather (when its hot or cold the leather is hot and cold). I wanted a recliner that was cloth based, that looked like an accent chair but still functioned as a recliner. It matches my room decor perfectly!. The chair arrived within the week of purchase and the assebly was relatively easy. The reviews warned me of the color change and I expected it not to be white, so I was okay with that. I love my chair and its super comfortable! I'm glad I bought it!.", 
    "Shipping was as expected (no delays) and it was easy to assemble. This chair is definitely comfortable enough to seat through a movie. It's an added bonus that it reclines (many don't expect it to) and it's easy to push back without trouble. Definitely receives great compliments from friends.", 
    "Very pleased with the quick delivery. Assembly was surprisenly easy. The chair is very comfortable and matches my furniture even though the white is not a bright white as shown.", 
    "The chairs are not as great as I expected. Colors are drab as its not a bright white background. We bought two and we had to put additional spacers on the front legs because the foot rest foot rest drags. The floor without them. Overall,, disappointed.", 
    "Yes, the color is just what I expected it to be. It is NOT taupe....it's slightly off white. It isn't the quality of a Lane recliner but then, it doesn't cost anywhere near what my wing back Lane recliners cost either ! It's perfect for my personal home office where I do all my crafts and computer work and reading. It isn't for a big family with constant use, but for a bedroom or office space, it's ideal. Everyone who has seen it thinks it is beautiful and I just love it! It arrived on time and was very easy to put together, although I did have my husband helping me!", 
    "This a a smaller attractive comfortable recliner. I love it and its a nice statement in the decor.", 
    "This chair was just right for the room. The style and color fit. The hand of the fabric is a bit rough, but not uncomfortable. Arrived quickly and in good condition.", 
    "Pleasantly Surprised these chairs were perfect. Large great quality and easy assembly! Very comfy and recline very nice. I wish I had more places to put more of these. Perfect for an accent chair or den.", 
    "The chair is quite comfortable and I tried several recliners on my search (found that a lot were too hard or too soft so you sunk into the seat too much). I loved the demask pattern and the quilted material, which I wasn't expecting, added more character to it. The recliner goes back to a really comfortable level and is easy to recline (sometimes recliners are hard for me to get back or stay back). The footrest could have a little more padding but it really isn't something that bothers me when I am sitting in the chair. I will say that when you are putting the back on the chair you want to make sure that you push ALL the way down so it COMPLETELY clicks in. It seemed like it was completely click in (like it wouldn't go any further) until I looked at it closer and realized that it needed to be pushed down hard and it will click in tight. I am so glad I chose this chair out of the several that I looked at. The pattern adds so much to my living room and it is comfortable to sit in for hours while watching movies which is just what I needed!", 
    "I was actually not going to be disaapointed if my chair arrived as black and taupe because I could have worked with that. However, it matched the overstock description and is black and white. My disappointment came when I opened the box and saw a chair - no packaging what-so-ever, in a badly damaged box. The back of the chair was mis-shaped. Actually, the problem is the padding in the top of the chair back is insufficient and gives no reason to hold a shape. I have kept the chair and see the problem as one I notice, but who else will? I'm on the small side, so the recliner works fine for me. I am not concerned about the chair tipping or wearing out the mechanisim. Easy assembly - you just slide the back into brackets on the seat. You get what you pay for, people.", 
    "Perfect reading chair! It is very comfortable and classy. Easy to put together. Great price!", 
    "The fabric wasn't sturdy. I was concerned that it would wear out quickly. Also, the upholstery design wasn't centered on the chair (a pet peeve of mine).", 
    "Fell in love with these on-line and bought them for a specific room. Chairs are not black and white. Mine were black and grayish. From the reviews I expected them to be ivory which would have worked. They are very low to ground. About 6 inches shorter than the chairs I was replacing in part due to short legs and also very thin seat cusion. Foot rest catches on floor and is difficult to raise and lower. Back was not as \"stuffed\" as I would have like either. Looked a little empty on the top cushion. They are very stylish and would be perfect for a library or bedroom where they were just for show and not for normal use.", 
    "Great accent chair to relax in. Everyone periodically falls off to sleep on it. Extremely comfortable. The Wing Back Chair design actually adds a touch of elegance to the room. Could fit well into a contemporary room design. Has an air of romance to it. Easy to assemble. Took about 20 mins to have it put together. Durability-so far so good. It reclines by weight, and does not have a lever or any kind of mechanism. Long and wide enough to fit people around 5ft 8 inches. Great buy for the money spent. I had looked into other stores like Pier1 which had chairs without any reclining at the same price and decided to go for this.", 
    "UPS left this on my front porch. I opened it myself and it was very easy to put together. I have a computer armoire and this chair looks fabulous with it. I get compliments from our guests. And it shipped out right away.", 
    "This chair is a great buy! It's comfy and pretty and well worth the money. The only criticism I have is that the feet are kinda wonky.", 
    "The chair is GRAY and Black so beware if you actually need it to be white. Chair is okay for the price, fits nicely in my room design.", 
    "I love this chair! Its smaller, perfect for an apartment. Super comfortable and easy to put together. Its very stylish and while the photo shows the footstool extended the entire back reclines all the way. I could live in this chair.", 
    "I would highly recommend this product to anyone that is looking for a smaller chair. Fits a woman perfectly.", 
    "Styling is nice and not humdrum boring. It is a nice decorative piece to add interest in any room. The upholstery is soft and the chair is quite comfortable when reclined. The feet were installed with no difficulty and the back merely slips onto the base and snaps on securely with minimal effort. The seat of my chair is positioned so that the spacing is a little off center (a bit of a gap on one side where I can see the floor underneath; however, some gapping is probably to be expected for a recliner and it is easily hidden with a pillow or throw. The shipping was super fast. The shipper left it on my front porch without calling me (would have been the courteous thing to do).", 
    "Purchased the chair for my mom for Christmas, ordered it Monday morning...it was at my house on Wednesday! Great shipping. The quality is great for the price! Would order this chair again. Love it!!!!!!", 
    "I read the reviews so I expected the wing recliner to be black AND off white. It was somewhat easy to assemble - it was human error (ME) that delayed the assembly of the chair. Overall, it is a beautiful recliner that I fully enjoy a great deal. It is not used as a decorative piece, but as a reading chair in my bedroom and I have been known to fall asleep in the chair.", 
    "The chair looked nice but was not very comfortable. The back did not attach to the chair perfectly and would come off if pulled on slightly. If you are looking for a chair to \"cuddle-up\" in or read a book in this may not be the one for you. With tha said, customer service was wonderful. Sent shipping lables for a return in a timely manner. However, I did have to bring boxes to a UPS store, which was quite difficult given the size and weight of the boxes.", 
    "We purchased 2 of these chairs and they are lovely and very comfortable. I wish the print in the fabric was a little crisper with sharper lines. One of the chairs came with 2 left legs, which o.co corrected by mailing us a new set of feet. However, that chair has a clicking sound when my husbands sits in it, which the other chair doesn't. But he doesn't seem to mind it so we've decided not to go through the return process. All in all, we love the chairs. Haven't sat on our sofa since they've arrived. :)", 
    "The size was great for our apartment and it doesn't look like a recliner when in chair mode. my husband loves it and it is super comfy. Assembly was easy.", 
    "I love these chairs. I ordered two to use as a matching pair in my newly created library. Easy assembly...ten minutes/chair. Lovely quilted pattern making the chairs look extremely expensive. The damask pattern is beautiful and very classy. Won't disappoint in any way. Love that they are recliners. Very comfortable seating for reading.", 
    "I bought this chair for reading. It's very comfy and it's a great size. I get compliments on it all the time.", 
    "This was a nice addition to a family room...my granddaughter loves it!", 
    "I love this chair. It's a great accent piece of furniture but it's also quite comfortable to sit in. It's not super soft - definitely firm- but I was amazed at how quickly I settled in for a nap. I was nervous that the white color would be closer to a cream because of other reviews but I think it looks exactly like the picture. There were some strings I had to trim off but it didn't bother me. Nice and easy to assemble and very pretty! I'm happy that I bought it and will be purchasing things from Overstock more often!", 
    "It's perfect for me. I was looking for a reading chair for my room, this chair is super cute, I love the pattern. You can beat the price, chairs smaller and plainer than this one run much more than this. I would not recommend it for anyone who is really tall though.", 
    "i cant wait to order another looks great as my accent piece", 
    "I could unpack this by myself, though I will admit that joining the back to the base was easier with the help of a friend. I have a white-painted library and a black carpet - the recliner was perfect and the price was more than right!", 
    "I use this chair in my bedroom. I love being able to put the foot rest up and work on my laptop or watch TV (yes, often at the same time.) It's great to put my feet up without having an ottoman taking up space. It was really easy to put together, and like another reviewer said, I did have to cut a few loose strings. But for the price, I couldn't find anything close to this quality and style anywhere. I like that it's not a big, puffy, overstuffed recliner. If you're looking to sleep the day away in it, this probably isn't the chair for you, but if you have a small space and like to sit with your feet up, you can't go wrong with this item.", 
    "The fabric on the recliner is very nice. The pattern is very sharp. Assembly was a breeze. It would make an excellent accent piece for an apartment living area or in a bedroom. It reclines easily. We would recommend it highly at this point. It remains to be seen if it will hold up under everyday use, or if it will withstand people sitting on it who are larger individuals.", 
    "Bought this chair for my daughter's bedroom. She loves sitting in it. It was a nice addition, stylish and comfortable.", 
    "This is a small scale, lightweight chair with a chic pattern . Have a phillips head screwdriver ready and you can put the two pieces together in 10 mins. I am a senior widow and carried each piece. up a flight of stairs easily, then assembled in a bedroom. I was hoping for a taupe background as others mentioned; my chair is black with a slight off white background. This chair is fairly low to the ground. Reclining requires some muscle. Might be difficult for a frail person. I will try lubricating the mechanism. I like it!", 
    "I absolutely love this chair. It is beautiful. It only took about 5 minutes to assemble.", 
    "This chair was perfect for what I wanted it for, it sits in my bedroom and works out really well. The white color isn't real white but I had seen that comment on another review and knew it would work with my other colors so I'm very pleased with it.", 
    "I had a small nook in mind for this chair, and it is beyond perfect. It comes in 2 pieces which were easy to carry upstairs. The four legs are screwed on and then the back slides onto the seat. Assembly took about 10 minutes. Other remarks about the color contrast are true, the white is not as bright as it appears in the picture, but for the price I am very impressed!", 
    "I am very pleased with this recliner. It was easy to assemble and fits into my living room motif perfectly. It's not a very easy chair to recline, but I don't use it very often for relaxing purposes so it doesn't bother me. Good chair for the price.", 
    "Love this chair for reading. It is very comfortable and is holding up really well after using it for almost a year. We had a few problems getting the legs screwed in all the way as the front legs would get stuck on the spot where the material was stapled. Had to unscrew slightly to get them lined up well. I was worried that would impact how sturdy the chair feels but it hasn't.", 
    "Great chair for small spaces. Using it in a bedroom. Fabric is beautiful both online and in use. Size is appropriate for a ladies' chair but too small for some men.. No mechanical lever. Must push hard with arms and legs. Main objection is the offensive smell. May not be a problem to others.", 
    "Everything about this chair is great...except the color. The black and white does not pop as much as the pic depicts. If you do not mind the not as bright white and black that is tinted with white then it is a great chair. Be cautious if the color contrast is extremely important to you.", 
    "I did expect a smallish chair, since I read the reviews & ordered it anyway, and was surprised that it was not a small as I thought it would be. I'm 5'6\" & thin, and it feels perfect for me, but wouldn't recommend for anyone bigger!!! My husband however won't be using it much, & it does not seem rugged enough for an everyday piece. Perfect as an accent in my parlor room & for early morning reading, but fabric is rather light (doesn't seem upholstery-like). Time will tell how it holds up, but I'm satisfied for the price.", 
    "Only the color was a bit of a disappointment. I thought it would be a whiter white and blacker black. The scale was perfect for my needs. I am rather small and so is the chair. Assembly was simple and I did it by myself. Great accent for a bedroom. I would buy it again!", 
    "So happy I did not listen to the person who was not satisfied with her purchase and went ahead and purchased the recliner. One of the best purchases this year. Very happy with the color, fabric, height and size of chair. The recliner exceeded my expectations, I weigh 170 lbs. and I have plenty of room in this chair (sitting in it now) with room to spare. Worth every penny I paid. Thank you Overstock.", 
    "love this piece...small scaled...perfect fabric....comfortable...affordable..... :)", 
    "I absolutely love my new chair. I'd been searching for a chair with this damask pattern for months, wishing there was one available as a wing chair without having to pay the big bucks for a custom job, before finally giving up and settling on a chair from Rooms to Go KIDS that had a black and white flower pattern on it. It cost $300, and that was before tax and delivery charges. Plus, it was for a child! When I decided to search Overstock one last time, I couldn't believe my eyes when I saw this chair, it was absolutely perfect, everyone I showed it to agreed it was perfect, and the price was pretty amazing. I read the measurements, and was kind of skeptical about the height, thinking it wouldn't really be that low, but it is, it really is only that tall. It doesn't look bad though, and it's very very comfortable. My only slight complaint is that when it reclines, actually when I'm folding it back up, the footrest scrapes against the carpet, keeping it from folding up on it's own, I have to manually push it into place. But maybe a different flooring type wouldn't do this, and it's no where near enough of a problem to make me any less satisfied with my beautiful purchase. The upholstery leaving something to be desired in the way of texture, but a nice throw makes this all but immaterial. Besires, the pattern is so lovely.", 
    "I bought this chair based on a few of the reviews and because of the photos and price point....this chair is cute, very low to the ground as another shopper stated. If you are looking for an accent piece, this is a good buy. If you are looking for an every day recliner, do not buy it, the quality is poor. I had to use pliers to fix the area where the leg screws in and the legs don't look even....the fabric is MAYBE 4 out of 10 stars, it looks like it is going to pull in places and would stain VERY easily. I am using this as an accent chair in a guest bedroom and I would return it if I had purchased this for every day use. From an assembly standpoint, it is really easy to put together, with the exception of the staple that was in the way of the screw piece. That was easy enough to fix. The chair comes in two pieces so all you need to do is screw on the legs (I used a powered screw driver, so easy) and then affix the back to the base, which is very simple.The shipping was 2 days, I couldn't ask for quicker and cheaper shipping!", 
    "This is a very cute chair, but by no means dont think it a big recliner! I'm 5'3\" and it's a my size chair. Sits low to the ground. It's perfect for the spot I bought if for though, so I shouldn't complain. The pattern is not quit as contrasty as the photo color wise nor is the black as solid as the photo, and I'm going to have to snip some extra strings hanging off. Other then that it is a comfy and very cute little chair.", 
    "I'm so happy to have this recliner. The quality is great! It's comfortable, It's comfortable, a great shape, and was simple to assemble. It could totally reclined with your feet and all pressure off the back. That's wonderful. The flowers and the color is exactly like the photo. Fabric very nice. Sitting here, this chair really makes you smile!", 
    "Much smaller and lower than expected. Not impressed", 
    "Inexpensive, cheap. The material sucks but is easy to put together. Feels cheap", 
    "very poor quality..not what i expected.. too light built..overpriced for the quality..", 
    "The fabric hurts my skin when it touches, even through the clothes. When you sit on it it's like cardboard.", 
    "Fabric was terribly cheap feeling and looking. i doubt it would hold up to a year of use. I returned it for a better chair.", 
    "Is the chair built to last a lifetime? Probably not. But, it is perfect for the price, and if it's the color/style you're looking for then it's not a bad purchase Overall I'm very happy with my chair. I'm using my chair as a desk chair for my home office, the desk is black. The contrast is just beautiful. Of course, I can't take full advantage of its reclining feature.", 
    "I was a little nervous about ordering chairs on line, but I feel in love wth the black and white Damask pattern. It would look perfect in my newly remodeled living room. So I held my breathe and ordered them. I was surprised and pleased when they were delivered. They look perfect and look stunning next to my black and white fireplace. They are not a high-back wing back chair, but still look good."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Wing-Recliner/4692750/product.html?recset=08151292-e7bc-4ff3-b0b6-7f4c93112dc1&refccid=AD5P3RGF2HAIAZ2HPMZ2CDFKTI&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4692750/Black-and-White-Wing-Recliner-L12609543.jpg"
  ], 
  "description": "Relax after a long day in this reclining wingback chair. The\ndurable wood frame holds up to 220 pounds, while the polyester\nupholstery and padded seat provide extra comfort. A black and white\nfloral pattern and decorative wooden legs give this wing chair\nrecliner a formal look with the casual comfort of reclining action.\nThe neutral colors allow this black-and-white recliner to fit with\nmany color schemes. Color pattern: White and black floral print fabricUpholstery material: 100-percent polyesterDimensions: 36.25 long x 30.75 inches wide x 38.5 inches\n  highSeat height: 17.25 inchesWeight capacity: 220 pounds         StyleTraditionalMaterialFabric, Polyester, WoodFinishBlack, WhiteChair TypeReclinersAssemblyAssembly RequiredColorGreyFurniture Frame MaterialWoodFurniture PatternFloral, Print"
}