{
  "name": "Simple_Living_Glass_Sliding_Door_Stackable_Cabinet", 
  "price": "EUR 109.15", 
  "reviews": [
    "We got this cabinet to place in our dining room and to store nice dishes, servingware, etc. For the price, this is a fantastic product, very sturdy, yet lightweight. You can't stack really heavy things on the top shelf but that's ok. Some reviews said it was difficult to assemble and they had to re-drill holes. We did not have this issue. If your holes don't line up, most likely it's not right. (There is a white version of this with better reviews to read) We had a piece backwards at first and that was the issue. There are lots of screws so that takes some time, but overall it was pretty easy. We attached fabric to the insides of the doors so that our items weren't visible and it looks like it cost 5x what we paid for it..", 
    "I am so impressed with the material and the outcome of this cabinet. The instructions were excellent and very easy. I would tell anyone to buy this cabinet and above all trust OVERSTOCK for your needs!!!!!", 
    "This is cute for any room. I use in dining room and put my wine and wine glasses in it. Smaller then I thought. The sides are open no glass.", 
    "Matches the Simple Living Sliding Door Cabinet - The glass on this is real glass, not acrylic.", 
    "This is beautiful to look at and holds alot off things. I stacked mine three high, nothing heavy though. It is impossible to close contents off from dust, or view from the sides. The sides are open, with no acrylic. There isnt even enough room to cut a piece because of how the shelf fits in. This disappointed me, but its still a keeper.", 
    "I purchased this piece to place in my dining area. In stead it's used in my living room holding crystal glasses and a couple of decorative vases. Easy to put together and I get so many compliments. I love it!", 
    "And they look beautiful. Not a complaint, but a comment: more difficult to put together then expected.", 
    "Easy to assemble and very spacious.", 
    "I like this cabinet. Easy to put together and it gave me some extra storage. (and yes, the ends are open, which I don't mind). I stained the door tracks to match the cabinet. It fits a lot of things inside despite the size.", 
    "beautiful and the doors slide very smooth", 
    "Cabinet is pretty solid, easy to put together.", 
    "the cabinet was easy to put together and looks very nice the doors are easy to slid and I like the color. only drawback was I thought it was bigger than it is. so check the measurements you are looking for first.", 
    "I put my china in it. It had been stored for years. I am very happy with the outcome...", 
    "I needed a place to put my antique dishes where I would be able to enjoy them and this is perfect. I may eventually put glass in the sides too as they are open in the cabinet but for the price I can live with that. Shows nicely and I put mine on top of a bench that is the same color to elevate it a bit. Easy to put together.", 
    "We needed something to fit under a large window and this was perfect. We did not put the feet on them so the are the same hight as the window sill. Perfect", 
    "Added this to the top of the solid door cabinet and set out whole kitchen off with the red and white dish sets!", 
    "Made one piece in the room be two solid doors & one glass door cabinet. I liked it so much I ordered one more solid door & another glass door to stack on the other side of the room.Two issues with the pieces. They have a VERY strong varnish order that takes a while to go away. I needed to air out the room even though it was February in upstate NY.. The other issue is the doors on the bottom cabinet, when stacked three high, don't slide as well. They moved well before I made it the bottom of the stack.", 
    "I really like the stand it's not the color I thought but not no complaints it beautiful", 
    "The color is accurate from the picture and it was easy to assemble.", 
    "The pictures makes it look bigger than it really is but overall it was nice and easy to assemble", 
    "Do not buy this unless you are okay with buying starter pieces, It was not worth the price, I purchased 4 of these and I wish I would have went to a furniture store as I spent as much money as I would have at an actual furniture store.", 
    "Only bad thing is the sides are open... but a great piece", 
    "Nice cabinet, no issues. Looks like an expensive piece of furniture. Easy to assemble. Note: sides are open with slats although front doors are closed. It was noted by another customer but I didn't pay attention to it until I saw the finished product. Still a great cabinet.", 
    "Prior to ordering this item we read reviews previously submitted, some were positive and others were negative. We ordered 2 units and as we have experience putting this type of item together in the past we found it straight forward. It took maybe 20 minutes for the first and little more than 10 minutes to complete the second. We ordered a third unit as we were very pleased. This product was exactly what we hoped for to place under a wall mounted 65\" TV to display odds and ends.", 
    "Please be aware that the sides are open on those two slats! It is not fully enclosed, which means anything can crawl into it and dust gets into it as well! We had to make something to put on the inside of the sides just to keep the dust out! Not happy at the size of the piece for the price & lack of seal. Big dishes do not fit.", 
    "I needed a little extra storage space in the kitchen, without making it look cluttered. This cabinet did the perfect job and I can always add to it if I need more space in the future because it's stackable. For now, I only need one and it looks GREAT in the espresso colour. It was also very easy to assemble and was able to do it by myself.", 
    "This is a very nice display cabinet. I put my Crystal Bowls in it. For the money you can't beat the product.", 
    "The Cabinet wasn't a big as I thought it would be but I loved the way it worked in my living room. I had my husband make legs for the Cabinet and now it sets us about 6 inches from the floor. Love it.", 
    "Wonderful piece for my daughter's home!", 
    "Upon arrival of this item, I kept thinking there must be two panels to assemble to get the look I'm looking for. Our home is relatively large and this was to be used as a sideboard in the kitchen. That was totally my fault, I should have gotten the measuring tape out to make sure it was a good fit. The picture looks one way, but the dimensions are listed. Be careful. When assembling the product, the top is frail - when screwing from the underside (as instructed) the screws punctured through the top. We had to go out and buy color covers to disguise the six punctures in the top. Needless to say, this cabinet isn't used in our kitchen, but it my daughters room as a bookcase.", 
    "A little hard to put together, cuuuute after!", 
    "I love this item. Was easy to assemble it took my husband and I about 45 min. Rest assured item is as pictured.", 
    "I ordered two of these and one of the matching sliding door cabinets to use as a hutch. Upon arrival, one of the boxes was almost entirely open. The other two seemed to be intact. I accepted the shipment. Once I started putting it together, two of the side panels (from different boxes) were pretty badly scratched. There were wear and tear on other pieces. Luckily, I was able to \"hide\" most of the imperfections on the side that is facing the wall. The item description states, \"Materials: Engineered wood, tempered glass\" I don't see cardboard included in this description, which would accurately describe the entire back side of all three items. It is definitely far from solid would...it's solid something. If I didn't just move into a house with minimal storage, I would have returned all three. There are definitely better products out there in the same price range.", 
    "very space efficient and easy to put together.", 
    "Not as tall as I would have liked but overall I am pleased with this purchase. It was easy and quick to put together. I don't know about stacking, it would have to be fasten to the wall some how to prevent tip over", 
    "Not worth the money for this", 
    "The groove for the sliding door began to loose its smoothness the same day it was set up", 
    "After assembling, it's looking very small sliding doors cabinet. sides it's open and complete closed cabinet.", 
    "It was smaller than the actual picture but was easy to assemble", 
    "Nice quality. Easy to put together.Fast shipping.", 
    "Very good quality. Easy to put together. Looks just like the picture.", 
    "Very nice looking. Serves the purpose I needed for china storage space for a small dining room. Carefully consider the measurements, the buffet is small. I stacked three of them and they look very good! Doors slide very easily for access.", 
    "\"Review the dimensions carefully. I like this product overall but it is smaller than I expected. The middle shelf is also weaker than expected. I use it in a break room in an office so it serves its purpose but it isn't as elegant looking as it looks. The price fits - other similar items are more expenses (and are probably higher quality). \"", 
    "We put sacred items that we wanted to protect that look pretty on display.", 
    "Great product and very easy to assemble I would buy it again.", 
    "This is a good piece of furniture and it went together easily, it is perfect for what I wanted and the price at Overstock was about $40 cheaper than anywhere else!", 
    "Very spacious for the price.", 
    "Fast shipping very satisfied with product easy assembly", 
    "The picture lead me to believe this was an adult sized buffet when it's actually half the size of regular furniture. They're stackable so I bought a second. Putting this together was not fun. Lots of swearing and confusion. Hardware was cheap (screws didn't fit, bolt screws were stripped) and missing parts. I ended up buying my own hardware and finishing with gorilla glue. Once put together, I slid the doors to test (the doors were the HARDEST part because they wouldn't lock into place to get them on the track) and the metal ovals that hold the glass in place dug into the shelf, scratching the, you know, out of it! The shelf can't be in the middle because it's too close to the doors. Ugh. I adjusted the prongs and flipped the shelf over. I suppose you get what you pay for but I expected better for over *** dollars.", 
    "I was in total disbelief after this cabinet was assembled. It look like something I'd buy to decorate my daughter play house with. I'm still in search for the cabinet I want.", 
    "This is a great storage unit for small items. It looks nice when paired with the solid door cabinet.", 
    "It was easy to put together. Looks great in the kitchen. When it is assembled, the middle glass brackets HAVE TO BE REMOVED. DO NOT ASSEMBLE IT WITH THE VERY MIDDLE HORIZONTAL GLASS BACKINGS. I say this in bold because there is no clearance from the shelves and that bracket. Upon assembly, the very first time I tested the sliding front, it scratched the heck out of the shelf face. Had to remove them and flip the shelf to hide the scratch.", 
    "Assembly wasn't hard, but have to pay careful attention to getting the side pieces on correctly, notches to the back so the back pane will fit.", 
    "Love it! Was easy to put together. Was here very quickly and I am very happy with it!", 
    "The parts for assembling wren too small we had to go to the store and buy the appropriate material in order to keep the shelves from falling in", 
    "I needed a piece of furniture of a very specific size to put in my new apartment's kitchen. This product does match the exact size that I want.However, it is a cheap product. The middle shelves pegs slip out at the slightest provocation. The middle shelf also slips back and forth. I was not able to install the cardboard back, which may have helped prevent that. However, there are screws but no matching holes on the back. I am a bit confused if I am supposed to just force them in or the piece wasn't delivered properly. The doors also are plastic. I should have read closer but thought they were glass.I am going to keep it and reinforce it with some additional hardware for the second shelf, scrap the back and the doors. Not worth the money but I will make it work.", 
    "I should have looked closer at the measurements. In my dining room it looks very small which cheapens it. I was also not able to fit my chargers on the shelves and close the sliding doors which is one of the reasons I bought it. I'll be returning this."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Glass-Sliding-Door-Stackable-Cabinet/8840548/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8840548/Acrylic-Sliding-Door-Stackable-Cabinet-bbfcb494-e639-45d6-a656-2c9b7154c9ff_600.jpg"
  ], 
  "description": "Exhibit your best cookware or dishes in style with this glass cabinet from Simple Living. Place one in your dining room for a modern look or stack two together for a more traditional style. The doors of this stackable cabinet are made of tempered glass for durability and added safety. Place a single cabinet in your dining room and use its smooth espresso finish top for appetizers or ornaments. Stack two of the units on top of one another to create a useful storage space for dinnerware. The sliding glass doors on this versatile piece make it easy to insert and remove individual plates and cups.Materials: Engineered wood, tempered glassFinish: EspressoStackable cabinetTempered glass sliding doorsOne adjustable shelfInside Cabinet Overall Dimensions: 21.75 inches high x 39.6 inches wide x 10.5 inches deepProduct Dimensions: 25 inches high x 42 inches wide x 13 inches deepMaterialMDFTypeFrame CabinetsAssemblyAssembly Required"
}