{
  "name": "Simple_Living_Bettega_Parson_Chair_(Set_of_2)", 
  "price": "EUR 116.95", 
  "reviews": [
    "these chairs are wonderful. they shipped and arrived within a week. took 15 mins to put together 6 of them, very beautiful color. changed the entire look of my dining room. i highly recommend these chairs if you want to give your home a quick inexpensive facelift.", 
    "I ordered 2 sets of these chairs. One package was flawless and I put the chairs together with ease. The other package was messed up. All of the parts were there but the openings on the bottom of the seat cushion where the legs are inserted was cut incorrectly. The legs were wider than the opening on both chairs and I tried all 4 legs in all 4 openings (the back legs are already attached to the back of the seat). I guess you get what you pay for but I at least expected them to arrive in a fashion that they could be assembled properly. They look nice and they are very light so I would be careful having a heavy individual sitting on them.", 
    "So far (two weeks in) the chairs have held up nicely and add a lot to our dining room. They are smaller than I thought (I didn't really check the measurements that closely), but I think they work really well in our space. The leg length's are quite even, so we need to put something under one leg so they don't wobble. Overall, I am very happy with our purchase, they were a great price.", 
    "The chairs arrived with missing hardware, so I couldn't assemble them. I immediately sent them back due to the poor quality and cheap-looking style. Also, they were super-small. Not that an average sized person couldn't sit comfortably, but they just looked like they were made for children or something.", 
    "Very rich color and comfortable. It is a smaller seat than I expected but it was perfect for the small place that it was going. It was also not to difficult to asseble.", 
    "Although they look nice, they chairs are not consistent ( I ordered 6). Not comfortable and not sturdy.", 
    "Easy to put together but one of the seat cushions is already sinking. Thinking of returning them", 
    "It is a cheap chair. Assembly was not easy because the holes were not drillled thru. We had to use an electric drill to get the job done. Once we got it assembled it looks OK but the legs are uneven for 4 out of 6 chairs. So they all wobble. Since this was a temporary measure to give some more life to our old table, I willl get some chair pads and fix this. I would NOT recommend this product to anyone. You can do better going to ****.", 
    "Although the look of the chairs is accurately represented in the picture, the quality of the chairs is far more poor than expected. Not only are the chairs smaller than the dimensions given, once the chairs are finally assembled, the legs of the chair don't all touch the floor. I'm a fairly small person and when I sit in the chairs, I feel as though the chairs will give out at any minute. With that being said, I do understand that I bought 2 chairs for less than $***, so I understand I got what I paid for.", 
    "Overtook is great, they came in 2 days! But they were tiny, looked good for my 6 yr old. But it was easy to return them, customer service was awesome.", 
    "Chairs are perfect, easy to assemble and arrived quickly. Very good quality furniture at an excellent price point.", 
    "I was leary about ordering these chair after reading some of the rewiews. While they are a little smaller than standard, I found them to be very nice for the price. The assembly could not have been easier. I think your satisfaction is going to vary depending on your expections. If you are expecting a decent chair for a low price then you will be pleased with the quality and style. If you want a $*** chair for $**, than you will be disappointed. Overall, I am very pleased with the product.", 
    "The chairs are sof acceptable quality, but are slightly smaller than I expected, however, they work well in the space which they were purchased.", 
    "My husband and I built a dining room table out of an old door and we became very concerned with what type of chair might look good with the table. We looked on overstock.com which became overwhelming at first, but it was very easy to narrow the search to what we wanted. We found these chairs and ordered four sets. The chairs arrived within a week and were fairly simple to put together. Of the eight chairs, one wobbles a little unless you are sitting in it. That could be my husband putting it together (probably not since he built me an awesome dining room table) or it could be a flaw in the manufacturing of the chair. Overall, I recommend these chairs!", 
    "Just what i needed. Chairs to use for new table.", 
    "After seeing chair after chair in the 200 dollar range, these were a welcome find. They look very good and they are extremely comfortable.", 
    "It's not great but not terrible either. You get what you pay for.", 
    "great dining room table chairs", 
    "The chairs look nice but did not realize that they were smaller than an average chair and when a client was getting up and moved the chair back one of the legs broke off immediately. The chairs are not sturdy.", 
    "Unfortunately 2 chairs broke. We purchased 12 of this chairs and we don't use them often enough, but we had guests and 2 the back of them broke. Check with overstock and their guarantee is for 30 days, but you can purchase an extension of the guarantee which I didn't do. Love the chair but concern with reliability", 
    "These are perfect for a more comfortable seat.. They look classy too.", 
    "IM very happy with the bettega parson chairs! they are very comfortable & just the right height that I needed. I would highly recommend them & they are inexpensive for the value, I love them & very pleased!", 
    "too small...made my small table look huge!", 
    "Poor quality not really as sturdy as i expected. I guess you get what you paid for...", 
    "when assembling the chairs one leg I broke", 
    "a little narrow, but over all a great fit", 
    "Chairs arrived on time and in good shape. Easy to put together. Look nice. Great for my sons. First place.", 
    "If the material quality of the chair is of entry level, fair for the price, the quality of the seating is good. The overall perceived quality is very good. I would recommend this purchase.", 
    "Beautiful looking chairs. Perfect for where I am using them.", 
    "I ordered 3 sets of these chairs. Make sure you look at the measurements because they are smaller than I anticipated. Three of the chairs fit on each side of the table so I ordered two larger, brightly colored chairs for the ends.", 
    "The chairs went well with my table but I will have to eventually buy a new set because they're not \"long-lasting\".", 
    "These chairs look good and are serving our needs for extra seating perfectly.", 
    "I love these chairs for their good looks and comfort. Easy to put together. They are a little smaller than they may appear on the pictures, but just check the measurements and you'll know. The size is perfect for my small apartment and small table. I think they're fine for most people, but I don't know if they are big enough (or sturdy enough) for a heavy person. The seat has a cushy-comfort and chair sits fine (doesn't wobble).", 
    "We bought 3 sets of chairs and the quality is very cheap, the frame is very poor made, once you put your back into the seat it starts to bend, once you seat on it you can feel the frame, not comfortable at all. It is not sturdy. We are not heavy and they already falling apart. We waste almost $$$ :(", 
    "The padding on the chair is week if you wait 185 lbs like me. You will feel the frame which after seating a little while it gets uncomfortable.", 
    "These chairs were way TOO SMALL - looked like kid's chairs.The materials were not well made and decided to return.", 
    "loved these and easy to put together", 
    "The shipment arrived on time and it was easy to assemble.", 
    "The chairs look great and were really easy to put together. They are pretty wobbly after a lot of use.", 
    "Attractive and comfortable dining chairs. Very light weight and thin fabric on the bottom.", 
    "These chairs are horrible quality. From the very first time I sat in the chair it felt unstable and cheap. They are lightweight and feel cheaply made. Spend a few more dollars and buy something that will last you more then a month.", 
    "small chairs not very comfortable for an adult but work fine for my kids.", 
    "I love these chairs. I use them in my office for clients. They are very comfortable and sturdy. Easy to assemble.", 
    "You have to be under 125 pounds to sit on it. Returned it", 
    "Exactly what I wanted for my small round table. light weight. easy to assemble. very cute.", 
    "They are a godsend for my apartment. They don't take up a lot os space & provide extra seating for guests.", 
    "We bought 3 sets of these chairs for a total of six. Although they were somewhat light in weight, we thought that they would be great for occasional dining, which is what they were being used for. After seven months the legs have begun splitting and cracking while a person sits upon it. (No roughness is involved). Two of the six chairs have done this now. I would not recommend these chairs, unless you are buying something for decorative purposes only.", 
    "I ordered 2 sets of these chairs... the assembly was easy enough, and they met the whole reason I bought them - I was looking for a more compact padded chair that would fit in a smaller space in my breakfast room. However, the padding felt lacking -when you sat on them you could feel the frame. Also, having 2 teenage boys using them several times a day proved they don't hold up well... I've had to tighten bolts several time before one of the frames cracked. Now I have to look for new chairs - only had these for about 6 months.", 
    "It was easy putting together but it's just too small. My table look a little off because of it but it'll do for the kids until we order something else", 
    "Ordered 3 sets for a total of 6 chairs. All came as described. The chairs are fairly narrow but that is accurately stated in the measurements online. The chairs are solid and seem sturdy enough. The legs were all fairly level and as good as can be expected in this price range...actually better than the more expensive chairs they replaced. I would reccomed to a friend and find the qualtiy and workmanship to be very good for the price.", 
    "Fit well with my small table", 
    "Looks great and works well, it was definitely worth buying!", 
    "We love these chairs, they are comfortable and ready to assembly. Our 10 year grandson assembled one all on his own! The only down side is, they are on the small size for our large table, we may have to order another set.", 
    "We had some issues with Delivery (through no fault of Overstock) and Overstock addressed the issue promptly! Quality of chairs were as expected for the price range. Thanks Overstock!", 
    "We were looking for a small chair that would fit my husband's antique desk. This one fit the bill. The chairs were a pain to put together however. Fine for our needs.", 
    "These chairs are definitely better than price reflects", 
    "I love this chairs it fits on my table good for my little dining room.", 
    "These two chairs are a nice extra in my home. They are made well, easy to assemble, very light weight. Narrow seating is a down fall. I don't think these chairs would last daily use. However when I have company I don't want to give an uncomfortable folding chairs and these just add a little extra to the room.", 
    "Excellent price especially for two chairs. They have a great look but the quality could be a lot better. Not too difficult to put together.", 
    "They are great! Every guest that has used them has commented on their looks and comfort!", 
    "These chairs are excellent value and they look good at our table. A little smaller than most Parsons-type chairs but also much easier to move around the table, especially over carpets. However, assembly was very time-consuming in getting the screws correctly placed in the seats. It took a long time and was very frustrating, but with patience we managed to complete them and they look fine.", 
    "I had purchased a drop leaf table with came with two of these chairs, we needed four,. It was great to be able to purchase the exact match for the chairs that came with the table. They are very comfortable and solid.", 
    "Easy to put together. Very nice looking product and seems to be of good quality", 
    "Love the chairs, they look like real leather and they are very confy, the delivery time was exelent and the costumer services and online help chat is great", 
    "This chair is narrow, although the seat gets wider toward the front. It's a little shorter than I thought it would be but seems sturdy and looks very nice. I was hoping the legs were more of a cherry color, but they are dark espresso in color, which is okay, but not exactly what I wanted. Will keep them as they are a great value and will do the trick as extra chairs over the holidays.", 
    "I would not recommend these for everyday use. They are not sturdy, very light weight. They look great around my dining room table that I hardly use. Great for changing the look of a room and good for the price.", 
    "I thought they were alittle too slim in seat. Just thought they would be wider and very light weight. All is good lucky for the small office I used them in for side chairs, but would be afraid to order for everyday use at a table for eating. Heavy people may feel unsecure.", 
    "These chairs look wonderful with our new table. The faux leather looks great. Assembled very easily with just one person. Legs are all balanced. Very sturdy. Perfect seat height for our family. Couldn't be happier.", 
    "These were easy to assemble, comfortable, and attractive. I am very happy with them!", 
    "I am very happy with the chairs, I ordered bedroom furniture from you years ago and it still looks brand new. I would and have highly recommended Overstock.", 
    "I was looking for desk chairs that were not the conventional office type. These chairs have very clean lines and match the decor of my and my son's home office desks and add to the style of the room.I would NOT use these for dining chairs because they are not that attractive for that purpose but for office chairs they look fine. Also after working in one for the past 3 days I do find it comfortable with just enough cushion on the seat and back plus support.For under $*** for both I think this is a very good value. These would make terrific 'extra' chairs to have around as well. Contemporary, clean and look and feel like leather. They are very, very light weight though- and assembly....you need to understand how to assemble the chair; it is more than just putting the legs on.", 
    "Easy to assemble, great looking, but they are a little on the low side, so if you are a tall person, the chair might not be that comfortable for you. Otherwise, it's a great chair.", 
    "Great chairs, run a little smaller than I thought but overall they work great and look great", 
    "I would not use these chairs for daily dining but as extras they are perfect. They look great but are not as sturdy as more expensive chairs.", 
    "the chairs are very fancy looking. Product is great. They look so good in my dinning room. I love how the color looks in my dinningroom .", 
    "Quick and easy to put together and easy to clean...with 4 kids you need something easy. And it helps that they look nice.", 
    "Chairs were delivered 4 days before quoted and were easy to assemble. They look great! Great buy for the money!", 
    "Really great value for the price they r jjust simple and chic", 
    "VERY SLEEK N RICH LOOKING..ALREADY THINKING OF GETING 2 MORE.", 
    "These chairs were purchased for a dining room. Quality great -looks great with the table - sturdy. Price beats same chair at popular warehouse store.", 
    "We are very happy with the chairs we purchased. Would feel confident making similar furniture purchases in the future.", 
    "I had a problem assembling one of the chairs - one of the legs on the front did not fit into the open area. I had to use a wood plane to shave quite a bit of wood off the leg in order to get it to fit. All the others fit fine but that one was quite a bit off.", 
    "Had a dinette set that was over 20 years, the chairs all fell apart so I need to replace them.. Ordered four of them (2 sets of 2) which has updated the look of the table. Love it!", 
    "The chairs were very hard to put together, meaning the wrench that was supplied was very strenous to use. Once I put one together it was uneven at the base. I took it apart and put it together again.... Still uneven. I returned the chairs.", 
    "I would say you should remember you get what you pay for. That is exactly what we got. I would probably not buy chairs on Overstock again. They are basically chairs that went thru an assembly line and were put together in 15 minutes and then shipped.", 
    "Not good quality nor where they standard size chairs."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Bettega-Parson-Chair-Set-of-2/6460945/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6460945/Simple-Living-Bettega-Parson-Chair-Set-of-2-50873ce8-29d5-4f16-82e0-6b3391d63b87_600.jpg"
  ], 
  "description": "Enhance your dining room's seating capacity with this pair of Bettega parson chairs from Simple Living. With a streamlined silhouette, faux leather upholstery and wood legs in an espresso finish, this chair set completes your room's contemporary design scheme. Stitch detailing on the seat back offers aesthetic interest.Set of two parson chairs extends seating capacity for family gatherings and dinner partiesRubberwood construction for durabilityWood legs with espresso finish add beautyFaux leather upholstery in dark brown makes chairs easy to cleanPolyester foam delivers comfortStitch detailing on back offers visual interestSeat height measures 18\"H37.1\"H x 17.1\"W x 22\"DSeat dimensions are 17.1\"W x 16\"DStyleTraditionalMaterialFaux Leather, Leather, WoodFinishBlack Finish, Espresso FinishChair TypeAccent Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlack, BrownFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion, Solid"
}