{
  "name": "Simple_Living_Portland_Tall_Cabinet", 
  "price": "EUR 283.72", 
  "reviews": [
    "I needed more storage in my kitchen/dining room and this cabinet is just what I needed (or the closest I could find in my budget). I had read other reviews so I wasn't surprised when there was a chip in one of the doors. I immediately contacted a rep while my husband was still putting together the cabinet. Turns out that they actually had sent us 2 right doors, so I recontacted a rep and they got an order in for the correct door. Instructions were slightly frustrating (certain figures not lining up with descriptions) but we got it together with minimal complaints. My main disappointment was the back was not a wood panel but instead a thin cardboard-like panel. I don't think this piece could handle moving but luckily I don't plan on moving anytime soon. Overall, a pretty sturdy piece. Great size and shelves and looks great!", 
    "Much sturdier than I thought it would be. Very happy with this purchase! Assembly for this item wasn't bad, I think it was par for what it is. I bought the black one, it's absolutely beautiful", 
    "It is so sturdy, easy to assembly (my 12year old grandson assembled it). It took him about 45 minutes. it is really beautiful. I received a compliments from many friends. Thank you!", 
    "I love this cabinet. Use it in the bathroom for towels! Only down fall is that there was ALOT of assembly", 
    "I bought this and the smaller cabinet and I'm very pleased. Can't comment on assembly as I had our handyman put it together. Looks of good quality compared to the price I paid. Some silver screws are visible but doesn't distract from the cabinet. I purchased black finish .", 
    "We couldn't get the doors on evenly but it still looks nice.", 
    "good value and quality, easy to assemble, function deep shelves", 
    "I love this cabinet. It has plenty of room."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Portland-Tall-Cabinet/10376543/product.html?recset=737066ea-80c9-4ba0-be47-873cbb31569a&refccid=3BTM3VVOQZYZOCCHUPIEP5YE7U&searchidx=2&recalg=61&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10376543/Simple-Living-Portland-Tall-Cabinet-f0000b8e-9196-4c72-9543-8ddc3183f19f_600.jpg"
  ], 
  "description": "Bring charm to your home with this Portland tall cabinet from\nSimple Living. Two window pane doors allow you to showcase your\nfavorite items, such as books or fine dishes. Three fixed interior\nshelves offer just the right amount of space, while bronze finish\nmetal pulls make opening and closing the cabinet easy. Choose\nbetween several different finishes to complement your decor.Three shelves for ample storageWindow pane doors for easy viewing of interior contentsAvailable in several finishes to complement your decorIncludes one tall cabinetMade from MDF with particle board, pine wood legs and\n  tempered glass for durabilityOverall dimensions are 50 inches high x 36.5 inches wide x\n  15.75 inches deepTop shelf measures 14 inches high x 30.25 inches wide x 14.25\n  inches deepSecond shelf measures 12 inches high x 30.25 inches wide x\n  14.25 inches deepBottom shelf measures 14 inches high x 30.25 inches wide x\n  14.25 inches deepShipping weight is 85.8 poundsOverall: 50 inches high x 36.5 inches wide x 15.75 inches\n  deepTop shelf: 14 inches high x 30.25 inches wide x 14.25 inches\n  deepSecond shelf: 12 inches high x 30.25 inches wide x 14.25\n  inches deepBottom shelf: 14 inches high x 30.25 inches wide x 14.25\n  inches deepWeight: 85.8 poundsMaterial: MDF, Glass, WoodAssembly: Assembly RequiredExact Color: White, BlackFinish: Bronze FinishColor: Black, Grey, whiteMaterialGlass, MDF, WoodFinishBronze FinishAssemblyAssembly RequiredColorBlack, Grey, White"
}