{
  "name": "Simple_Living_Bettega_Parson_Chairs_(Set_of_2)", 
  "price": "EUR 112.07", 
  "reviews": [
    "Great chairs, would buy from Overstock in a minute. They are sleek and well designed. I have a smoked glass table top. They brought my dining room into the current century!!! Oh and was very pleased how quickly the arrived.!!!", 
    "These are good chairs for the price. They are smaller than typical parson chairs, and the legs are somewhat thin. However, they are half the cost of anything else I looked at. They were easy to assemble and seem pretty sturdy for how lightweight they are. If you are looking for heavy, substantial furniture, this is not it. However, they are attractive and affordable and look great with our black dining table.", 
    "We needed to get 4 chairs in a hurry because the company we hired to reupholster the retro chairs screwed up royally on the stitch work. Since the kitchen was getting a facelift we thought we should just get more modern chairs. While I don't prefer to assemble chairs, these were quite easy. After setting up the first one, the remaining three took only a fraction of the time to put together as all tools and parts were lined up in assembly order. The colour looks great; it's almost a soothing greyish/tan that's so neutral it looks good with the textured floor tiles and a dark wood table. They can go with pretty much anything. The chairs are slim and don't take up too much space but they feel sturdy. We're pleased.", 
    "They are a perfect chair for table use or to fill in where ever you need extra sitting. They are very light weight. Great for my hundred year old father, he is able to move them or lift them with ease. Yet they are strong enough to hold a big person. We love them.", 
    "I recently bought six of these chairs as my first purchase from Overstock. They came quickly and in good condition. My husband and I spent about an hour putting the first two together, a half hour putting the next two together, and I put the last two together in another half hour. The front two legs and seat to back were the only things needing attachment. The faux leather is a soft grey, not the cream shown in the photos, which I was aware of from other reviews and was exactly what I wanted. The chairs are well cushioned, comfortable and have a slight curve giving the back a bit of lumbar comfort. We are not large people, so the smaller size seat and thinner legs are perfect for us. They have a sturdy but light weight feel. As they are fairly neutral in color, they go great with our grey kitchen table and also with our walnut dining table. I think they are a great value.", 
    "These chairs are smaller by about an inch height wise and very small scale overall. My biggest issue is that the color does not match the picture at all, they are very much a taupe/grey and not a dark cream as reflected in the pictures. if you want small grey chairs, they are a good price.", 
    "I was t expecting much considering the price but was a little taken back by how cheap the quality of these chairs are, they weigh a couple of ounces each and if you weigh over 100 pounds be careful sitting on them.", 
    "seem cheap, lot smaller then a dinning chair, woul be ok with a kitchen dinnet, gave them to my neighbor", 
    "Both chairs broke soon after we received them.", 
    "I would recommend these chairs only if you want eye-candy to stage your home if you're about to sell it. Not a believer that they would stand up to day-to-day abuse.", 
    "These gray leather parsons chairs are just what I was looking for. They were an extreme value because I had Club O reward points to apply. The bonus for me was that they are extremely light weight. I am small in stature and they are like featherweight and easy to assemble.", 
    "These are lightweight chairs and they are slim. Three fit on a side of our 91 inch table. We started off with 4, but added two more because they would fit. We plan on putting a bench on one side eventually, but until then these six chairs will do just fine. We got them because the color, the price, and that they were smaller. We are very happy with them. The color goes well with our grey toned, wood table. It looks quite rustic modern.", 
    "Chair leg broke with barely any use and now Overstock can't even give me the manufacturer's contact information in order to deal with them for a replacement.", 
    "I haven't even had them a year and they get little use. One chair leg has already broken. I would not purchase them again.", 
    "Like the look of the chairs,however too light weight for me.But you get what you pay for.My husband took them to his automobile shop for the lunch room.", 
    "I love this I own this for 3 years now and they look great in my dinning room. They are easy to clean", 
    "I like these chairs, the color, the fact that they are really light to move in and out from the table...the construction is really good. I put them together in about 30 minutes.", 
    "These are beautiful and very inexpensive. However they are very cheaply made. I was afraid to have them. I returned them. They have a great return policy.", 
    "I bought 6 of these chairs when they were on sale. These chairs look sleek and modern and go great with my black dining table. The leatherette finish has a great texture and is very easy to keep clean. These are not chairs for large people, but will be great for normal sized adults. Assembly was straight forward. I would not purchase these chairs if you plan to stand on them or have little kids climbing on them, as they are not very heavy duty. For the price they cannot be beat.", 
    "I love the design and color, however, they are not very sturdy. One of our chairs broke after about 5 months. We are not heavy people either.", 
    "The upholstery is not holding up well.", 
    "These chairs were very easy to assembly, somewhat narrow, they clean very easily and being sturdy hold a sufficient amount of weight.", 
    "The holes were not lined up correctly so it was difficult to put thew chairs together. Also the chair legs are uneven so the chair wobbles", 
    "Light, small, inexpensive.", 
    "Was a little surprise of the texture of the leather look. It's not smooth hasa texture to it. Nice looking chairs and can't beat the price", 
    "excellent products and fast delivery!!!!!", 
    "Chairs are poor construction and very small. Great option for a small table in a kitchen, not a dining room", 
    "There very comfortable and lively", 
    "I love these chairs. They were very cheap, I use them in my practice for my employees and they commented that they are comfortable and they are not bulky either.", 
    "I didn't like these chairs at all I put one of them together and the legs was uneven, I read that in other reviews but thought that wouldn't happen to me , but it did and I sent them back.", 
    "I bought 4 of these chairs and they're great. Super easy to clean. I added wood protectors on the bottom to protect my floor. Considering purchasing 2 more.", 
    "Not as sturdy as I would have liked and needs more cushioning. But for the price I guess you get what you pay for.", 
    "These chairs are ok for the money. I am very disappointed that legs on one were damaged and seat was damaged on another. I e mailed abt the damages and never got a response!", 
    "The color is matted, seat padding thin. Be care not to let young children stand and lean on back to prevent chair from falling backwards. Very light weight.", 
    "Affordable chairs that look great with my dining table", 
    "The color is perfect; the chairs are sturdy yet light; overal very satisfied.", 
    "Chairs look nice but break very easily.", 
    "For the price, I am really happy with these.", 
    "I bought 4 of these chairs 2 months ago. Very light weight & not made very well. We used them the first time at our Easter family dinner & my son who weights 180 lbs. sit on one & the front leg just broke. Would NOT buy them.", 
    "PROS: style, value, priceCON: comfort of seats, sturdiness", 
    "Sit on them 30 mins. and your legs are sinking in the frame front", 
    "Ordered 4. Arrived on time. Easy to assemble. Comfortable and look great.", 
    "Bought six of these for my daughters new home. The rich grey faux leather covering is beautiful to look at and easy to clean. They were simple to put together and are quite sturdy. Best of all... They look way more expensive than they cost!", 
    "we looked feverishly for gray chairs and found these!!! VERY GOOD CHOICE!!! Reasonably priced just the right width and height . we wer concerned with how comfortable they were but wow pleasantly surprised! we love them...thank you!", 
    "After looking through hundreds of chairs online, on every site I finally found these, and boy am I satisfied. I get so many compliments on them, they look sleek and nice. they are a great price, they are light-weight and just like others said, they are not wide at all which i dont mind for my small apartment they fit in perfectly. They are pretty comfortable which i wasnt expecting considering the price. They seem a little lower than a standard chair although when measured they are not. Putting them together was not that hard, it was just frustrating that we couldnt use our electric drill since it's all done with a hex socket. overall great chair!", 
    "The chairs are great looking and pretty comfortable but I bought 2 sets of 2 and 3 out of the 4 had one leg that was shorter than the rest of the legs, which is disappointing. Others then that, they're fine.", 
    "These chairs were exactly what we were after. We have two young boys who make messes when they eat. We wanted something that looked good and could be easily cleaned. These have the added bonus of being light weight, which makes it easier for all of us to push them in and out or move them around the table. The seating surface is at a normal height, though it certainly isn't oversized... The backs of the chairs are a few inches shorter than other chairs we have owned, but I believe their height is sufficient. The construction is similar to many chairs in this price range. I'm sure they won't last forever, but they are inexpensive and good looking and we are very happy with them.", 
    "Sturdy nice finish and a great price. The only thing is the legs need to have something on the bottom; felt pads would avoid premature wear and raise my review to 5 stars", 
    "These chairs are very flimsy. They were a good price but I found some that were less expensive that were a much higher quality", 
    "I bought these to replace a leather parsons chair from ****. I was shocked to see that these are much smaller than the **** products and they looked way out of scale with my 42 inch round table. The dimensions were not the same as the description btw. On the plus side.....loved the grey color and the smoothness of the leather. Sent them back.", 
    "We needed lighter weight and more of a blue grey tone chairs for out newly painted room. These are very light weight, color is perfect very much like the online photo and really easy to wipe down (important with kids). They are small but work for us. Easy to put together too.", 
    "I'm torn on whether to keep or return these chairs. I really love the style and color; however, they are very small. My dining table is 48\" and the chairs look out of proportion to the table. I think I'll order two more and see if that helps. Overall, the style, quality, color are great.", 
    "My boyfriend put these together and through the box in the dumpster right after and if he didn't I would have immediately sent them back. They just felt so cheap all around and weren't a solid chair. One leg starting to bust within 6 months of having them. I only ordered 2 and planned on getting the other 2 if I liked the first instead never purchased the next set and threw them in the dumpster. CHEAPLY MADE Guess you get what you pay for but what a waste."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Bettega-Parson-Chairs-Set-of-2/7568779/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7568779/Bettega-Parson-Chairs-Set-of-2-dc0adfbd-2096-4622-a2c4-7c89ebcd358d_600.jpg"
  ], 
  "description": "Classic and modern, these gray Parsons chairs add punch to any\ndining room. This pair of upholstered Parsons chairs is covered in\nfaux leather for easy cleaning and lasting style. Elegant enough\nfor formal dinner parties, the rubberwood legs and frame are sturdy\nenough to withstand everyday use in the family dining room. Set includes: Two parson chairsMaterials: Rubber wood and faux leatherFinish: BlackUpholstery materials: Faux leatherUpholstery color: GreyUpholstery fill: Polyester foamParson chair upholstered in grey faux leather for easy care\n  and has a matching stylish light grey stitching       Dimensions: 37.1 inches high x 17.1 inches wide x 22 inches\n  deepSeat dimensions: 17.1 inches wide x 16 inches deepSeat height: 18 inchesStyleContemporaryMaterialFaux Leather, Leather, WoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorGreyFurniture Frame MaterialWoodSeat StyleCushion, Upholstered"
}