{
  "name": "Simple_Living_Slat_Espresso_Rubberwood_Dining_Chairs_(Set_of_4)", 
  "price": "EUR 136.45", 
  "reviews": [
    "Unlike many of the other reviewers, I had no problem putting these chairs together. I actually enjoy those sorts of projects and thought that this one was easier than some of the other purchases I've recently made. Once they were put together, the chairs looked great! I thought they were comparable to our other dining chairs that we'd purchased from **** and were less than a quarter of the cost. Unfortunately, we hadn't had the chairs 24 hours before my husband sat in one of them, and it cracked through one of the legs. He is of average size, so this was completely unexpected. I am wondering if perhaps I over-tightened some of the screws which caused excess tension on the joint? Regardless, this was extremely disappointing, especially given Overstock's extremely limited return policy. I will think twice before making future purchases of this kind.", 
    "These chairs are nice looking, but don't buy them if you're planning on actually sitting on them. I bought 8 chairs in September, and so far 4 have broken (only 4 months old). Don't scoot the chair back, or pull them out from the table cause they will break in half. Leaning back in chairs is not a good idea for any chair, but these don't stand a chance even for the slightest tipping back. They are junk and do not hold up. I have pictures of the broken chairs and they have all broken in the same place, where the seat meets the back legs. A waste of money.", 
    "There was only one review of this product and it was a negative one so that got me nervous. I really needed some dining room chairs and these ones are the perfect color and they came in a 4 pack-- so I bought them despite the negative review. Once I figured out the hardware, putting them together was easy. The color is true to the picture-- very dark mocha. One of the backs did have a broken piece so I called Overstock and they ordered me a replacement immediately. The chairs look great, they are simple and classic, and you CANNOT beat this price!", 
    "Excellent quality for great price. If you don't mind the small hassle of assembly, these are perfect. Excellent addition to my dining room.", 
    "As stated before this product comes in many pieces; approx. 9 wooden pieces and 35 pieces of hardware per chair. Be prepared for this and think of the contents as a \"chair kit\" not chairs and you won't be so disappointed. I am not mechanically inclined and I had two toddlers running around while putting these together assembly style and it took about 3 hours. It wasn't hard to follow the instructions, but you do have to use a tiny little hex tool that comes with the chairs to tighten most of the screws and that takes some time (plus I had to rest my poor thumb and forefinger between chairs). The extensive build time and the fact that a piece of hardware was missing are the only reason I gave the chairs 4 stars and not 5. Once put together the chairs are very sturdy, they weigh about 16lbs each, the kids spill all over them and they clean up great. They do not look cheap, as a matter of fact I have seen very similar chairs at **** that cost about as much for one as the whole set of four on Outlook.", 
    "I like a lot of people have a fear of complicated instructions and having to follow them to assemble something! The first chair took about an hour but after that it was about 15-30 minutes each. I found instructions simple and easy to use. They are really beautiful! Good quality solid wood product. Lovely finish. Great product!", 
    "I wrote a longer, more thoughtful review but it got lost in a cyber void. Maybe this company doesn't really want people to post reviews? In a nutshell, they look very cheap and took a LONG time to construct (close to four hours) and aren't too stable once you have finished. The picture in the advert didn't show the very evident bolts in each leg of the chair which make them look like something from xxxxxx. you get what you pay for. They look OK from a distance and actually feel surprisingly sturdy once you have tweaked all the bolts very carefully (which will take half an hour.) Pretty disappointing, really.", 
    "I needed a set of 8 chairs and did not want to spend a lot. These chairs fit the bill. Nothing about these chairs excites me, but if you like the look and are willing to settle for mediocre quality, the price is right.", 
    "The chairs are sturdy, nice looking wood, basic chairs. Exactly as the ad states. Very happy with them.", 
    "I ordered these chairs and was not sure what to expect. I was a bit nervous based on previous reviews. The chairs are sturdy and beautiful and match my dining table. I just ordered 4 more. Assembly for the first chair took some time about 1 hour but the rest were a breeze. Thanks overstock for such a great buy!", 
    "These chairs were not easy to put together. now that they are together they look great but they are not the qaulity I was looking for. they are not heavy or sturdy. the price was right though and I guess you get what you pay for with these.", 
    "Aside from assembling, which took me a bit of time, I love these chairs. Make sure you get the chair back facing the right direction when you put together. They are beautiful and comfortable and a great deal.", 
    "I read every review before making this purchase. I decided to get the chairs regardless of any negative comments because I needed eight chairs, and you can't beat this price! The boxes arrived, and were a bit heavy, so I opened them on my porch and brought the pieces upstairs. There are quite a few parts involved, so I recommend unpacking ALL of them and sorting them, the hardware too. It took my husband and I between 2 and 3 hours to assemble all eight chairs. We put one together as an example, following the instructions, then assembled the other 7 in an assembly line-style fashion. After assembling, I sat in each chair while my husband tightened the screws. I highly recommend using a hex bit other than the one provided, it will really save your hands. The chairs are sturdy, and comfortable even for a 200lb+ person to sit on. The seats are wider than I expected. As far as the visible bolts, they are almost industrial-looking, in a modern kind of way. They don't look cheap at all.", 
    "I should have paid attention to ALL the reviews. I followed the directions for the first one then did my own thing for the rest. Much easier. I'll keep them until something better comes along. These were the worse purchase I have every made from Overstock.", 
    "These have been difficult to put together. My husband has only made it through two. They are not very sturdy. I have ordered items from Overtock before and have never had a problem. I'm already looking for new chairs. Oh well, you get what you pay for!", 
    "Good heavy chairs but all 4 come in one heavy box and chairs are broken down to the smallest component possible. These will test your marriage. On the very last one we discovered that it had 2 R front legs instead of one R, one L. Called Overstock and they got out the replacement super fast. Excellent customer service. Tip: once chair is assembled do the final tightening while someone sits on the chair. NO wobbley legs with this method.", 
    "For years, my husband and I have had two chairs at our EIK table. But as we recently had twins, who are now in the type of high chairs that attach to a dining chair, we were left with no seating for ourselves. As the chairs we originally had have long since been discontinued, we decided to order four new ones: two for the high chairs, and two for us. When the chairs arrived, my husband set about assembling them. Major pain. These are flat pack, but they're like, Super Flat Pack--nothing is assembled. He put one together, and then we brought it out to the kitchen to see how it looked. \"Ridiculous\" would be an accurater description. First, the hardware is all visible. All the screws and bolts and whatnot are plainly visible on the finished product. Second, the one assembled chair rocked because the legs were uneven--and lest you think we just assembled it improperly, my husband has made a large portion of the furniture in the house, and has been woordworking and making furniture since he was a child (with twin infants, however, we were looking to save time by buying these). Third, they're like little mini dining chairs--they were a full five to six inches shorter than the chairs we already have, and they just barely peek over the top of the kitchen table. So that was it--he took the chair apart, and back they all went to Overstock. And the return shipping charge was over fifty dollars, so we only received a refund of approximately 64 percent of the original purchase price. So that stunk, too.", 
    "I did not put together the chairs, but my 17 year nephew put them together rather quickly. I really like the chairs, I am very happy with these chairs.", 
    "We were pretty satisfied with these chairs. Once put together they are pretty sturdy. The color is very similar to how it looks online. The assembly was a bit tedious, and required a few extra tools (drill to screw in the seat to the rest of the chair frame. Can be done by hand too, but drill was quicker). They are pretty comfy, and look good too. Overall we were very satisfied.", 
    "The chairs are sturdy and are what I expected. I like them, except for the fact, they don't have screw covers for the holes.", 
    "I bought these chairs as a replacement for leather covered dining chairs that had been worn out by my 2 boys within the past 5 years. I chose wood chairs this time, as I assumed that they would hold up to the abuse of children better. While this theory might be true, there is absolutely no way that these chairs will last for 5 years. In fact, I'll be surprised if they last for one year. My husband, a fairly handy guy, spent over an hour putting together 4 chairs (not difficult work, but time consuming and tedious- every little piece is separate and needs to be put together). They look decent, but are quite flimzy. We have lost two screws from the bottom of the chair that I use (I am only 120 lbs.) and when we try to screw them back in, the wood is so soft that they just work their way out again within a day or two. I am already looking for new chairs. These may be alright for back up or extra chairs, but will not hold up to daily use. I definitely regret this purchase. =(", 
    "These chairs work perfectly with the table they were bought to go with. Would definitely recommend them. Not difficult to assemble either.", 
    "The chairs are easier to put together than many people wrote about. Not rocket science, just give yourself an hour to do it. Color is dead on and I love the look of the chairs. I have but one complaint, which is that the hardware is visible on the finished chair. Therefor, they show their true price.", 
    "These chairs look very good in my dining room and do not rock or squeak when I sit on them. However, assembling them was a real nuisance. This was mostly because the wood these chairs were made from had cracks or other damage that was sealed with other small pieces of wood (which was well done, and you would never guess it looking at them). Unfortunately, the small pieces of wood that were used to seal a few of the cracks were large enough that they partially blocked the pre-drilled holes that are needed for assembly. If I did not have a power drill to cut through them, I never would have been able to put the chairs together. Also, Adjusting the screws so that each chair did not rock or wobble required more time and patients that I ever want to spend on assembling furniture again. The price was right, but the product was very troublesome.", 
    "For inexpensive chairs, they are sturdy and seem to be holding up well. After you put the first chair together, the other take 10 minutes each. If you can follow simple direction, you can assemble these chairs with ease. I am satisfied with my purchase.", 
    "I have purchased two beds and four dining room chairs from overstock and have been very impressed. The products are solid,sturdy,and beautiful. The delivery dates and on time accuracy is to be commended.", 
    "Chairs were beautiful, it did take me a few days to assemble them, so be patient and they will be great.", 
    "Very good product, easy to assemble, sturdy. Fits well with multiple styles. I am using them with mission style furniture and they do not appear out of place.", 
    "These chairs were what I expected to get for the low price. They were challenging, but no overwhelming to put together. They seem sturdy, although time will tell on that one. They look fine with my table. You will need cushions on their absolutely and unforgivingly hard seats, if you intend to sit for any length of time. I was happy with the service from Overstock...two of the pieces - a seat and a rung, arrived damaged. I e-chatted with a representative...no waiting...he was great and I got replacement pieces in short order. Overall, I'm pleased and would order from overstock again.", 
    "I purchased the set of chairs online to match the dining table already there. They work well together. But my husband worked hard on assembling them. Even my little 6 year old daughter helped him with the works. It took him the whole weekend to finish them. We're using them daily basis now.", 
    "These chairs were fun to assemble and only took about 30 minutes per chair. They match our table great and are a clean simple addition to our modern dining room.", 
    "These are very sturdy chairs, easy to assemble (if you have better tools than provided), good value for the money. The look is not as smooth due to the screw holes, but overall very nice.", 
    "It is very nice quality! True to description! Actual Hard wood for such a cheap price! I would recommend to any friend. The only drawback is that you have to put every single joint together by yourself. It was quit a bit of work. But as to the quality, no complaint!", 
    "Ten, count 'em, ten pieces to each chair and then there are all the hardware pieces. I bought two set (8 Chairs)..good thing I had family over to set up an assembly line! It was almost two hours with three people to put together the 8 chairs. After all that, the chairs are okay but I am unsure just how long they will withstand daily wear and tear. On this product I would have to say....You get what you pay for.", 
    "The set is exactly what I expected. It matches my other pieces of furniture and fixs the room size exactly.", 
    "Great chairs for the price! They look perfect with my modern wood dining table. Despite other reviews, the chairs took probably 15 minutes each to put together. My mother helped and had no problem following the instructions. One caveat was that the set had too many left front legs. The lady at customer service was amazing and had replacement parts sent out immediately.", 
    "I was excited to see the chairs arrive so quickly, but soon was frustrated at trying to put them together. Still only have one done and it's 2 weeks later.", 
    "i love these chairs! the color matches perfect to the internet and very sturdy! the size is perfect!", 
    "They are light-weight chairs and require significant assembly. It took 3 hours to put all of them together. They are a plain looking design on par with some similarly priced folding chairs. If the storage convenience of a folding chair is desirable then that might be a better option.", 
    "I shopped around quite a bit and finally ordered these as they were the best deal I'd found. They were just what I expected. Good quality, and though they needed assembly it went quickly, even with the \"help\" of 3 little ones. The directions were easy to follow and all the parts were included. Delivery was extremely efficient - only a couple of days. Compared to $80 per chair for pre-assembled, these were a great bargain. They look great and are very sturdy and comfortable to sit on. Yes, the heads of the bolts are visible, but at least they blend in nicely with the wood. Overall, great chairs at a great price.", 
    "For the price, these are very nice chairs. The color is great and works really well in my household. The only problem that I have is that the screws are always loose and have to be tighten very often.", 
    "These chairs went perfect with my table and were pretty easy to assemble. They are sturdy and beautiful. They look expensive -- what a bargain!", 
    "Fast shipping and it was free! Assembly was not difficult and quality for the price is outstanding.", 
    "A little hard to put together for a totally non technical person,but I did it!! Really a good quality product for the amount I paid", 
    "My husband put the chairs together and the chairs were fabulous. They chairs went with my table. I am so happy and content with the style and durability of the chairs.", 
    "These chairs are beautiful. They class up the whole joint. The directions for assembly were fairly obvious, and we were left with just the right number of parts and chairs.", 
    "I put together the chairs, and by the end of the third of four, I couldn't go any further. Overstock left out just enough parts so I couldn't even start to put together the fourth chair. Thanks... Now I can have 2 guests over instead of 3!", 
    "These are crap. Don't even waste your money! Just sit on the floor because that is where you end up. Not kid friendly. Only buy if you plan on never sitting on them.", 
    "Love these chairs, easy enough for my 8 year old to help assemble and look and feel great. Awesome quality for the price!", 
    "Screws did not fit- very difficult to assemble. Also way too short for my dining room table. Not worth the stress", 
    "Was impress how well build the chairs were . Like other noted it about 2 hour to put them together , I learn from some of the other reviews to do each section and then build the chairs .", 
    "I love these because they are lightweight, yet durable.", 
    "Great chairs. It took a little time to put together with the tools it came with, but with the right tool it got easier.", 
    "Be patient it takes time to put together but worth it once your done. Good quality look great", 
    "Chairs become loose. Need to tighten them regularly", 
    "These chairs were very inexpensive and a reasonable value for the money. The seats are flat not contoured making them very hard and difficult to sit on for any period of time. I did put foam and fabric on the seat and it is easier to sit on... How ever for the money they did suit the need.", 
    "Love the chairs what a great addition to out home", 
    "These chairs take a long time to assemble - my Father-in-law spent several different days doing it. They look pretty good for the price. Some of them are still wobbly despite is good assembly. But, for the price they work well and look good.", 
    "Just love these chairs. We needed a set of 4 chairs for an island in our kitchen and these were perfect! We searched all over and could only find sets of chairs that came with a table but we didn't need a table and buying chairs separately we well found the chairs to be too expensive for what we were looking for. Took a little over an hour to assemble the first and then other three we completed in about 1 1/2 hours. Well constructed and if I ever need more I'll be ordering them from Overstock. Thank you!!!", 
    "these chairs are good chairs.", 
    "Bought these to go with a table I ordered for our new house. Pretty easy to put together. However, when I opened it one of the legs of the chairs were split. Instead of dealing with hassle of sending it back so I just fixed it. Two years later, two of the chairs are broken. They broke from sliding in and out. These chairs are not forever, but will last long enough until you can afford the table you actually want.", 
    "Nice chairs for the money. However, buyer beware that they are inexpensive for a reason. Scratch easily. Start rocking over time and use.", 
    "I love my new chairs. Easy to assemble, they look great in my dining room. I bought them to replace the original chairs from my set. With age the originals fell apart and couldn't be fixed, these chairs fit right in like they belonged originally. I'm glad I took the chance.", 
    "I would prefer heavier chair if they are made with hardwood. But I guess you get what you paid for.", 
    "Chairs match the table perfectly, but after putting 3 out of 4 chairs together found out we were missing a piece. Very disappointing.", 
    "Chose these because of the seat height...perfect for our higher than standard dining table.", 
    "Inexpensive; not fancy... but functional, and easy on the eyes.arrive in LOTS of pieces though; be prepared for a long assembly task.", 
    "patience needed to assemble , but dollar for dollar the chairs are nice", 
    "Bought these chairs for a dining room table I purchased at an auction barn. Considering the reviews here I was hesitant. So happy I decided to buy them! Once one is together, the others are easy! Very happy with quality and they look great with my table!", 
    "I purchased these chairsbon sale at a really good price. They were a gift for my son. The two of us tried to assemble them and failed. Also, the screws were missing. My husband purchased screws and assembled them. They look really nice.", 
    "One of them arrived with the seat cracked down the middle. The rest are fine.", 
    "we love these! they look great, arrived fast - and have lasted us a long time!", 
    "They are holding up VERY well. I've had them for several months now and no complaints!", 
    "These chairs are not high quality. However, they are very affordable and do the job well for our breakfast table. Over time the screws become loose and the chairs are a little shaky. We have two kids under 3...these are inexpensive and can stand up to the messes easily. We've had the chairs for two years now. I'd say their lifespan will be about 3 years in our house.", 
    "I ordered these chairs to go with a table that I bought and didn't like the original chairs it came with. I looked for 3 months and found these, they are perfect! Took me 2 hours to put 8 together, my fingers were hurting from the alen wrench they provide for you to use. Super easy instructions and having no issues at all with the chairs! Win for us!!", 
    "these have held up a lot better than I was expecting", 
    "Sturdy, but needs a cushion for comfort. Needed something small for staging a breakfast room & the color isn't bad. More difficult to assemble than the average.", 
    "For the price, these chair as perfect. We ;had some issues with the product so I had to call Overstock. Without any hesitation and with haster, they shipped my the replacement parts. Truly excellent customer service!", 
    "Although the directions for assembly were terrible, we figured it out and my husband helped me assemble the first chair. After that, I easily assembled the other seven. These chairs have a lot of bolts, but that's good because once tightened they are very sturdy. They are also very attractive.", 
    "My friend had to reinforce the seats with clue and brackets. A small cost now they are stable and look very nice.", 
    "The chairs were easy to put together, they are sturdy and look great. Good value for the money.", 
    "Very exceptional chairs that you assemble , and are very high quality.", 
    "Chairs are very sturdy. The color is right on. Very happy with the order.", 
    "Nice looking chairs, however, they were hard to assemble and are not very sturdy, We had to add wood screws in order to make them stable. I would not recommend if intended for every day use.", 
    "I have spent more time trying to repair these chairs than actually being able to sit in them. They were easy to put together when I first got them, but have not been durable at all, they are very unstable. The legs and the back of the chair break off. . I would not recommend these to anyone unless they were planning on never sitting in them.", 
    "The finish is uneven, scratched, chipped, worn, or otherwise blemished. The legs are uneven on one chair making it rock. The holes didn't always match up well making it difficult to use that small hex wrench on an angle. No start holes for the wood screws made it impossible to screw the seats on with that stupid tiny PLASTIC \"screwdriver\".I guess you get what you pay for. We should have bought the more expensive chairs that matched our table.", 
    "They are the best . Love them.", 
    "I've had them for several years and it's a good, solid set of chairs. They look the same in person as they do in the photo.", 
    "Quite a bit of assembly required, so you'll need to set a couple hours aside for that. Some of the chairs have a wobble that I can't seem to straighten out, but the wobble goes away once you sit down on the chair. The look is absolutely beautiful, however and they are quite heavy, which I prefer in a dining chair. I use them in my bakery lobby.", 
    "They are lighter than i thought, once we put together one, the rest were easy", 
    "The chairs are fairly easy to assemble and are sturdy.", 
    "The chairs look nice and seem ok to begin but after 1 year we are down to two of the four chairs. We put them together with a screw driver, not a drill, but the wood still cracked with normal use.", 
    "Nice, solid chairs as advertised. Excellent chairs for the price. Fast shipping too.", 
    "I bought these to go with my black and brown table. I moved across country and couldn't fit the chairs in my car. Even though the quality of the table is much nicer than these chairs, they look like they are a set. We noticed some imperfections in the finish and there are scuffs and scratches but they do the trick and can't go wrong for the price!", 
    "These turned out to be great chairs but it did take us a while to get them assembled. Not difficult, just time consuming but well worth the effort for the money.", 
    "Takes a while to put together, but definitely worth it for the price!", 
    "I LOVE the color of these chairs, however they were a pain to assemble. The first one went fine, but the other three had holes incorrectly aligned which made them impossible to work with. Now, they wobble terribly, and even the one that started off great has since dwindled in its stability.", 
    "Beautiful Chairs, Great Price & Easy To Put Together!!", 
    "Look good, not overly sturdy. Good for starting out.", 
    "This is a piece of **** set of chairs unless you weigh between 80-120 lbs and have nothing but skinny little friends I highly recommend just stick with furniture stores you can actually see and inspect the furniture", 
    "Very durable. Takes a lot of punishment.", 
    "Easy to paint sturdy ! Love it", 
    "I ordered these chairs to fill in until I decide what I want for our dining room. They need to be re-tightened frequently but they're generally pretty good quality.", 
    "Perfect fit for my DR. Love the color.", 
    "Can't beat this price. .....makes my kids sit up straight and no legs on the chair...because the bottom has no cushion", 
    "didn't like putting together but they are beautiful", 
    "EAsy to assemble, sturdy, simple and attractive", 
    "For the price you pay they are worth it. I added cushions for comfort. They were easy to assemble. The color looks nice its a deep brown but after having it for almost 5 months the chairs that get the most use are beginning to chip.", 
    "My nephew, who had mad mechanical skills, had trouble putting these chairs together. I bought them for him as a housewarming gift. Once assembled they were attractive and sturdy.", 
    "sturdy, color is exactRecommend purchasing", 
    "I was so excited when I got these chairs we got them all put together which was not easy by the way and they seem to be really sturdy....so far out of all I ordered I now have three broken chairs the first one we merely sat on and the black back split from the legs not sure if I would ever reorder this item again", 
    "These chairs are great for the price, but took hours to put them together with an allen wrench. Once together, they do seem sturdy. No extra parts so don't lose any of the screws!", 
    "The product took over 2 hours for a professional to put together. Many of the pieces were damaged fairly badly (whether in shipment or from the warehouse). Desk looks fairly nice when together, though I would never recommend buying this - I would spend an extra few hundred dollars and get a higher end product that is put together or easier to put together.", 
    "The chairs are very nice and are what I wanted. The only problem was they weren't easy putting together. Extremely frustrating N,", 
    "These are not superior chairs, but are a good height for our table and will work well as our children are growing.", 
    "Unfortunately, my husband took 11 months to put these. together, so it was too late to return them. The quality is extremely poor, one is broken after only two weeks of use! They also are complicated to put together, which is probably why it took my husband so long. Now I have four chairs we are afraid to sit on!", 
    "These chairs fall apart easily. Just waiting to buy better chairs.", 
    "Very happy with these chairs. They were kind of a pain to put together but there were two of us so it wasn't as bad. I wouldn't recommend doing this alone, get help if you can. They look great and are very stylish. They are also quite sturdy and are all level. I don't know how much abuse they could take but I don't have kids and am pretty easy on my furniture so I'm not worried about it. I think that for the price I paid, they're a great value.", 
    "My daughter loves these chairs", 
    "After reading the reviews I was worried about the quality and how hard assembly would be. I took the chance and ordered them anyway. I have absolutely no complaints. We've used them for a month now and they are holding up well. When assembling the chairs, I did not have any issues with damaged or split pieces. All the screws screwed in without any problem and none of the chairs wobbled after assembly. A lot of reviews talked about how difficult assembly was but if you take the time to set your pieces out and look over the instructions fully before starting you shouldn't have any problems. I'm very satisfied with this purchase. Good value for the price.", 
    "It took me almost 6 hours or more to put the first chair together. The assembly is difficult especially working with those little tools included. The hardest part is placing the screw in that screw lock. Finally after I figured out how to get the screw in and lock it- the chairs were a cinch. I was truly ready to surrender but I hated the thought of wasting that money plus it was too late to get extra chairs other than folding chairs. Putting these chairs together was not that easy. Some of the pegs seemed loose but by chair number 3 t I could use that little Allen wrench to put them together. They do look nice and support my weight. I was ready to give up but practice makes perfect. Also at the end the chair has to be put on top of a table to put the seat on because the back and frame are one piece. The wood does not look cheap and I bet no one will guess I assembled the chairs unless they collapse at dinner.", 
    "I wish I had taken the time to read the reviews on this one. These chairs were very hard to put together BUT MORE IMPORTANTLY - the quality is very poor. I looked for the same rubberwood as my table (which I love) but ended up with low quality chairs that may only last for a year or two. I even asked one of the popup stylist if these would work. Save your money.", 
    "Bought these chairs for Thanksgiving but was surprised with the style and comfort. Would definitely recommend.", 
    "The wood was a very poor quality. One leg of a chair snapped in half the first time it was sat upon. The assembly was unnecessarily difficult. The wood stain used in finishing the pieces smelled toxic.", 
    "These solid wood dinning chairs were easy to ensemble, nice style and color - excellent for the price.", 
    "It didn't take me nearly as long as I had feared to put these chairs together. After reading the reviews, I was a little worried, but my 4 year old and I got them all done in just under 2 hours. I did them simultaneously and not one at a time. I used a drill with a allen wrench bit. Maybe that made the difference.The chairs are awesome. They are sturdy and comfortable and they look modern and sharp. I'd put them up against any similar wood chair in a furniture store or **** * any day. And for the price, I don't think you'll find better. I'm not buying my forever furniture, because I have kids, but I can see these lasting for a long time.", 
    "Overall the chairs are nice for the price. The wood is decent, the color is nice. However these were the biggest pain to put together. The cheap screws that come with them that tighten around the other screws are easily broke or stripped. There are absolutely no extra parts so if you screw on up you'll have to find a unique way to put them together. I would recommend this if your have plenty of time and patience to put them together.", 
    "These chairs arrived on time and all the parts were present. The chairs are not made to exacting tolerances so you have to center the seat yourself and then screw it in.Building the chairs was straightforward enough and takes about 30 min per chair using the supplied allen wrench. You will only need a phillips head screwdriver to attach the seat to the frame during the final step..For the money, its a decent set of chairs. They feel sturdy and with a chairpad, they are comfortable.", 
    "Very nice chairs for the price. Hard to put together but when done they are very much worth the price", 
    "The chairs were missing parts. The fourth chair had two sets of left legs, and so it cannot be used. I have written OVerstock, we will see what happens.", 
    "Read the reviews but decided to try it for myself. When the package arrived I anxiously opened it. I found broken pieces and cheap flimsy parts. We tried to put one together and it took at least 30 mins. The chairs are smaller than anticipated and the quality is just not up to par. This website does have great items but unfortunately these chairs are just not worth it. I ended up sending the chairs back and getting a full refund.", 
    "These chairs are very simple and beautiful which was exactly what I was looking for. My husband had no problems putting them together and we are both very pleased.", 
    "If you like a difficult to assemble chair, which 'rocks'\" even when assembled correctly, then buy these chairs. Very cheap.", 
    "The chairs did not match in color and there were not enough hardware provided. I cannot figure out how to just ask for more hardware. The chairs had nicks and white paint was on the surface of one of the chair seats. The chairs are comfortable to sit in and the instructions are too vague. It was easy to install but had to reverse a few of the pieces due to the lack of clarity in the instructions.", 
    "The chairs worked out great. Amazing deal for 4 chairs. Easy to assemble just missing some screws on one chair. It is the piece for the legs to connect to the side piece which is a metal screw. The hardware store didnt have any that matched. How can I request for this missing hardware?", 
    "I was looking for a while for small chairs for a dinning room in an apartment. These chairs are perfect, not only because they are small, they are good quality and they look fantastic with the table.", 
    "The wood is strong and appears to be solid. I bought these to go with my antique table that I refinished. I was impressed by the price and quality. Finish appears to be solid and very pleasing. I hve lots of little grandkids and so far it has held up very well to toy trains and cars from toddlers. I would recommend this to others. Putting together was time consuming but very worth the effort.", 
    "We needed 4 extra chairs because we bought a 8 person table and used 4 chairs that we already had. They match fairly well in color and no one noticed the difference. Their is a bit of assembly to these chairs which my husband and I flew through using an assembly line. The quality is more than I expected because of the price we paid. I would definitely recommend this product to others because of my experience with them has overall been positive.", 
    "a jcbc screw is missing. and after a 4 hours of work, including predrill and the instruction did not go into where to place the washers.", 
    "They are very simple, no-frills chairs. The backs are not very high but they are exactly as pictured, sturdy and a great deal.", 
    "Could not assemble pieces did not fit. Asked for refund but received another shipment of same. Did not open the second shipment but returned the second shipment by ups. Will be returning the first shipment when we receive another shipping label and manage to rebox it. Still awaiting a credit which was never received. Will never again order anything from overstock.com", 
    "I bought this to go with an amish made heirloom table that is solid oak I spent days looking for chairs in stores and online but in store wanted you to pay $XXX dollars more for the same thing. I was weary of ordering them but I needed chairs so I went ahead and ordered got to my house in 4 days. They were in all in one box and neatly protected by some foam. It took me 20 mins to get the first chair put together. The next did it in 10 mins each. I would suggest you get your husband to tighten the bolts but if your husband is a gym rat like mine then he might crack the wood. I would not say its cheaply made cuz he has broke things before", 
    "This set of four chairs cost *** or about ***chair, and that's about what they're worth. They look good, but the craftsmanship was not the best. Angles were slightly off, so that they were a challenge to assemble. They seem sturdy enough and they look good. I expect them to fulfill the purpose I intended, which was extra chairs for large dinner parties, not for every day use. THey would not be a good choice for everyday use, especially if you have family members who push the limits of the furniture (bouncy children, for example, or people who lean back in their chairs).", 
    "I wish I had read the reviews before purchasing these chairs. Good value but took forever to put them together. Many of the holes were misaligned and we had to drill new holes to put the seats on. Almost shipped them back after spending over 2 hours on the first chair but had already invested so much time. Next time I'll spend a few more dollars and read the reviews!", 
    "These chairs arrived partially broken and the wood was such poor quality that my husband would not even put them together even though we were opening a new restaurant and needed them desperately! We had to borrow chairs from the soup kitchen until we could find replacements. I have purchased from overstock.com before and loved the quality of my merchandise and therefore I will not hesitate to buy from them again. Thankfully the return process was relatively easy.", 
    "It was easy to assemble. Two days after using the chairs a leg snapped in half. The chairs were thoroughly looked over when putting together. Turns out the wood was very weak and poor quality. We were to terrified to use the others, even when offered a new leg for free. We politely declined and asked for our money back.", 
    "These chairs are great value for the money. Simple. Elegant. Sturdy. Easy to assemble - although the instructions took a bit of deciphering initially.", 
    "We had been searching for wood dinning chairs for quite a while. We didn't want to spend tons of money. We saw these and bought 8 of them. So far, after a few weeks, we are very happy. The wood is high quality and they feel very sturdy. We had no problems or any issues with the stain not being applied correctly. The instructions are fairly clear and the chairs are easy to assemble. The one strange thing is when you attached the seat to the chair, there don't seem to be screw holes in the right places. The screws that they give you are wood screws and go right into the wood with a screw driver and some force (not even not that much force). This might be why there are on overstock, because they are totally fantastic!", 
    "I bought these chairs to use in a second home and I planned to paint them from the start. That said, the color , style, and quality is as shown. The seats are very flat and are MDF , I believe, the slats and legs are wood. I lightly sanded and then spray painted and they look like cottage chairs. I don't yet know how they will hold up with grand children, but am pleased enough with the quality verses cost.", 
    "the price was just right, the chairs were what I was looking for. I `m very happy with the chairs. they are lovely.", 
    "As I mentioned, very comfortable and sturdy. Attractive and matched my already existing table perfectly. One piece arrived broken and Overstock replaced that part immediately without any hassle.", 
    "If you have ANYONE weighing over 100lbs in your household these chairs will break on them. That should actually be the guarantee the company includes with the product. The seat height is normal but the backs of the chairs are meant for a third grade classroom. Also, I'm extremely handy, I use tools and have actually BUILT a shaker table...these chairs took me nearly an hour each to build. Poorly illustrated directions and parts that you need to secure with wood glue to attempt to get longevity out of them. Overall: You get what you pay for. #moneythrownaway", 
    "This chairs have made a great improvement to our dining area. The quality is fantastic. The wood is heavy and sturdy and stands up to my 11 years old antics !", 
    "We have a large family, and we just bought a 14 seater table. These chairs looked like an economical way to provide a spot for everyone at our dining table. The chairs (although time consuming) were easy enough to put together, and they are nice looking. However, within the first two weeks of our purchase, I broke one of the legs off of the chair simply by scooting back. Grant it, I'm pregnant, and I tried to scoot on a rug, but I am not a \"large\" person by any stretch. I figured it was just a freak accident, and wasn't too concerned about it. Unfortunately, my husband, who is not fat AT ALL did the same thing last week. Apparently the wood the chairs are made of is not very sturdy. The chairs are cute and cheap, but they are not extremely durable. My recommendation is that if you plan on purchasing these chairs, use them on a hard surface. I do not know if they would hold up in a restaurant situation. All in all, they're nice enough, but you get what you pay for.", 
    "Well where should I start I got the chairs and there not espresso more of a cherry walnut and I tried to return them with a $30 dollar charge so I kept them and the second day u had them one chair broke while sliding it out I had to repair it by putting two screws through it how disappointing I would not recommend these chairs trust me", 
    "Chairs arrived faster than anticipated. Directions not the best but doable. First chair took ~ 30 minutes to put together and the rest about 20 minutes. I glued each dowel for added strength. They look good and match the butterfly table I had perfectly. They are hard chairs but a thin pad helps and also gives it a punch of color. I was missing a piece of hardware but was able to make it work anyway. Did not contact Overstock for extra pieces as I wanted the job completed. Overall, nice chairs and would recommend !", 
    "My husband and I purchased these chairs to match our 60 year old dining table.The wait time for shipping was not long.The quality of the metal hardware (screws and fasteners), are terrible.When we went to assembly them, over half the hardware stripped out on us.This is not due to us over-tightening.It is expected to have one or two strip out, but not over half.We were only able to get 2 out of the 4 assembled.We ended up getting an exchange on this order.I will say, however, the quality of the rubberwood is very nice, but overall, not worth the money we put into it and our Overstock.com shopping experience has left a bad taste.", 
    "It took forever to put these chairs together. Truly a pain. I bought them approximately a month ago. They have had very little use, not even close to daily, and already one chair has a broken leg. It did not break at a joint but literally in the middle of the leg. So disappointing. You get what you pay for, but usually Overstock has much better quality items. Sigh", 
    "The chairs were a little hard to put together , but they were very sturdy. I had one defect with one chair , but its hardly noticeable. They look very nice and the price was great. I rate them a 3.9!", 
    "Had to assemble however was simple enough for anyone to do. Chairs are great for a secondary dining room setting which is what I needed.", 
    "Bought these chairs for my son. He put them together easily. They are sturdy and attractive. The un-upholstered seats are perfect for anyone with children -easy to keep clean. And the price couldn't be beat.", 
    "The terrible part of this set is that they are impossible to assemble. We are good with putting things together but this needed a cabinet builder to finally finish them. There were so many parts and pieces that we werew starting from scratch. It took hours! Once completed they looked good and were sturdy. Somehow it just has to be easier.", 
    "Very easy to assemble, sturdy. Overall, very pleased!", 
    "I bought these after reading reviews, satisfied that you get what you pay for. If you buy these, go to the hardware store (or big box) and buy a screwdriver that takes a bit holder. Then buy a 5/32\" hex bit for that holder. If you have a good drill that runs at low speed, there is no reason you cannot use it to screw in some of the hex-head bolt. If you use the hex wrench that comes with it, then enjoy because you are waaay overworking. Also, get some wood glue. For the life of me I cannot figure out why a piece that uses wood dowels would not recommend gluing them. Put a few drops (not a lot or it will squeeze out) into the dowel holes before you make the connection. I've just assembled two and will do the other two tomorrow--had to stop for dinner. Once you have assembled one (about 30-40 minutes), the next one will take about 20 minutes. To look at, they are nothing special, but adequate for my daughter's apartment. My biggest complaint is the seats are totally flat--no curvature for your ar%$ at all. If you don't like the exposed hex heads (on the sides of the long legs that also hold the backrest) it would be easy enough to fill them with a colored putty.", 
    "I already had a table, and I struggled for a long time to find chairs to match. It was very difficult! There were so few items that matched the style and color of my table, and the ones that I did find were almost $200 for ONE CHAIR. YIKES! Then I saw these, and I just had to get them. I actually ordered two sets - 8 chairs for less than $300. Wow! Honestly, I was worried. At this price point I was not expecting the world's greatest chairs. I was afraid they would be totally crappy and would fall apart, but they're actually not. They are very sturdy. It is a lot of work putting them together. My husband and I each did one a night for almost a week. I think the do-it-yourself factor is why they are so inexpensive, but the end result is so worth it. They are simple, Shaker-style chairs, and the color is perfect. I am very happy with them!", 
    "The chairs arrived in a timely fashion and my husband was able to assemble them quickly. They are good chairs and match our existing table perfectly. This was a great buy; the price was good and they shipped very fast. Just what we needed!", 
    "Chairs are solid, a rich brown color that gives this chair a pricy look.", 
    "I had ordered these to use around my dining room table and realized when we got them that we had to build them. Ok, so no problem, execpt the tools didn't come with cover inserts to cover up the screws where the holes are. I returned the chairs as they were not the desired sturdiness I needed. A great set of chairs for small people and a starter apartment. Price is good for that.", 
    "I didn't have trouble putting them together and they serve the purpose. Look nice in my dining room. Can't beat them for the price, I had been looking for chairs for quite a while and just couldn't justify the high prices. These are just perfect.", 
    "Great price for 4 chairs! Great looking! They are easy the put together, takes a little time, but not bad at all. I bought a total of 8 chairs. They started to wiggle a little bit. I took out 4 main screws under seat that go into each of four legs and put some cement glue in holes, re-screwed and they are holding up great!!! Highly recommend!!", 
    "Except the mix up on a few parts.Livestock was awesome with fixing the situation. I loved every one of the chairs. I would definitely recommend this product.", 
    "These are nice chairs, once you get them assembled. The assembly was cumbersome for the first chair, but once you get the hang of it each chair goes faster. I like the weight and the color of the wood. Would definitely recommend them to others, especially for the great price.", 
    "I didn't expect much from these VERY inexpensive chairs, but they are weighty and secure feeling. Spend time on assembly.", 
    "The chairs are sturdy but you can see the large screws on the sides of each chair. In the picture the chairs look nice but in reality they are very cheap looking. We had a nice expresso table I was matching the chairs to. The chairs match but there is a big quality difference.", 
    "It was a little bit of a challenge to put them together, but they are gorgeous and exactly what I expected. I will be ordering in the future.", 
    "Worst buy, not at all impressed. The screws show at the top of the chair on the sides and just.. ugh. I HATE these chairs, it did not match my other nice stuff. Nothing you can do will make these chairs feel high end. Overstock.com is amazing tho for letting me return them!! So impressed.", 
    "My husband built a table and I needed at least 8 simple chairs. These are clean lines and nice color and not too heavy. Takes a little time to put them together but they are very nice, especially for the price!", 
    "These chairs are great for our kitchen table and we love the color. For us, the price is right and I made matching seat cushions. The chairs can get a little hard so they only get 4 stars. With the seat cushions, a 5!", 
    "Good value. Nice product. The chairs were exactly as described. They were easy to assemble with the instructions.", 
    "i loves these chairs the leg to one of the chairs was broken but they send me replacement parts within a week.These are wonderful chairs they match my new table very well.", 
    "It requird some work to assemble them but not bad for the price.", 
    "The quality of these chairs were a little better than I expected. They were simple to put together, they look nice, the color matches that of the picture perfectly. All the chairs I have assembled have held up beautifully, considering they are exposed to 3 small crazy children. My only complaint is that the bolts in one or two of the chairs loosen over a relatively short period of time making them unstable. I have had to tighten the allen screws repeatedly. With that being said, for the price, they are a great deal.", 
    "I actually hadn't expected such nice quality, and such sturdy chairs. They are very versatile either around my oak drop leaf antique table or as side chairs in the living room. I also have used one as a desk chair which goes perfectly with my dark hardwood espresso desk and bookshelf (also furnished by OS) in my study. I have always been confident when inviting guests in to enjoy the comfort of my OS furniture.", 
    "Would difinately recommend this product and Overstock for quality and fast delivery", 
    "Nice chairs but rather difficult to put together. Very time consuming. Hopefully they will last a long time and conter the time spent with assembly.", 
    "In all I was very pleased with the product and will continue ordering from overstock.com", 
    "It's pretty slow to figure out how to ensemble but once you get it it become a fast assembly line! Love the chairs!", 
    "We love our new chairs. They are sturdy and high quality, just as depicted on Overstock. The legs are even (not rocky or wobbly) there were no problems with putting them together once we received them. Shipping was quick.", 
    "These chairs are excellent for the price. Solid wood. Color is accurate. Quality construction. My husband put them together in a couple of hours.", 
    "I read all the reviews so I had an idea of what to expect. My only recommendations are these: (1) put these together on carpet; and (2) put in a good movie while puting these together. It took me several hours to assemble the four chairs. Alot of tightening and I was glad to have it done. Following the instructions is a bit tricky but I figured it out and was a pro by the second chair. All the hardware was there and when all done, they all look the same. I am happy, the kids are happy and I am sure the husband will be happy when he sees it in the morning.", 
    "Chairs came unassembled and were missing the drill holes. When put together they remain very flimsy and very poor quality. I wouldn't recommend buying furniture from the website. Would have been to difficult to return such a large item.", 
    "I really WISH I had seen this offer before I went out and bought four unfinished rubberwood chairs. For eighty dollars each. It wa.s the most horrific mess staining them, and getting them to be \"espresso\" in color was nearly impossible. They are streaky and the stain didn't take at all in some spots. After three coats. In addition, I had alll the sanding and the endless coats of polyurethane, NEVER AGAIN. If only I had waited, I would have bought these four chairs in a heartbeat. Don't make the same mistake I did, trying to save money. I spent an endless amount on finishing that raw wood... I could have bought four sets of these charis, already finished, for my investment in the others. Overstock has never let me down. A loyal customer of big furniture items for the past decade, keep up the great work, Overstock!", 
    "These chairs are the pride of my kitchen. I love the color on the seat. I will die before they leave my kitchen", 
    "You get what you pay for! From afar these look good but up close the flaws appear. Joints are slightly misaligned, chairs dont fit together perfectly. Putting these chairs together makes ikea furniture look simple!", 
    "Very happy w/ the chairs! They arrived quickly (4 bus. days) and the directions were very clear on how to put together. So glad I found these at such a great price. They are very sturdy and look great around my dining table.", 
    "These chairs look pretty nice, but the back is too curved for me, so that my back really only leans against the very top of the chair back. Maybe they would be more comfortable with some cushions, I will try that. Fiirst chair took me 45 minutes to assemble, each one after that 30 minutes. I was missing one nut, but Overstock shipped the missing part out to me within less than a week. Overall, nice for display, not so great for actual sitting.", 
    "these were cheap looking and not stable enough for my large employees to sit on. i woudl not recommend this product,", 
    "I ordered the chairs to match the Yarra Dining Table and they match perfectly. Fairly easy to assemble-it took about an hour. Great sturdy, sustainable wood. They do not look cheap. Great value. The sides of the chair back show the black screws and I wish they were not so visible. However for the price, great quality and value. I would definitely recommend this if you are looking for nice chairs at a low price.", 
    "The new chairs look wonderful. The first one took a few minutes to figure out putting together but the rest were then easy. I put together 8. yikes! I also had a few ill machined bolts so they would not work but I called overstock and they handled it like pros and before a week was up I had the new bolts and my final chair in place. I love them!", 
    "After reading the other reviews I was a little hesitant to get the chairs because I thought that they did not come with any screws. Fortunately, mine came with everything I needed to put it together. The chairs all look great and matched my table perfectly. I am very happy with the quality of them would love to buy more, but I can't fit any more chairs in my dinning room.", 
    "These chairs look fine. They are sturdy and steady. The quality is good. They did send us the chairs with a few screws missing, so we had to contact overstock.", 
    "These chairs are great, very solid - the only problem we've had was putting them together. There were so many screws and some of them were stripped, we also didn't receive as many as were needed and had to purchase some from Home Depot. We were also short several cross dowel nuts. So, unless you have tons of patience and enjoy using an allen wrench, I wouldn't suggest getting these.", 
    "we liked these chairs very much. it took some time putting them together. only problem was it took a couple of shipments to get the front leg that didn't have a crack at the bottom of them.", 
    "Having read the reviews I realized that you get what you pay for and that it would probably take a while to get them assembled. I've assembled many, many items from various online/retail stores and never in my life have had so much hassle putting four lousy chairs together. It took over FOUR hours to get them assembled. The short bolts don't all screw into the cam nuts properly and I ended up stripping 6 of them to the point of not being able to use them. I had to leave out a few to complete the set of four leaving the last chair to not be as sturdy as it should be. Like previous readers mentioned, you see the ugly heads of the bolts on the sides of the chairs. You definitely get what you pay for, but these took just way too long to assemble. I just am thankful I did not buy eight, else I'd still be putting them together.", 
    "Although the wood is nice and they are well constructed, the price reflects the assembly required! There is hardly ANY assembly NOT required. I am still working on assembling the chairs 4 weeks later. If you are very handy and mechanically inclined, you'll be fine. Otherwise, buy real chairs, not pieces parts!", 
    "I was a little worried when I ordered these because of the complaints about the difficulty assembling. But I took a chance on them. I'm glad I did! Yes there is some work putting them together, but I didn't think it was very difficult. The instructions are clear. There were two dowels missing, but I had extra from a different project. They seem very sturdy and a lot more solid then the Ikea chairs I had. FYI, I'm a 35-year-old woman.", 
    "Good construction, quality, and color! Easy to assemble. I was surprised at how large the seat of the chair is... much larger compared to most inexpensive sets. I am very pleased with my purchase!!! They look fabulous!", 
    "These chairs make a beautiful addition to our large country style dining table. The color is exactly as pictured, but there is one down side! A pain in the butt to put together. Took my husband a week to do them by himself (which may have been one of the issues). There are a lot of parts that go to these chairs, but the end result was worth it. I would recommend these chairs to anyone as long as they have the time and a friend to help put them together!", 
    "We ordered three sets (12 chairs) of these chairs. The chairs look really good for inexpensive chairs. The first set of chairs took about 30 minutes per chair to assemble. The subsequent chairs took aroud 15 minutes per chair for my wife and me to assemble. Make sure to keep the allen key that comes with the set because after you use the chairs they will probably need to be tightened again. Overall these are great chairs for the money.", 
    "These chairs are a little work to put together, but not quite as bad as some other reviews, about 1-1/2 hours, the first one is the longest. Nothing too complicated. The capscrews are visible once the chairs are put together but blend in well with the chairs as to not make them stand out. The chairs are very stable and solid once complete, they are probably prone to marks but I have not had any problems yet with my 8 and 6 year old and to 80# dogs running around. We got them for the eat in kitchen where we do most of our dining, game playing, crafts, etc. For the price and for what I need them for I think they are a good deal when compared to spending $400+ for other chairs. These are solid and stable chairs.", 
    "These chairs look good from a few feet away and if assembled properly are sturdy and functional. While they are not the epitome of quality furniture they do represent a good value in the market. Assembly may be a challenge for some as there are a lot of parts that must be attached. I consider myself quite skilled at assembling components and it took me a full 2 hours working quickly with hand tools to assemble four chairs. The chairs met all my expectations and I would recommend them to anyone looking for a good looking functional chair at a bargain price.", 
    "These chairs look great! They take a little time to put together. They are a little wobbly. I do recommend these chairs", 
    "very pleased to see the chairs are a perfect match to the dining table; the assembly instructions are quite helpful; its been a good experience with all your products to receive easy assistance to put together the items - your merchandise arrives timely and boxed perfect. I will enjoy the chairs, solid stylish look and pleasing wood color.", 
    "They match beautifully with the table. They are a bit tedious to put together, but other than that, excellent.", 
    "These chairs are an excellent value as long as do don't mind assembling each chair. The only thing that is preassembled are the chair backs. As with any piece of user assembled furniture, you need to ensure a hex screws are tightened properly in assembling the chairs. The chairs are sturdy even though the legs appear to be somewhat slender. The legs and back are all solid wood, but the chair seat is definitely MDF even though the product description says solid rubber wood. We bought this to go with a wooden kitchen table we have already. It looks great and we think it will hold up well for the intended purpose.", 
    "I've had these chairs for over a year now and they've been holding up great, even with kids rocking on them and hanging off the backs. Really good value for the price.", 
    "This table was exactly what my husband and I were looking for. We needed a small drop leaf table for our kitchen area and did not want to spend a lot of money. Several things that potential buyers should know about this product before buying: 1. This product is inexpensive. Please be aware that you will get what you pay for! The mechanism by which the leafs are extended is a sliding piece of wood. It DOES NOT create a seamless transition from table to leaf, but rather the leaf hangs a little lower than the rest of the table. 2. The table is very easy to assemble. The chairs are a bit more time consuming. There were several pre-drilled holes that had imperfections and required a Dremmel to fix, but this was not an issue for us. The chairs (as long as they have a pad on them) are very comfortable and seem very sturdy. 3. When we first received the table, it was cracked down the middle. I called Overstock.com immediately, and within several days they had delivered an entirely new table in perfect condition. Customer service was exceptional. Basically, I would recommend this table to anyone who is looking for an inexpensive table that they do not intend on using on a daily basis. My husband and I are very pleased with it, and it looks great in our kitchen, but we don't have particularly high expectations of it holding up for an extended period of time. It was exactly what we needed, when we needed it.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Slat-Espresso-Rubberwood-Dining-Chairs-Set-of-4/5206335/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5206335/Simple-Living-Slat-Espresso-Rubberwood-Dining-Chairs-Set-of-4-c0db5b58-e9a7-4baf-b810-29ee0a956e93_600.jpg"
  ], 
  "description": "Provide your guests with a comfortable place to enjoy meals with\nthese Simple Living dining chairs. Sold in a set of four to\naccommodate a family or small group of friends, the chairs sport a\ntraditional slat back design with a sleekly modern espresso finish.\nSince the seats are not upholstered, you can customize the set with\nseat pads that express your tastes.Set of four chairs to complete your dining setRubberwood construction for strength and sustainabilityEspresso finish and slat back design offer good looksSeat height measures 18\"Chairs measure 35.25\"H x 17.5\"W x 19.75\"DFour chair set assembles in about an hourStyleMissionMaterialRubberwood, WoodChair TypeDining ChairsSet SizeSet of 4AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBrownFurniture Frame MaterialWoodFurniture PatternSolidProduct FeaturesEco-FriendlySeat StyleSolid"
}