{
  "name": "Simple_Living_Portland_Glass_Door_Cabinet", 
  "price": "EUR 155.93", 
  "reviews": [
    "Ordered 2, one was damaged upon arrival (not in transit-- box was pristine, but damaged in the box). I'm hoping it can be returned without issue. Went ahead and assembled the other and asked for a replacement cabinet (not a refund) for the one that was damaged.The good: I ordered the red and it is really the PERFECT deep red I was hoping it would be-- not too orange, not too wine. Kind of a dark, candy apple red.. It also looks like a much more expensive piece than it is once it's assembled.The bad: If you so much as look at it crossways, you will ding the finish. Fortunately, I recognized that when I was taking it out of the box, so I was very, very, very, very, VERY careful when putting it together. It comes really well packed in styrofoam, and I ended up using the packing materials to cushion it when I was assembling it. There are still a couple of tiny nicks where I dinged it with my cordless drill/ screwdriver while assembling it, but nothing noticeable. But really, BE CAREFUL when you're assembling. Really.The assembly: Amazing, actually. When I began unpacking and saw it was made in China and there were spelling errors in the instructions, I had my doubts. That said, I was really impressed with the assembly, and I did it myself. Took about 2 hours because I got ahead of myself and didn't read all the way through the directions, so I had to backtrack a couple of times, but if I'd been more careful I could have had it done in about an hour, I think. Each individual part you need is labeled or numbered, so there's no way you can mess up which screw you need for which part of the assembly. There are a couple of tricky parts that you want to be careful on, and it really doesn't \"sturdy up\" until you get the top on, but have faith, it will come together. The diagrams that come with the instructions aren't 100-percent clear at first glance, but if you take a sec and really look at the picture compared to the part you have, it makes sense. The only other part I'm not crazy about are the handles-- kind of an ugly fake brass, but that's an easy change. I probably wouldn't recommend this for every day heavy duty use, but for me, I'm using it to display crystal and I can envision putting a cloth on the top and using it as extra serving space for big parties or something like that. For that type of use it's a steal. I'm pleased and would purchase again. One thing to note-- you WILL want a cordless drill/ screwdriver for this. If I'd had to put all those screws in by hand I'd still be working on it.", 
    "We read the other reviews before we purchased. Several advised being \"very careful\" during assembly or that the pieces shipped were wrong or damaged. Our pieces all seem to be for this product. However, the screws included needed to be adjusted somehow before using to put together the body or the wood of the body splits. This was not discussed in the instructions. We read through them in full before we started (also advised by other reviews). Also, the pegs are stuck inside the body of the cabinet and not easy to pull out. So when one peg split, we had to drill it out, instead of simply replacing the peg. We are very disappointed in the value of this piece. Even at $$$, we would expect a little better wood than this. While the cabinet overall looks nice, it is incredibly cheap and impossible to put together without damaging it--with even the MOST CAREFUL ASSEMBLY.I would advise you to look elsewhere.", 
    "Got it in red to spice up dining area. It was easy to put together. However be careful with wooden pegs they break easily. For the price its a great item. I store wine glasses in it and there's plenty of room. It has a nice modern look to it. I think you will like it and realize that it's not expensive and you get a nice little cabinet. Thinking of getting it in another color.", 
    "When unpacking, numerous parts were missing and damaged. When a product has in big bold writing on the front cover of the instruction manual how to contact them for replacements for missing/damaged parts, RUN!! Upon emailing the address to get my replacement parts, it was pointed out to me that the model number doesn't match the part numbers I was requesting......seems they sent me a manual for a completely different cabinet!!! To say the least, this has been such a headache from beginning to end, and unfortunately, the quality of this item is mediocre at best. I should have stuck to my gut and splurged on a more quality piece. Lesson learned....you get what you pay for.", 
    "Pros:Red color is niceEasy assembly Cons:Cheap partsWood splits easily\"Glass\" seems more like plasticShelves are flimsy", 
    "It's adorable, not too big or too small. Putting my Christmas dishes inside this cute cabinet.", 
    "I purchased the white 31\" high cabinet. Every piece was numbered, and all the hardware was in little bags and numbered as well. Took my over 2 hours to assemble this, you MUST look through the instructions! The only tools needed are phillips head screw driver and some patience. The finish looks nice but take care & use the foam in the packing to cushion as you work. It is a brighter white than I expected. Sturdy enough for my TV in top.", 
    "I use this in my open style dining room. I fits perfectly under window and is very sturdy. It was easy to assemble and very useful.", 
    "Nice cabinet well constructed easy to assemble.", 
    "I ordered the tall cabinet and this cabineT and they are perfect. I can't comment on assembly as I had our handyman do this project.. No complaints re: broken glass or scratches.. It s clear that this is compressed wood and I bought the black finish. Looks more expensive than the price....", 
    "Nice piece, went together easily and looks fine. I was a little disappointed that while unpacking it 2 of the pieces had scratches already, and of course, both where you can see them once assembly is complete. I should have returned it, but I can live with the marks, easier than the hassle of packing it back up and waiting for my money back. I do like it, and it looks and works just fine. Feels pretty sturdy and looks like it cost a bunch more, so I am happy with it.....but if you care about the scratches more than I, you might think twice.", 
    "This cabinet is beautiful and easy to put together, I bought the red one and the color is stunning. Fast shipping.", 
    "This piece was a great price, but the quality is just ok. It looks expensive until you touch it. The magnetic closure is made of plastic, I'm sure I'll have to make a run to the hardware store to replace it soon. However, for around $***, it's not bad. If you just need a simple piece that looks good, it's a decent buy. Expect it not to last forever. I hope to get at least 2-3 years out of it before it starts falling apart. For indoor use only.", 
    "It was not difficult to put together. I would have totally satisfied but the doors do not line up correctly. There is a gap at the top.", 
    "I like the red color. It took a bit of effort to put together, but the directions were clear and all parts fit.", 
    "Very easy to put together ! Just the right size for a small space.", 
    "I'm happy with the cabinet overall. Its not solid wood so expect for it to be light and easy to move. The glass is also a bit flimsy BUT it is a charming little Buffett table and i enjoy having it a part of my living space!", 
    "Nice small footprint in a rich deep red. We are using as a media cabinet in a corner of a living room. It looks elegant. Highly recommend", 
    "Easy to assemble and really nice looking", 
    "great color, it lights up the dining room!", 
    "LOOKS GREAT! I USE MINE IN THE DINING ROOM AS A SIDE BOARD", 
    "The quality is good. It's a solid item and looks really pretty. 1 star less because the item was damaged when i received it. It had scratches at 3 different places.", 
    "Took a while to put together but is awesome looking"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Portland-Glass-Door-Cabinet/9316537/product.html?recset=df65c005-dc87-4db3-b33c-10327aff707c&refccid=6YK4GEDSR4YZQCCOEGPJIQ7DFI&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9316537/Portland-Cabinet-5145329a-dc03-4732-8f30-cb85d7e592e7_600.jpg"
  ], 
  "description": "Add graceful, useful storage to your home with this glass door\ncabinet. Display your dishes or serving pieces in style behind the\ntempered glass doors of this classic cabinet. It is perfect for\nkitchens, dining rooms and even halls, thanks to its compact size\nand adjustable shelves. The two-door cabinet comes with all the\nhardware needed for assembly.Color: Red, black, antique whiteMaterials: MDF with particle board, tempered glass doors,\n  metal handlesHardware finish: MetalTwo (2) door storage cabinetTwo (2) shelvesDimensions (overall): 31 inches high x 32 inches wide x 15\n  inches deepStyleContemporaryMaterialMDF, MetalFinishBlack Finish, White FinishAssemblyAssembly RequiredColorBlack, Off-White, Red"
}