{
  "name": "Simple_Living_Stella_Dining_Chair_(Set_of_2)", 
  "price": "EUR 230.02", 
  "reviews": [
    "So comfortable! Enjoying.", 
    "I just bought 10 of these chairs back in 1/11/16, and one of them already broke. The chairs are beautiful but the quality are horrible.", 
    "love the chairs. very stylish, sturdy, and the color and fabric is exactly as described. excellent accent chairs for my dining room. unfortunately one of the chairs I received had a stain on the fabric. I contacted Overstock.com customer service who sent a replacement part within days. mistakes happen and they were very quick to remediate the problem.", 
    "I put these together in under an hour by myself. They are very well built and sturdy and the coil seat really does make a difference in comfort. But most of all I love the teal color. It is a really nice accent chair in my living room and just in time for my holiday get togethers.", 
    "We bought these chairs to use as captain's chairs on each end of our dining set, and they work perfect. They are super comfortable, solid and over-sized (they look much smaller in the picture). They'd also work great as accent chairs in a corner or on each side of a buffet table; I'm thinking about ordering another set for that purpose. The color and the pattern of the fabric is very modern and stylish."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Stella-Dining-Chair-Set-of-2/10513771/product.html?recset=8aba1583-b205-436b-83f3-9856ad324913&refccid=KHKJ4FPXJPPLFUCKYYVQMBIY7I&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10513771/Simple-Living-Stella-Dining-Chair-Set-of-2-a6396527-e661-4a41-944d-f55ef78912a3_600.jpg"
  ], 
  "description": "Crafted with contemporary style, the Stella Dining Chair is the perfect addition for your dining room or sitting area. These chairs are constructed of sturdy rubberwood and upholstered in your choice of a lovely grey or teal fabric with piping along the hourglass shaped back. The coil spring seat is designed for utmost comfort so that you and your guests can enjoy a leisurely dining experience.Coil spring seatingHourglass shaped backSet includes: Two (2) chairsChair dimensions: 38.75 inches high x 20 inches wide x 19.5 inches longSeat dimensions: 18.5 inches high x 20 inches wide x 17.5 inches deepWooden side chairs and dining table sold seperatelyChair weight: 21 lbs.Furniture Pattern: PrintMaterial: Rubberwood, Fabric, FoamStyle: TransitionalColor: Blue, Grey, Green, Off-WhiteStyleTransitionalMaterialFabric, Foam, RubberwoodChair TypeAccent Chairs, Dining Chairs, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBlue, Green, Grey, Off-WhiteFurniture PatternPrint"
}