{
  "name": "Simple_Living_Slat_Black_Rubberwood_Dining_Chairs_(Set_of_4)", 
  "price": "EUR 141.31", 
  "reviews": [
    "I've assembled the first of the 2 batches of these chairs that I ordered. I was skeptical thinking these chairs may be flimsy, but they have turned out to be nice and solid!! Here are some additional details about the chairs that might be useful: * the chairs weight about 15lbs a piece and feel very solid when you pick them up. * the frame construction uses pocket screws (hex bolts actually). * there are at least two hex bolts for attaching each leg to the frame -- perpendicular to each other -- so if the chair loosens you can tight up that hex bolt. * the chairs are made of rubberwood, which has about the same density at maple, though it is more porous so not a durable. (over time we'll see if that is the case) http://www.answerbag.com/q_view/2011912", 
    "Be prepared for an all day, exhausting project if you buy these. Every single part of the chair is a separate piece. Your hands and back will ache by the time you are finished and it indeed takes two people to get this done. After the first chair, we developed a sort of assembly linre process but still it took all day. This puts new meaning to the phrase \"assembly required.\" The end product is sturdy enough, though we ended up with one split leg and partially split lower back. The leg was easy enough to replace but nothing could be done about the back without taking the entire chair apart. I was not about to put together one more of these chairs. This a hard call becauise the end product is a good deal, but I would not have purchased these had I known how hard it would be to assemble them.", 
    "Excellent value. Yes, you have to put the chairs together, but the effort/time is worth the savings. These same chairs at a local furniture place would have cost me 6x as much! We boought 2 sets (8 chairs), so it took some time to put together, but with the help of a friend, we had them done in a couple of hours total. Once you get the first one figured out they go together quickly.", 
    "Great chairs once they're put together. After the first one it is a little less difficult. The manufacturer could have supplied covers for the screw holes as they are quite large and give the chair an unfinished look. The chairs are sturdy though and should last for quite a while. Great value for the price,", 
    "These chairs are GREAT for the price. Yes, you see the screw heads on the side of the chair. However they are black to help them blend - and you aren't paying very much per chair for this product! I was missing a few screws, which overstock was VERY responsive to my inquiry and I am expecting the missing pieces any day now. So far the chairs seem very solid. I am very happy with the value of this product.", 
    "So far it meets my needs and about what I'd expect from a relatively cheap set. Although, the wood is pretty soft and thin so when assembling it the wood cracked in a number of places. None that are visible, but it remains to be seen how that will impact the longevity. I just noticed last night (after about a month of very minimal use) that the paint on the top of the table seems to be cracking or at least raising up like the wood underneath is cracked. From what I can tell this will fit the bill for what I need for the near term under light usage. If you're looking for something that will get used daily and not so gently, I might look elsewhere", 
    "The little alan wrench they give you would have been a real pain to use. Using my screw driver with a hex end attached took me almost 3 hours to put all these chairs together. I found I had to tighten the screws connecting the seat to the back after a couple of days worth of use. I've had the chairs for a couple of weeks and they seem great so far. Pay attention to the height. These chairs are not tall by any means. But I recommend them. Excellent chairs.", 
    "I am very pleased with the dining chairs. I feel I have received 4 decent chairs for the best price around. I was looking for kitchen chairs that would work well for 3 growing and destructive children (and myself). These chairs are perfect. I was surprised by the seat portion of the chair; it is made out of some kind of particle board (not wood) and then covered with something. But I have realized after a bit of use that they are more durable for my children and very easy to clean. Regarding the comments/reviews about assembling the chairs; I was expecting a huge project. I was happy to find the assembly easy and not nearly as time consuming as some of the other reviews had implied. I guess I expect and don't mind some work involved when you are paying this price.", 
    "THESE ARE WELL MADE & WERE EASY TO PUT TOGETHER. THE INSTRUCTIONS WERE WELL WRITTEN...I AM WELL SATISFIED.", 
    "After reading all of the other reviews, I decided to take a chance on these chairs. I am very pleased with them. Once I got the first one together, the rest were a breeze! I would highly recommend them!", 
    "These are attractve looking, well built, sturdy chairs. They were easy to assemble but a little time consuming. I purchased 8 chairs and it took me about 2 hours to put them all together. The directions were not as clear as they could be but with a little logic, they went together. Once you get the first one assembled, the rest go much more quickly.", 
    "the quality is VERY good. very heavy, not the least bit wobbly. No one would guess they were SO inexpensive! amazing bargain! would recommend to anyone! they fit booster seats fabulously and are VERY study and safe - don't worry at all about the kids sitting and/or wiggling in them! fabulous!", 
    "Easy to assemble and very sturdy. I added \"feet\" to the bottom of the legs so they slide easier on the rug.", 
    "Patience is required - these chairs have lots of nuts and bolts. Took me about 2 hours for the first chair, after studying the rather confusing directions. Subsequent chairs were faster - still, a lot of parts. I am thinking of gluing on the seats - the little wood screws provided are pretty insubstantial. Don't tighten everything down until the seats are in place (which the directions say at the very end). All in all, great for the money, if you have time.", 
    "The chairs are nice and heavy. But as the other reviewers stated they are very hard to put together. Some of the materials were defective or missing for putting them together. Luckily I got more sent to me with no problem. In the end they look nice and I am so far happy with them.", 
    "They sit a little too high for my dining room table, but otherwise good chairs.", 
    "A couple of the longer pieces came broken. Overstock handled the problem quickly, expertly, and had those pieces to my house within the week. I knew they would. Which is why when I saw the broken pieces I didn't get upset, I just emailed overstock and the problem was fixed. These chairs are very similar to a chair set they had 5 years ago that were brown. My mom sat on a chair and tried to move it across the floor while sitting on it. Broke the chair. So I had to get another set, and luckily these match close enough. These are great if you have cats that jump on chairs because there is no material for them to claw into. Naughty kitties. These last for absolutely years, and I love them and I love overstock.", 
    "Good luck putting these chairs together! The angle that you have to be at to join the legs to rest of the body is close to impossible. To top it off when you do get them together a good majority of the screws will be stripped. We've had these in use for less than two months and we are constantly having to try (stress try) to tighten them. Not only that, five have gone in the trash from having broken legs or backs.", 
    "These chairs are missing the pre-drilled holes in the seat. In order to put them together you need a power tools to drill in the holes to the seat so you can attach the seat to the chair frame. I would not recommend buying these chairs.", 
    "I would buy more of these chairs if needed. They are a bit uncomfortable, but cushions help that right away.", 
    "I Love these chairs !!!!!", 
    "Was a bit time consuming to assemble but they are well constructed chairs.", 
    "Good Chairs for the price. Happy with the purchase.", 
    "I really love the chairs and they are sturdy. The only thing that I am upset about is that one box was missing 12 screws and then a bolt that was defective. I still have 1 chair that isn't put together because I have been trying to find a replacement bolt.", 
    "These chairs arrived quickly and were relatively easy to put together. They are sturdy and reasonably comfortable. Great buy.", 
    "Oh man are these chairs labor intensive to put together! but once that is over with, they are a great value. I have had for 3 years and held up well.", 
    "While the chairs are well priced and look nice, one of the four had the sides come loose within two months of occasional use. Couldn't get one replacement, so now I have three chairs and one more is getting wobbly.", 
    "These chairs are great. After to put the first one together, we were able to finish the other 7 in no time. Had an issue with one of the legs which Overstock customer service took care of nicely. I would recommend these chairs and Overstock to anyone.", 
    "These are great chairs, study. And very comfortable. Look great also, I bought them to go with The Amstel trestle table. Looks beautiful!!!!", 
    "Great chairs, very sturdy, excellent quality, very pleased with this purchase! Highly recommend.", 
    "Easy assembly, a year later they are still holding up.", 
    "I was looking for an inexpensive chair and that's what I got. They look fine and since they aren't used heavily, they are holding up well. We've had them for a year now and we did have to tighten them recently, but again, they get really light use.", 
    "these chairs are beautifully constructed and I am sure will last a long time.", 
    "Looked great at first. One chair cracked right away. Easy to put together if your husband is a carpenter...", 
    "This was a really great purchase. It's a great value for four pretty decent looking chairs. They were a bit tedious when it came to putting them together, but it was definitely worth. I'd highly recommend these to anyone who's looking for something nice and inexpensive.", 
    "These take a very long time to put together. There are tons of different size screws and they give you a 2 inch allen wrench for all of them. Most screws have to be inserted at crazy angles while trying to hold the pieces together and it's hard to tell which piece is which. With three of us working on assembly (using 2 allen wrenches), it still took us about 3 hours and my husband rage-quit once. Now that they're all together, they're nice enough, but I wouldn't have bought them if I'd known they were this hard to assemble. I also had to put cushions on them because they're hard seats. They do look nice with the Simple Living Shaker Black Dining Table.", 
    "Our dining table is higher than standard, so I was very pleased that these chairs were available. Originally bought four chairs; have now purchased a second set.", 
    "This is a very nice solid wood set. We were missing a few pieces of hardware, and Overstock helped us get replacements. It looks like a much more expensive set. Very nice!", 
    "Must have been engineered without regard to piece part count. Allow 45 minutes for the first chair assembly and 30 minutes each for the others. Very tedious to put together. Takes longer and directions are poorer than putting together an **** chair. End product is satisfactory.", 
    "Very sturdy and as described.", 
    "Strong and sturdy! Great price and looks amazing!I assembled alone and it only took maybe an hour with basic skills and tools.", 
    "Received within the same week as order was placed. Package arrived unharmed product very carefully wrapped. As other reviews have stated full assembly required. Not horrible once you figure out first chair goes smoothly after that. Had 1 side piece to crack but truly believe this was due to construction error on our part. Contacted customer service on a Sunday afternoon and was promptly directed to the correct department where my issue would be resolved and I would soon receive parts for replacement chair. Parts for replacement chair arrived within the week; was very well packaged and put together very quickly. We have a rustic farmhouse table & these chairs complement very nicely. Have been used for approximately two weeks now they are very sturdy, not wobbly, have had a wide range of weights use chairs, so far no problems. Good chair for the price if you're willing to assemble... otherwise pay the extra elsewhere. Definitely recommend & thumbs up to customer service!", 
    "These chairs looked good when I first put them together, unfortunately, they started to fall apart after a month of normal use. I have them in the eat in kitchen area of my house and I ended up having to get other chairs to replace these after a few months of use. SO NOT WORTH THE MONEY!!!", 
    "One of the chairs already broke (first time using them) after a guest just tried to scoot the chair back. That made the rest of us a bit nervous at the table.", 
    "for the price great, they don't feel really sturdy but work, wouldn't suggest for a heavy person. Once you figure one out assembly not bad, I put 8 together in 3 hours. For $$ a chair definitely worth it.", 
    "very cheap chairs that do the trick perfect for extra seating or a tight budget", 
    "i love my new chairs! the quality is great and I'm proud to have them in my kitchen.", 
    "Chair leg broke after only three days. Now I need to pay $*** to send it back. Learned my lesson", 
    "Although time consuming to put together, these turned out to be really nice chairs - especially for the price.", 
    "Chair caught on the edge of a carpet and immediately cracked and split one leg. Turned out to be a giant rotted knot in the wood that they just painted over and sent out!", 
    "These were the worst chairs they all cracked and fell apart and are thrown away already. Do not buy these!", 
    "Love the look and price. I put them together myself, which took awhile but listened to an ebook which made the time go fast. Downside..need to be tightened often and the little tool isn't too handy for that", 
    "The chairs look exactly like the picture and seem sturdy enough. I've only had them about two weeks. The directions that came with the chairs are wrong. They tell you to use the wrong screw which caused one of my chair legs to break.", 
    "These chairs were a replacement for my former kitchen chairs. Overall they have been good but they did come with several nicks on them.", 
    "They're very nice chairs; however, the instructions are incorrect and we ruined the first chair. After that fiasco, we came up w/our own plan, and we ended up this project well, but with 3 chairs...pls use your judgement when using nails. We used the biggest one, and that was a mistake...", 
    "For the price they are great", 
    "They look great but did take 3 hours to assemble.", 
    "The chairs are a little complicated to assemble and some screws are positioned in a weird way that make the chairs unstable.", 
    "Bought two sets, they took a while to put them together, but got easier as you go. Have had them over a year now, and still in great shape. Easy to wipe down, and they look great.", 
    "Bought these chairs for our lake cabin and one broke while putting it together, not great quality wood. They had good customer service and mailed us the new part though. They have held up, but we hardly use them as it is our cabin and we mostly use our outdoor patio. Would not purchase for my home but fine for the cabin.", 
    "These were a good value for the money. However, they were a bit difficult to assemble. Once I got everything finished and in place, they looked beautiful!", 
    "Chairs are great to sit on but the assembly was horrible!", 
    "It took quite awhile to build each chair. There is a serious design defect with attaching seat to frame. No pilot holes provided. Silly plastic \"screwdriver\" supplied for hard to reach screws. I used 1\" angles to attach the seat securely.", 
    "Had folks over and 2 chair legs broke on 2 separate chairs!!!! Customer service was awesome, replaced the chairs, but still wary!", 
    "They were difficult to put together. They look fine and blend in with our decor.", 
    "Takes little bit of time to put them together but they are solid chairs. Definitely recommended", 
    "These are very attractive, simple chairs that do not overpower my small dining area and are not too heavy to pull in and out from the table. Easy to assemble and very sturdy. I made a good decision here - I would recommend these chairs.", 
    "They were extremely hard to put together, the angles for screwing the bolts for the seat to attach to the legs makes it to stripping the bolts is easily done.", 
    "Absolutely love them. They are perfect with the parsons dining table. Very sturdy. The price is unreal!!", 
    "Purchased 8 of these chairs. Great price! Good quality. A bit more precission on chair seat could make this go from 4 stars to 5. Remember for this great price you have to put them together!!", 
    "Perfect addition to my current table.", 
    "I am very, very disappointed that these chairs (which appear solid when you first put them together) became extremely wobbly with minimal use. These chairs have barely held up at our weekend house. We are average-sized folks. We will be looking to buy new chairs after only a year. Save your money and get something more sturdy!", 
    "Arrived on time, well packed. Handsome chairs that go perfectly with our new table.", 
    "These chairs are good for the price range. A little hard to put together but look very good when finished. Will see how they hold up over time.", 
    "We wanted dining room chairs that are sturdy, easy to clean and relatively cheap. SO HAPPY we went with these! We have two boys that have put them through the abuses already and they have no signs of weaknesses. Of course, this comes with a very extensive assembly process but I am more than willing to sacrifice the initial time for a product that is longer lasting.", 
    "These chairs are very small and did not look like a good size for my 42\" round table. They would probably work well in a small space with a cafe' table. Each chair took my husband and i about an hour to put together and we are very handy. They seem sturdy and I will put them in storage and use them when i need extra seating.", 
    "I really wanted to love these chairs, and I had very fair expectations. Of course I didn't expect incredible quality at this price point, but I wanted sturdy chairs that functioned well. These chairs are sturdy and they look pretty good, but six of the eight chairs wobble! The legs are uneven! I have built and rebuilt these chairs, but the wobble is not my fault - the pilot holes in the legs are simply uneven. I cannot give anything above one star for chairs that are infuriatingly uneven. That's the most basic requirement for a chair, isn't it? Also, the bolts to fasten the legs to the chair are visible along the outside of the chair, so you won't fool anyone into thinking you purchased nice prebuilt dining chairs.", 
    "These chairs took forever to assemble. The instructions are not clear and the pieces not well marked. It took several hours for two mechanically inclined people to assemble them. Poor alignment was also an issue. With minimal use (once a day, if that), the screws frequently loosened and needed to be re-tightened. This happened a LOT. Once chair broke after about 8 months, with the front support beam splitting lengthwise and the front leg collapsing. A second chair followed two months later, with the SAME defect occurring and leg collapsing. As stated, these chairs are used AT MOST once a day for dinner. We weigh, at most, 150 lbs., the majority of us much less. I contacted Overstock to get information on how to get the support replaced for the chairs and was told that they could not help me. Now I'm stuck with two broken chairs, and two that will likely break sometime in the future if the design/batch is all the same. I do NOT recommend these chairs unless you want to consistently repair them and don't intend to use them.", 
    "These chairs are great quality.. hardwood and nice black finish. The only complain i have is that one of the chair was missing threads so we couldnt screw the chair together. But customer care was helpful and resolved my issue.. Highly recommended!", 
    "Purchased these as a gift for someone who was just starting out.....no hardware...does anyone have manufacturing info on them?", 
    "When I ordered a set of four chairs for the very low price of $$$, I expected them to look nice be not really be very usable. I am truly amazed at the quality and how sturdy these chairs actually are.They look great and are very sturdy :)", 
    "After reading the reviews about assembling the chairs, I was a little hesitant to tackle, but they weren't bad at all. It took me a couple of hours from start to finish and I'm very pleased with the result. They are exactly as advertised and very sturdy. I'd buy more if I needed them!", 
    "To begin with, not only were these chairs incredibly difficult to build because the screw bolts didn't properly fit the holes and nuts. We had to \"prep\" the the nuts and bolts to fit into each other before even assembling. Luckily we had a power drill to screw in the seat of the chair because those holes were impossible to manually fit the screws into. The instructions weren't particularly difficult, you just have to have extreme attention to detail to properly read them. The chairs did arrive in a timely manner so shipping wasn't an issue. Now here is the real reason I am writing this Jig Saw review! Jig Saw had his way with my chair! One of the chairs came with a back body of the chair leg that was already \"broken\". When I grabbed the leg out, I said that it looked broken. Under a closer inspection it had this crazy jig saw pattern that had been perfectly cut straight through the chair's leg! the pieces were together as a puzzle but easily taken apart! so now we have to wait for a leg replacement to be shipped out. The quality is questionable since the slice through this leg chair looks machine made and intentional.", 
    "If you don't mind spending a couple of hours assembling the chairs then this is a good deal....There are a lot of pieces to assemble.Having said that I am pleased with my purchase. I removed the hard plastic pads on the chairs and replaced with felt pads which give a better \"feel\" when moving the chairs and will also better protect the floor.", 
    "Such a great value! Love my chairs! It did take a minute to put them together but WELL worth it!", 
    "Once the chairs were finally together, we could appreciate the clean lines and easy-to-work-with size. HOWEVER! Each individual back slat and chair leg needs to be attached to the seat. The dowels, screws, pins, etc all come in one big bag, with nothing sorted or labeled. The first chair took over an hour to assemble because the instructions skip a step about putting in a piece to hold the slat in place. The next three chairs took about 45 minutes each. Not sure it was worth it to order these from Overstock and spend time (time is money) to get them all assembled.", 
    "These chairs are inexpensive and look great but they do not feel very solid. It has only been a few weeks and I've had to tighten them 3 times since the first assembly. They are very light so I am concern about weight capacity, but so far they are doing the job. Warning: This chair comes in sooooo many pieces!! It took me over an hour to assemble the first chair ... about 30-40 minutes for each remaining chair once you figure it out.", 
    "I think these chairs are really great! The only downside is that NOT ONE PIECE is stuck together when they arrive. You have to put every single piece together. My husband and son-in-law put two chairs together and it took them 2 hours (one chair took 2 hours per person). Part of that could be that they didn't read the directions at first :) BUT, it is not a quick process. Certainly worth the savings in price though! And I think having them come in pieces reduces the risk of damaging while shipping. None of our pieces were damaged in any way.We love the chairs and highly recommend them!", 
    "I had to have a few pieces replaced and the company was great about getting me new ones right away! The overall quality of the product is... you get what you pay for. There are some pieces that aren't designed to fit right (some parts are curved and then it's supposed to align with a piece that is built at a 90* angle?) and the legs bow (because of the angels) but you probably won't notice any of this unless you're building them. Again, for the price.... they aren't bad! They look really good with my black IKEA table.", 
    "The chairs are very good quality. I struggled putting the first chair together because I'm not very handy, but after that the 3 other chairs went together a lot easier. After a few days of sitting in these chairs the screws did need to be retightened, but after that there have been on problems. I would highly recommend these for an inexpensive option for the kitchen.", 
    "Pros: Good price, quick shipping from OverstockCons:Out of the 4 chairs you get, one chair was missing a front piece (2 backs instead of a front and back) and missing 2 long screws, instead 2 extra short screws. With that said, they other 3 feel cheap and the finish is also cheap looking. I am going to return, due to not being able assemble the 4th chair and lack of quality on the other three.", 
    "take your time and layout all pieces. very good product for the money we love them", 
    "These chairs have a beautiful black satin finish, which matched my newly refinished dining room table perfectly. Even if they hadn't been perfect, the price alone was amazing. If you shop around, you will find it nearly impossible to acquire four matching chairs in any quality at this low price! To say that we were satisfied with this purchase is an understatement at best. We will look at Overstock FIRST in the future, not only for the beauty of the product but for the extremely reasonable prices!", 
    "The chairs are surprisingly good. I took my time in putting them together so I didn't have a problem with anything being loose. They're pretty sturdy and will last a long time with normal use. My only complaint is a missing screw that you can't buy in the hardware store because it's \"metric\" so I called Overstock...not the number on the instructions...and within 1 week, they sent me the missing hardware. If it wasn't for that incidence, I would have given the product 5 stars.", 
    "With the exception of the damage to two of the chairs the product overall was good. When I received the chairs I noticed that two pieces of one of the chairs was damaged/chipped. When you pay the price that you think is a good deal only to get the product and it is damaged makes people a little mad. The damage was not that bad, a couple of pieces were chipped so I decided not to send back. The trouble of sending it back would have been far more painful than putting the chairs together. I am satisfied with the product and they will serve the purpose they were bought for.", 
    "Stat Black Rubberwood Dining Chairs (sat of 4) .I like the chairs.They will go good withe the room.", 
    "These were really the only affordable chairs in black that would work for what I needed. The items should be cheaper if they are not assembled. It takes forever to put this stuff together.", 
    "The chairs are great looking, but didn't last a year. They are not real strong. I'm sure there is a weight limit, but for the most part I would say the ones using the chairs are probably under that limit. They are not real sturdy and I've not had them a year yet.", 
    "Chairs arrived ahead of schedule and were packed well. All parts and pieces were in tact and there were no scuff marks or scratches on any of the pieces. These chairs are not high quality, but very suitable for kitchen purposes. In my opinion, they are a great bargain and compliment the Pier One table I purchased to create an eclectic look. Putting the first chair together was a little difficult and time consuming. The other 3 were a breeze though. I love the chairs. You can't beat them for the price!", 
    "they looked better then they are. quality is an issue they definitely won't stand up to children and scratch easily", 
    "The chairs look good but stand up well to my pets and children. This is what I needed. They're a lot of trouble to assemble but well worth it. I'm thinking of ordering more .", 
    "Would have been nice if some parts of the chairs were assembled. If you have children these chairs may only last for a few years. Im saying this and only had my chairs for 2 months. They are kind of flimsy. Again, they are not bad for the price but one might want to go up on price to get a better chair.", 
    "The chairs are nice but not very sturdy. Took a while to put together. I think I'll have to keep using the tightening tool as they continue to be used.", 
    "If you need inexpensive chairs , I would recommend these. The pre drilled holed were missing or in the wrong spot and there were some blemishes on the wood. The chairs are very sturdy, and look nice and work with our table. The quality is more of a low end.", 
    "I got these chairs to go with my new kitchen table my hubby found on clearance at another store. They match perfectly and go so well with the look I was wanting. I put them together all by myself, well, with the help of a very anxious to sit on the new chairs, 2 year old boy! They are holding up very well, no scratching like some reviews said. And I live in a house with 2 wreckless boys. I would recommend these chairs if you think you like the style. They're great!", 
    "What you can't tell before you get them is how actually very solid they are when assembled, which gives the overall impression of much higher end chairs. Very high quality for the price, really good value. Fast cheap efficient delivery via us/canada post.", 
    "These chairs look nice, but the design of the legs is very poor. The joints are weak and wobbly and after one week the legs were in danger of coming off. Not a good product.", 
    "The reviews on putting these chairs together had me a bit scared, but my husband said it wouldn't be a problem and for the price we couldn't turn down. My husband is pretty handy around the home, but by no means a full on handyman. With that being said these chairs we far more easy to put together than I had read. He made an assembly line and put together in stages after he got one chair fully assembled. It was easier this way and the process seemed to go rather smoothly. The chairs are GREAT. Very sturdy and a good size. The chairs we had before were much smaller. I am so glad I didn't let some of the negative reviews affect my decision to buy these chairs.", 
    "These were hard to put together and there was a chair broken in each of the two sets we bought. It was so hard to unpack and sort through all teh parts that we decided to just deal with teh two broken chairs rather than go through all the hassle of trying to send em back.", 
    "I could not have found better chairs for a better price anywhere! My husband isn't very handy and some of the reviews made me a bit nervous but he assembled all 8 chairs one afternoon. The look great and I still can't believe the price. And the shipping was super fast.", 
    "These chairs are good value for the money. A bit time consuming to put together but not bad. Nice big seat but very flat. I love the clean straight lines of these chairs", 
    "Nice chairs for the price, they look very nice, just some issues with 2 missing screws that could not be found at local stores, and 1 chair back broke, even though these chairs were not under warranty the people at OS were able to help us get a replacement chair back and sent us the correct screws. Customer service is excellent!", 
    "The chairs arrived very fast and are great!!! I couldn't believe how fast they came to my house", 
    "Great chairs for the money. The only drawback is that the chairs take a while to assemble and some of the bolt ends can be seen after assembly has been completed (they are black so they aren't too easy to see). The chair bottoms are literally as flat as a board which some may find uncomforable. We just added cushions and that fixed the problem. I have two kids that are climbing all over the chairs and so far none have become loose or broken.", 
    "It seemed like a great deal, 4 chairs at such a good price. And it is a good deal if the chair is just going to sit there but if you are actually goind to sit on it on a daily basis do not purchase. The chairs look nice from a distance but very flimsy! And if you are more than 100 pounds you start to wonder if it is going to break from underneath you.", 
    "good set of chairs long time to put togeather but so what......", 
    "We ordered these to replace some chairs the kids had destroyed over the years and I was refinishing the table itself because it was a quality table. We received the chairs very quickly after ordering which was great. We did have an issue with one of the legs not being bonded but the customer service rep was very helpful and had a leg shipped to us right away to replace the defective one. Only Con i can think of are the chairs are super flat and not very comfortable without getting some chair pads, but still great for the price.", 
    "These are a great buy--well-constructed, clean lines. I highly recommend them.", 
    "I, and my family, really like the chairs. They are a great look. Substantial, modern, yet classical. My only problem is that I am not the most patient at putting things together. So, in the end, one chair broke where I must have not screwed it together correctly. Overall, they are good looking, sturdy chairs, but could use someone with a bit of mechanical skill to put them together. For the price, I would still order them again.", 
    "We have had these chairs for a couple years now and they are still great! I put chair pads on them from pottery barn and you would never know the chairs were so cheap. I would definitely recommend these! Love them!", 
    "These chairs are great. They are very sturdy and well made. Also for the price of one similar chair at a Pier1 store you can get 4 chairs on overstock. That's just money in the bank!!", 
    "We had a problem with 2 left legs and the problem was handled with 2 new legs sent to us in a timely manner, your staff was very helpful with this problem.", 
    "While I was very please with the appearance of the chairs, other reviewers correctly noted that putting these together practically takes a degree in mechanical engineering. If it weren't for Hurricane Irene forcing my husband to stay home, these would probably still be in the box. I feel pretty cheated that it lasted a whole 6 month before the chair snapped in two during a dinner party- while my husband was sitting on it. I really don't want to buy new ones either because then I'll have to wait for a another natural disaster to get these chairs put together. (Literally a 8+ hour job) .", 
    "I am so pleased with my new dining chairs. I bought two sets, and everyone who comes to my home admires them. It took some effort to put them together, but taking one's time or getting someone to help you really pays off. The chairs are sturdy, attractive and durable.", 
    "These chairs are nice but I bought them to go with the drop leaf table and the seats are quite wide. Hence they do not fit well under the table.", 
    "These chairs were a bit difficult to put together, but not too bad. They are attractive and seem sturdy.", 
    "These are great chairs for the money. The seat didn't line up exactly but you would never notice unless you looked real close. Would buy these again especially for the price.", 
    "luv the chairs. perfect fit in the dining room. assembly IS required and directions were NOT provided, but the assembly was pretty straight forward but directions would have been nice. all in all, i would recommend them", 
    "Yes, you have to assemble these chairs, but for the price, what do you expect? They're easy to assemble, and once together, they look and feel great! I'm thinking about buying a few more!", 
    "There are no children in the household so these chairs are perfect. I'm not sure they could take the wear and tear of small children. They get moderate use. They match the table perfectly, wihich is another brand. I am very pleased with them. Assembling them was a bit tedious but after the first chair, things moved more smoothly.", 
    "The chairs are what I expected based on the price I paid. I needed a set of dining chairs fast, and I didn't want to spend a bundle. For the price of two chairs, I got 4. However, they took a decent amount of effort to assemble. Some screws needed to be hammered into the wood, while some screws were tough to get a hold on and tighten. In addition, they don't feel 100% solid; you can feel the chair wobble a little if you rock slightly.", 
    "A little bit time consuming to put together but once these chairs are assembled you will love them. The rubberwood is very strong and sturdy. My husband is a big guy, over 250 lbs, and these chairs are a perfect fit for us in every way: decor, comfort, and durability. An excellent buy!", 
    "The chairs did come in a lot of pieces and it took a while to assemble. But the end product is very nice looking and sturdy!", 
    "I had painted our old kitchen table black and needed matching chairs. Compared prices and reviews and settled on these--and they are PERFECT. The first one took me about 2 hours to put together because I hadn't been careful and had to redo some (did them backwards so future screws wouldn't fit). The other chairs took me about 30-45 minutes each. The chairs are good looking and sturdy. I have a house full of kids so I don't think they'll last forever, but I think they'll hold up very well, especially for the price.", 
    "After reading several reviews I was dreading the assembly of these chairs. However, I have to say that they were not bad at all to assemble. No power tools needed!!!! Took me about 35 minutes to assemble all four. I would highly recommend buying a ratchet tool that has interchangeable ends so you can use the allen wrench end. This tool cut down quite a bit of assembly time. LOVE them!!!!!", 
    "Very sturdy chairs. Very comfortable. Easy to construct and was surprised that I was able to put these together and they are actually as sturdy as they are. Now I have the confidence that I could do this again with other self assemble furniture. They look great! And the price is excellent!!!", 
    "These are very nice chairs for the price! The ability to get 4 chairs for the price of 2 chairs (even when compared to other dining chairs on O.co) was a real savings for me, when we needed chairs for 7 Thanksgiving guests in a few weeks time! My next concern was the quality... but when they came it was clear that they were of good quality. The assembly was relatively easy. All in all we are pleased to have these 8 dining chairs in our dining room.", 
    "I wish it came with instructions... it's hard to put these chairs together without them. I don't understand why they would send it with instructions. They need better quality checks...", 
    "These chairs are a good size and good quality for the price. Needed chairs to fit under my table and match the black hutch I already had. They were a good solution for my dinning room.", 
    "chairs were a pain to assemble,the seats were made of compressed sawdust and the metal parts were cheap and flimsy.you get what you pay for.", 
    "I love these chairs. They look far more expensive and are very sturdy. A great buy!", 
    "You cannot beat the price and quality of these chairs! Although you have to put them together on your own it was very easy and well worth it. I would highly recommend these chairs!", 
    "Took some time to put together but overall they are great! I would highly recommend them", 
    "I ordered these as extra chairs to have around our dining room. I was surprised at how well they blended in with the nicer, much more expensive furniture. They are very solid, kids climb on them regularly. But as other reviewers have pointed out, assembly is very time consuming. Very.", 
    "Pretty much as advertised, certainly worth the price, especially for informal or short term. Biggest negative is the exposed and open screw goles giving a cheap, unfinished look", 
    "Directions for putting the chairs together were fairly easy and I found that putting them together in an assembly fashion rather than one by one made more sense. I put the frames together while watching a movie on TV. But right before attaching the seats, I decided to upholster them! I didn't think the mini plastic screw driver was good enough to attach the seats, so I got out my mini drill and it worked great. They came out beautiful and are much more comfortable than sitting on hard wood or having to go buy chair cushions. I just wish the backs were a bit taller and the seat a bit wider, but otherwise I love them!", 
    "Loved the chairs,hated the assembly. The allen wrench supplied was of low quality and rounded over, I had to use my Snap-on allen instead. I would still recommend the chairs.", 
    "The chairs themselves are fine and exactly what I was looking for, but the overall experience left a lot to be desired. I don't know who is in charge of quality control with these products but they are not doing their jobs. First, we received the chairs without instructions. Second, we received one too many front left legs and one too few front right legs. Third, my boyfriend had to drill some holes in the chair backs because the holes that were supposed to be there were not. After several calls and emails to customer service and some in-home fixes to the materials, the chairs look good and I am happy with them BUT, I wouldn't have bought them if I had known the hassles I would have to go through just to get 4 chairs.", 
    "This was a great value for four chairs. It took some time to assemble them, but the instructions were self explanatory, and I am pleased with the sturdy quality of these four inexpensive chairs.", 
    "Chairs arrived promptly and look great. Complicated to put together but we really think they were a good value", 
    "II brought these chairs for the price and that was the worst thing I could have done I had to have parts sent to me twice and then the second time the never sent the screws that I needed so I have not finished putting the chairs together. Not a good choice", 
    "We needed to replace kitchen chairs that didn't look good anymore. This was a good buy for the price. Once, one chair was assembled, the other were easy to assemble. They look and feel good to sit in.", 
    "These are nice sturdy chairs and we were impressed by their quality. The process to put them together went well but slow for my husband. One of the chair seats arrived cracked in two. We called customer service, and they had 2 new chairs (they come packed two to a box) here within 3 days. I think they're great as far as customer service. We've had a couple of returns before too, and they went very smoothly.", 
    "These chairs are decent for what I paid for them. They were fairly difficult to put together, because the allen wrench doesn't have the room to make full turns in some areas. Also, approximately 4 of the screws used to put them together wouldn't thread into the pieces properly. We eventually had to go to the hardware store to get some replacements. The replacements weren't exact, so that chair is a little loose/wobbly. The chairs that have the proper screws in them are very solid and sturdy. Overall though, they look great and were exactly what we were looking for as a temporary solution to a table that didn't have chairs.", 
    "I ordered these chairs thinking they would be prefect for new repalcement chairs. WRONG! They are confusing to put together (instructions have NO words only diagrams) they don't line up the way they are supposed too. Just a major pain in the hind side. Do your self a favor and keep looking.", 
    "I bought two sets of four so that we would have eight chairs. It took a long time to put them all together but because of the process, they seem to be pretty sturdy. It wasn't very hard, just time consuming because there were eight of them! I love that the screw holes are accessible so that if a chair seems a little wobbly, I can just tighten the joint. When I opened the first box, one of the chair seats had a crack down the middle. I live chatted with an overstock employee and they shipped me a new chair seat pronto. I love the look of these chairs and the black is a true black, not a stain. So it matches my table well.", 
    "Complicated to put together, but look great. One of the chairs was a little wobbly, not sure if that was the construction of the chair, or what.", 
    "beautiful chairs at a great price. instructions aren't really helpful. took around 3 hours to assemble the four chairs. First one took about an hour, fourth one about 15 minutes.", 
    "These chairs are basic chairs; not super fancy. But, they look nice. They seem pretty sturdy. Overall, I'd say they are really good chairs for the price.", 
    "We are happy with the chairs. We bought to use as home office chairs. They are good quality and attractive for the price. They are a little uncomfortable if sitting for a long time...need a cushion. They no way compare to my Ethan Allan chairs, but for the price, I am not complaining.", 
    "difficult to put together and one of the chairs cracked in the process. however, they seem relatively sturdy and are a good option for a family with two small kids - low cost and durable for the price. overall, they look great and after debating whether or not to return them, we decided it would be difficult to find a comparable replacement. definitely not heirloom quality, but who could expect that at this value?", 
    "Easy to put together, make sure you have all the hardwear for each chair before you start putting them together, I was missing 8 nuts but hopefully after calling CS they will be here by the end of the week. The only problem I ran into was using the allen key for all the bolts(small and takes forever) and some of the stickers on the parts are placed upside down so you have to pay attention to how they really go. Otherwise great set.", 
    "I recently purchased a new table and was looking for a set of chairs in black. These chairs are a great value. They do take some time to assemble. The first took an hour, but I went and got a hex bit for my variable speed drill and the remaining 3 took 45 minutes (Caution: If you try this trick make sure you are using a variable speed drill set low or you can crack/strip the wood.) The only reason I gave the chairs a 4 instead of a 5 is because some of the screws used to secure the seat have begun to fall out. I have reset the screws but pay attention when vacuming around the chairs. Also, you should know that the hardware is visable on the sides of the chairs. All is black, but if you are looking for hidden hardware this is not it. A great price for what you get. I ordered a second set so I now have 8 of them.", 
    "My husband was trying to pick something up off the floor and he had his hand on the seat of the chair and one of the legs broke in half. We tried to save some money cause they look ok (although you can see the screws once they are all put together) so they really are not worth it. Spend good money on good chairs and you will be happier.", 
    "I will start this by saying that 2 of our 4 chairs came broken....Overstock is sending new chairs however it's still pretty annoying to have to deal with. The chairs, once assembled are very pretty, well made and could easily pass for *******. The one BIG issue we had with the chairs is they are a nightmare to assemble and took about 30 minutes per chair. There are a lot of steps and overall construction of the chair is lacking however once thy are put together they're sturdy, very elegant and look great with our table. I would say when it's all done I would consider them a great purchase but not without a lot of work...", 
    "I read the reviews saying the chairs take an hour each to assemble. And they were all right! That said, they're great looking and the seat size is not so deep that they take up all the room in a smaller apartment/condo. Seat size is good for desk and projects where you sit a long time. Though you may want some cushions. Can't beat the price for the look, size, and functionality.", 
    "I purchased these about four weeks ago. I consider myself handy, and felt these were pretty annoying to put together. They seem like pretty solid chairs, but not strong enough to lean back and lift the front legs off the ground. I think they are a good value for the price.", 
    "The other reviews were very accurate that these are hard to put together the first time. I read the review that said to put the side slats on the back piece of the chair FIRST which is not what the directions tell you to do. I wish I had listened to the review. ALSO PAY CLOSE ATTENTION to whether or not you are supposed to be using short or long screws. The allen wrench provided works if you insert the other end into the long screws so you can get a full turn. One of my chairs' seats was defective but I did the online chat and they say they will send me a new one. The other problem I had was that they didn't include enough of the small silver bolts you drop into the wood chairs to screw the screws into so they are sending those as well. Great customer care! Gorgeous chairs esp for the price and with a toddler i wont worry about him hurting them.", 
    "Perfect!! There was a missing piece in the box. I contacted customer service chat and within a few minutes the piece was being shipped. Awesome. Sturdy chairs. Reviews helped a lot.", 
    "My Mother-in-law loves the chairs and they were very easy to put together.", 
    "These chairs were exactly what we expected! It takes some time putting them together (30 minutes per chair for me), but they're very sturdy. We bought them because they're easy to clean up after a three-year-old, and the price doesn't stress you out if the kids are rough with them.", 
    "These chairs look really nice and they are a very nice weight. I was pleasantly surprised at the quality and look for the price! They did take a long time to put together. I wish they came in a 2-pack as well so I could get just 2 more - I don't need 8!", 
    "I bought this set of 4 chairs for our Thanksgiving dinner. They took about an hour each to put together, but VERY easy (I put them together while also running around after my 3 & 1 year olds). The chairs are very sturdy and a good \"weight.\" (They don't feel or look as inexpensive as they were!) I would HIGHLY recommend. One recommendation when assembling: I would attach the 2 side pieces to the *BACK* of the chair first instead of to the front legs. It was MUCH easier to align the FOUR screws of the side pieces to the back legs when they weren't attached to anything else. If you put them together in the order that the directions tell you to, you will probably end up fighting to align the 4 screws with little visibilty. There are only 2 screws to align with the front legs- MUCH easier to mess with when you can't see very well.", 
    "These are good chairs for the price. Materials seems to be made of decent quality wood. However, it is a pain to assemble. I gave up after assembling 2 1/2 chairs. The problem lies with the way the holes were drilled in the wood piece, you can only turn the screws with the provided Allen wrench 1/4 turn at a time. It took me about 1.5 hours to assemble the first chair and another to assemble the second one. I would only recommend buying this chair if you have the patience and the stamina to put them together. Pros: sturdy, modern looking, cheap price. Cons: difficult to assemble.", 
    "I bought two sets of these Slat Back Chairs and I'm very pleased with the quality. They were exactly as described and I couldn't be happier with them! I placed them with a black modern farm table that my husband and I built and was able to have an 8 foot dining table with 8 Slat Back Chairs for less than $400!!!!! I just ordered my chandelier from Overstock as well to complete the look!", 
    "we purchased these a little hesitant about their durability... They are very sturdy look great and at a great price Thanks overstock!!", 
    "Nice chairs and good price. Hard to assemble...just ask my husband!", 
    "These chairs are just as pictured. Very sturdy with a nice finish. The price couldn't be better. Easy to assemble too.", 
    "\"Some assembly required\" is an understatement. 50 pieces per chair! I expected the chairs not to have visible screws, but I was wrong. They will work for the time being, but they are not what I expected. Better to wait for a sale at a furniture store in my opinion. Very average.", 
    "This is my second set of these chairs- easy too assemble- look more expensive than cost.", 
    "These chairs are well made, solid and take long to assemble! Be careful of scratches. I take a sharpie to touch them up. Great price for straight up good lokking, durable chairs.", 
    "These arrived quickly, easy to assemble, and good quality. Superior to those available at local super center type store, at better price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Slat-Black-Rubberwood-Dining-Chairs-Set-of-4/5206391/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5206391/Simple-Living-Slat-Black-Rubberwood-Dining-Chairs-Set-of-4-24540409-7258-41a5-bf65-f9663193be6a_600.jpg"
  ], 
  "description": "Infuse a touch of contemporary charm into a dining area or lounge\nwith this set of four stat-back chairs from Simple Living. Each\nchair's alluring black finish and straight lines create a subtle\nappeal and lend depth to any dining table or breakfast nook. Pair\nthis set with other hardwood pieces or a modern crystal chandelier\nto invoke a sense of radiance and luxury that guests find\nirresistible.Highlight a dining table with this set of four chairsCrafted from rubberwood for solid durabilityBlack finish with slat-back design adds elegance18\" seat heightMeasures 35.25\"H x 17.5\"W x 19.75\"DEntire set takes approximately an hour to assembleStyleContemporaryMaterialRubberwood, WoodChair TypeDining ChairsSet SizeSet of 4AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlackFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleSolid"
}