{
  "name": "Simple_Living_Parson_Black_and_Silver_Rubber_Wood_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 107.20", 
  "reviews": [
    "The linen fabric is nice, good quality and nice patterns. Color is exact, match well with my home decoration. The wood is light, the chairs were a little shaky. Assembly is manageable. There are rough plank surfaces and cracks under the cushion.", 
    "Great for the price little hard to put together", 
    "Small yet still nice. I just wish they we're a bit bigger.", 
    "I love these chairs! I bought a black table to go with them and I love the look! They are easy to assemble and look very high end. I get many compliments on them!", 
    "Great chairs but one of them has a leg that is about 2 inches shorter than the others, so we had to do some work to make them all the same", 
    "These are great chairs for a formal dining room that is used for a dining room that isn't so \"formal\". There is one leg on each chair that isn't as long as the others but they are very comfortable.", 
    "These chairs are so much more beautiful in person than in picture. Very well built.", 
    "Magnificent value. Some easy assembling required but worthy of the nice chair you get for less than $**. I finally could afford an 8 chairs dining set.", 
    "Very attractive to look at. Mid range construction value. Not comfortable to sit in at all.", 
    "SO ELEGANT AND STYLISH! BUT I DONT LIKE THE INSTALLATION ITS A LITTLE TEDIOUS! BUT OVERALL I LOVE IT", 
    "Chairs look just like picture but smaller than I thought. Material is somewhat cheap but chairs looks nice.", 
    "I get many compliments on these chairs. I even bought an additional set. Well-made.", 
    "These chairs are much prettier in person, the fabric has texture to it, making them look expensive. Very easy to assemble and a great price, well worth it!", 
    "Like that you can buy them by twos. Do require minor assembly.", 
    "Brightens up a room. Have 8 of them now.", 
    "I use these as side chairs in my dining room. Seems a perfect place (in our house)to change shoes. I bought a hinged ottoman to sit between them and that's wherewe keep the shoes we're not wearing. Plus, they're front and center when weneed extra seating at the dining table. Really adds some life to the room.", 
    "We're very happy with this set of chairs. They look great and are very comfortable to sit on! Practically a steal at this price. recommended!", 
    "I ordered two sets of these chairs. They arrived sooner than expected. They were packaged very well, I was a little worried because they were not put together, however, the instructions were very easy to understand. It took me about 45 minutes to put all four of them together. These chairs look great, and sit great. I really love them and as I am expecting the table I ordered next week, if there is room, I plan on ordering two more of these chairs. Love, love, love them!", 
    "Classy chairs... quality constructed, and with good instructions - one of the easiest assemblies I've ever done. Chairs were a little smaller than I had hoped, but still a great buy.", 
    "I am very happy with the chair my dining room table looks very nice now", 
    "I actually get extra discount on these chair when i purchase during around black friday! i coudln't be happier with the price that i paid for.", 
    "The color of the chairs are bright and very sturdy for the price. I have got a lots of compliments and very happy with the look of my dining room. I was also happy that the delivery time did not take as long as it was suppose to be.", 
    "We bought these chairs to complement the new black table that we bought for the kitchen in our new condo. They were very easy to put together and they look great in the space. The only bad thing is that they gave off a pretty strong fishy odor, so we put them outside for a couple of days and that seemed to fix the problem. They also do not have as much padding on the seat as I would like, but they are exactly the right style and color so we do love them!", 
    "The wood was cracked and they are not sturdy for people over the weight of 70lbs. But as a symbol of decoration they look great.", 
    "Simply put, you get what you pay for. We didn't want to get really expensive chairs just yet so this does the job of extending our dinning seating. Fabric is nice and size is just right.", 
    "These chairs add real spark to a room. The color is just as described, the fabric looks to be wearable, a comfortable chair for dining, an excellent investment at the price.", 
    "Very pleased with the chairs. The color was accurate. The instructions were easy to read.", 
    "I bought these chairs because I loved the print. Looks better in person. It goes perfect with the table I purchased and was easy to put together. The delivery took no time. I had an issue with one of the chairs and reported it and customer service took care of it asap. I am very happy with my purchases!", 
    "The chairs are beautiful, comfortable too. They are a bit smaller than I anticipated but that's a plus for me as my space is small.", 
    "chairs are lower and have a smaller seat than i imagined - but i didnt check the measurements beforehand as i assumed chairs were standard. f size matters to you, check the dimensions. Otherwise pleased with color and quality", 
    "The chairs look great in my formal dinning room. I wanted to update the look of my dinning room and this chairs sure did the job. The only thing about this chairs is the the back is a little to low but they still look great.", 
    "I put these 4 chairs with my black granite dining table and they look just as rich. The colors and the stitching are fabulous. The assembly was simple.Although they are light as a feather they can sure hold alot of weight. Not Mine haha. I recommend this product.", 
    "I love Overstock.com The product I've purchased is of the highest quality and instructions are easy to assemble. I would highly recommend this company to anyone who wants great quality products and quick service delivery. The Parson chairs are beautiful. The color and quality is great. I have received many compliments on them", 
    "LOVE the fabric and pattern of these chairs different looking, I think Asian looking, I bought the tabke that has these chairs I am thinking of buying a couple more....the bolts seem the s ame size to me not marked,,.", 
    "I bought these chairs on sale -- four for <$*** -- so I didn't expect them to be great. For three years I had two chairs from my dining room at my breakfast table and hated it. They didn't match the room. I found these and decided to go for it. AM I GLAD I DID. These are beautiful and a perfect fit for my breakfast table. -- My kitchen is gray (walls and tile floors), white cabinets and black gradit counters. I couldn't have asked for anything better at such a great price.", 
    "Good value chairs, look great and are comfortable. A little work to put them together but nothing too difficult if you work carefully.", 
    "I wouldn't recommend these chairs for a Dining Room... because next to your dining room chairs they look like children's chairs. There shorter in height than normal chairs, and anyone over 180 lbs. should not sit on these chairs. The first day, an average man sat on the chair and broke the wood under the seat (that supports the pad).", 
    "I bought 6 chairs total for my kitchen table, my kitchen is all black, white and chrome decorated with circles and flowers. so these chairs matched perfectly. I have an older house ('55) cape cod style, with hardwood floors, so I am not too sure if it is the floors in the house that make the chairs wobble or if it is the legs aren't perfect. However either way, I can put my butt down in them, and they hold me up... which means they work! I might eventually mess with the legs a little to fix the wobble, but it isn't so terrible that I am fretting over it. I love the look, and the height of the back, and thats... that!", 
    "although there was a little stain on the back of one of the chair, I had ordered them for a country house for thanksgiving and wasn't so concerned about it. They may only last a few years, but I really like them.", 
    "I cannot rate the chairs because I didn't receive them ontime and had to cancel the order However the service was outstanding", 
    "They're built cheap, especially the wood on the seats. Chairs could use more padding and I really needed to have the chairs about 3-5 inches taller (to sit at either end of my table). I love the fabric and the colors in the fabric. I'm disappointed because I really LOVED the fabric and thought these chairs would be better quality."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Parson-Black-and-Silver-Rubber-Wood-Dining-Chairs-Set-of-2/6467778/product.html?recset=5065fc47-d070-48c3-94d0-44333334f652&refccid=5NYNIZSMD7H3SW2KT6ARHCPQ3Y&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6467778/Simple-Living-Parson-Black-and-Silver-Rubber-Wood-Dining-Chairs-Set-of-2-1261c323-d6c0-40fd-94ce-58bfc667f069_600.jpg"
  ], 
  "description": "Made with rubber wood, which is both eco-friendly and less prone to\nshrinking and warping compared to other types of material, this\nchair provides long-lasting service while helping you protect the\nenvironment. The polyester foam upholstery provides extra comfort\nand support to the user, and the 16.75-inch wide seat provides\nample space to accommodate different body sizes.Set includes two chairsMade of rubber wood for durability and eco-friendlinessBlack finish gives the chair a modern lookLight grey with black and silver upholstery fabric gives the\n  chair a lively lookMade with polyester foam fill for added support and\n  comfortSeat measures 16.75\"W x 16.5\"DSeat is 18\"HChair measures 36.5\"H x 16.75\"W x 21.5\"DStyleModernMaterialPolyester, WoodChair TypeDining Chairs, Parson ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlackFurniture Frame MaterialWoodFurniture PatternSolidProduct FeaturesEco-FriendlySeat StyleUpholstered"
}