{
  "name": "Simple_Living_Addin_Recliner", 
  "price": "EUR 273.96", 
  "reviews": [
    "I ordered two of these recliner because of the \"PRICE' and they were small enough to fit in my living area. As the saying go's.....You get what you pay for. They are small but you do fit in them. The fabric \"Pleather\" will not hold up to any animals jumping on them. First day cat jump into the seat ......HOLES IN FABRIC!....ouch! They only recline half way. You can push them back to a full recline but you MUST keep your body pushing back to stay that way.... not so good to relax that way. To much trouble to return, So live and learn..", 
    "This chair is comfy, but like other reviews said, it won't stay reclined. Also, the material is easily scratched, so if you have pets its not durable. If you're on a budget, your money is better spent elsewhere.", 
    "I bought 2 of these recliners for my living room based on the prior review. All I can say about that is that the husband referred to must be 4 feet tall if he falls asleep in this chair. I assembled them in about 5 minutes, then stood back and laughed. It looked like dollhouse furniture.I decided that rather than boxing them back up and trying to return them I carried them, 1 in each arm, to my son's room where he and his friends use them when they play video games. For this purpose they are very good and of good quality, hence the '3' rating, but these are not for adults. But, if you are looking for recliners for children to use, these are quite good.", 
    "I'm having shoulder surgery in 10 days and was told I'd sleep better in a recliner. We don't have a lot of room, so this recliner sounded perfect. Size-wize, it's great. Otherwise, it's flimsy, cardboard like and made to last a very short time. Next to my leather (not terribly expensive, but solid) sofa, it looks cheap. The directions for assembling the back were a joke (poorly translated and poor-quality figures). I predict I'll sleep in it for some weeks then move it to an out-of-the-way location until we can afford a real recliner. Save your money. Find something on Craigslist or wait until you can get a solid chair.", 
    "Love the chair, with two caveats: a little small and reclines deeply enough to make it a non-ideal corner chair. At 75 inches the chair is just a little small for me, and my most comfortable recline position forces me to keep the chair further out from the wall than I'd like (but I didn't like the prices on wall-hugger options). Sometimes won't hold the recline position but pulling up one leg changes the center of gravity enough to compensate. Good bang for the buck.", 
    "It is a great recliner. It is a well made and easy to assemble. It took me minutes to assemble after reading the assembly instruction. The assembly instruction is very clear. The design is beautiful and simple. Love the color. Best of all, it is a very comfortable and cheap. Definitely is a good buy for the money, quality, style and design!!!", 
    "I have had the product slightly more than a year and it looks 30 years old. The mechanism is still good but the fabric is worn in many spots.", 
    "The chair looks nice enough but it has several drawbacks. I am a small person so the chair is okay for me but anyone of average or above would find it awkward. It's not very comfortable on the tailbone after only a few minutes of sitting. Assembling the back took some doing to line up the fittings and one arm wobbles terribly. This is my second disappointing chair from Overstock and I won't buy anymore from here. The towels are great though.", 
    "After seeing a few mixed reviews, I was somewhat hesitant to purchase this recliner, but for the price, I decided to give it a try. I was very pleasantly surprised when it arrived. It comes in 2 pieces, but takes only seconds to assemble; once put together it was very solid. It's definitely a smaller-scale recliner, but I needed something to fit in a small space, so the size is perfect. Some stated that this chair would not be good for a tall person, but I'm 6'1\" and found it to be quite comfortable. The color was lighter than I was hoping for, but for $10 worth of vinyl dye and one afternoon's effort, the color is nearly a perfect match with the sofa now. I'm very pleased with this purchase. If the back were just slightly taller, I would have rated this a 5.", 
    "Great small recliner. I bought it to use as a desk chair that could be reclined at that desk, and it works perfectly for that function as it is shirt enough to easily fit under most desks I think. It comes that casters to help it slide across carpet if needed. I didn't have much problem keeping it reclined, but I'm short (5'1), so that probably helped because my feet and legs weren't hanging off the end of the footrest to weigh that end down and keep it from staying reclined. I like the side pocket also.", 
    "I ordered 2 of these, and they are small. Small enough that I would return them if it weren't for the cost of return shipping. The top of the recliner is at my shoulder blades, and looking at it in the living room it looks like it was designed for a child. The arm rests barely crest over the bulk of my thighs, and the width is just barely enough to sit in without my hips touching the arm rests. Construction feels somewhat cheap, it has a good amount of sway to it and I am afraid that if I wiggle around too much I will break it. The pleather material feels as if I might rip it with my toe nails if I'm not careful. Functionality is ok, but you can't recline without raising the foot rest. Good points, though it is small and wiggly, it does feel comfortable.", 
    "Chair was just what I had hoped for. It is solid and sturdy as well as comfortable. Set up and install could not be any easier. We are very pleased w/our purchase and the price was very reasonable.", 
    "comfortable and inexpensive. Very easy to clean. The compact size is perfect for the small room.", 
    "I bough this Recliner for my husband as an Anniversary gift I gave it to him on 4/4 and by 4/6 the REcliner broke the leg gave in. The back of the recliner was not soported by any screws so it was always loose. Do not buy this Recliner it was a wast of money and time.", 
    "Purchased this recliner due to having to keep legs elevated most of the time. It's easy to assemble,however it's very small and low to the floor. It also does'nt fully recline all the way(more of a sit-up position)w/legs slightly elevated. It would have been more trouble to send back, so I kept it for now.I will be getting a full sized recliner from \"furniture store\" later on.It looks good and stylish and the price was right ,if your on a budget.", 
    "Space saver and comfortable!", 
    "This is a wonderful chair. Very sleek and easy to put together. My only complaint is that the recliner part is too short for my husband's long legs but I couldn't tell that when I bought it but he has gotten use to it and sits on it all the time. Thank you too for the speedy delivery.", 
    "While the product looked good upon arrival it only took 2 days after sitting in the chair that we noticed the seat cushion sagging. A chair typically has springs and or wooden design beneath the cushion and this product clearly does not. Waiting it out for a bit to see if the sagging continues before we return the product to Overstock.", 
    "had to replace on old recliner and love seat and decided to go with three recliners to stop fighting with the the kids over the recliner. this became my recliner and the kids stay out of it. very comfortable", 
    "The other reviewers are correct that it's a very small recliner but that's exactly what I was looking for. I wanted a recliner I could use at my desk. When working on the computer I need to be sitting up like a regular desk chair but when watching movies or playing games I wanted the option to recline. This chair fits perfectly at my desk and is the right height for my keyboard tray. It obviously doesn't have wheels but it's light enough to slide back and forth easily on a chair mat. The chair feels sturdy and appears to be made well. The padding feels like memory foam since after sitting in it a few minutes you kinda sink into it. Very comfortable for my back which is a plus since most desk chairs usually bother my back. I know some complained that their feet hang off the end but this appears intentional. The recline part that comes up is just enough to raise your legs, leaving your feet hanging off the end (I'm 5'4\" as a reference). I've owned other recliners designed like this so it doesn't bother me. As for getting into the recline position, it was harder when I first got the chair (I've had it about a month now). You have to push back on the chair to recline and at first it was a little stiff. But now it's broken in and is no trouble at all. I do agree that's its difficult to fully recline in this chair and lay all the way back. However I never use the chair that way since I use it at my desk so it's not an issue for me. This is probably not the right chair to use in a traditional living room (unless it's a small apartment) because it's definitely no lazy boy. But it's perfect if you have a need for a small recliner and I can highly recommend it as a non-traditional computer chair.", 
    "I bought this chair for my son's nursery. I hate rocking chairs. This has been perfect. The faux leather is perfect for cleaning up spills as opposed to a fabric covered chair. I am only 5'2\" so I have no problems with this chair. My husband is only 5'8\" and still ok, but if you are over 6ft tall you may have issues with this chair. Perfect for a smaller space! Definitely can handle the abuse that a toddler can give it too :)", 
    "It's an awesome product and so comfortable. Our TV experience is totally different in this recliner. The only negative is and that's why I didn't select all 5 stars is the strange smell of the material for the first couple of day. The smell is gone now and we can really enjoy our movie nights at home. (We think the material just needed some air after it got out off all the packaging)", 
    "Very small recliner....fine for me I'm 5 4\", but too small for my hubby. Christmas gift for him. Plenty comfoirtable and good back support, just not enough leg area....needs an extention.", 
    "I'm only 5'2\" and my feet hang off the edge of this very tiny recliner. It's also way too close to the floor for comfort. I would rather my chair catch me before I get so close to the floor that I feel as if I'm falling. One other reviewer said it looks like children's furniture and I have to agree with that. I'm not even sure I want this chair in my den because it's just not comfortable.", 
    "I have never been disappointed in anything I have purchased. I am 70 so always concerned about handling and putting together. This was no disappointment. It arrived quickly. I could bring in house carry after opening and put the two pieces together. For the price I think the product is excellent. I love overstock so am partial.", 
    "very nice chair, supports back, easy to put together and use. Love the side pocket, my laptop fit it perfectly!", 
    "Great little recliner for the average height person that fits in a small space area.", 
    "The recliner looks great and very streamlined for small spaces. I love it my only problem is that when you push back in the full reclined position it does not stay there the chair slides back into the middle recline.", 
    "I purchased the chair for the looks and the reclining ability. Little did I know it would not be functional. I read another review from someone else who bought the chair before I purchasde it and they also said it did not stay in the reclined postition. And I bought it so I could recline. Unfortunately, the chair is not all that it is cracked up to be. Small. narrow and will not stay in the reclined position is what you will egt by ordering this chair. It is better suited for small people/children.", 
    "Nice looking chair, but does not stay reclined. It's a little small.", 
    "I ordered this chair to relax and put my feet up, they hang off the edge. Chair only stays back when I push it. Not happy with purchase. My wife likes it as she is smaller but wishes it was bigger also.", 
    "This isn't the fanciest recliner you'll ever find but it suits me just fine as a starter chair for my living room.", 
    "Needed a small recliner for motor home. This worked out perfectly. Comfortable too.", 
    "Slim. Comfortable and great looking. Happy with purchase", 
    "Just the right size for my space. Good quality", 
    "Love it, great shape, size and comfortable", 
    "I knew this chair was smaller than a normal man size recliner. I had a small recliner which I replaced with this one. However, this chair is very uncomfortable for me. I have some lower back pain and I cannot sit in this chair for more than a few minutes. I think it would be great for my 9 year old great neice..... Unless you are a very short person, it is not for me and I will be replacing it. I will never buy another chair on the internet unless I can sit in a like chair in a store.", 
    "A great chair for tv or relaxing", 
    "Fantastic comfortable night quality finished", 
    "Beside the color, the chair is unstable, both arm rest are loose and cannot be fixed. I trough out the box before put it together otherwise I would have returned it. Not a happy purchase.", 
    "This compact recliner is just what we needed. We don't get lost in the cushions, it is very comfortable and looks good too!", 
    "The chair is comfortable, but doesn't stay back in reclined position; It creeps forward. It's also very loud. Anytime you move reclining position it makes loud noises.", 
    "Everyone fights over getting to sit in this pretty chairLooks like a T-Model chair", 
    "There is not much good I can say about this chair. Not very comfortable and recline mechanism is rough in operation. I'm 6' plus and this chair is too small for me. Again it was an inexpensive piece and represents the down side of Internet purchasing of furniture. Never would have bought this if I had seen it and sat in it first. I could have done better lesson learned.j", 
    "Well made, but very firm - great for support but not for softness.", 
    "The recliner took 5-10 mins to put one side into the other. I am 6-4 skinny and still getting used to it the legs hanging off a bit does not bother me. Just need to recline half-way to feel comfortable as far as sitting back in the seat. The seat is very narrow which does not affect me but if you are fairly wide-bodied than might not work. It is wonderful as far as space consumption. I have it in a ten by ten room. You won't find many that take up such a small amount of space and that can work in a room. The fact that you have to lean to recline is over-stated, it locks once you push to the postion you desire.", 
    "Chair appearance is exactly as in the photo. Its size is medium to small and the seating is medium firm which makes it suitable as an accent chair but much more comfortable. The fact that it reclines (push back, no levers) is a plus. The faux leather seems reasonably thick. The stitching is straight and well done. Assembly was easy.", 
    "Well made, but smaller than a typical recliner. It is comfortable for me, but my 260 lb. husband doesn't find it comfortable. It was easy to put together.", 
    "It doesn't stay laying down for some reason... I thought we would be able to stretch it out to 180 degree but it would only stay at the 90 degree angle", 
    "This was an excellent choice for me. The chair arrived in a timely manner, very easy to assemble, looks great and comfortable.", 
    "love this chair very nice look great to.", 
    "I purchased this chair in 2010 and it is still my favorite spot to sit. The vinyl has held up well. After five years of use I do not have any tears or rips. I would recommend this chair for someone who wants a recliner that doesn't cost a lot of money.", 
    "I have a bad back and this chair is firm. It is small but so am I and then my husband and son can't use it. It's a bonus!", 
    "Good chair, for the price I didn't expect a Laz-e-boy....I just wish I could sleep in it...but sitting in it is just fine.", 
    "Good chair. I'm 6' and it supports my head well. It's not a luxury recliner, it's pretty basic, but I like it.", 
    "An absolutely great chair, at an insane price, from a very good company!", 
    "This chair is one piece. It is easy to assemble. You literally slide the back side onto the base and it's done and solid. It looks and feels like leather, even to people like me who love leather and are usually picky. I am 6 ft tall. Someone taller than me will start to be too long for this chair, fyi.", 
    "This chair is small and fits in with my decor and it is comfortable.", 
    "When I purchased this chair for my son I thought it might not be big or strong but my son says he loves it and sleeps in it all the time! With the pocket on the side he can put his remote and books there too.", 
    "I recently bought a wingback chair(not a recliner)from another store. I am use to a recliner and I didn't like the chair/ottoman system. I still wanted a recliner. Having a small livingroom this chair was perfect!! It arrived in a big box and consisted of two pieces; the top and bottom. I screwed in the feet and slid the top onto the bottom and bingo! I have a recliner! If you are looking for a soft, cushy chair this is not the one you want. Its solid when you sit but its got good back support. Easy up and down. Great chair for the price!!", 
    "Beautiful, the picture on line does'nt do it justice. Very rich looking, and comfortable to lounge in. Shipped on time. Thank you!", 
    "I wanted a recliner that I could use as a replacement for my computer chair. This recliner comes in 2 pieces & is very easy to assemble; you just have to click the back part into the cushion part of the recliner and that's it. The leather does look like it can get worn out pretty quickly but I'll be making a slipcover for it soon to preserve the material. It's very comfortable and surprisingly light enough for me to lift; the seat part was probably the heaviest piece for me to carry. I'm an average height girl (5'4\") and this recliner was big enough for me to sit in and relax. I thought from all the reviews that it would be too small & too narrow for me but I'm glad that this wasn't the case. You do have to push all the way back really hard if you want to basically be lying down like in the pictures shown with the recliner bent all the way back and it doesn't stay down like that if you do sit back up. However, the leg rest stays up and I can curl up into a ball on the recliner when I'm watching TV on my computer so it's not a big deal for me. I put floor protector dots on the 4 legs of the recliner and I can slide it around my bedroom floor without any issues. Very easy to move, lift, and carry. Aside from the fact that the material does look a little cheap, everything else about this recliner is great. As for the quality of the material goes, like I said I'll be making a slipcover to protect the vinyl. Very reasonably priced & I've been looking for a recliner that's comfortable, big enough for me to sleep in, and at a good price for a very long time!", 
    "received earlier than expected", 
    "Practical recliner, not oversized like most, but not plush and relaxing.", 
    "I bought this chair for my husband and he says it's comfortable but he is 6ft 5 inches tall and we would give it 5 stars if the chair extended about another 11 in or so. With the chair fully extended his feet hangs down a bit.", 
    "This is a great compact recliner with a sleek look.", 
    "I purchased this chair because it looked nice and the price was terrific! It arrived quickly and was a snap to put together. It looks like a much more expensive item and because of that I am happy! The only reason I am giving it a 4 instead of a 5 rating is because the width of the seating is narrow and a larger person might have trouble sitting in it. Me and my husband are smaller, so for us it is perfect. It looks great and is comfortable!", 
    "This is perfect for a smaller room. It's very comfortable but not wide like a regular recliner.", 
    "The chair fits perfect in my small area. I looks good. All I can say is I made a great choice in this chair...", 
    "This recliner is a little cheesy to me, well in my opinion. It doesn't recline the way my other recliner did. But I couldn't afford the recliner that I really wanted, the micro material with the reclining handle on the side. It came in two pieces and it was easy for me to assemble it and it doesn't take up a lot of space. So that's a plus. And it has pockets to hold remote controls, phones, etc.", 
    "Fits nice in a smaller room and comfy. unless you are tall your feet will hang over", 
    "This chair is a little bigger than a child's sized chair and is extremely uncomfortable. The seat cushion is as hard as a rock. It looks great but even when reclined your feet extend way beyond the foot rest. Would not recommend", 
    "Had less than 6 months. Fabric on seat starting to look a little loose. Small children jump on it so its ok for the price.", 
    "The chair arrived in good condition, easy assembly. Would be nice if items that needs to be put together have a list of tools needed for the assembly.", 
    "I love this recliner it is very comfintable", 
    "Good deal for the price. Very sturdy. Smaller than expected. I did have to go purchase additional Velcro to attach the vinyl flap in the back as the strip installed was in the wrong location. But we are satisfied with the chair and it feels good on the back during movie watching.", 
    "Can't get my daughter out of the chair long enough for me to sit in it. Very comfortable and it was very easy to put together. it was as easy as 1,2,3.", 
    "Good value. Leather sturdy. The full recline is not easy to maintain.", 
    "Omg.. This chair iz very comfortable an vrry lite too. Get one u won't regret it.", 
    "I thought for the price the chairs would be decent. Yup, I was dumb enough to order two! They are extremely small and terrible craftsmanship. It's not leather, it won't last- my teenage son is 6'4 222lbs, can't even fit in the chairs . They don't recline and aren't comfortable at all. Like others have said it's too much torrible to return. I'm very disappointed, I should have read the reviews before I ordered them!", 
    "I purchased the recliner for my husband to replace his old recliner. He loves his new chair, he told me he loves the firmness of this chair compared to his old chair that was extremely to soft that hurt his back. I recommend this recliner to anyone who likes a firm comfortable chair.", 
    "Easy to assemble, out of the box and together in minutes. I have small living room so this was perfect for the space.", 
    "We needed a couple of recliners to replace an old couch that was way too low to the ground. These worked great. They took no real time to assemble. Very simple and easy to follow instructions. They are very sturdy and a great value.", 
    "The chair is really very attractive and comfortable. I had to think about the recommending to a friend question for a second. I would recommend it to a friend simply because none of my friends or family members have had 2 spine surgeries. This chair has a firm lumbar support that pushes your spine upwards when in the recline position. I'm fused in that whole area so for me it was not accommodating. Other than that the chair was comfortable. More so as a chair than as a recliner. It's not deep like most recliners are.", 
    "It feels so wonderful sitting in a most reasonable price and comfortable chair with recliner. Helps support my back when I'm breast feeding with my baby.", 
    "This is the perfect size, perfect price, perfect style. I love the side pocket!", 
    "I BOUGHT THIS AS A GIFT FOR MY SISTER, SHE REFUSED TO RETURN IT BECAUSE IT LOOKS GOOD IN THE ROOM. IT IS VERY STIFF ANS SITS UP VERY HIGH WISH I HAD GONE WITH THE LEATHER ONE, DISAPPOINTED", 
    "Being a recent leg amputee; I needed this chair to relieve the pain. It is just what I needed ... Can't keep my grandsons out of it ... I need three of these recliners at this price why not! When you sit in it you automatically fall asleep ... Easy clean too. I love my chair!!!", 
    "It looks much better than it is. Very cheaply constructed and not comfortable.", 
    "Chair looks nice and is fairly comfortable, but it does not stay reclined so at the very least, they should stop calling it one.", 
    "Assembly is super easy and couch is very light. The picture is a little misleading the cushion area is a little smaller than what depicted in the images online", 
    "There is nothing not to love about this chair ! Easy to install, perfect size for bedroom.", 
    "We were looking for a recliner for a small room that would not take up too much space but still had a foot rest. This chair worked out great.", 
    "I am short but my ankles and feet hang off the end, but for the amount of time I'll be sitting it is good for my bedroom.", 
    "This chair looked great in the picture, but the reality is that it feels like you are setting in a poorly designed dentist chair. It is way too small and very uncomfortable.", 
    "The firmness of the chair is great for people with achy backs where soft, mushy chairs you sink in are not good for your back. When I fully recline and stretch my arms back feel like I am doing Pilates!!! Really modern style too, fits any décor!! Very satisfies with the price, delivery and easy set-up!", 
    "This chair was a Christmas gift for my mother, and she loves it. I have not been able to get her out of it since I set it up. in fact it so nice I might get another one for myself.", 
    "The Addin Recliner I ordered from Overstocked.com arrived and after I put it together I really love it. It make me feel relaxed when I'm watching TV. I would reccoumend it to anyone.", 
    "I had high hopes for this chair as I have a need for a reasonably comfortable SMALL recliner to fit in my family room. The chair is small, but is overly firm yet the cover wrinkles from my 155 pound weight. The chair also is difficult to hold in the full recline position without putting my arms above my head. I am a 5'7\" male and fit the chair OK but it will not stay reclined even with 3/4'\" spacers under the front legs.. The style is a bit unbalanced as the seat pack widens from the arms to the top and looks out of proportion. The right side angle is larger than the left hand angel so the chair is visually tilting to the right. This is the first product I have purchased through Overstock that I am disappointed in. As usual I discard packaging at the closest pickup day so the hassle of returning is compounded. I am likely not going to purchase any more furniture as I consider this purchase a $150 lesson. It went together easily,", 
    "For the price as a club chair goes for my waiting area it would serve my needs well. The only problem is it was more of an eggplant with pink coming through. I would not call it brown. It has to go back as my reception area has no room for pink.", 
    "We purchased this recliner 2 1/2 years ago and it is already showing severe wear. The arms which get the most use, on any recliner, are in terrible shape. They have become loose, and the \"leather\" is breaking up and coming off. You would think that the arms would be treated with something a little tougher to take years of using them to push to recline. The rest of the chair seems to be holding up fairly well so far although the seat gets distorted after sitting for an evening. The structure of the recliner seems to be sound, but the materials used to cover it are very inferior. We are an older couple and take care of our furniture. I would not recommend this chair.", 
    "With the promotional price more than happy with the product. Gret for a chair that doesn't take a lot of space but doesn't look out of place.", 
    "i really like the recliner, it just doesn't stay open in the reclined position.", 
    "already recommended with someone at work and they are looking into it. Great price", 
    "The chair looks nice, but is much smaller than you would imagine. The area described includes the arm rest area for total width, so the chair is very narrow. It also does not recline completely for a full back operation and only locks in the middle position. For American tastes and size, I would not recommend, unless you are a very small person, no taller than 5 ft 6 inches and 150 lbs.", 
    "Chair is great everything is exactly as it is shown on the site !! Only compliant is that the seat cushion is not soft at all for a recliner !!! But everything else is great !", 
    "I did not think I was going to find a recliner chair that would fit into my small sitting room -- let alone two! Having difficulties rising from a sitting position for medical reasons, I did not want to be held hostage in a recliner though I wanted the comfort. This chair suits our purposes for now. What's best: it's not so expensive that I wouldn't mind letting it go when my needs or decor changes in the future; I have found it frustrating over the years to be stuck in a decor rut because I paid so much for certain pieces furniture.", 
    "This chair is very cheap. It will not go all the way back. It keeps coming back forward.", 
    "We needed a narrow recliner to take up less space. This recliner is small but very comfortable.", 
    "i ought this to put in a bedroom and needed a small chair was easy to put together the color was awful so i bought a black chair cover and now i am very pleased with it . it was also hard to find a small chair cover but since i sew it was easy to alter one.", 
    "I expected the recliner to be black and it was purple when it arrived. This thing is tiny I'm 5\"10 and my feet and ankles hang over the end. Definitely not worth the price.", 
    "I recieved these chairs very quickly, the pros are they came in 2 pieces and are easy to put together and move in and out of doorways, they were the only recliners i could find for the size i needed for the small space i had to work with. the cons are the faux leather or rather the vinyl is average. The 1st reclining position is easy to do, but to do the 2nd position is awkward and does not stay in place. This recliner was well priced for what you get, it is in a game room for my son and grand children and husband who wanted something that reclines and in expensive. I have had these recliners for a couple of weeks and it is serving the purpose, i hope the chairs hold up on the long run. This is my first buy with overstock and so far i have been happy with my purchase. i also got the warranty just in case, so hopefully i will not need to use it, but it is nice knowing i have a little insurance incase something does go wrong, it was cheap as well.", 
    "I just got this recliner. It is definetly very comfortable. It's a push back recliner so it does take up some space in the back. I would not recommend it for bigger people. I am 6'3'' and it its a bit short for me when I recline, but for the price I can live with it. The only thing I dont like is, there is no way for you to lock it in the recline position, so because I am big I always find it drifing back to the original position. Like I said for the price and for smaller people it is a great buy.", 
    "I didn't realize how small the chair was. Definitely check the measurements before you purchase. I ended up putting it in my son's room to use as a video chair. Overall, I would say it;s great for kids.", 
    "I love how affordable it is. The recliner was very easy to assemble and is very sturdy. It was so easy to move from the front door to the family room. Not only does it look good, but it feels good. It is very comfortable and fits me perfectly. The foot rest comes up easliy without a lot of effort. I was able to lean back to watch TV and lean further back to sleep in the recliner. I am very happy with my purchase.", 
    "It's so easy to be assembled. The quality of it is great and the price is low. It's very comfortable when you want to relax after a busy day. I just fall asleep today on the nice sofa. There is a magazine bag on the right of the sofa. It's useful for me since I can easily grab one from the right. Overall, it's worth the price! Really love it!", 
    "My wife likes it more than I do... The surface material seems to create extra perspiration on my back! But the chair is fine, other than for the \"perspiration glitch\".. Thanks", 
    "Great chair. Super comfortable. Easy assemble. Love it.", 
    "I really like this recliner, i now sleep in it and i just cant get enough of it.", 
    "this chair was exactly what i was looking for fits well in limited space", 
    "Product was returned, feet missing from chair, not exactly the quality I expected, needs to be shipped better,and a better description of actual chair", 
    "I BOUGHT MY RECLINER TO BE USED ON OUR PATIO AREA OVER 3 YRS AGO. IT STILL LOOKS NEW, I KEEP IT COVERED WHEN NOT IN USE. THE COLOR MATCHES WITH MY EXISTING OUTSIDE FURNITURE AND EVERYONE THAT VISITS MAKE SURE THEY SIT IN THE RECLINER. I AM VERY HAPPY WITH IT.", 
    "Product met my expectations and the description on the site was accurate.", 
    "I ordered 2 recliners for our medical office. They are used for patients to recover after a medical procedure. Ordering was a snap and they arrived in less than a week. The price was great. I had been looking for a while and these chairs were at least $200 less than the nearest comparable. They look like good quality chairs. Only complaint is that they are a little smaller than they appear. A wider seat would have been better.", 
    "I got the recliner in 5 days. My son assemble the recliner by himself.He said it was so easy to assemble. I like the recliner.I got what I paid for.The size of the recliner for my place is just right. The color black would have been nice.The armrest is kind of hard not enough cusion I guess. I was looking for a recliner for months and can't find one that suit my price and the delivery charge in my area is anywhere from $50.00-$80.00. Over all I highly recomending ordering at overstock.com .The price of the product is good and the price for shipping is unbeatable. I am now a regular overstock.com customer", 
    "This recliner works well, looks sharp, and is perfect for small apartments, studios, etc. Not for large framed folks."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Addin-Recliner/4692753/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4692753/Simple-Living-Addin-Recliner-a48d86ad-d971-4478-bea9-1a3d2c702259_600.jpg"
  ], 
  "description": "Take a load off in this Simple Living vinyl recliner. This modern\nrecliner features a curved bottom and a contemporary design that\nlooks good in any living space. With attractive chocolate\nupholstery and clean lines, this recliner uses soft polyurethane\nfoam for comfort. The recliner has a cozy feel, and the footrest\noffers additional support and relaxation. This recliner allows you to put your feet up and stretch\n  outAttractive chocolate color vinyl complements any homeThis chair is padded with comfortable polyurethane foamIncludes: One (1) reclinerMaterials: Vinyl, polyurethane foamSeat dimensions: 18 inches high x 20 inches wide x 19 inches\n  deepRecliner dimensions: 39 inches high x 28.5 inches wide x 33.5\n  inches long      StyleModernMaterialFoam, VinylChair TypeReclinersAssemblyAssembly RequiredColorBrownFurniture Frame MaterialMetal, Vinyl, WoodFurniture PatternSolid"
}