{
  "name": "Simple_Living_Pisa_Bentwood_Chair_(Set_of_2)", 
  "price": "EUR 84.30", 
  "reviews": [
    "I didn't expect the quality that we received. They are very nice and comfortable. We live in a 5th wheeler and needed space and these stack in a corner when we don't need them and they are easy to unstack. I used one when I was sewing the other day and was on it for over 4 hours and it was still comfortable. Love them", 
    "Great quality so far for the money. I've only had them a month but so far so good. They're a breeze to put together. Even my 5 year old helped and figured it out! The feet of the legs come with two options: rubber or hard plastic. The hard plastic is much better on carpet. I highly recommend the chairs!", 
    "We ordered 6 of these chairs inn a effort to obtain decent looking dining chairs that could not be scratched or damaged by cats, dogs or kids. We have been using them for 2+ months and not a scratch yet. My husband its 6'3\" and the chairs work for him as well. They might be one of our best buys in terms of style and durability.", 
    "The chairs are solid, and can bear a large person. The chair itself is well constructed, but (at least in the black) the finish is far too thin and easily chipped. Merely pushing the chair under a table table chips the finish, exposing a white substrata.", 
    "We ordered these chairs for our open format office space and they fit beautifully. They are stylish, comfortable and add an elegant touch to help upgrade boring old office furniture.", 
    "I bought these in red in February, so 9 months in, I can report that these chairs have held up impressively for me. They get light to moderate use at my breakfast table and there is not a scratch on them. I have had to tighten the hardware twice because the legs start to shift when someone sits in the chair. So far, tightening has fixed the problem and not caused cracks in the wood. They do not glide very well over my rug, and there is no 'handle' on the chair so can be awkward to pull out from table. I have the rubber/plastic feet on the legs. I don't believe it would be a good decision to leave the feet off for any reason. Assembly was a bit of a challenge if I'm being honest because of an arrow marking the front and back of the leg being quite inconspicuous... Helpful in terms of beauty, a stumbling block during assembly. They are cute chairs that look great at my tulip style table. It is obvious to any user that they are not expensive. I think the sturdiness and weight of the legs is what gives it away for the chair. The seat is so solid, more comfortable than I dared to hope. I have used it for hours and it does become slightly uncomfortable at that point. But, for any meal period, and for the beauty they add to my room I am quite delighted with these chairs. I recommend for inexpensive applications.", 
    "Very bad idea. The next day was better, and they are really, really cool chairs. I'd give them 5 stars except for the drunk thing.", 
    "Loved the look, size and stackability of these chairs! HOWEVER, one broke within 30 days of just weekend use by lightweight female. The chrome frame broke away from the seat! My clever Mr fixit can't repair. They are not sturdy.", 
    "My espresso chairs arrived full of dings and scratches. Since the chairs are going to be used by kids who will probably scratch them up anyway, I won't take the time and energy to return them. However, for $*** per pair, I don't think I got my money's worth.Assembly was okay. The instructions were not awful but the illustration was hard to follow. It took some jiggling to get everything to fit together and I had to use a hammer to bang the feet into the legs.", 
    "Assembly was ok would be better if done with 2 people. Small not so sturdy.", 
    "I love most everything about these chairs. They are comfortable, and seem sturdy so far. And look good around our dining table. The reason for 4 stars; 1-one set came with missing parts and one of the chairs had a 3 inch divet in it. I am still in the process of getting that resolved, but overstock has been great to work with so far. 2-I have kids ranging from 15-1. The seats quickly started getting dents/scratches on them. They are still white, so it doesn't look too bad. Not sure what the kids are doing to cause the scratches?", 
    "Love these chairs, it took my husband no time to put them together.", 
    "I ordered two of these. Really like the looks, however one is wobbly. Tried adjusting all pieces.", 
    "I got exactly what I think of , too happy with the purchase. All my friends were asking where u have purchased these chairs and that feeling was awsum.", 
    "The chairs were fairly simple to assemble and look good however are proving to not be very sturdy and need to be tightened after almost every use. Perhaps they would be more stable on carpet as opposed to my Mexican tile floors.", 
    "These look dainty, but they're solid little chairs and contoured to sit comfortably. I love them, the blue is gorgeous too.", 
    "Product arrived on time!!!", 
    "Modern and simple, goes well in my kitchen with the table also purchased here. They are a little hard on the behind, but basically a good functional and modern design. (I put a small colored pillow to sit on.)", 
    "The chairs were lost in transit for weeks! Trying to locate them with the assistance of several reps from overstock.com and federal express was a nightmare! I decided to accelerate the order and received a credit to my accoun. 1 set showed up several weeks later but i had purchased them from another online store and they were assembled and sitting around my kitchen table so I refused delivery!", 
    "Attractive and easy to assemble. Fits our small dining area nicely.", 
    "Super stylish and easy to clean, but 2 of the 4 chairs I purchased have broken within 4 months, and it's just a matter of time before the other two give out. The legs are not sufficiently held to the base, so they wobble under weight and eventually collapse. Weight is not the issue; we are not heavy people. But I can't let guests to our home sit in the remaining chairs. Whenever anyone sits down, the chairs' legs splay out a couple inches and threaten to break, frightening everyone. A very disappointing purchase and waste of money.", 
    "I had high hopes for these chairs based on the reviews, however I found them to be small and uncomfortable to sit on.", 
    "Product is good as expected", 
    "Nos gustaría un mejor acabado en cuanto a la pintura,necesitan más brillo.", 
    "Durability of the finish is not what I had hoped, especially the painted option (we got both stained and painted)", 
    "very easy to assemble nice and light but strong", 
    "We got 4 of these for an office lunch room and they work great. Small scale but sturdy, went together pretty easy. Fast ship and great price. haven't used yet, so can't speak to wear.", 
    "for the money they look and work good", 
    "These chairs look great but I have to tighten them about every few months because they get wobbly.", 
    "Arrived quickly and easy to put together.", 
    "Good value, sturdy, and easy to care for", 
    "perfect table and chairs and price, but too many shipments required to get all the pieces together-cost me time and cost you money!", 
    "I use them as accent pcs. in my dining room. Just a little pop of color (yellow). They go beautifully and were easy to put together. It only took me 30 min for both chairs. Great Purchase!", 
    "Chairs arrived promptly and were easy to assemble. I find they are quite comfortable. We use them with the computer desk. No complaints from the kids who use them the most! There were a couple blemishes in the finish, but no one else seems to notice.", 
    "One of the chairs was a little more difficult to assemble than the others, the holes were not quite matching up. But once assembled, nice chairs.", 
    "These chairs are sturdy and easy to assemble, however they are hard. I brought cushions for comfort, and they are fine.", 
    "These chairs are cute. Great, vibrant colors. However, the color rubs off on the wall behind the chair. Also, the screws do not stay put - they seem to \"wiggle\" free. They go together fairly easy but do not stay together. Also, we had scratches on both chair seats when they arrived. Overstock replaced them but the replacements had similar scratches as well.", 
    "I am in love with these! great quality for the price", 
    "At less than $*** for two, you get what you pay for. I initially liked them, but after a few months of daily use I somewhat regret my purchase. They come loose often and just remind me that I went the cheap route.", 
    "Easy set up & solid construction good price bought 4", 
    "A bit hard to assemble, but looks very clean and modern.", 
    "very comfortable, bright white, modern, sleek, price good, fit perfect with the table I had. Would recommend.", 
    "Got two of these chairs in grey to try them out. They're great. Really nice color. Don't take up much space and make the room appear larger. I will get more.", 
    "Simple, nice chairs with clean lines that really fit the style I wanted. Great buy, and I am really happy with them!", 
    "I bought four chairs--two in black and two in blue. The blue is actually a beautiful color, and the black are as classy as one would hope. Some of the best aspects of the chairs: 1) they don't take up as much space as normal dining room chairs as they are sleek and slender and are completely out of the way if pushed in 2) they are more comfortable than one would expect, likely because there was some serious ergonomic work done, and 3) the pop of color adds some character to any room. They chairs are not too difficult to put together once you get past the first one. They're also stackable, and unlike the last chairs I had for my dining room, these are worth keeping even if you change aesthetic--the chairs are a great addition to almost anyone's furniture collection.", 
    "Just perfect for the space I need 😊", 
    "Got a pair of these chairs electric blue It brights up my place with happiness :)", 
    "beautiful color but missing assembly parts like the rubber that goes to the bottom of the legs! I need more of those how can I get them?", 
    "These look great, but the paint chips right off and the wood dents. Good style. Poor quality.", 
    "Great charis! Color is true to what you see in the pictures. Very easy to put together as well.", 
    "I have tailbone issues and cannot sit in a soft chair, this is nice and hard. We got the dark brown. A few flaws in the wood are visible, but overall it looks nice.", 
    "The wood quality is great, and the color is beautiful. They fit pretty much any decor you may have at home. Very easy to assemble. Happy customer here!", 
    "Matched these chairs up with a recently purchased round glass table also from overstock. Gives my new apartment a very modern minimalistic look I was going for. install is a little tedious, but after you figure out how to build the first one the rest is cake.", 
    "Bought these for our office lunch area. We got the blue color and these really add some pop of color to an otherwise, dark colored lunch room. Good quality. Highly recommend.", 
    "Good material,good color,easy assembly,durable product.i am going to order 2 more...", 
    "First I ordered 2 red pisa bentwoods then 2 more. I love them, the color is perfect for my use - they are quite comfortable. the only thing I would say is be patient with assembly as the directions are basically not good nor are they correct and I had to actually bend one of the legs in order for it to work correctly. they came early, packed to protect, and I just love them actually. I would recommend. then I went to IKEA the other the day and saw the chairs I REALLY wanted with wheels for 3/4 less the price - murphy's law. I do like these chairs and would recommend.", 
    "Great chairs for our office kitchen table. Clean, compact design. Comfortable enough, and so far seem well constructed.", 
    "Needed a table and chairs for a smaller area and this was perfect. I wanted the red chairs, but my husband won on the blue ones. I have received so many compliments on this, thinking of ordering 2 more chairs", 
    "These chairs were as described, easy to put together and look amazing with my glass/chrome kitchen table.", 
    "it was hard to put them together and they haven't felt very stable. good enough based on the price. so just aerage.", 
    "Satisfied with the purchase.", 
    "These chairs are comfortable and look great with the Pisa Dining table. The assembly instructions were poor (thus the 4 rating) but once we got through that we were very happy.", 
    "I purchased these chairs to go with the simple Pisa table, I was very happy with the selection! They look pretty cool for the price!", 
    "Great design, well constructed, and easy to assemble. Before ordering these I looked at a lot of similar products that cost much more. These are affordable and look great! So glad I bought 2 sets.", 
    "Along with easy to assemble. Color is true to picture. A bargain.", 
    "very easy to put the chairs together...the tools come in the package. the chairs look amazing", 
    "These chairs are great. They are easy to put together and the quality is good.", 
    "These are great chairs, great price. Easy to put together, as long as they are tightened they are sturdy and really comfortable!", 
    "Strong and sturdy chairs that look gorgeous", 
    "I am sitting in one as I write this and it is comfortable and just nice.", 
    "We bought these chairs for our firm's kitchen. We love them.", 
    "I bought these to stage around a round clear glass table just for the look and the price. Lo and behold, they are actually very comfortable to sit on and even stack! A bargain at twice the price!", 
    "comfortable and good looking", 
    "Very comfortable and sturdy. Since the legs are not secured to chair, Iwasn't sure how it would be to sit in them very long but they hold up well.Quite pleased. The design lines of the chairs are very nice.", 
    "Perfect for dining area and very comfortable. Well built at a very good price. One chair received with hardware, but was taken care of very quickly. Had I been in hurray this would have been an inconvenience.", 
    "Easy ot assemble. A second coat of paint should have been applied.", 
    "One of the chairs was missing the foot rubber bottom. Luckily, we had our silicone caulking gun loaded and we made a custom rubber foot.", 
    "I bought 4. They are good quality and a great price.", 
    "Beautiful! Easy care! Comfortable! Better than I expected!", 
    "Love these chairs. Look modern and quite comfy", 
    "I really like the look of these chairs. They are a little bit wobbly though, and need to be tightened regularly.", 
    "I bought 2 sets of these in black, and the look is just what I had hoped for, but the legs are not as solid as I had hoped. I am quite sure a heavy person would not be able to use these without breaking them. Service was good, but I will be looking for sturdier chairs in the future", 
    "Love these chairs. I got them in yellow. They go perfect with my tulip table and are easy to keep clean.", 
    "Purchased for rental properties, put together by contractor. Purchased to use with a computer desk.", 
    "We loved these chairs upon receiving them. My husband put them together very quickly and they looked perfect in my small breakfast area. Last night my 3 year old was sitting on one and said \"What's this line on the chair?\" I looked and the chair was cracked the whole way down the seat. She weighs 29 lbs so there's no way it was just from her. I can't believe these chairs didn't even last beyond 2 months. I am so disappointed in the quality of this chair.", 
    "excellent construction and modern look for our new bathroom", 
    "I got these in yellow. They are cute and what I was looking for and very easy to assemble!! Love these pop of color yellow in my kitchen!!", 
    "easy to put together...I did not realize there were two, an added bonus...bought for our 13 year old to use on the desk we bought on here too. Looks great in her room!", 
    "very bright and sturdy chairs, easy to put together", 
    "I got these chairs in yellow. Up close you can till that the paint job wasn't the best. You can see streaks where the paint wasn't coated well.The chairs are a little wobbly but I'm a small person so that's not too big of a problem. The chairs would probably be scratched easily, be careful.The assembly was easy and shipping was fast.", 
    "Looks great and they're comfortable. They look like a more expensive chair.", 
    "Not super sturdy but great for the price!", 
    "You can't go wrong with these chairs. They have a small footprint, but are comfortable for everyday. They would be perfect for extra seating; they do stack, but be careful - they can chip. We bought the blue, and it is a beautiful bright color. Worth the price.", 
    "Easy to put together!! Love them!!", 
    "These chairs are easy to assemble (if you follow the instructions), they are sturdy, and look great. Unfortunately, they started to chip and scratch almost immediately, so I suspect they won't look good for long. These chairs are white underneath the thin red veneer, and within a couple weeks 3 of the 4 chairs we ordered already have some sort of white chip or scratch. I would only recommend these chairs if you are going to use them very gingerly.", 
    "The chairs look a lot better in person, quality is great, look expensive, im in love :)", 
    "Ordered 3 sets for a matching table (Naples Oval Dining table). One came with missing hardware; had to wait for a week to get the hardware. Stay away from the \"yellow\". It looks \"lime greenish\" in the pictures which is why we ordered, but what arrived was pure yellow; had to send back, and got all white instead.", 
    "contemporary clean-lined, practical seating easy to assemble", 
    "These chairs are the perfect compliment to my farm table. Slim and sleek, they don't distract from the table but seem like art. Easy to assemble and comfortable to sit for a long time in. Thin legs make me nervous about big men sitting in them but otherwise I'm incredibly pleased.", 
    "They are great for the price. Takes a little time to put together.Great extra chairs.", 
    "The quality of the materials on these is excellent. I love the design as well as the wonderful sturdy wood of the seats. However, I have great issue with how one has to put these together. You have to use one of those diabolical hexagonal-type cheap-o hand tools to assemble. That tool simply does not give you enough leverage to tighten the screws enough. I purchased 4 chairs and had to take 2 of them apart and re-assemble because the screws loosened. And, even after I thought I had them all just right, one has once again become so loose and unstable that I'll have to take it apart and redo. To me, these chairs are borderline useless if they are wobbly. They should have used screws that fit a screwdriver which would make them so much easier to tighten. So sad since these are otherwise lovely-looking chairs.", 
    "These chairs are easy to assemble and great quality for such a reasonable price. They're exactly as pictured and comfortable too! Great buy!", 
    "Easy to assemble modern looking perfect for the look I was going for", 
    "These little chairs are perfect around our small Kitchen table. They look great, feel good to sit in and are well made. The cost is very reasonable. No regrets!", 
    "Comfortable, functional, inexpensive, easy to assemble. Recommend!", 
    "I really love these chairs. As some other reviewers noted, the legs are noticeably slender, giving the appearance of flimsiness. However, thus far my 250# husband has sat in them and moved about while sitting in them, sometimes even with a child or two hopping on his lap, and the chairs haven't shown any sign of strain.They arrived in a timely manner and were extremely simple to put together. I was fortunate in that I have a large ottoman which was just the right height to turn the chair part upside-down while I screwed in the legs. Mine came with both the white rubbery feet and the harder plastic feet. The hard feet required a hammer to tap them in. We ordered four chairs and originally put white feet on two and hard feet on two to see which we liked better. Within a couple of days we switched them all to hard feet because the white tips were getting \"pulled\" against our linoleum, stretched and such as though they might soon fall apart. The hard plastic feet have been perfect.I love that the chairs don't have any nooks or edges to catch dust and crumbs. They are so easy to wipe clean. I love it!I will confess the first chair out of the box had a bit of paint flaking off along one edge, but the others were fine and we just put that side near the wall so it's not noticeable. Overall, a super buy (I priced similar chairs at multiple times the cost of these--even at a local thrift store, they had some seriously used old chairs of similar style that cost nearly as much as these but in way worse shape). I'm quite pleased and would buy more if we had room in the kitchen for six.", 
    "Look good but are a little flimsy. Perfect for kids to use while eating because they are easy to clean", 
    "I’m always nervous and unsure of myself whenever I have to put together anything, despite the fact that I’m good at it. These chairs just arrived today. I really have to say that they look really amazingly beautiful and airy and light. They were a breeze to put together; I did it in roughly an hour. They are sturdy and felt strong and also easy to move around. I love them with my decor which is contemporary modern. I am hopeful they will last quite a long time. I give them two thumbs Up!", 
    "the blue is a knockout. Great modern, classic shape.", 
    "These chairs are very comfortable and look great with our glass table! We purchased two white and two blue...makes it look even better.", 
    "Easy to put together.. you think they won't be sturdy, but they actually are. I have them on carpet. So far so good, but it's only been a month. I weigh like 125 lbs and my husband is 200lbs so they hold up for our weight, but not sure for weights over 250 for example. They look exactly like the photo, and so far are working out great for us.", 
    "The red chairs look great with the Pisa round table. Perfect for my daughter's NYC apartment.", 
    "Takes some time to assemble but totally worth it! Great price...clean, simple, quality chair!", 
    "These are easy to assemble basic chairs that I needed because I am in transition in my living arrangements. Reasonably comfortable and sturdy", 
    "I ordered the cobalt blue - beautiful color!", 
    "Great chairs. I ordered them in yellow and they look amazing with my white table. Shipping was so fast. Great price too!", 
    "First of all the blue color is a beautiful royal blue, LOVE IT, and they are very sturdy and comfortable to sit on, can't ask for better. ;)", 
    "just the right size and extremely easy to assemble!", 
    "Nice chairs for the money. They seem to be well made and they were a breeze to put together by myself.", 
    "Used these in the company breakroom and they are awesome", 
    "Easy to assemble, super cute and functional, great price, comfortable. Don't love the material. It's a short term purchase as it smelled a little toxic when we opened it. Great design though!", 
    "This is made of composite wood so not good quality. The color looks prominent but small scratches may take off the color. Only good thing is assembly which is very easy.", 
    "Chairs were exactly as represented. Ordered the red ones and color was as shown. Shipping was prompt and they arrived in excellent condition. Chairs seem sturdy enough for my purpose; as kitchen chairs used mainly by adults. Great style and the price is right!", 
    "good quality, very rigid but just right for kids play area", 
    "These chairs were as advertised. They were actually better than we anticipated.", 
    "I bought two sets of these chairs (in black) for the eat-in kitchen in my 1952 house. They are the perfect compliment to the Simple Living Bistro Retro table I bought at the same time. I was impressed by how weighty and substantial they feel. Their sleek, curvaceous shape is extremely appealing. A couple of the chairs have Very Slight imperfections in the surface of the wood that no one other than an absolutely stickler like me would ever notice. The legs are a snap to attach; all four chairs were in place in under 15 minutes, and fit perfectly under the Simple Living Bistro Retro table.", 
    "Easy to put together and sturdy. Love the modern look and can't beat the price- especially for a pair!", 
    "These chairs are a good value for the price. I bought them to go with the kitchen table. They are good for moderate and light weight use. However, the legs are narrower and less stable than similar more expensive chairs. One chair delaminated the first time it was used, but the delamination was not noticed before another set of chairs had been ordered. One chair in the second set also had noticeable ridges in the seat, which is indicative that over time it too would delaminate (separate). These chairs were not returned because of the cost of mailing, the time necessary to disassemble and re-pack them and because my husband is able to repair them cosmetically. They are stacked, stored and will be used as additional seating.", 
    "Quality purchase, worth the price.", 
    "These chairs were easy to assemble, comfortable, and look good in our breakfast nook!", 
    "We bought 20+ of these for our breakroom. They are all breaking. Not very strong or going to last.", 
    "I bought 4 of these to go with the Simple Living round tempered glass and chrome table. The set looks great on my lanai. The chairs are not super comfy, but you can tell that just by looking at the photo. But the price sure beats what you'd pay for a \"patio\" set.", 
    "The legs on these are very narrow and seem to spread out when sitting on them almost like they are uneven. The seat it self is comfy for a hard chair.", 
    "Very comfortable and easily stacked chairs- assembly was reasonably easy and color was as expected. Sturdy chairs.", 
    "Beautiful look and feel. The legs are thin and have some wobble, but that comes with their sleek design.", 
    "I love the look of these chairs. The quality wasn't very good but for the price it was decent quality. One of the chairs was missing a screw when it arrived but I put the chair together anyways (giant hassle to re-package and return chairs) and it seemed to be alright without the fifth screw. But last night while I was sitting on the chair (and holding my 2-year-old son) the whole chair collapsed and the legs broke clean away from the main part of the chair. Pretty inconvenienced and disappointed in this purchase, which is a bummer cause I love the look of them. Waiting to see if I'm eligible for a replacement/refund at this point.", 
    "These look great and seem to be holding up fine. They shipped right away.", 
    "I purchased these chairs because I loved the design and the great reviews that it had. To my surprise after a month of having the chairs, I noticed the wood was cracking. I inspected all four chairs and each one had tiny cracks on the wood. Overstock has great customer service so they exchanged my chairs immediately. I thought maybe the original purchase was just a bad batch I received. I received a new shipment of chairs and have not even been with the chairs a month and already one of them is cracking. I'm considering contacting the manufacturer. I don't understand all the great reviews, these chairs don't even last a month!!!", 
    "I bought these chairs in red. It is super easy to put together and it looks very contemporary. Great value", 
    "Modern and best for the price. Perfect!", 
    "Very cute, simple and cool chair!", 
    "Chairs came very nicely packaged and were in great condition. Fairly easy to assemble. Didn't take very long to assemble four of them. They are really good quailty chairs. They don't scratch my hardwood floors. Very comfortable and easy to get in and out of. I have 2 toddlers and put a white booster chair in 2 of them and they work great for little ones too. Nice height. Couldn't be happier for the price. Also one more thing...they do not wobble. They are very sturdy and good quality.", 
    "Stylish looking and comfortable. They fit our needed purpose well. They were easy to assemble. The only reason they did not get an excellent was that when you stack them the paint (I got the black) chips a bit. But for the great price, It was easily fixed with a magic marker. Also, customer service is fast in correcting mistakes for they first sent the wrong color. I ordered more after I got my first chairs because they were so reasonable and good looking. Be sure to tighten the legs on well or they wobble.", 
    "Love this product. Easy to purchase. Arrive on time. No disappointment", 
    "stackable so easily moves to another room to accommodate extra guests. Updates the look In our kitchen in conjunction with our new glass topped table.", 
    "Sleek , modern design . My twins actually prefer those chairs by their desks over those ergonomic ones.", 
    "I bought four of these in blue for my one-bedroom apartment. I was looking for a stylish, reasonable priced stackable chair, and these don't disappoint. Product came with all parts, no dings and although can be put together by one person, two make it much easier. Be careful with the 5 tiny \"rings\", they get lost easily! I debuted these chairs for a Christmas dinner; comfortable throughout a long meal. Contrary to one review, the leg feet only come with rubber. I optimistically disregarded the first review, was glad I did!", 
    "I ordered the dark brown color and it;s a perfect match with my kitchen and cabinets. The order arrived in only two days chairs were easy to put together, but the best part is that they are super comfortable. Great with the round glass table I also ordered.", 
    "My expectations were met with this purchase. Love them", 
    "Bought a set of these in red for my kid's rooms. They are pretty good little inexpensive chairs. Quality was somewhere between average to good. They were easy to assemble. Relatively comfortable for a hard chair. The red was a true red. They look cool and different. Overall I'm happy - and I'm pretty difficult to please.", 
    "We got the chairs in Espresso and they are really pretty! They were not difficult to assemble at all, and seem quite sturdy. They're also very comfortable. Overall a great deal for the price. The only thing we needed to do was add some coasters on the bottom of the legs - the rubber leg bottoms are good if you don't want the chair to move, but if you need to pull it in and out of a table on hardwood, you'll need coasters.", 
    "These are very nice and easy to assemble. I'm going to order a couple more!", 
    "Easy to assemble, and they're nice looking for the price", 
    "I am happy with my purchase. I will buy more in future.", 
    "Light-weight, stylish, nice color. We were very pleased with the color and quality of these chairs.They were just as pictured, though a bit of a challenge to assemble. Great value!", 
    "Love my modern chairs! They are super stylish and didn't break the bank. Mine are Cobalt Blue- Love it!!", 
    "Sturdy and stylish - fits small spaces and looks great. Ordered the blue chairs; they are a hit!", 
    "nice chairs. comfortable and easy to assemble. would recommend to buyers", 
    "I am so pleased with this purchase! I still can't believe that I paid so little for 6 dining room chairs. The chairs were pretty easy to assemble (although I could've used another set of hands). Exactly as described/ pictured. Very comfortable. Easy to wipe clean.", 
    "This purchase was well worth the price and I am over the moon excited about my new chairs! The instructions were spot on and they look amazing with my new table I purchased from Overstock. Overall: very, very happy!", 
    "We bought these chairs hoping to use them with our kitchen table. When they arrived I immediately attempted to put them together for use. The legs were very difficult to attach to the chair and did not seem to match the holes that were provided. It was a struggle to make it work and once they were on, the chair was lopsided. The seat seemed to be lacking symmetry, was oddly shaped and the color was an awful bright yellow. I am very disappointed with this purchase!", 
    "The chairs are exactly what I wanted look great in my breakfast area.they are quite comfortable.", 
    "Good value, looks great in our kitchen. Easy to assemble. Easy to clean. A bit wobbly, but not enough to not recommend it.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Pisa-Bentwood-Chair-Set-of-2/9167803/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9167803/Simple-Living-Pisa-Bentwood-Chair-Set-of-2-ff9f6777-0936-44d6-ae9d-87978b469b77_600.jpg"
  ], 
  "description": "Available in multiple colors to meet your decor needs, this modern\nchair set gives your kitchen a lively feel. This two-piece chair\nset is an ideal choice for small spaces. These lightweight chairs\nare stackable, which allows you to conserve space and put the\nchairs away while not in use. Stackable chairRetro hour glass shape curvesSturdy chrome plated tube metal legsSet includes: Two (2) chairsMaterials: Bentwood, chrome plated metal legsFinish options: Black, blue, espresso, red, white, yellow,\n  greyWeight limit: 250 pounds (for home use only)Seat dimensions: 18.25 inches high x 16.8 inches wide x 16\n  inches deepOverall chair dimensions: 33.5 inches high x 18.8 inches wide\n  x 18.8 inches deepStyleContemporary, ModernMaterialWoodFinishBlack Finish, Espresso Finish, Grey Finish, White Finish, Yellow FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardColorBlack, Blue, Brown, Grey, Red, White, YellowFurniture PatternSolid"
}