{
  "name": "Sure_Fit_Soft_Suede__Waterproof_Chair_Protector", 
  "price": "EUR 32.48", 
  "reviews": [
    "Okay, I ad mit it, I have a tendency to fall asleep in the recliner. Often with a cat on my lap. Somehow lately, I've taken to falling asleep with a soda or a cup of (cold) coffee in my hands (I blame the hypnotic nature of modern TV shows, myself) and I am awakened by the shower of cold liquid going down my lap, all over the vat, and depending on how full the cup was, all over the floor as well. Bummer.The obvious answer is a waterproof chair cover. Here's what's good about it:\u0095 It's a lovely burgundy color\u0095 the fabric is suede-ish and doesn't resemble a waterproof pad in any way\u0095 the quilt squares are nice and big\u0095 it fits and it looks goodHere're the nit-picky problems:\u0095 It's hot. Like any waterproof fabric, \u0095 It's kinda small-ish. My chair is very average and I'm a small woman\u0095 When I sit down on it, everything migrates to the seat of the chair. I have to re-drape it whenever I stand up.All together? Good value for money, I'd recommend it, I like it. It doesn't help the poor cat, though.", 
    "Could be designed to fit better over arms. Protects from pets, but does feel a bit slippery and arms have to be adjusted often. Good quality and color.", 
    "Great neutral color, protects my chair from pet hair, washable and easy to install. Great value.", 
    "A bit large for a wing chair but then at least it covers everything for when my dog is up there (and that is most of the time!) I would recommend. Color is spot on and seems to be very durable; although I have not washed it yet I would think it would hold up well.", 
    "I have 2 cats that sleep and climb on my furniture. I have had these covers on my furniture for 6 months now and they definitely protect the furniture. They wash well also. The only drawback is that you have to adjust them constantly because the material moves.", 
    "this is an extraordinary recliner - works well, beautiful color and takes up little space. If I had a larger house I would buy one for every room! And - as an aside, Overstock.com Customer Service is truly phenomenal! Thank you Overstock.", 
    "I thought because of the strap this Protector may stay on even though it is a leather chair. It does not though. It seems to be a good product but not for my use.", 
    "This product is horrible does not stay put and only has one piece to secure it to the chair.", 
    "Nice fabric and color, but a bit hard to fit it to the chair, and keep the cover from shifting and getting smushed up in the crevices the wrong way. The top part that goes over top of chair does not stay put very well. Have to keep tugging it down. My husband spilled something on it, and we could not get the stain out completely But better to have the stain on the chair protector than the chair itself!", 
    "Helps keep dog hairs off the furniture.", 
    "Great item that matches to perfection. The pic could be my dog and my chair as the colors are perfect. OUght to have a companion piece, the kind of pins that would stay put to keep the seat covers in place.", 
    "I like it well enough that I want anotHer one.", 
    "A little oversized and not as soft as it looks. Plastic scares the dog and he doesn't like it.", 
    "It looks good and does an excellent job of holding the cat hair so I can just vacuum it away.", 
    "Fits my chair well, anchors fairly well. Serves the purpose perfectly. Kitty likes it...an important factor...", 
    "looks better than most, washes well", 
    "This cover is very neat looking and protects the chair to boot!", 
    "Good fit for the recliner & Grandpa!", 
    "Having a small pet in the house I needed to cover my furniture and these are just what I needed. They look great ! Received compliments from visitors too!", 
    "I have no major complaints with this chair protector except that when my medium-sized pooch parks on the chair, it bunches and I seem to always be straightening out the chair cover. It just doesn't stay in place. However, it is waterproof and washes well. My friends have commented that they want one too for their recliners to protect the fabric. It gets a lot of use & is holding up well.", 
    "So far so good. I'VE WASHED ONE OF THE TWO SETS THAT I ORDERED AND IT WASHED BEAUTIFULLY. SURE, THE COVER HAS TO BE REPOSITIONED REGULARLY AFTER SITTING ON IT AND THAT SHOULD BE EXPECTED SINCE IT'S NEITHER GLUED ON OR STITCHED IN PLACE. I WOULD HAVE GIVEN 5 STARS BUT SINCE I'VE ONLY HAD THEM A MONTH, I HAVE NO WAY OF KNOWING THEIR DURABILITY.", 
    "Very pleased love the wrap that goes around your recliner no more fixing it a million times a day", 
    "Bought to protect chairs from dog for everyday use. All three chairs are different shapes and sizes but the covers did great on all. Easy to put on and when company comes they whisk right off. Great product and worth the money.", 
    "Love the size, color and comfort of this chair cover! Quality even better than I thiught and because it has a waterproof backing I now have no worries of my 15 year old dog snuggling in my new chair! I would order this item again!", 
    "Fabric kept sliding off from prolounger chair. Wrong size and fit even though the design/cut seems more flexible.. so sending back.", 
    "Perfect product. as advertised.", 
    "I needed this and it suits it's purpose. Only problem is, it doesn't stay put , but it is a bulky chair so it's my problem really. On a normal side chair I think it would be just fine.", 
    "Softer to sit on those leather chairs.", 
    "Nice enough but don't swtay in place too well.", 
    "They are great for keeping the pets hair and kids from damaging the chair but they don't stay in place. The Back strap is too big and moves around and the arms and seat move constantly", 
    "I have bought both the light tan color and the dark brown. Very satisfied with both. The cover really is waterproof, washes and dries easily. I prefer the light color for appearance, even on a darker chair. The dark brown one is very dark, too dark. The covers do slip and slide but a little straightening is not a problem. They really protect the armchairs.", 
    "Fits wing chair perfect and color matches decor nicely! A+", 
    "Fantastic. A must have invincible god send for all pet owners and parents...", 
    "It was bigger than expected but the ties allowed us to secure it. Cat hair comes of really easily!", 
    "Thick soft and works well.", 
    "If you have dogs, you need this!", 
    "Great product. Would recommend it to any dog owner to keep their upholstery clean and hair free.", 
    "This is a really nice cover. Yes, it does need to be adjusted a bit between sittings, but I dare you to find one that doesn't. Minimal adjusting is required. In the winter this will be VERY nice, as it is warming when lounging on it. Not so good for summer use, but on cold winter evenings, it will be perfect! My dog LOVES it, if he can be allowed to give a thumbs up!", 
    "Softer than expected. Keeps dog off of white chair upholstery.", 
    "My first order was never received despite the fact that UPS stated that it was indeed delivered. I contacted Overstock and after 4 days, the items were replaced free of charge. I must say that the customer representative was attentive, professional and efficient. Well I just received my chair and sofa covers and placed them immediately. The covers are FAR BETTER that I expected. Both fitted my furniture extremely well. Now my three dogs will be allowed on the furniture!. I must emphasize that I have purchased 5 items from Overstock and I cannot be more satisfied with the service and the quality of the items I purchased. Thank you so much", 
    "This is very comfortable recliner chair!", 
    "This is our third one, plus we have 2 couch covers. If you have pets this is a must. Really waterproof and washes up great.", 
    "I bought 2 covers for my club c hairs to protect from my TV cats. They cover the chairs nicely onthe backs, seat and arms. They do the job I wanted them for and the color blends nicely with the chair upholstery.", 
    "This protects chairs great. I use upholstery pins to hold it in place. It is easy to take off to throw in the washing machine when necessary.", 
    "Good quality but only wish that it stayed put better. Am constantly arranging it.", 
    "I bought this because I keep my grand baby, who spits up a lot. It really protects my rocker.", 
    "okay if you don't mind straightening everytime you get up.", 
    "The taupe color goes well against the olive cushions. I intend to remove the arm portions so they don't hide the nice wood mission style arms on the chairs. The length covers the chair well, but the strap to hold the back around the top is pretty awful. I will have to alter it; it's bulky and way too long.", 
    "good quality, a little big for the chair, but I just tuck it in !", 
    "Easy to wash and maintain", 
    "great for all your pets,I have 6 and they have held uplol", 
    "I bought these chair covers to use in my dad's assisted-living apartment. They seem to be working out just fine.", 
    "I LOVE these protectors. I bought two to keep my often wet, muddy and very lively Tibetian Terrier from ruining my light-colored living room chairs. The protector is just the right weight--not flimsy, but not overwhelming. They cover my small and large chair easily. And they wash beautifully! 5 stars for a quality product that does its job.", 
    "It's a great idea & the fabric is really nice. But, it is way too big for all chairs & will not stay on my leather chair.", 
    "Would probably work better on an over stuffed recliner. I own a sleeker style lazy boy.", 
    "I bought this for keeping my chair clean from my dog. It doesn't stay on because she is constantly jumping on the chair and the top of the chair. It is easy to rearrange though and I am not sorry I bought this product.", 
    "I bought this cover to use on my recliner which my cat also uses. It fit fine (2 pieces) and the material was good. The problem was the waterproofing. When I sat on the cover, it retained the heat and it made me sweat. It was the wrong product for me, and I returned it with no problem (except for the $*+ shipping fee!) For others using it just for a pet, it might be perfect. For me It was the wrong product.", 
    "These waterproof covers look great on my 2 recliners, a big improvement to the tablecloths I used to use. I chose tan which is a very nice neutral color. The micro suede is very soft and comfortable The waterproof pad is an excellent solution to my occasional cat messes. I like that these covers are machine washable, but can also be easily spot cleaned with just a cloth and water. I then ran a fan on it and it was clean within minutes. The only downside is that the straps tend to ride up and break on the recliners. I must adjust them each time I use the chairs. Nevertheless, these covers are a great looking solution for my chairs.", 
    "Perfect for our lay z boy recliner. It washes up nicely and stays true to size. My cat loves it.", 
    "I bought two arm chair covers and a sofa cover. The cranberry color matched my furniture perfectly. The armchair covers fit wonderfully. The sofa cover did not work for my sofa, as it has a contour back, so had to send the sofa cover back. The quality of the protectors is high end and wonderful to sit on. I have not washed yet, but I don't anticipate any problems. I will use cold water when I do wash. I would buy these again .", 
    "Very good product but was small for my furniture which made it so hard to stay in place", 
    "This product does exactly what it was designed to do. It is stylish for a cover - provides full protection and is well made.", 
    "The chair protector came in just a few days; the color is beautiful and fits the chair nicely. I have washed it according to the tag directions; it washed and dried beautifully. I am very pleased with this purchase, particularly because the price was so reasonable.", 
    "Good value for products And great customer help...........................................................", 
    "I ordered this to protect my new chair so that my Golderdoodle would still be able to enjoy his favorite snoozing spot. The cover is thick and comfortable and is very easy to just slip off and store when company is expected. The only issue that I found was that the elastic straps that would hold it from slipping were a bit tight on my over-stuffed chair so the cover does require a bit of straightening at times. Much better than a full slip cover!", 
    "I do like this cover; however, it doesn't stay on that well after you sit in it. It's not that bad, though. I have a feeling most covers do that.. If you're a super neat freak, you might not want the twisted cover staring back at you. It does what is intended, however. It keeps my kittens from poking holes in my leather recliner, and it generally looks nice doing it. I would certainly recommend this product. I do wish it was a little darker, though. It is a very light beige. It would have been really nice in a darker taupe.", 
    "I ordered two for a double recliner . i did modified them by sewing the two together in the center bottom . these will protect my recliner and they are the same color. I dont want the recliner to get dirty , these covers will protect my furniture from spills and if they get dirty i can wash them .", 
    "Even though the strap broke, I think it does a good job at protecting the chair. I have to get a couple more since they need to be cleaned daily.", 
    "It works okay but the strap is placed so low the top still falls down."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Sure-Fit-Soft-Suede-Waterproof-Chair-Protector/7538804/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7538804/Soft-Suede-Waterproof-Chair-Protector-c872c3ef-85de-476d-8832-55cb05a9c5b5_600.jpg"
  ], 
  "description": "This decorator-quality Chair cover is streamlined, stylish, and\nwaterproof. With specially bound seaming to prevent leakage and a\nwaterproof laminated backing, it discreetly protects furniture from\nspills and accidents. In a clever combination of style and\nefficiency, this soft suede waterproof chair protector from Sure\nFit is one of the best ways to safeguard the quality and beauty of\nthe furniture in your home. Care and maintenance of this piece is\nsimple as the 100-percent polyester construction of the material is\nmachine washable.Color options: Taupe, BurgundyPattern: Soft Suede WaterproofMaterials: 100-percent polyesterDimensions: 34 inches high x 43 inches wide x 36 inches\n  longCare instructions: Machine WashStyleFurniture ProtectorPatternSolidFabricPolyester, SuedeColorBrown, Red, TanFabric CareMachine Wash"
}