{
  "name": "TRIBECCA_HOME_Uptown_Modern_Accent_Chair_and_Ottoman", 
  "price": "EUR 360.61", 
  "reviews": [
    "Love this chair for the price. It is inexpensive, but looks beautiful in our bedroom. Perfect size. Very easy to put together.", 
    "I ordered the sofa as well in the same light grey. The color and fabric are exactly as pictured. If you have patience you will find the assembly is quite easy. The chair is very firm, which is what I wanted, and isn't overly large for the space next to our fireplace.", 
    "Comfortable and solid. One chair came without leg hole drill so it broke right away...but the others are all solid and look great", 
    "This chair looks great in the corner of my living room. The color is exactly as shows online, and it is a great medium size. The chair is a little stuff but still comfortable. My biggest complaint are the cheap legs of the chair. You need to twist the legs to screw them onto the chair. When we turned the legs, small pieces of the paint on the legs chipped right off. We were able to position the chair and ottoman so the chips don't show but beware of the cheap legs! Other than that, we love it!", 
    "It's a pretty basic chair that would fit in with any decor. Not overstuffed and super comfy, but it works well for me.", 
    "Bought this in the light gray and couldn't be happier. It fits in the corner of our bedroom perfectly. Comfortable and just what I wanted.", 
    "Received my chair today.. Love it! The color was exact, and it didn't take too long to put together. One note of caution.. be careful when screwing in the legs. They are soft wood and have the potential to crack or chip. Otherwise, it's perfect. I love it!", 
    "The chair is small and the material does not fit the chair. The ottoman broke when my daughter sat on it and the material does not clean easily.", 
    "I was looking for a chair for our office, and didn't want to pay >$$$$ for a chair at the furniture store. I went with this one, which looked nice on-line, and got good reviews. Well...let's just say you get what you pay for. 3 of the 4 legs \"chipped\" while installing them to the base. When finished, the back shows that it's level, but the seat is actually lower in the front right than the rest of the cushion. And, I wouldn't actually say it's \"comfortable\", just ok. I now wish I had just spent the money to get a better quality chair. :-(", 
    "This Chair is fairly comfortable. The Faux leather doesn't bother me too much", 
    "Looks nice when assembled but very lightweight and constructed from cheap materials. I had to reinforce the corner on the chair after the wood split open just from screwing in one of the legs. Also, the microsuede fabric looks nice but has been annoying the way it creates constant static cling.", 
    "First piece came defective but overstock took care of that and mailed another one out right away and sent UPS to pick up defective one. Nice piece and fills our space perfectly.", 
    "I was pleasantly surprised at how large this ottoman is - my 15 year old put the legs on it and its going to be perfect for board games, snacking over the upcoming holidays", 
    "fantastic chair. very comfy", 
    "Very pretty. Not as comfortable as we would like but still a great addition to our room. Not too hard to put together. Easier with two people", 
    "Perfect and exactly what I was looking for . I bought the mocha get many compliments . Great additions to my fireplace area.", 
    "Beautiful Accent Chair ! I highly recommend this chair. It will definitely add a elegant touch to your room.", 
    "This product is nothing like I thought it would be, very cheap and fabric does not clean very good. Ordered it December 27, 2015 and it already looks like it's a year old. .", 
    "The chair is comfortable and has a nice look to it but wish I did not order the Ottoman not good quality at all The material is loose in some areas and makes it look cheaply made.", 
    "Poorly (cheaply) made. The entire set is a waste of money.", 
    "Nice size , easy to assemble ,looks like fine furniture", 
    "Really love this chair & ottoman! Also very easy to assemble. : )", 
    "Nice combo for the price. I love how high the seat cushion to floor ratio is...this is a great chair for tall people who often find themselfs slumped down in under-supported cushions.", 
    "Looks good. I ordered the sage color and it is a good match to what's on line. The chair is comfy but much firmer than it could be. Overall a good purchase but not a chair you could fall asleep in if that's what you're looking for.", 
    "larger than I expected, Looks good but not very comfortable to sit in for long term.", 
    "Great chair for the money", 
    "Looks great in my living room, very comfortable, and easy to put together, so glad I purchased it", 
    "Needed a reading chair that was not too big and not too small. This chair with ottoman is a perfect size. You can put it in a living room, bedroom or den. It's firm and comfortable. Pictures shown are exactly what you get. Dark chocolate brown. Putting it together took some time but nothing too difficult. Love it so far!", 
    "Putting it together was NOT as difficult as other reviews would lead you to believe! If you have any experience with IKEA type furniture that should not be an issue. However... The quality seems a little low. One of the feet on the ottoman got chipped when I screwed it in. I can touch it up with wood stain I think. I am also worried the stitching will split because of where it us located (right in the center of the seat). It definetly has not... But we have only had it 2 weeks and it will not have heavy use in my house. It looks very nice though! Hope it works out.", 
    "The scale is great, the style supreme, it is comfortable and appears that it will last for quite some time.", 
    "It is a cute comfortable chair and works well in our family room. The quality isn't great so I don't expect it to last years and years, particularly since it is used on a daily basis. It was packaged well but in several pieces so I passed the job off to the hubs. Not real impressed with the screw in legs on the ottoman as they come loose. Hey, you get what you pay for sometimes. Like the chair, just not great quality.", 
    "Comfortable. A good size for a bedroom or smaller space", 
    "I should've bought 2. Instead, I bought a lesser quality fabric one to go with it. The other one was only about $$-$$ cheaper but the quality is cheap. This is very comfortable to sit on and it's sturdy.", 
    "We have had this chair about 6 months now. It wasn't too hard to put together and the material and cushions still look great. The back is a little shorter than a typical chair but overall it looks great and is pretty comfortable.", 
    "a bit of a pain to assemble (how did I not expect the chair to come in pieces at this price) but really a great value. Using as an accent chair that we don't sit in very often, so i suspect it'll hold up nicely.", 
    "comfortable, sturdy, but the legs of the ottoman have come loose already and screws have to be re-tightened occasionally. Shipped in good time, and was relatively easy to put together.", 
    "nice item and fast delivery", 
    "For the price, I didn't expect much but the ottoman is SO SO SO cheap looking.", 
    "Fabric is good quality and easy to put the legs on, not heavy. A good buy.", 
    "i love the color and the matching footstool. great size for a small apt.", 
    "Ordered two chairs. Love them. Super fast shipping too. The chairs needed to be put together when they arrived. Super easy to put together, only negative, both chairs were missing a couple bolts and screws. Still a great value.", 
    "Impossible to put together. I still have never used it. Unfortunately this was a waste of my money.", 
    "No complaints on the chair for the price. The fabric is pretty, but the chair is cheaply made and not overly comfortable. It's fine for the price, but if you can spend an extra $5$, you'll likely find yourself a more comfortable piece.", 
    "Purchased the grey. The piece is fairly easy to put together. The fabric is very this, worries me with my dogs getting up and down that it will easily puncture or tear. Would've thought the fabric would be a bit thicker even at the lower-end price of this chair and ottoman set. I have some issues with the way the fabric lays in certain places, like around the arms its gathered and not in a neat/even manner. It'll be OK for the 2 or so years I plan on using it. Sits high and firm.", 
    "Disappointed in the quality and a challenge to assemble. The seat started to show wear within 3 months of occasional use.", 
    "Ordered over the weekend and it arrived today in 2 packages. Chair comes in one 65lb box and ottoman arrives in smaller box. Both very well packed, not a single issue of mark on the pieces. Assembly was very easy and fast. I bought the Linen Grey and I'm very impressed with the quality of fabric. It's not thin or weak. The chair is actually very well made and firm to sit on. You don't sink into the cushions with is great! Great overall size. Was assuming it would be slightly smaller but I'm happily disappointed that i underestimated its overall footprint in my livingroom.", 
    "The Ottoman is creaky and not very stable", 
    "I ordered the white linen, but it's a little beiger than I'd like and it gets dirty very easily (had to be careful not to touch the fabric during assembly!). It was difficult to assemble, the ottoman was missing parts, and the chair doesn't line up perfectly. Once everything was adjusted and corrected, it is a comfortable chair but it feels kind of flimsy.", 
    "Put together, this chair and ottoman look very nice. (We got the grey linen and its lovely.) Only ISSUE is that the legs are all angled differently, and they aren't marked (left-front or right rear) so it's a bitch figuring out which goes where. Also, as you screw them into the bottom they catch the underliner and make it hard to finish the task. But, once done -- looks pretty good.", 
    "Pros: Well packed. Arrived very very quickly. Easy to assemble. Excellent back support. Lotsa compliments on look of chair when folks see it for first time. Other: there is more \"blue\" in the grey than appears in the picture online. I'm compensating for this by using a throw of a color tht ties it better to other things in the room. Chair is smaller and much lighter (weight) than I'd hoped for. The fabric feels very thin. Since used as an \"occasional chair\" it should b fine. Overall, I'm pleased with the product.", 
    "Easy to put together, just persevere. And comfortable to sit in - my cats haven't been out of it since I got it, a sure sign of comfort. For the money, this is a really nice looking chair and ottoman set. I did one thing to upgrade - the legs look cheap and you can buy wooden legs online - who knew?- so I bought slightly better legs for both and it improved the look 1000%. Can't tell now that it is not expensive furniture.", 
    "Loved accent chair and Ottoman, no problem assembling took less than 20 min. To do and chair is supper comfortable.", 
    "this is really a poor quality piece of furniture. the chair itself has very little strength to it and the ottoman weighs less than 3#. The chair is very difficult to assemble. you must put the arms on as well as the seat. the hardware was still oily from the machining.", 
    "Love this chair and ottoman I got it in gray and it looks beautiful in my livingroom. Very easy to put together great quality for a great price you will not find anything else in this price range and I've searched everywhere. Highly recommended.", 
    "I really liked the coloring of the grey, but unfortunately one of the legs wouldn't screw on straight because it was drilled wrong. Had to return", 
    "stylish & comfy best of both worlds", 
    "I bought two of these chair sets for our sunroom (indoors) and am happy with them so far. They are very firm but not in a bad way. The only con would be that I got the white linen and pet hair is showing up very easily on it.", 
    "The chair is very nice, however, it was too dificult to put together. No specifications how to set legs on ottoman.", 
    "It was worth it...I love that chair", 
    "Although you do have to assemble it, it was quite easy. It is the perfect size for the corner of my room that I was looking for. Very comfortable and have actually fallen asleep in it a few times. The affordable price made it even sweeter!! Love it!!😃", 
    "Love this piece. It makes a great reading nook area!", 
    "Gray linen is exactly as pictured. Easy to put together and very comfortable. Adds an elegance to the bedroom.", 
    "excellent quality-quick shipping-just what I wanted.", 
    "I bought this on sale, was worth the price. It's a bit light, but is very comfy and was fairly easy to put together. It looks very pretty in my beach themed living room.", 
    "thought this was going to be a cheaper cost alternative to **** for a similar product, and unfortunately chairs are grossly cheaper quality alternative: lightweight and hastily made. Honestly, they belong in a dorm room. Ottoman legs are tricky to screw in tight enough to appear straight, yet not wobble. Take the hit and buy furniture store quality- there is a distinct difference.", 
    "This accent chair & ottoman was exactly what was described and pictured in the website.Workmanship was good and assembly is not that difficult at all. Just screw the arm rest to the back rest and the foot at the bottom and that's it.Size, i would say is just right at 32.5\" wide (side to side) and 23\" inside seating width. Although I would have preferred had it been a little bit narrower due to our limited living room space.Durability still remains to be seen, we use this almost whole day everyday so we will see how long the shape would hold.Delivery was surprisingly fast, it arrived earlier than expected (if not on the same day).Overall, I believe my experience with regards to the online purchase, delivery and the actual product is excellent.", 
    "Nice quality, easy to assemble, but maybe sits just a little too firm.", 
    "major task to build this item when I received it and a leg screw got stripped and it will break in a short while I'm sure. looks nice and right size chair and ottoman but I should have paid more and got something to last."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Uptown-Modern-Accent-Chair-and-Ottoman/8767750/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8767750/TRIBECCA-HOME-Uptown-Modern-Accent-Chair-and-Ottoman-bb0f061a-0db4-4b1b-b36a-21f380eb6808_600.jpg"
  ], 
  "description": "Streamline your contemporary space with this chair and ottoman\naccent set. The modern construction and clean lines of the cherry\nor espresso wood finish contrast with the upholstery choices to\ncreate a striking and versatile furniture set. Introduce this chair\nand ottoman to your living room for a touch of warmth and class, or\nput it in front of the fireplace in your den.Set includes one chair and one ottomanCushion covers are removableMade of Asian hardwood, linen and premium foamWood finish available in espresso or cherry to highlight\n  different color schemesUpholstery available in gray or white linen; light brown,\n  mocha or sage micro fiber; and dark brown faux leatherFoam density measures 24\"StyleContemporaryMaterialLinen, WoodChair TypeChair & Ottoman SetsAssemblyAssembly RequiredChair Back HeightStandardColorBrown, Green, Grey, WhiteFurniture PatternSolidProduct FeaturesOttoman Included"
}