{
  "name": "TRIBECCA_HOME_Hills_Mission-Style_Oak_and_Olive_Microfiber_Accent_Chair", 
  "price": "EUR 244.74", 
  "reviews": [
    "This is an awesome chair! It looks even better than in the picture. It's pretty comfortable and the upholstery is reasonably nice. Not necessarily sure how the fabric will hold up over time, but nice for the price point. Everything arrived intact with the exception of a minor scratch near the bottom exterior of one leg. A couple notes on assembly: Try to get the bolts for the front stretcher in by hand as far as you can go before using the included allen wrench. An interesting note (that I figured out after assembling the front stretcher, of course) is that the semi-rounded tip on the allen wrench can be used to tighten the bolts at a slight angle. This is invaluable in the tight quarters of assembling the front stretcher. When assembling the back panel, it helps to have someone hold it in place while you get the the bolts in place. As always, make sure you don't tighten down the all the bolts completely prior to getting everything together and snugged. The back panel looks like it doesn't want to go in properly, but once everything is tightened, it all fits just fine. When placing the seat panel make sure to only use a hand screwdriver as anything else is likely to strip out the soft wood (soft being relative, of course). I made that mistake, but it was easily remedied by substituting some longer wood screws and tightening them till snug by hand. Overall, great buy and would definitely purchase again! This is going to look great in my new apartment.", 
    "I needed a comfortable chair for my elderly sister who is diabetic and has mobility problems. That means I needed something with sturdy arms that would help her get out of the chair and with seating that was not too low, too soft, and would not cut off circulation. This chair looked like it could be it. With my own back and joint problems, putting it together was a challenge. Ten years ago, I would have had it assembled in an hour or two. Having an extra set of hands when attaching the second side would definitely be a big help. Realising I had to screw in the seating platform was daunting at first, but after a few taps of the screws with a hammer, they went right in with the Phillips. Even with my limitations, once I could decipher the \"illustrations/instructions\", this was not a difficult job. I love the look of the chair and my sister feels that she was given the best present ever.", 
    "This chair is so comfy and it's so big! I am only 5'2'' but my hubby is much taller and bigger than me, and we BOTH loveee the chair and it's so comfy even for him! I did add an accent pillow for more back support but overall, very good price and worth it. The chair (and the ottoman) looks expensive and sturdy. It took my hubby less than 30 min to assemble the chair, he's pretty handy around the house so maybe that's why but I'd imagine that it shouldn't take too long to assemble for anybody really.", 
    "I was very skeptical about these chairs after reading the reviews. I just got 2 of them today. They were very easy to put together and took little time. I'm a big guy 6' 5\", 300lbs, and while I was putting them together, I wasn't sure I would even be able to sit in them without them crashing down or immediately cracking. However! Once I got them together and sat in them, they seemed sturdy enough, and did not feel unstable. The back does seem a bit flimsy, but I don't get the impression it is going to give way. The seat support concerned me more than anything. The only thing holding the seat (which is a thin frame and strap seat), is a board in front (which is ok), and the back piece (not a support in the back, the actually back piece of the chair, which is flimsy). There was no under support on the sides or back at all!!!!! Even though they held and seemed ok, I did go and buy a $2 1X1 1/2 piece of wood and cut it into 4 pieces. I put about a foot long piece on each side (on the bottom) of the seat and screwed it in to provide some extra support. I'm feeling pretty confident they will be sturdy enough. The cushions are very firm, which is exactly what I wanted, so they are excellent. I wasn't thrilled with the olive color online, but it actually looks nice. Now that I have them secured and framed up a little more, I feel good about them. Most importantly, they LOOK GREAT! If need be, I can add some additional supports over time if the back or bottom begin to feel weak. For the price and how great they look, I don't mind spending a few bucks to making them more sturdy. I'm \"so far\" pretty satisfied. If I run into any issues after owning them for awhile, I'll write another review.", 
    "Most chairs we've seen were so heavy I thought they might dent our wood laminate floor. But this chair is easily movable but has held family and friends comfortably from 5' 4\" to 6' 2\" and all the way up to almost 300 pounds. Really happy! And such an easy way to purchase!", 
    "I love the chair and it is exactly as described on the site. It arrived very well packaged and right on time, with all parts in place and intact. The assembly instructions were a series of 3 photos only, no actual description or step by step instructions and to make things complicated, the bolt holes for the seat back support did not exactly line up. Not exactly impossible, but required some finesse in putting together. I can see an impatient male assembler breaking the back support in attempting to assemble it, thus only 4 stars for this one.", 
    "My husband wanted to kill me for buying this because it was very much of a pain to put together. However, once he got it together, it looks great and is comfortable. So, be prepared for a wrestling match getting it together, then you can relax!", 
    "I was a little leery at buying this chair offline, but what the heck, I'll give it a shot. After the chair arrived, it me about 30-40 minutes to assemble it, and the assembly was pretty easy. The screws and bolts an allen wrench were all there. This is a very durable and comfortable chair and it should last me at least 10 years. It's easy to clean, just use a light damp cloth for the fabric and a little lemon pledge for the wood. I highly recommend this chair.", 
    "I am very satisfied with the end product, however, the assembly sheet was ill prepared, hard to read and understand. I know the product was made in China but there was no need to have the instructions in Chinese, just kidding, but darn close. I was so glad that just by looking at the parts, common sense was all that was necessary to properly assemble the chair. I'm just very happy that the item was not very complicated to put together or it would be on its way back to Overstock.", 
    "These chairs were just what we needed. We ordered them on Tuesday and received them on Friday! Had them assembled and in the family room on Saturday. Very comfortable, perfect for casual space.", 
    "Very happy. The wood is cherry colored and pretty. The micro-suede is decent quality. Assembly was not a problem. True the directions sheet is faded but there is enough to do the assembly in 20-30 minutes. BUT two sets of hands does help.", 
    "We totally remodeled our living room and dining room. Our sofa and loveseat are a muted olive color and we were having a hard time finding a chair that would fit with the fabric and the wood coffee table, etc. This chair was PERFECT for what we wanted and the price was incredible. With no shipping and no sales tax, it made it even sweeter. The chair is solid, well-made and as for the covering, most people who see it think it's suede. It's really comfy and the mission styling really makes this an impressive piece in the living room. O Stock is the best!! They deliver what they promise for me, every time. I would highly recommend this chair to anyone looking for great quality and a great price!", 
    "These chairs look pretty good for the price I have had them in a front living room and they seem to be holding up good. The upholstery is not the tightest so I don't think I would put them in a room where they are going to get used all the time I'm pretty sure they would look shabby fast.", 
    "Love the chair. Exactly what I imagined. Easy to assemble with simple house hold tools (screwdriver). It's comfortable, Handsome and has a simple elegance. The fabric is soft and I love the mushroom-olive color. Quick delivery", 
    "As I have come to expect from Overstock, the Mission Chair is a quality piece of furniture. There were two small spots where the finish was marred but they were easily repaired with Old English. My husband put it together in a few minutes. Its a favorite with us and our cats too. How can you beat a nice comfortable chair and $2.95 shipping? I love Overstock -- Go Big O!", 
    "Easy as pie to put together in spite of previous customer reviews.", 
    "I don't recommend this product. It looks nice, but the quality if very poor. The back of the chair is so flimsy that I'm reluctant to sit in it.", 
    "Lucky that my husband has mechanical abilities. Assembly directions were printed on over exposed paper--making them hard to read, and what could be read was poorly written. Once assembled, I found the chair quality equal to the low price. Not bad for the money, but I'd rather pay a little more for better quality.", 
    "For the money, this product was a good purchase. We bought 3 pieces from this line, all match well together and are comfortable. However, the bottom cushion on this piece feels like a spring has been bent or somehow impaired, possibly during shipping? We are using it as indoor/outdoor furniture for our sun room. and replacement seemed more trouble than it was worth.", 
    "It is an attractive chair and a good value for the price, but it does not have springs in the seat as is listed in the description. It is just a foam block. Easy to assemble the very odd instructions.", 
    "This chair is soooooo comfortable! The quality of the cushions was much better than I expected. I am very pleased with the purchase. The only negative would be the assemble instructions. They were not very good. I am in my 60's and put it together by myself. (a second pair of hands would have made it easier)", 
    "I absolutely love this chair. It is the perfect size and comfort level. I am constantly sitting in it to read, work on my laptop or just hang out. The arms are wide enough to place a coffee cup or bowl of food, providing a great breakfast seat to read and sip a cup of coffee. My only complaint is the assembly of the chair. It took me 2 hours to figure out the pieces and finally get pieced together. I did it on my own, so may have gone a bit quicker with another set of hands. The color is nice and fits into any setting. Highly recommend!!", 
    "Do not buy this chair. It is poorly made, looks cheap and is uncomfortable to sit in.As it is impossible to keep in the house it has been relegated to our garage.", 
    "The chair was easy to assemble, has nice fabric and is comfortable to sit in. I'd recommend it to anyone who is looking for a mission style chair for less.", 
    "Extremely pleased with this purchase...the was easy to assemble and is very comfortable. Love it!", 
    "The chair arrived quickly and was easily assembled by just me (a woman). It is comfortable and fit nicely in our office.", 
    "One of the best purchases I have made on-line. It was easy to assemble and looks great in my den. Very comfortable.", 
    "The chair is great, and it makes the perfect final piece for this room. It is comfortable and feels sturdy. The instructions for assembly were pretty weak, so it's good it wasn't too complicated. I do wish that the various \"mission\" style pieces that Overstock sells would match a little better, but I have made the various shades of wood work together. The ottoman wasn't available and is priced too high even if it was available.", 
    "Fast delivery. It took more than an hour to assemble each chair. Chairs look good and are comfortable.", 
    "I found the chair easy to assemble, and it is very comfortable. The picture is true to the color of the chair. I also bought the ottoman, and it is a lovelyaddition to our downstairs TV room..", 
    "saved for sun room ,nice ,too large for living rm. comfy.", 
    "These are very nice chairs. I bought three, two for a rental and one for ourselves. The only thing I wish were different is the fabric. It would be nicer if it were cotton or linen. I plan to recover the cushions.", 
    "These were easy to assemble and a good qualify chair. This is for a home office so they will not get everyday use. They are perfect for what I need them for and sure they will last a long time. Color and wood looked just like the photo.", 
    "Truly great product for the price. Easy to assemble. Sturdy", 
    "Good value for the price. Was a bit of a pain to put together, instructions were non-existent.", 
    "We needed an extra chair for our family room but didn't want anything too big. This chair is a perfect fit. My husband and I put it together in about a half hour. We had a guest coming for an extended stay, (a couple of months). This person is quite large around 350 lbs, I was a bit worried about the chair holding up to the weight everyday, but it has held up perfectly! It's is a very comfortable chair, It looks so much better in person than in the picture. My husband is 6'2\" and I'm 5'11\" and it fits us perfectly! it and long wide arms and a nice deep seat. Couldn't believe the price of this great chair, what a fantastic deal! We are very happy with this purchase!", 
    "This chair fits our needs and works with our decor. All past reviews are accurate: It's stiff when you sit down and the cushion fabric does not wrap around.", 
    "When chair arrived, both \"arms\" were broken. Customer service handled quickly w/ replacements. Chair was easy to assemble.", 
    "Chair arrived in great condition and was very easy to assemble. I ordered the matching ottoman and was worried that the colors wouldn't match but the two pieces match very well. I'm very happy with both pieces.", 
    "Not high-end but looks great for the money.", 
    "The drilled holes for the provided screws were very poorly done and too big for the screws provided. Had to glue the screws in and had I not started the process and not thrown out the original containe, I would have returned it. Very disappointing considering that aesthetically the chair looks good.", 
    "This is a well-designed, nice-looking piece of furniture. In order to sell it at this price, however, it is pretty marginally constructed of was-wood with a thin veneer. After a few years, it is pretty banged-up, though no less comfortable. The fabric is still in great shape, even with our cat-full household, and cleans right up with a good vacuuming. While we are happy with this purchase, and would probably buy these again, what I really get from this purchase is the hope that next time I can afford to buy a \"real\" version of this char from a local craftsperson. Still, for less than $$$ bucks it is hard to go wrong with this piece.", 
    "smaller than I thought - well shorter BUT comfortable and looks much better than the larger chair I had in the space. Thanks again for a bargain.", 
    "Great quality. Really satisfied.", 
    "Chair working well so far. Fits nicely with my decor. Not extremely comfortable but ok for short periods of sitting.", 
    "This is a nice chair, solid, easy to put together. Makes a nice addition to my living room.", 
    "Great value comfortable and good looks", 
    "Great chair, very comfortable. Super price !!", 
    "Just as pictured online. Love the color of the wood. Arms arrived with a little damage but I was quickly sent replacement arms by Overstock. Customer service is TERRIFIC. Thank you Lani.", 
    "Good quality for the price and comfortable. My husband likes it too. I thought the cushion was a bit stiff at first but after a few weeks it's become more comfortable. We are happy with our purchase.", 
    "This is a very attractive, comfortable chair. I was worried about the color, but it's just like the picture. Incredible bargain, and doesn't take up a lot of space.", 
    "It's a great chair at a great price", 
    "Husband didn't seem to have much trouble assembling it, and it's sturdy and very comfortable. Good buy!", 
    "It's hard to buy furnitue via the internet, but I took a chance with this chair. It's perfect! Wide enough for those of us wide in the beam, feet fit squarely on the floor, cushions are extremely comfortable. Will it last forever? Probably not, but I'm very happy with this Mission style chair.", 
    "This chair is a beautiful addition to our mountain home. The mission-style design is an accurate rendition of the old mission-style. It is a great chair for the price. Assembling the chair was a piece of cake. Bravo!", 
    "This is a great addition to our new sunroom, the frame and cushion materials are durable.", 
    "These 2 chairs were a great buy! My hubby put 2 together in a couple of hours and I didn't hear any yelling or throwing of items so it wasn't bad ;) We wanted extra seating in our living room and chose 2 green ones, took a chance by reading all the reviews. Ours came in on the expected delivery date and in perfect condition. They are very sturdy and comfortable. I worried my hubby wouldn't be able to use them because he's a big guy, but they have been great!! Many compliments on the chairs!!", 
    "comfortable. back is on the short size.", 
    "I would of given it a 5 star rating, however one of the chairs came with no predrilled holes. Of course once the package is open we are stuck with it so my husband did the best he could to put it together. I am not sure if they will take it back ..", 
    "We own cabins that we rent, this is a nice sturdy chair with the cabin look we like. We've had it for a year and it still looks nice. Good purchase.", 
    "It fits perfectly with my living room furniture. We live in a prairie style home and the sofa and love seat have an olive design for the fabric, so this was absolutely the perfect choice. It's comfortable and easy to move.", 
    "Great color, easy to assemble. Really works as an accent chair, yet very comfortable.", 
    "Once this chair is put together it's great. The design is user pain in the ass. I was shorted on hardware on one chair, but the serious design fault is bolting the stretcher to the sides. The allan wrench needs to go into a groove that only allows 40 degrees of turn before resetting. Maybe the designers could take some lessons from Ikea", 
    "I love this chair it's exsay like the pic", 
    "Comfortable and easy to assemble", 
    "We previously purchased 2 of these chairs for my husbands office space.The color is rich and soothing in his space. the fabric is easy to keep clean and holds its shape. We have recently moved and are buying two more.", 
    "It's obviously not quarter-sawn oak, but it's stylish and comfortable.", 
    "I have enjoyed this chair very much. It has made a lovely addition to my living room. I'm more of an informal person, so this chair has just fit right in. It is quite comfortable.", 
    "This ottoman and chair set are wonderful! Worth every penny.", 
    "These chairs look fantastic, high-end. More importantly, they are COMFORTABLE. The matching ottoman adds even more comfort. You will not want to get out of this chair. My best all-time online furniture ordering success", 
    "The chair is just as described. I like the olive color and the frame is well built and solid as well as easy to put together. The chair is on the smaller size, but a good size chair for my den. It was delivered in a timely fashion with no damage. I am very pleased with my purchase.", 
    "It's the perfect chair to relax after work watching your favorite sport or TV channel.", 
    "Great chair- comfortable- easy assemblyOverall very happy!!", 
    "Comfortable, easy to put together and traditional look/feel", 
    "Good chair easy to assemble, fits the room perfectly", 
    "I've bought a few of these chairs for work and home; they're great. I was disappointed to notice a crack through the wood of the new one I just bought. It's ruined out of the box. What can I do to get a new one?", 
    "just not a comfy chair at all", 
    "What a great chair! Very comfortable and durable. The color is wonderful and goes with every wall color.", 
    "Very nice looking and comfortable for now. Does not appear to be built for a long life of heavy use. We're using it for staging a home, primarily. Using the matching ottoman although we had to order it separately. Both arrived quickly. The quality seems fine for limited use and considering its modest cost.", 
    "We needed the prefect sitting chairs for an area in our house and these chairs fit the bill perfectly. They are a piece of furniture, a beautiful thing to look at and VERY comfortable to boot. We are even contemplating buying 2 more - they ARE THAT GOOD! Can't say enough how great they are -truly!!", 
    "This item looks very good and is pretty easy to put together. It does creek once built and so it makes me nervous when sitting on it. It has not cracked or anything-we have owned this for a while now. The microfibre is very durable..after mutiple spills it looks new. Good product overall.", 
    "This chair is well made and looks very nice.", 
    "Purchased this chair with the ottoman for additional seating at our lake hose. It was very easy to assemble and better quality than I had expected. It's very comfortable and has held up well to use.", 
    "I've had 4 of these chairs for over a year now. Not used on a daily basis by any means but they are a sturdy chair. The mission style is quite nice. Receive numerous compliments from our company. Glad to of purchased them. Nice for some of the larger guests.", 
    "Looks great, feels great. it get's very little use, so for the money this was a perfect addition to the room.", 
    "Very comfy chair. Easy to put together looks nice and good value", 
    "Bought 2 of these and the matching loveseat. After a bit of a struggle with the first assembly, the other 2 pieces were a breeze. Love the color, love the sturdy cushions and frames.", 
    "Nice chair. Matches my other medium-colored Cherry wood furniture pieces perfectly", 
    "The two look great in our little public library....Our librarian was able to assemble them alone without trouble but it did take about two hours! I'll let you know how well they hold up ... They have been perfect for almost a month now ....with some pretty heavy weights enjoying them!", 
    "I love this chair. I was worried about buying a large item on-line in case I hated it and had to ship it back. No worries. It's beautiful. As pretty as the picture. My son in law put it together for me, he said it took 15 minutes. This chair is also so affordable. Would be double the cost in a furniture store.", 
    "Awesome, comfortable chair...especially at this price.", 
    "This is a good looking piece of furniture and comfortable too.", 
    "very nice wood and cushion. comfortable. would buy again", 
    "very nice chair, a little hard to get together.", 
    "The wood looks good but the material and the construction of the cushions are of poor quality. I needed a couple of chairs and it wasn't worth the effort of trying to send them back. They will do for now but will not stand up to normal usage.", 
    "We purchased two of these and loved them The color was exactly what we were hoping for. We have gotten many, many compliments on them They are comfortable and seem to be holding up well. They are in a room where they aren't in daily use and don't get alot of wear and tear so I'm assuming they will hold up well over time. Very comfortable for reading. We purchased the matching ottomans which I would recommend as well.", 
    "Easy to fixed I do it by myself.", 
    "Had to reship as first one was damage in shipment. Chair is lovely, Not very easy to assembly but thats just me. Would recommend", 
    "Bought two of these together for our sitting room, and it fits perfectly! It's the perfect depth and height for me and my husband (5'4\" and 6'). The cushions could be better in quality, but they are firm and comfy. The stain on the wood was not perfect, but hard to notice the imperfection. Setting them up left some stains on the carpet though - there was stain or grease when we stood up the chairs after assembly. Need a good wipe down of all the pieces before you assemble!", 
    "We have had 2 of these chairs for several years, and they still look great. I love the color.", 
    "Excellent product. After purchasing I have seen exact chair for twice the money at other stores.", 
    "Excellent product. After purchasing I have seen exact chair for twice the money at other stores.", 
    "This is a real nice chair, way worth the price. Takes a half-hour to assemble but no tools required. Shipped fast and I can't think of anything negative to say. Would buy more than the two I bought if necessary.", 
    "This chair arrived well packed and protected. It was easy to assemble and is very comfortable. I could not have found a mission chair of better quality at the price this one is selling for.", 
    "great looking, easy to assemble and good value", 
    "You will love this chair! It is comfortable, and looks great in my mission-style living room. It also looks much more expensive than it is. I recommend purchasing it with the matching ottoman. They both look great!", 
    "Not finished in the hand rubbed manner of the original style, but surprisingly sturdy and very comfortable.", 
    "Perfect selection for my front sitting room! The chairs add a touch of class without the expense of original mission chairs. They are sturdy and attractive.", 
    "Comfotable chair, looks nice, love it", 
    "Solid, stylish, easy to assemble, and comfy. What more could one ask? I think I may buy its twin.", 
    "This is a great chair folks. Very comfy, I find, -- no the kind you sink into, the cushions are quite firm. The color is more of a deep olive than the photo on the website, really quite nice. I was able to put it together pretty quickly, but I'm pretty hand (I guess). The finish on the undersides of the wood parts is a bit rough in places, but at this excellent price point we shouldn't have expectations that it's a piece of fine furniture. All in all, a great purchase.", 
    "We bought two sets 4 years ago(sage green) and they look as good as new still! Great chairs for a great price!", 
    "This is a beautiful chair. It went together very easily. So comfortable and perfect in my office!", 
    "Chair arrived in pieces and was very easy to put together. Took me 30 min. by myself.", 
    "The size is right, easy to put together. Nice quality, looks good and is comfortable.", 
    "easy to assemble, comfortable chair. Sturdy frame and it matches the ottoman perfectly", 
    "Great chair. Who needs LLBeans $*** chair when you can get this one for under $***. Lovely.", 
    "Nice product, Easy to assemble, makes a nice set with the other pieces.My only complaint is, why can't we make this in the US?", 
    "This chair assembled easily and is quite sturdy. It didn't require any adjustments, like some other self-assemble furniture I've purchased that required adjustment in orfer to sit square without wobbling--this chair was not like that. It was easy to put together and it's been square and sturdy.The cushions are firm, but not to firm. The color tends more toward charcoal. In dim evening lamp light the color reads more as dark gray than olive. It your looking for any fatigue gree, this is not it at all. It's dark olive green.Would purchase again.", 
    "I needed 2 chairs for my smaller living room and they look perfect next to my dark brown leather sectional sofa from Ikea. The green fabric is exactly as pictured and the wood is a nice dark oak stain. My husband said they were a bit of a challenge to put together with the allen wrench provided and worked better with his ratchet screw driver. And did I say they are comfortable too.", 
    "Easy to assemble, product is good for the price, but I prefer the leather version better.", 
    "This is a very nice chair for the price. As a senior I found assembly a little taxing, rolling around on the floor working in tight spaces with an Allen wrench and my apologies for saying some not-very-nice things about them. All done and in place in an uncomfortable 45 minutes. It's really very sturdy and quite comfortable although the back is reallycheap and not all that permanent looking. The color of the cushions is much darker than shown but not objectionable. On the whole I'm not sure this chair will last as long as one might wish but I go back to the price...meh! Didn't go for the matching ottoman but instead went with another. I'd recommend this chair if you're thinking just a few years light use. Not an heirloom! \"leather\" ottoman w", 
    "It is a good quality chair for under ***. You can't beat it. Comfortable and seems real sturdy.", 
    "Outstanding in every respect. We purchase 2 chairs to replace nearly new $*** each 2 large overstuffed chairs that we donated to a needy family.These Mission Oak chairs are located in front of our very large rock fireplace what enjoyment for all. Thank you.", 
    "A good chair for most people who have a small apartment like I do. My only gripes are is it is a smidge too low and the arms are hard. But what can you expect from wood, cushioning? I knew what I was getting.", 
    "At such a great price each, I can't see how there can be any complaints about this chair. I ordered two; they were a cinch to assemble, they are comfortable—I’m writing this review in one right now—and they look great in my living room with the antique floor lamp between them. They are better than I expected, I was worried that there may be some cheap MDF somewhere, but no, all wood, very nice.Also, fast delivery: I ordered them on the 24th, got them on the 29th, and the 25th was a holiday. No scratches, no dents, no missing parts.Helpful hint for all furniture requiring assembly with screws (especially chairs): get some Loctite Blue and apply it to the threads of all screws and bolts during assembly.Chris, Portland, Oregon.", 
    "I was skeptical to order chairs online but I am very happy with these. They are sturdy and easy to put together. The have nice firm cushions that are true to the door shown online. The back of these chairs are not pictured, so I was worried about what they would look like. The backs are the same green microfiber. Great chair!! Very nice looking", 
    "It looks great but my grandson claims it's very uncomfortable to sit on. He says it's quite hard.", 
    "Love this chair!!! It looks rich...is so comfortable...and my husband had it assembled in 30 minutes. Overstock...you have NEVER disappointed!!! I have bought everything from rugs to coffee filters and love the products and service!!!", 
    "My first experience with Overstock and ordering items this large. I cannot say enough good things about the service or the product. I placed the on-line order for two of the chairs. They were here before I knew it. My daughter and granddaughter assembled them for me. The style was just what I was looking for, the upholstery is lovely, (coordinated beautifully with my redecorating scheme). The assembly process went well, and I am really enjoying the comfort. The chairs seem to be well made and I am extremely pleased and satisfied with this purchase. Will be using Overstock again as I feel I can trust their products.", 
    "I bought this for a corner in my living room. It's a nice small chair. Very easy to assemble.", 
    "Great chair and great price. Excellent value. Also, pretty comfortable.", 
    "The assembled chair feels sturdy and quite comfortable. The cushion is firm, which should assure a long life. The frame and all components are solid hardwood with good finish. According to the installation booklet the bottom supporting rails were to have four pre-drilled mounting holes, which, along with the wood screws were missing. I easily fixed that by using standard 1-1/4 long coarse threaded wood screws. The chair could be used without the four mounting screws, but I felt they would increase the rigidity of the assembled chair. I would recommend this chair to friend.", 
    "I love this chair. It is perfect for what we had purchased it for. It is surprisingly firm and very comfortable!!", 
    "Had the chair for ~3 weeks and when I plopped down in the chair today it broke the bottom of the chair. I am only 210 lbs and expected this chair to be able to hold my weight. Very disappointed because I liked this chair quite a bit for its price.", 
    "This chair and ottoman is pretty comfy. Not as soft as it could be, but the firmness probably means it'll last longer. The arms and legs are sturdy and the width is generous, giving me space to sit cross-legged if I want. A beautiful addition to my living room.", 
    "This is a nice chair for my formal living room (where people won't really be sitting on it). It looks nice, it's solid, and the style was just right. It's a very firm chair, however, and probably not the highest quality (remember, you're putting off of your furniture together with an Allen wrench). But for what it is, it's a decent enough chair.", 
    "Very Comfort look good. good price Quality Excellent", 
    "We purchased these chairs about a month ago for our living room. The mission style arms go perfectly with our decor. The chairs are fairly firm and the olive color is beautiful. Perfect to sit in while reading your favorite book or even watching the nightly news. One very minor negative is that the backs are the olive colored material and my cat loves to scratch at that.", 
    "These were nice chairs/ottomans (ordered 2 of each for my living area). However, they just weren't for us. The size was a little smaller than you expect after looking at the picture. I was envisioning something more like what Carrie got in SATC from her woodworking boyfriend than these. Also the chairs are maybe a little overpriced for what you get. Cumbersome to put together, so beware. The cushions are REALLY stuffed to the max and were more firm than I expected. I didn't exactly want to melt into the chair but bouncing off of it wasn't my agenda either. We decided to return them and go with a larger sectional couch. I sound so negative - the chairs really are cute but just not what I was envisioning.", 
    "I am happy with my purchase. The chair and ottoman are very sturdy and comfortable. The color is good. It is just what I wanted.", 
    "For me - it was the perfect dolor for my living room. Easy to assemble. I love the simple lines of the Mission style so it's a perfect fit for my house.", 
    "I studied this chair for weeks. I had never ordered furniture on-line, I was worried about the quality and ease of assembly. I am happy to say that this chair does NOT disappoint. It was really easy to assemble. I was able to put together 2 chairs and ottomans (purchased separately) in one evening. Once assembled I thought, \"I could retire in this chair.\" It was that comfortable. One suggestion: buy those little furniture pads to fit under each leg. I purchased the type that can be nailed into the wood. This helped with moving the furniture across my hardwoods and area rug. The color is as described, Olive. Not sage green, not pine green, it is olive and looks amazing. I am very pleased with this addition to my mission style living room.", 
    "This chair is really pretty, and fits well in my living room. The seat is fairly deep, so you might need a cushion to support your lower back if, like me, you tend to slump in the chair for reading, which is what the chair and ottoman seem designed for. It was a little bit of a pain to assemble, since the bolts go into a shallow recessed area, and the Allen wrench can make less than a quarter turn, so has to be continually reinserted. I screwed them in with my fingers as far as possible first, which helped. Once you do get the bolts fully tightened, though, it gives you a wonderful feeling of relief and accomplishment that it all worked. It's very sturdy, and quite pretty, as well as comfy.", 
    "The arm has a scratch and the chair is not of the same quality as the other chairs I have purchased. I am disappointed with the stability of the chair I had hoped to use this chair daily but fear it will not hold up under daily use. The color is darker than I had hoped. Sorry for this negative review.", 
    "The appearance is wonderful and looks like a super replica of a well known manufacturer.The chairs are also very comfortable.", 
    "I recently decided to replace my old well-used rocker recliner. Cost was a factor, so I checked out Overstock for a good value. To my surprise, Overstock had just what I wanted. I placed my order online and three days later I found a huge box on my front porch. I managed to get the box inside the house and there my chair in the box sat for two days, daring me to open it and put it together. After a large glass of wine I opened the box. I have to say that putting my chair together was really very easy. The finished product is quite nice, very comfy and large enough for a grandma with a cat or two young children . The color is a deep olive green so it goes with my other furniture. The wood trim is sturdy and without flaws. Yep this chair was a heck-of-a good deal.", 
    "Lovely piece of furniture with firm, comfortable cushions that are separate. The hard wood is beautiful and came well packaged to avoid any scrapes or dents. Easy to put together, all tools and instructions came with product. I've gotten several compliments already on this comfy chair and footstool.", 
    "Based on the price this chair was worth the risk. Love the clean lines of this piece. However some of the stain is spotty but it's all underneath the arms but overall looks great.", 
    "love the chair, it doesnt take up a lot of space. easy to put together.", 
    "Love the chair. A good price. The color is just the one I wanted.", 
    "I was very pleased when I received my chair. It was easy to assemble, well it took me a little longer than if my husband would have done it, but I couldn't wait to see me chair. It looks great and is exactly like the photo and description. It's probably not a chair for lounging and watching movies but I love it in my sun room and for guests, its a great chair for me!!!", 
    "Good chair for the money, no problem assembling it. Glad we bought", 
    "For the price it is a great value. Art and craft style is perfect.", 
    "I needed to add extra support to the seat with wood under it.", 
    "The piece came quickly and was packaged well. I opened it and checked the parts for wear or damage and found none. The piece assembled easily with just the basic tools that came with the item, although the instructions weren't overly detailed. The chair is comfortable and stylish. The cushions were a little bit firm, but I think that is to account for the normal softening of foam once it is used a bit. I would recommend this chair highly.", 
    "The chairs design has the metal fasteners drilled into soft wood. The screws easily come our/loose and the chair becomes unstable. I had to add screws to the frame to keep the chair from wobbling. Not made of hardwood. Inferior fastener and attachment design.", 
    "Very nice indeed! It looks great, nice upholstery, beautiful woodwork, & comfy too. :)", 
    "It is a nice chair. Hubby had it put together by together by the time I got home. I rated good because to me it is not extremely comfortable but husband likes it.", 
    "Great chair, great price. Arrived quickly. Assembly is easy, but awkward.", 
    "I would not recommend this chair to a friend, because none of my friends would want to work so hard putting it together. The instructions were bad, and it was a struggle--much more so than it looks like it would be. But the chair looks nice now that it's assembled. I wanted a Mission-style chair to go with the Mission-style futon in a family room, and it serves that purpose well. It is less comfortable than it appears, however, and also less substantial. The cushions are unusually light weight, and (especially the back one) kind of stiff. The chair arrived broken, and I had to reorder (Customer Service at Overstock is fabulous, by the way). Had I known the time and effort that would be required for this rather ordinary chair, I would have purchased a different one.", 
    "We were surprised but the quality of the chair, it is great for the price.", 
    "We are enjoying this chair very much. We also purchased the matching ottoman. It is comfortable. My husband assembled the chair and ottoman quite easily as all parts were labeled clearly. The chair arrived in perfect condition. Overstock does a super job in its packaging of its products.", 
    "We bought two of these chairs and they fit our space well. The quality of the chair is very good considering you build it out of a box.", 
    "The chair came quick and was not that difficult to put together. It is comfortable and looks good! I would order from this vender again!!", 
    "Not easy to assemble. The holes don't match up well on the frame. But good solid chair. Wide enough for friends over 250-300 lbs. easy to get in and out of. Taller than most chairs I have purchased here before. Overstock tends to have short chairs. Good sage color. More towards the dark teal side than the green side.", 
    "This is a nice chair for the money. We have it in our front room which actually doesn't get a lot of use so I think this chair will hold up just fine. I don't know how well it would fair in a family room with a lot of teenage boys flopping down in it on a regular basis. Overall, I was pleased with my purchase. It was what I expected when I ordered it.", 
    "Love this chair! Took very little time to put together. Very pretty and very comfortable!", 
    "The day that the chair and ottoman arrived began a new love/hate relationship in our home. My husband and I blame this chair for making us lazy yet we love it for its comfort and smart design. The dog even fell in love with it the first week. The neutral color helped enhance the color palette in our home. The beautiful Mission style design fits our design aesthetic for clean lines and uncomplicated design. The manufacturer decided to keep little knots in the wood which (in our opinion) was a nice touch. It's a great piece.", 
    "Great quality. Nicely weighted chair with a smooth, seamless finish. This chair was a breeze to assemble - don't know why some reviews stated otherwise. I had ordered two and had them both assembled and ready for use within an hour. Despite what those reviews suggested, no assistance was necessary during assembly. I love the scale of these chairs. They're not so large as to look forced in a small apartment living room or bedroom. But they're also not so small so that you couldn't float them in a larger space. The wood's finish is perfect - from the color of the stain to the smooth silkiness of the final coating. The gentle slope of the arms is a wonderful contrast to the straight mission style, yet the tops are still wide and flat enough so you can easily set a drink or rest a book. The back support piece is upholstered. It's not wood like you might expect, but by no means is it ugly. The cushions are really thick and they look great. I would prefer them to be a bit softer, but I'm fine with them now and I'm sure they'll soften with use. Overall great piece of furniture that makes me happy!", 
    "I received this item with 1) a ding in one of the arms, and 2) with one of the bolts missing. More on this below. The most important thing for the buyer to consider before purchasing this item is that the included L-shaped allen wrench will not be of much use in bolting the stretcher to the arms. This allen wrench allows the bolt to rotate only about 30 degrees. The wrench then has to be removed, put back in, and rotated another 30 degrees. This might be a deal breaker for some. It's like trying to do your backyard gardening using a teaspoon. A ratchet-style allen wrench is needed for bolting the stretcher to the arms. The included allen wrench does work fine, however, when used to bolt the arms to the back. In this case it is able to rotate freely a full 360 degrees. My suggestion would be for Overstock to advise the manufacturer to include an allen wrench that is better designed for this particular stretcher. Overstock refunded me twenty dollars for the ding, and has advised me that the manufacturer will mailing a replacement bolt.", 
    "I wasn't sure what to expect but I love the chair. Cushions are thicker than expected. Chair looks good and is confortable. What a great buy!", 
    "The chair arrived with NO Foot rest and.NO Instructions. Not even a hint as how to put it together.The parts bag was opened and the parts scattered throughout the box. I knew that i I would have to assemble it. But this was impossible. Save your money and time.", 
    "I highly recommend this chair. It is very comfortable and looks just like the picture.", 
    "I bought this chair as a birthday gift for my husband who has always admired mission style furniture. He assembled it easily. It is very comfortable as well as sturdy. My son liked it so much that I bought one for his apartment. He also had no problem putting it together. The chair is surprisingly well made and attractive for such a reasonable price.", 
    "I am satisfied with the chair. It is comfortable to sit on. It will be even nicer when I get the matching ottoman (all sites were out of stock). The finish has a nice look (just like the pic) though it is not \"fine furniture\". But hey, for the $*** I paid I'm very happy. The construction strength is adaquate. Yeah, if your going to seat a 300lb person you might want to beef up the rear strip with a little glue and couple extra screws but I'm not too worried about it. Mine had a couple of dings in the wood. Not sure if it left the factory that way or happened in shipping. Not worth the hassle to me of complaining. Warning: there are strengthening/alignment pegs to be inserted into holes when constructing. Don't tap too hard on the ones going into the outside piece. I tapped one right through, knocking out a big chip of wood where it exited. A little wood glue fixed it fine. It hardly shows but be careful.", 
    "We bought this chair because we needed something on the smaller side for our study/home office. My husband and I were able to put it together in about 20 minutes. It would have been trickier with one person, but construction went smoothly for us. It is sturdy, comfortable, and looks great in our house. For the price, you can't beat it.", 
    "LOVE THE CHAIR!.. GOING TO GET ANOTHER ONE .. WOULD HAVE BOUGHT TWO ORIGINALLY BUT THOUGHT I BETTER SEE HOW IT IS FIRST. GOING BACK FOR THE 2ND ONE NEXT MONTH..", 
    "When we received this chair I was happy because it is a wide chair which would accommodate my husband who is quite large. However, it sits low making it difficult to get out of. Then my husband said that he was going to have to put in extra supports because he felt like he would fall through the bottom. We could tell that it had been returned before because the product tags had been removed but the plastic rings were still in a cushion. Overstock was great about letting me return it.", 
    "like the chair but assembly has a design flaw and you need to add parts to make it sturdy Made in china and hate buying anything made in china", 
    "I like it. It was very easy to put together. It is comfortable and nice looking.", 
    "If I hadn't just spent an hour putting it together I might have sent it back. It was not easy to put together using the instructions, as part of the page was missiing and the rest was fuzzy in the photocopy. It has no written instructions, just diagrams using letters and numbers. the letters identifying the hardware were missing from the instruction page. fortunately my husband was able to figure them out. also two holes were not punched into the back for the dowel and screw. once you step back and in soft lighting it is a nice looking piece. will return to the review to let you know how it hold up.", 
    "The quality of the chair left me with a feeling of disappointment. I knew it wouldn't be as nice as going to Ethan Allen or Bassett furniture but I didn't know it was going this cheap. The seat cushion isn't competely covered, they just cover the top and side. The faux suede material is so high in polyester it makes your legs and butt hot after you sit a bit. This might be desirable in winter but not now. They didn't even stain the underside of the arms or any other part. I guess the folks in China don't think we lay on the floor of our den or living room. I know kids probably won't notice but an adult will see and think just what I do, cheesy! The front cushion brace wasn't fully stained. The finish isn't smooth, someone forgot to wipe the arms down after sanding before they stained. But it took so long to get it together, I didn't have the energy to disassemble it and send it back. The guys couldn't even assemble the arm pieces correctly. They couldn't get 4 screws into the 2 little \"L\" brackets straight, at least one will have been screwed in sideways and didn't lay flat.,Really! both arms!. There. Now I feel better.", 
    "These chairs look amazing! I ordered them for my new home office, and couldn't believe how nice they look after assembling them. Granted, the assembly itself was not a lot of fun, as anyone who has assembled furniture at home knows, but in the end it was worth it. I love the look of mission furniture, but it's hit or miss with quality of the less expensive items. We really lucked out with these chairs. I use them for both relaxing and reading at home on weekends, and meeting with clients during the week. Perfect!", 
    "We bought the chair for our Colorado summer home. The quality of the chair and the price was good. It was easy to put together and all the parts were there. We are very pleased with the purchase.", 
    "For the price, it's a great deal. It is actually very comfortable and both animals and humans have taken naps on it several times already. It really looks great, like a much more expensive chair. Arrived with two very small defects in the finish on the edge of the arms that is hardly noticeable and easily dealt with. The instructions are fairly nonexistent, but honestly, it is not difficult to figure out how this chair goes together. It has hardly any parts at all. I put it together by myself in under 30 minutes and I'm no construction genius. I am honestly very pleased with this purchase.", 
    "This chair is about what I expected for the price. It seems solid, although several of the pieces are particle board (the arms/legs come attached together and are solid wood). If you purchase this product, please be aware that you will need to assemble the chair with an Allen wrench (hex key) which is included with the product. If you have arthritis or weak hands/wrists, plan to get some help with assembly. The assembly itself was a little awkward with only one person (I could have used someone else to hold the pieces at the right angle as I tightened the Allen screws).", 
    "I ordered two of these chairs for my livingroom and put them together by myself. The directions were a bit of a joke...basically pictures, no true instructions...but if you spend a little time, you can figure it out. They turned out perfectly and the price was definitely right!", 
    "I would buy this chair again, I can not say enough good about the comfort and looks of the product!!", 
    "Overall we are very pleased with the chair! Easy to assemble, nice fabric, and nice wood finish.", 
    "The chair matched well the futon I purchased in bits and pieces from various sites. The wood matches and so does the fabric. The cushions are high quality and very comfortable. I am glad I purchased the chair.", 
    "This isn't the easiest chair to put together. It's not difficult just hard to follow the instructions which are all pictures and awkward for one person to do alone. That being said I would say my skill level is low and I did it in 90 minutes because I was so unfamiliar with the process. So that wasn't too bad. If you are a handy person I am sure you could do the assembly in less the 45 minutes. It arrived within days after I ordered it, was well packaged, and in good shape. It is not a Stickly Mission Chair, but for the price, it is good value.", 
    "Overall,this is very good furniture. I purchased two of the chairs and that is where my problem lies. One chair is distinctly (and I mean a very distinct color difference) more reddish in color than the second chair which is reddish/brown and looks like the chair in the picture. This same problem has been noted by some other buyers also and can only be attributed to poor quality control by the manufacturer. So be aware of this if you purchase two chairs. For this obvious flaw I can only give the chair two stars.", 
    "Great little chair. Easy to assemble - 2 people were better than 1, but 1 could do it.", 
    "love the chair, have had many compliments on it. I do wish that the ottoman shown in photo was a part of the deal however. my husband put it together, had a it of trouble but overall was not that hard.", 
    "Instructions are hard to read, Made in china that is why. The chairs in olive are more sage/grey and the color is fine. You most have two people to assemble. We bought the chairs for a sun room on a budget and we are very happy with the price. The chairs do not compare to ones at $250= $400 value but work fabulously if you are on a budget.", 
    "I'm very happy with this chair. I did not think it was especially hard to put together but don't count on the directions for much help. If you are the least bit intuitive about figuring out how things go together then you should have no problem. I did it by myself in about a half hour. The wood pieces fit together solidly and the cushions are comfortable and look like they will hold their shape over time. The size of the chair fits my small space well but it is large enough that I can sit in it cross legged if I want or together with my six year old when we read. The only thing I was slightly disappointed by was that the color of the wood did not match the mission style corner desk that I also bought from Overstock. Overall, I think this is a great chair for the price. It looks much more expensive than the actual cost and I think it will hold up well. In fact, based on my opinion of this chair, I just ordered the mission style small couch for another room.", 
    "Solid chairs, really comfortable! The ottoman makes it the perfect relaxing chair. I liked it so much, I purchased a second one!", 
    "Wanted to make a sitting area on our sun porch. I couldn't be happy with how nice these look.", 
    "The chair was fairly easy to assemble, the instructions were not all that in-depth but still easy to figure out. The chair exceeded my expectations but I shouldn't have been surprised since I have never been disappointed by anything I have purchased from Overstocks. It will be the perfect chair for my bedroom and fits in with my decor so well.", 
    "received the chair today which was only a week in shipping time. Hubby put it together in a vary short time without any problems. The one arm has a scratch on it but not sure if that was there before unpacking but it can be covered. The color of the fabric was just like on the computer screen. Very happy with it. We are using it in our sitting area by our kitchen.", 
    "My wife and I are very pleased with these chairs. For the price we paid we could not find anything similar anywhere else. They look very sharp and like much more expensive chairs. The wood is a beautiful dark cherry color and the chairs are very comfortable. Assembly was pretty simple and took maybe 30 minutes per chair. One of the arms arrived dinged up a little (noticed after I assembled the item), so I contacted customer service to see what their response would be. I expected that they would want me to send the chair back, in which case I wouldn't have worried about it. Much to my surprise, they put in a request for a replacement part and sent the new arm to me in a about a week and a half...no questions asked! I'm extremely satisfied with their service and will absolutely look to Overstock for future purchases.", 
    "Very pleased with purchase. Looked all over for a small affordable accent chair that didn't look cheap. This is perfect.", 
    "My brother is a carpenter and he had a heck of a hart time getting it together for me. If it were not for him drilling new holes, etc. it would have never been put together at all. But it is sturdy and gorgeous and so comfy that I'm glad we bought it. Great buy once you get it put together.", 
    "Easy to assemble and very comfortable, I love it. If I have to enter at least 50 characters I will be here at least another hour, rite now I am going to take a nap in my new chair and call it a day. Thank You and good nite.", 
    "Assembly is straight forward, very nice appearance, wood color and finish is good. Sturdy when assembled. Actually comfortable to sit in. Microfiber cleans up well and cushions are firm. Very happy with this purchase.", 
    "Chair is very comfortable. I feel it is a great value for the money. The only drawback is putting it together. The directions are very vague. Lukily my husband is handy and has a power screwdriver. Once he decided to distreguard the directions it only took about 15-20 minutes to put the chair together.", 
    "Ordered 2 chairs. It took a week to get them. I opened the first box and inspected all the parts and everything was perfect. A friend visiting us put the chair together without the directions - he only had trouble with the front piece. I don't think I could have figured it out. Today we opened the second box. All the wood pieces were broken or scratched but the cushions were in great condition. Emailed customer service regarding returning package and they are checking with warehouse to see if replacement of all wood pieces can just be sent - hope that can be done. Service so far has been great. Would have given 5 stars if there wasn't any broken parts.", 
    "Chair looks nice. Only complaint is that the bottom cushion slides out.", 
    "I really like it. It was easy to put together. Its comfortable. I regret not getting the ottoman at same time.", 
    "The seat cushions could be softer. The 2 chairs fit in good with my other furniture.", 
    "I was shocked and so disappointed by the actual color of the chair. The pic on line showed quite a contrast between the color of the fabric and the color of the wood. However, when it arrived, DARK.... DARK.... very Dark olive. I must say, though, that the customer service department was so understanding and so helpful with my return.", 
    "So far the chair has been wonderful! I don't know if it will last long, but for the price, I am very happy with the chair!", 
    "I love these chairs. I bought one, liked it so much I bought another one. My husband helped me put it togethe which was no problem. Directions were excellent, parts were all there. I'll tell you it sure beats paying furniture store prices.", 
    "I bought these to replace two wing back chairs as my decor has changed. They blend perfectly with my other purchases which cost much more and hold their own in appearance and function. Yet another great deal on a quality product from the O.", 
    "Very fast delivery, it was easy to assemble and seems well made. I plan on ordering a matching love seat of couch later on.", 
    "Very nice Mission style chair at a very good price. Looks really nice in our living room. Simple design, comfortable and functional. Easy and quick to assemble.", 
    "I purchased two Mission style chairs and Ottoman for my daughter for her birthday. I had to return one of the chairs because of a crack in the wood. The quality of the furniture is adequate, the Ottoman looks good with the chair. If someone is looking for a decent piece of furniture at a fair price this works.", 
    "This chair fits perfectly with the decor of the room. It is sturdy and was easy to assemble. My one criticism is that the cushions are not slipcovered normally--they have Velcro sewn in so that the cushion will adhere to the base. So if I ever want to get it reupholstered (or thoroughly clean the upholstery), it's not so practical.", 
    "Stain job very splotchy especially under the arm rails. The directions on putting the chair together was very confusing and somewhat frustrating. Somewhat pleased with the chair overall but would probably not buy another one.", 
    "It is a bare minimum chair, but it is quite attractive and just a great addition to a living room. I don't know how sturdy it is over the long run, but it looks terrific and the cusions are spongy and nice to sit on. The wood looks rich and warm and I can sit on the arms without fear of it falling apart. Great for a college room or a low use area where no one will pouce on it. Could even be great for a guest room or home office where kids won't be jumping up and down on it. I recommend this item for the price and the look. Take your time putting it together and keep an open mind.", 
    "Love, love, love this chair. Nice, heavy and comfortable. The wood is beautiful and gives it a very rich look. I may buy another!", 
    "The delivery was made in a timely manner.I took about a week. I was happy that the chair was easy to put together. It looks great in my living room. No complaints here. I am happy with the result. Also if I don;t like the cover or want to change the cover to fit a new color scheme, it is easy enough to make one that I do like to cover it. All in all, good.", 
    "I had the chair put together by my son-in-law. He completed it in less than a half-hour. It fits nicely in the corner of my living room beside my glass terrace door. I love it, the color matches my decor.", 
    "The chair arrived in good condition and looks exactly as pictured, except that the color is a very dark olive green, not the greige it appears in the photo. My only quibble is that the instructions, as others have written, were close to incomprehensible. (Luckily, my husband loves a good puzzle and put the chair together without too many expletives.)", 
    "I ordered one from ****that arrived damaged. They sent out a replacement arm twice, but replacements were in worse condition than the original. So I ordered a 2nd chair from Overstock. Again, the wood needs stain for touch-up and one of the arms has marks on the visible part of the wood where your hand rests, not acceptable for a new chair. No luck getting replacement parts from them, they say they are a wholesaler and you must have the store you bought it from order parts, but that doesn't work out at all. Instead of a replacement arm Overstock shipped a 2nd chair and stated in an email if it wasn't returned in a certain length of time I would be charged for it. So, I refused the 2nd package with a whole new chair, and gave up on trying to get this chair in the new condition it should have come in. Now I have 2 chairs with wood flaws, scratched up, etc.too heavy a box to deal with shipping back. Not nice enough to put in livingroom, so my son has a \"new\" chair to play video games in. They are cheap quality. The only thing nice is the cushion. No directions come with it, just a dark bad copy of a parts list and so just figure out how to put it together yourself. Just remember, if you order this, its 54 pounds and too hard to ship back and you will not get replacement parts that are not damaged.", 
    "It goes without saying that this was the most complicated assembly of any piece of furniture I have ever experienced. The directions are illegible and there is no way actually to follow them. I have put the chair together but do believe I'll have to take it apart and start again, that's how scared I am to sit in it. It looks fantastic ... but this was far too difficult, and most certainly cannot easily be managed by one person. You are going to have to harken back to your geometry class and go on gut instinct on this one, because there is nothing in writing that is going to be of use to you.", 
    "Delivered on time. Easy assembly. Good quality for the price.", 
    "Chairs came quickly but had some issues with the wooden legs having been chipped - they replaced them right away and I have to say the chairs are very nice - For the price they are comfortable and sturdy - The fabric is exactly as in the image - easy to put together -", 
    "Nice chair, nice rich color, not to hard to assemble and not to expensive. However, suggest you spend the extra cash and get an Ottoman to really enjoy it!", 
    "I needed a chair for my living room to fill in a space and make more of a conversation piece. I loved this look and color from the start. All the other reviewers are correct, the assembly instructions are difficult to follow, but not impossible. It also helps to have a cordless drill/screwdriver, otherwise the screwing would take forever. The chair looks great, I've had a lot of compliments on it and no one believes the low price I paid. The only issue was two legs were slightly chipped-it looked as if the box was dropped. But I dabbed some wood stain on it and you can't tell. I love this chair and would purchase it again.", 
    "Overall, I'm pleased with this chair. It looks great and was easy to assemble. However, the cushion is a little hard and there was a notch in one of the harms from where the chair had been damaged.", 
    "These look very nice, but are extremely hard to put together. Also, my first chair arrived damaged, but overstock did replace it.", 
    "These chairs are really nice.They get 4 stars instead of 5 only because they are darker green than they looked on the website.The wood is really pretty .Kind of reddish brown and rich looking. Some other reviews said they had a hard tme with the instructions to assemble them.We didn't use the instructions and found them easy to put together.A very good value for the price", 
    "This is a great chair, but I would caution the purchaser on two things. First, the copy for the instructions is dreadful and key things seem to be faded, but with a little patience and common sense, the chair assembles pretty nicely. The other caution is that the ottoman pictured with the chair is not included.", 
    "Love the look and comfort of the chairs. Just what we were looking for. Not an easy build. Had to use a long, thin racheting screwdriver with an allen head to put it together instead of the included allen tool.", 
    "I purchased this chair to replace my old recliner. It needs two people to assemble this. Instructions to how to assemble is very poor, I am not a mechanic but more or less know how to break the code. Once assembled you will be very proud that you purchased this chair. It gives a new look to my family room, its beautiful and I love it.", 
    "These chairs are less expensive than I have found similar styles anywhere online or in traditional furniture stores AND they are actually much nicer. I was very impressed with them, and we received them very promptly after ordering. The wood seems to be of a good quality and the fabric is very nice. The only con I would point out to those ordering would be that the stained finish is not 100&#37; perfect . It does not cover some of the areas between the slats, but only in areas where it is not seen when the cushions are on. I still think they are a great value and have already recommended them to several friends.", 
    "love mission style furniture and couldnt pass up the opportunity to own this chair. it did not disappoint. pluses --elegant and looks lovely as an accent chair --i bought the olive color and it is a rich olive color, very pretty.. and offset very nicely by the dk brown wood. --reasonably comfortable though not a chair to snuggle into --love the wide arms to easily rest my large cup of tea! --easy to clean minuses --directions were quite bad, but what can you hope for.. i have come to expect this from overstock. (on the other hand how hard is it to put a chair together? not too bad at all) --the seat chair cushion can slide forward and i wish it had velcro (like the back cushion does) --the seat (under the cushion) *should* have been a sturdy piece of wood, but its a wood frame with some cloth, not ideal.", 
    "the instructions were too blurry to read, but once i cracked the code on puttiing one together the other 3 were easy. the chairs look great. i have them in an enclosed porch area and they really make the room look like a craftsman den.", 
    "The chair was very easy to assemble. I did it myself in under 30 minutes and I am not mechanically inclined!", 
    "I am very pleased with the chair both in construction and appearence. The assembly of the sides and legs is much easier if two people work on it, other than that it was a snap.", 
    "I really like the chair. It was exactly what I was looking for. However, the directions were a little hard to follow for assembly. Buy this chair", 
    "The instructions were useless, utterly, semble arms to spacer, semble seat bottom to arms, semble back to seat. Not even ASsemble. No instructions, just tiny sketchy drawings. The molly bolts backed out of the wood when I tighened the screws. Four screw are so located that you cannot turn the Allen wrench required. I finally had to buy lumber, drill holes, and screw the thing together. It's a beautiful little chair, very comfy, but unless you have two assistants and some fairly sophisticated carpentry tools, buy something already in one piece. It took two of us SIX HOURS, two trips to Home Depot, and all my good will for Overstock.com.", 
    "The chair looks more like a cherry then oak. It was easy to assemble.", 
    "I bought this chair to accent another Mission Style futon that I have. The style goes great with my existing futon, but the frame color is a little darker than I had hoped. Once I figured out how it went together (the instructions leave something to be desired) it all went together fine until I came to one pre-cut screw hole that would not take the screw no matter how hard I tried. I finally had to use my ingenuity to figure out how to keep the screw in the hole. Even then it still could not be tightened up all the way. But at least it is holding!!", 
    "Very misleading picture - depending on where you click on item, you may think the ottomon comes with the chair for the price of $190. When the chair is delivered, the box actually has printed on it \"chair and ottomon\". You are only getting the chair shown in the picture. The ottomon is a separate purchase.", 
    "Very shoddy workmanship, looks like it was stapled together. Plus it was damaged in transit. We tried to screw into the existing holes, and they were stripped. The only good thing I can say is that Overstock handled the return very promptly, confirming my desire to return, sending the pick up info, and then had UPS pick up promptly. Hopefully my account is credited correctly, that hasn't happened yet.", 
    "Cheaply made, Impossible to put together. lacked holes for fitting together seat to frame. I discarded it.", 
    "I GOT THE CHAIR BUT I DID MY FOOT REST AT IS THE 2 X TIME IT HPPENED"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Hills-Mission-Style-Oak-and-Olive-Microfiber-Accent-Chair/3911905/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/3911905/TRIBECCA-HOME-Hills-Mission-Style-Oak-and-Olive-Microfiber-Accent-Chair-b1239478-2ef5-4f1d-b547-9e26ac457419_600.jpg"
  ], 
  "description": "Accent your family room or vacation getaway decor with this\nMission-style chair from Tribecca Home. Solid wood construction,\nsteam bent arms and an innerspring seat cushion ensure years of\ncomfort, durability and beauty. A dark oak finish and a neutral\nolive-green microfiber fabric blend beautifully in casual or rustic\nspaces. This Mission-style chair makes an ideal option for extra\nseating in any space. Armchair also features olive-colored microfiber fabricSteam-bent arm and inner spring seat cushionDimensions: 32 inches high x 30 inches wide x 33 inches\n  deepSeat cushion dimensions: 9 inches high x 26 inches wide x 23\n  inches deepStyleModernMaterialFabric, Microfiber, Oak, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightLow BackColorBrown, GreenFurniture Frame MaterialWoodFurniture PatternSolid"
}