{
  "name": "TRIBECCA_HOME_Tess_Wingback_Tufted_Linen_Upholstered_Club_Chair", 
  "price": "EUR 318.37", 
  "reviews": [
    "Nice fabric color! Love the look of this chair BUT it is so cheap! The sewing along the seams were not straight. There were bumps along the back of the chair probably from poorly place batting underneath the fabric. You truly get what you pay for. Cheap chair = cheap quality! It's too bad bc I thought the look of the chair was perfect!", 
    "The cushion on these chairs feels firm. Not in an uncomfortable way at all, there is definitely some give. But I can tell that they are going to last for a good amount of time, unlike chairs that don't have a built in cushion. These are sturdy and look sophisticated. Come fully assembled. Just have to screw on the legs.", 
    "Glad I bought it! This chair is wide and comfortable, great for curling up with a book and a cup of tea. Color is true to pictured and the linen-like fabric is good enough, maybe a little on the thin side. Only disadvantage is that the seat cushion cannot be removed.", 
    "The chair arrived with the box intact (we all know how tough the delivery can be). All we had to do was attach the legs, and tah dah, a beautiful new chair. The fabric is a nice quality, the styling of the chair is great, and it feels sturdy when you sit in it. After we received the chair, we liked it so much I tried to get another but it was sold out already!", 
    "We've had this chair for a few weeks and absolutely love it. It's in our bedroom and seems pretty comfortable but we don't sit in it every day like a living room chair though. Fantastic chair for the price though.", 
    "Love these chairs! They are deep and larger then expected, which is a good thing. They have a modern, yet classic feel to them. Could fit in with any style home. Assembly was simple, just screw on legs. Very nice!", 
    "I bought this chair along with the Tribecca sofa (in grey). Gave my apartment the perfect look PLUS its comfortable. Easy assembly too.", 
    "We bought two of the dark grey chairs for our family room and love them. They are beautiful to look at, true to color and very comfortable. Deep seats and sturdy! In fact we liked them so much we bought two more in the beige color for our den. My only negative would be that we wish the arms were slightly higher for better arm rest comfort, but it's not that important that it deterred us for loving these.", 
    "Looks darker than the picture in real life, almost black. Legs are not very strong, has a cheap feel to it.", 
    "The size and quality is great for the price. And it is comfortable. The only thing I would question are the legs and their stability. They are strong and good but they are hard to screw on and make sure they are angled appropriately to support weight.", 
    "Love my new club chair it fit perfectly in my living room. It's very comfortable and well made. The size of it is great too...larger than I though it would be. It came assembled the only thing I had to do was screw the legs in. Great purchase...highly recommended.", 
    "I ordered a (beige) pair of these chairs and they arrived yesterday. The packaging was great, super easy to assemble. The color is really good. The chairs look nice in terms of design but they don't feel expensive. That's fine because they aren't! I'm not sure how they would hold up under everyday use. I'd expect the cushion to get misshapen rather quickly. But I am using them in a formal living room and think they will be just fine.", 
    "Great price for a great looking, comfy chair!", 
    "Well worth the money an very comfortable as well", 
    "Well made, comfortable, good looking chair", 
    "Comfort with great style. Only reason I did not give 5 stars is I am a little concerned about the legs which screwed in. If a heavy person plops down in a chair, I will the legs fold? We'll see!", 
    "These have a vintage flair. It is a wide chair that most people except the very talk will need a pillow in order to reach the floor and be comfortable. We have gotten many compliments on the pair we bought. It takes a bit of getting used to not to have arms. These chairs are firm but seem to be softening ip a bit as we sit on them. We bought a pouf to put our feet up on. The fabric is very nice and matches our decor perfectly. Overall a good buy and a happy customer. Packaged well.", 
    "I love the color and the style. It's a great size for being an accent chair!My one complaint is the legs are weird. I tried to put the chair on a wood floor and it was unbalanced, it works better on some type of carpet.", 
    "for the price this chair added the perfect design and scale to an empty spot in my newly-redone living room. Very tailored and sleek, low arms, love it. Not totally solid and everlasting quality but that's not what I needed in this piece.", 
    "The chair is made well and I'm happy with the shape and size. The color, though, was off from the picture. I purchased the beige color expecting a light 'linen' look but what came was more of a muted brown, maybe 2 shades darker than the picture. I'm going to use the chair in another space so it ended up working out.", 
    "Great chair looks really nice", 
    "This chair is a nice touch if you want simple, elegant, and different. Not to comfortable. I find myself having to adjust myself and sit up more than I like too!", 
    "This is a beautiful chair, exactly as pictured. Very easy to assemble. All I had to do was screw the legs on. Chair is quite sturdy and big.Only downside is that the material bunches up or creases at the edges when it's sat on.", 
    "This chair is incredibly lumpy near the stitching and wobbles . I hope the return process is easy.", 
    "I thought these would be more comfortable than they are. Just as a reference I am a 5'10\" woman. While the chair is deep the position of the back makes you feel like your sliding out of chair, (that's if you lean back to relax). If you just sit for short period of time they are fine. They look nice", 
    "If you don't plan on sitting in this a lot, it's a fine chair for extra seating. We have it in my son's bedroom, and in retrospect, I would have bought something nicer since we use it a lot.", 
    "This chair looks like a million bucks! I purchased two grey chairs. I'm 5'8 and my husband is 6'2 and this chair has enough seat room (for your bottom) and height to where it does not feel tight or squeezed it. Very nice chairs for the money!", 
    "It sits well... but a bit clumsy looking", 
    "I really like this chair and its comfortable! The construction is pretty good for the price.", 
    "Looks great... but not as heavy/sturdy as I would like. Using it in my bedroom, so not too worried", 
    "This is a nice chair, on the small side which is what I wanted for my bedroom. It is a bit stiff, but perfect for what I will be using it for. It is true to the color in the picture.", 
    "I like the looks of this chair however it does not sit flat on all four feet. It seems the legs are Crooked and there is no way to balance it", 
    "Love this chair, very wide in the seat area, great color and put together fairly well for the price. I am pleased with the purchase and looks great as an accent chair.", 
    "Very poor quality, legs unstable and material poorVery poorly made", 
    "Great chairs. Complemented the non-fussy sophisticated room I was going for.", 
    "Overall happy with this purchase. Looks wise it's an A+. Shipping boxes were falling off by the time it arrived, but thankfully the chairs were perfectly fine. Quality wise, they are ok. Fine for where I have them, in a low traffic room. If these were intended for every day use, I'd return them. As they say, you get what you pay for so just be aware they are not the most solid or sturdy piece of furniture.", 
    "The chairs are nice and wide. I am 5'6\" and can totally curl up in the chair. We like the comfort level as well. Love the look and come assembled, just have to add legs, which is a bonus. Love these!", 
    "they look sharp. I returned 2 chairs because the legs would not balance. They were off by nearly 1.5 inches. too much to find a quick solution.", 
    "Fairly cheap but ok to use as staging items for houses", 
    "This is a pretty piece, and just right for a corner of my den. The linen is pretty, but it is not as heavy as usual upholstery fabric. I have concern that it would not stand up to heavy use. Or may need replacement sooner than anticipated. For the price and my needs, I am happy with it.", 
    "Beautiful, comfortable and a great price! Very light, so they are easy to move around.", 
    "Bought these chairs for my new home and they are very comfortable to sit in.", 
    "Comfy but seems cheaply made.", 
    "These chairs are perfect for my home office. Stylish, comfortable, yet very professional-looking.", 
    "it's more for my sitting area so i don't really use it but it looks great.", 
    "Nice chair for the price. It is roomy and was easy enough to assemble for my 4 year old and I. The charcoal is a little darker than I was expecting but it looks great. Totally unrelated: The box it came in has provided hours of entertainment for my kids. :)", 
    "Nice color and fabric. Seat is very wide and deep, great for a tall person.", 
    "It was a quick delivery, color was true to description and image on screen, great price and the chairs look great in our living room. I purchased 2 chairs to fit in the room. The chair is deep and sits high (I am 5' 2\"). Overall good buy.", 
    "Chair is ok but the color is not as described. The color on the chair is clearly tan not beige as indicated. Not happy 😫😫", 
    "These chairs are gorgeous!", 
    "Chair is really nice and we are really happy with it. The chair is a tad wobbly, but overall it's really good.", 
    "Perfect for the sitting area I created in my Master Bedroom!", 
    "I purchased the grey upholstered club chair x2. The boxes were battered and partially opened. The fabric had what appeared to be bleach spots (approx 2-3\" in diameter) on them. The wooden legs were battered and scratched. I am not returning due to the simple fact that I live on the 3rd floor and it was hard enough getting them up the stairs.Overall, functionality is good. The seating area is rather large (bigger than most chairs) and has great coushion and give.", 
    "I eyed this chair for a while before i bought. Having read the reviews good and bad. I reasoned that there were far more good reviews than bad, so the bad reviews were just over critical, and on the whole people seemed to like it. Now i own the chair, i am starting to appreciate the bad reviews a little more.. Firstly, the color of the light beige chair on the site, is way deceptive!! I expected this light creamy beige color, but is actually quite a few shades darker, ( a darker putty color). Secondly, it is very light in weight! (Im a small woman) and i can easily carry it around the room. While i still love the comfort and shape of the chair, (its very wide and generously proportioned, I can curl up comfortably on it no problem) I am beginning to notice the leg issue, .. this is after the first week of owning it. So buyer beware.. the low reviews are justified... Im keeping the chair just because I dont want to deal with the hassle of shipping it back.", 
    "These chairs are the perfect accent to our living room. The only assembly needed was to screw on the chair legs. Extremely easy and took no time at all. The chairs are comfortable but the cushion is slightly bulky. Doesn't bother me though. The style is very similar to a chair I wanted from pottery barn but 1/4th of the cost. I would recommend this chair!", 
    "Good lines. I Scotch Guarded items and hope fabric gives o.k. Service. These are good for the price but not the very best for comfort as the seat is deep. And needs fill in cushion for average person. SSeat also humps in the middle. Hope sitting will correct this abnormality eventually.", 
    "Ordered 2 for our living room. Look very nice, good price. Could be built a little more solid.", 
    "Lots of padding for the bottom, wide, easy to sit in, not too heavy so easily moved, but durable enough to withstand the kids climbing on it. The linen is \"soft enough\" to be comfy, but durable feeling as well. Time will tell on that though.", 
    "I really wanted to like this chair and I disregarded the negative reviews about the defective legs. However, the threaded rod of the leg truly is defective and we have to lay the chair on its side because it is unusable. I would have liked to have emailed the seller to request a replacement leg but there is no mechanism that I can find on overstock to contact the seller. Other notes: The chair looks very nice from afar. But close up the reviews that complain of the poor finish work of the upholstery sewing were right. The seams look wobbly and crooked. Also, there are furniture staples that are very visible on the armrest and there is nothing that can be done about it. The packaging was so poor that during delivery, the curve of the arms had no protection and permanently have highly visible worn-down marks that nothing can be done about.", 
    "They look really pretty and comfortable to sit on ..however after 3 months of hardly any use the legs are starting to get loss. I need to tighten them and hope one of my guests done fall...", 
    "Throw a decorative lumbar support pillow on this chair, and you have a surprisingly comfortable yet stylish chair.", 
    "chairs where ok, if you want something for looks these will work but not very sturdy.", 
    "I ordered these accent chairs - did not look like pictured. Also not sturdy! Returning these!", 
    "This chair looks very classy and is the perfect touch for our guest room. Classy and comfortable too!", 
    "On unwrapping this chair, I was surprised to see how high and rounded the seat is. Then I noticed chalk-like white marks on the curve of each arm. Since they seemed light and powdery, I tried sponging them off, but they remain. Then when I unwrapped the legs from their protective packaging, I found that one of the front ones was badly scratched.Despite all this, I put it together and set it up. It looks wonderful in the spot I wanted it for, despite the flaws, but is completely impractical for actual use. That rounded seat keeps me from sitting back comfortably; even my 6-foot partner's feet barely touch the floor. No matter how I tighten the legs, it wobbles and feels unsteady.This is going to have to go back. I only hope I don't have to pay for the shipping, considering how poorly this was made.", 
    "Very deep and comfortable. They are firm, but not enough to not get them. I can tell the quality isn't really great, but for a sitting area in the bedroom, they are just what I was looking for.", 
    "I purchased this item to complete the set with the \"matching sofa\" (the Tribecca Home Knightsbridge Beige Linen Tufted Scroll Arm Chesterfield Sofa). It was supposed to be the perfect match, however, it's far from it. The material is different (definitely not the linen on the sofa) along with the color tone and texture. This item is very cheaply made and it certainly does not match the sofa. Additionally, the 'tufted' back doesn't even have the buttons like the sofa does and the stitching is just terrible. I would advise against it. Now I have to return it and pay for shipping . Very disappointed.", 
    "Too short and a bit on the dark beige side. Also the legs are a little awkward", 
    "Quality not good. If I had seen it before my purchase I would not have bought it. Some of the stitching is bad. Not comfortable to sit in either. Too stiff.", 
    "The chair as pictured is gorgeous, but the upholstery job is HORRIBLE! It's such an eye sore, that I will be returning it.", 
    "Love the chairs. Had a little bit of a problem getting a non-damaged one here but overstock was beyond helpful for that.", 
    "Perfect for a sitting area in the home! They are so comfortable the size is nice not small they are nice and wide! Very nicely made. Beautiful chairs!", 
    "Although it's very pretty, it's very stiff. Perhaps it needs some usage.", 
    "This chair is much wider in person than i was expecting which is a great thing! They are definitely a dark tan rather than beige. But it went perfect in our living room. Great quality and durable. I curl up almost every afternoon with a cup of tea in these chairs very comfortable.", 
    "I actually ordered two of these chairs for my Master Bedroom -- one for me and one for my husband. They are perfectly sized, not too overwhelming for the room (we have a good-sized room with a vaulted ceiling) and not like those cheap accent chairs you're afraid to sit on. Assembly was a breeze. It took me just 10 minutes to assemble each chair, and the chairs look great from all sides (one is sort of \"floating\" in the room so it was important to me that the back look as good as the front). The color was what I expected. perhaps a little more brown than grey, but still perfectly neutral.I am very pleased with this purchase.", 
    "It looks great and very comfy! Moves around a bit on our hardwoods.", 
    "Returned this item. The color was not what I expected.", 
    "This turned out to be a great chair for the price. Very satisfied", 
    "very comfortable. looks more expensive than it is.", 
    "Bought 2 of these chairs for the living room and it looks great in front of the bay window, might move it around later on. Only complaint about the chairs is it took a little longer than I expected to screw on the legs, but other than that I'm happy with the quality and my purchase!", 
    "My chair was delivered to me in a week. I love the chair, its perfect for the space that I bought it for."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Tess-Wingback-Tufted-Linen-Upholstered-Club-Chair/9822503/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9822503/TRIBECCA-HOME-Tess-Wingback-Tufted-Linen-Upholstered-Club-Chair-bb1d6363-0a8c-4e00-8199-ec6b3d1ceb17_600.jpg"
  ], 
  "description": "Cozy up with a good book in this lavish club chair by Tribecca\nHome. Tufted details accent the contemporary wingback design, and\nthe linen upholstery adds a soft, neutral look that blends with\nyour decor. With oversized dimensions and plush cushions, this\npiece creates an inviting place to sit in your living room or den.Tufted details lend an upscale touch to your roomModern wingback design coordinates with contemporary decor\n  themesCrafted from plywood and solid wood for strengthEspresso finish for enhanced beautyLinen upholstery available in beige, gray and dark gray for\n  easy design incorporationMeasures 35\" H x 32.8\" W x 32.6\" DSeat measures 20\" H x 24\" W x 23.5\" DArm measures 22\" HCushion measures 11\" thickStyleContemporary, ModernMaterialLinen, Rubberwood, WoodChair TypeAccent Chairs, Arm Chairs, Club Chairs, Wingback ChairsSeat HeightCounter HeightSet SizeSingleAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Brown, GreyFurniture PatternSolid"
}