{
  "name": "TRIBECCA_HOME_Hamish_Tan_Chenille_Power_Lift_Recliner_Chair", 
  "price": "EUR 594.53", 
  "reviews": [
    "My elderly family member has been having more and more trouble getting out of regular chairs. Her normal chair has been a recliner, relatively soft and normal height. She literally finally could not get out of it anymore, by herself. For the money this chair looks OK and is comfortable but the main advantage is that she can control how and when she gets up. The chair rises to a height that aids her to nearly standing. It is limited as far as being able to change the angle of the leg support independently of the chair back etc. but again \"for the money\" it is comfortable. She likes it!", 
    "This is a wonderful chair. I would not have it delivered. It was received broken and had to be repaired before it could even be used.", 
    "I was very surprised when this power lift recliner arrived and I found it to be a nice-looking and comfortable piece of furniture. I've never owned a recliner before, but now that I have severe back problems, I thought this particular chair would work well not only as a comfortable seating choice, but also for its ability to help me stand upright when I can't do it on my own. It came in two pieces and we didn't opt to pay for having it brought inside and set up (white glove service). The bottom half of the chair was pretty heavy, but my husband got it where it needed to go and was able to put the pieces together and set up the remote control. Since I've only had it for one day, I can't attest to it's durability, but I'm very pleased so far with the look and comfort of the chair and the price I paid for it. My neighbor paid $300 more than I did for a very similar chair. She also had to pay a delivery charge, and mine shipped for free!", 
    "i was reluctant to order furniture but when the chair arrived, it was easy to put together and it is ten times prettier than the picture.", 
    "Purchased this chair for my 91 yr old mother who is in assisted living. The recliner is great for her, as it assists her to get up with the lift feature. She loves the recliner. The price was excellent. The recliner was shipped within a few days.", 
    "Chair was all it advertised.", 
    "It is not as comfortable to sit in as some, being as it is rather stiff. But it easy to sleep in and the mechanics work well.", 
    "The chair is great. The delivery was terrible. It was delivered and left in the rain. No notification of delivery as stated.", 
    "A small chair but great color. Also company stands behiiind the product! Got this chair on a flash deal at a great price. Thanks Overstock!", 
    "We bought this for my 96 year young FIL, it's perfect, he was having trouble getting in and out of chairs. This chair is comfortable easy to use. My FIL often sleeps in it!", 
    "Purchased two for my parents, they were very easy to assemble ( slide the back on) and it was just plug in the remote and your ready to go. Simple up/down buttons, handy pocket on the side for storage. They have been more active since they have been using these. Before, they would be wore out from trying to get up on their own. My parents are on the heavy side and these have helped with their mobility, also mentally, they like being independent.", 
    "Originally this chair was very comfortable but within a few weeks the side of the seat \"broke down\" so there wasn't any support. I have to use a small pillow to make sitting in the chair comfortable. It reclines well and if I need the assistance to get up, the power lift works well."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Hamish-Tan-Chenille-Power-Lift-Recliner-Chair/8931560/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8931560/Hamish-Tan-Chenille-Power-Lift-Recliner-Chair-a94a1907-6ce5-49a8-9327-443567032dd4_600.jpg"
  ], 
  "description": "The Hamish collection features a powered lifting mechanism that pushes the chair up to move more easily to a standing position, and also functions as recliner to sit back and relax. This recliner chair set is covered in a tan chemille.\r\n\r\nMaterials: Solid Asian wood frame, chenilleFinish: TanUpholstery materials: ChenilleUpholstery color: TanSeat depth: 21.26 inchesSeat height: 18.5 inchesWidth between two arms: 20.47 inches Height of arm to floor: 23.62 inchesFoam density: 28DDistance needed away from wall: 6.5 inchesDimensions: 40.95 inches high x 35.43 inches wide x 31 inches deep StyleTraditional, TransitionalMaterialChenille, Metal, WoodFinishWoodChair TypeReclinersAssemblyAssembly RequiredColorTanFurniture PatternSolidProduct FeaturesPower Lift"
}