{
  "name": "TRIBECCA_HOME_Trumbull_Stainless_Steel_Dining_Table", 
  "price": "EUR 1012.54", 
  "reviews": [
    "After assembly, the table looked really plain (like a fancy picnic table) and we weren't sure of our choice, but after we added a few props and chairs, it really popped! There are some minor discolorations in the finish, we absolutely love it. We are temporarily using our old kitchen table wrought iron chairs for now until we get the new chairs (although the iron chairs look surprisingly great with it). We get so many compliments. I'm usually a traditional decorator, but wanted to go way out of the box and I do not regret this innovative choice! It looks like it cost so much more. Loving it!", 
    "Compliments galore on this piece. It is beautiful. You cannot cover up the stainless steel though that will cover up the essence of the style. Has to be accentuated with a runner or simply with mats and a center piece. The contrast between the traditional wooden legs and the contemporary table slab makes this a winner in a contemporary, traditional or modern home. We love it and so do our guests. Also, does not scratch easily with regular use, but will do so easily if deliberate.Definitely recommended", 
    "I was hesitant to order, such a large item. I love this table. I wanted something different.Beautiful, strudy. unique.So happy with my purchase! Get so many compliments.", 
    "i was hesitant to purchase this table because of the price, but i LOVED the contemporary look and saw the great reviews, so i took a chance. if it weren't because of the trouble i would have to go through to ship it back, i probably would because the steel top scratches SO quickly, it already seems damaged and i just purchased it for the holidays. i do love the dimensions, it makes setting the table so easy especially when serving 10, which i can easily do. but now i have a table that scratches easily and is not as pretty as it was 45 days ago. the beauty of the table is the steel top so always placing a tablecloth to protect it defeats the purpose. :-(", 
    "This table with staged beautifully in the photographs. When we got it and put it together, we were disappointed with the overall look. Though it is very heavy and sturdy, the overall look is exactly as a previous buyer described a glorified picnic table. Additionally the galvanized metal top poor adhesive and would bend like the lid on a pickle jar. There was also some residual glue alongside the metal top which we could not remove using all sorts of household cleaners. It is now used as a desk in my office, though I don't use it alot, it's a nice table to work at. However, I think for the price $800 and the fact that it doesn't come with dining room chairs, it is just not worth it.", 
    "This is a WOW table and had a wait list on it, however, Overstock was able to deliver it before Thanksgiving for my 1st holiday dinner! Thank you Overstock! I always receive compliments on the table because it is simple, but elegant w/the bench and certain chairs I paired up.", 
    "Love it and the shipping was super quick", 
    "This table is the talk of my house. It is absolutely stunning. It is not your normal dining table which makes it even more worth buying! Super easy to put together ( I did it myself) and I get compliments on it by every new person who comes over!", 
    "Easy assembly, substantial yet graceful. It's well beyond my normal style set, and an improvement.I'm proud of myself for getting this piece.", 
    "I love this table. The assembly was minimal...took just a few minutes. The table top is extremely heavy - I was unable to lift it with my husband to put stand it up after my he put the legs on. Very substantial table! It is gorgeous - really goes so well with our contemporary decor and adds an industrial element. Couldn't be happier!", 
    "I have two small children. This table doesn't care. Everyone who has seen it has commented on it and rightfully so; it's gorgeous.", 
    "This table is superb for a modern, industrial looking dining room. Sturdy faux railroad tie legs are easy to attach. Problem with shipping...one corner of table was dented and made for a sharp piece of tin sticking out. CHECK BEFORE DELIVERY TEAM LEAVES even though it is packed in big box.", 
    "I love this table - it is worth the extra time it takes to polish it!", 
    "Its sleek, modern and different! I don't know of anyone with a stainless-steel table. Smudges and fingerprints disappear with a wipe of a damp cloth. No streaks!! I have young children and its nice to not have to worry about keeping this table clean. Easy to assemble and gorgeous!!!!", 
    "So, I was definitely expecting a brushed stainless steel look -- and it's NOT that. It's almost a textured (think very, very tiny jelly-bean shaped indentations. Sounds weird, but it works!) shiny silver. I was VERY unsure about it when I first opened the box, and was mad about buying such a big thing without seeing it in person first. But, I have to say, it's completely grown on me. It's WAY more unique than I originally thought, without being weird. It's definitely flashier than it looks in photos, though, so keep that in mind. Oh, and I was worried about the silverware metal-on-metal thing. It's not bad because it's not a solid metal -- just the paneling. And because I had to see, I tried scratching a tiny piece of the table that wasn't visible on the outside -- hard. I was unable to scratch it. Cleans off easily without TOO too much of that annoying metal-finger-print-smudge thing. It wasn't what I was expecting, but I'm definitely happy with my purchase!", 
    "This table is gorgeous. I kept looking at it and reading the reviews but hesitated because of the price, but it was so worth it. The only difficulty we had was getting all the staples out of the bottom of the table! The legs and cross bars were held to the bottom of the table for shipping by rope that was then stapled many, many times. It took longer to remove the staples than to put the whole table together. That said, it looks fantastic. Totally love it!", 
    "The table is stunning! It is definitely shinier than it looks in the photo, but it is still a beautiful piece. We have received so many compliments on the table. I would suggest purchasing a piece of glass to further protect the top, although it is not required. Assembly was easy, just note, it is VERY VERY heavy!", 
    "This table is probably the best item I have purchased it looks amazing in this room.", 
    "Delivery took as expected. Packaging was good. Not difficult to assemble but does take two people with decent strength. Described as stainless steel but it's actually chrome. Corners are very sharp so be careful with little ones around it. Received many compliments and we haven't seen anyone with our table yet! We love the uniqueness and goes great with bright white leather chairs!", 
    "This table is well constructed but the metal corners are dangerously sharp. We are covering the corners in a custom wood trim.", 
    "Very contempirary im very happy i found this", 
    "beautiful table... difficult to put together and was missing one of the screws.", 
    "This is an amazing table. It looks even better in person. It is high quality and heavy. The table legs could be better, but the top makes up for it.", 
    "Really unusual one of a kind dining table. Customer service was best I ever dealt with. They were very accommodating and I will continue to shop Overstock because of that. Table is really beautiful, get lots of compliments.", 
    "one word- GORGEOUS!!!! The picture doesn't do it justice, quality is amazing!!!!!", 
    "Stunning, eye catching dining table! It's modern stainless steel top and traditional wooden farm table bottom allow this unique table to fit in any decor. We love it.", 
    "I wasn't sure about getting this table and I looked at it for 3 months before I committed but I am so glad I did. I has a very sturdy base and the table itself is a beautiful compliment to my dining room. Easy to clean.", 
    "This table is beautiful! We are constantly receiving compliments on how rich and different this looks! I highly recommend.", 
    "This is SO much nicer than I expected. Very heavy and sturdy. Not one ounce of wobble. Stainless steel top is beautiful and easy to clean. Wood base is very nice. Perfect for a family with young kids,, but I bought two to be used a craft tables.", 
    "This table is very cool and unique. Easy to put together too!", 
    "Beautiful! Looks just like picture. Easy to put together.", 
    "The table was great but damaged on arrival, still working with Tiffany K./supv to get damaged one picked up and a new one delivered. I am in love with the table so I am waiting per Tiffany for November 2014 for NEW table.", 
    "It's in a model home. Many, many compliments, everybody loves it!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Trumbull-Stainless-Steel-Dining-Table/8672376/product.html?recset=e83d4c1b-9dde-4e46-b88d-eae8a2104121&refccid=M647KYMPX5MLGFKLRIOXHFHZAY&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8672376/INSPIRE-Q-Trumbull-Stainless-Steel-Dining-Table-520378e4-4302-460f-94fc-9ad9bdbf20ea_600.jpg"
  ], 
  "description": "Feed guests and family in effortless style with this stainless steel dining table. with its traditional trestle design contrasted by up-to-the-minute steel, this table makes an ideal fit in transitional or contemporary dining rooms. It's roomy construction allows plenty of room to dine in comfort, and the sleek stainless steel top offers quick and easy cleanup.Chrome-plated patternsStretcher legsSet includes: One (1) dining tableMaterials: Asian hardwood/chromeDistance between legs: 49.5 inchesClearance under tabletop: 27.5 inchesDimensions: 29 inches high x 40 inches wide x 80 inches longStyleCountry, Rustic, Southwestern, Traditional, TransitionalMaterialChrome, WoodFinishChrome FinishShapeRectangleAssemblyAssembly RequiredColorBlack, Brown, SilverGallery MatchYesGallery RoomAdagio Ambiance, Alpine Afternoon, Botanica Brunch, Refined Countryside, Rustic Elegeance, Uptown Mimosa, Urban BordeauxSeats Up To6"
}