{
  "name": "TRIBECCA_HOME_Sophie_Tufted_Full-size_Upholstered_Platform_Bed", 
  "price": "EUR 465.66", 
  "reviews": [
    "So, I ordered this bed at the end of December, but we were moving eminently, so I held off on putting it together until we had made our move. Well, that brings us to yesterday, when I finally assembled the bed, and my husband and I slept in for the first time last night. Love the look of the bed - no complaints there. BUT, at 7:50am this morning, when my husband rolled over on his side, THE BED COLLAPSED. when we lifted up the mattress, we found that the legs that support the middle beam had completely buckled, causing the slats to all slide out of place. NOT the way I wanted to wake up on my Saturday morning, on the first morning in our new house. I am getting ready to call Overstock now to arrange for a return. I will stipulate this: my husband is 6'4\" and 260 lbs, and I am 5'9\" and 170 lbs. We are not small people. HOWEVER, the bed that this one was replacing was the Ikea Malm bed. I have had that bed for almost NINE YEARS, and it is a platform bed just like this one (so, it has wooden slats, and you don't use a box spring). I have assembled, unassembled, and reassembled that bed five different times. I have never ONCE had an issue with it. AND IT'S A FREAKING **** BED. Seriously disappointed with this product.", 
    "I don't normally write reviews for anything because my views have either been expressed already or because I don't feel strongly one way or the other, but I felt compelled to write a review for this bed because I came so close to not buying it. All of the negative reviews criticized its quality - the bed slats, to be exact - and I figured if all these people are criticizing the same thing, it must be bad. I honestly thought about this bed for months. I couldn't decide whether or not it would be worth it to buy it. I mean, if I bought it, I could just buy a higher quality slat system for it, but would the additional cost be worth it? Anyway, I finally made up my mind and ordered it a couple weeks ago and I must say I absolutely love this bed. The price for it is beyond fair and, honestly, the bed is breathtaking. After my husband and I assembled it, we couldn't help but admire it.And while the bed slats aren't the best, they're more than sufficient. Because of all the reviews that said their slats started falling off in the middle of the night, my husband and I were oh-so-gentle getting into bed the first night. Then, the second night, I thought I'd test it. I didn't want to have to live in fear forever. So, even though everyone always says you're not supposed to... I did it. I jumped on the bed. A LOT. I jumped on it everywhere. And you know what? The bed is still perfectly fine. I didn't feel a hint of instability. Based on the design of the bed slats, I think the reason why people are having issues is because they're not using box springs. If you put a soft mattress directly on it, I can see how the slats might fall out. You get into bed, the mattress sinks, pushing the slats down and pop! Although, with how many slats there are, I still find it incredible that it could happen. The only other conclusion that can be made is that some people didn't install their bed slats properly.", 
    "Overstock sent a bed which took almost 3 weeks to receive. The bed was missing a vital part. They then took 3 more weeks essentially to reship a new bed. All of this was \"expedited\" because I spoke angrily to a supervisor but even still the whole process was painfully slow and I lost a little faith in the competence of the overstock staff. May not order here again.", 
    "Purchased this bed for my daughter and in less than two weeks of use the slats began falling under the bed.The headboard moves quite easily and I have tightened multiple times. This purchase was a big disappointment.", 
    "This bed does not accommodate any movement whatsoever. It's BEAUTIFUl, but easily collapses. We already returned it once and will have to return it again. Don't buy this unless you are under 100 pounds and sleeping completely still and alone.", 
    "They have no business calling this a Queen -- it turns out it's a 'California Queen', meaning it's 5 inches longer than any normal mattress. We were not pleased to have to lug the whole heavy thing upstairs and spend an hour assembling it only to discover this fact.", 
    "This bed LOOKS amazing- it look just as good as it does in the picture! But sadly, I cannot say that the construction of this bed is amazing! I assembled this bed quite easily and placed my mastress (bought from overstock) on top... The mattress appeared to be risen, right down the middle. After trying numerous times to adjust the support beams under the bed, with no success, I realised that the bar that was running from the top to the bottom of the bed was sitting higher then the edge supports, creating a mountain in the middle of the bed! After one week of waking up with a sore back I decided to contact overstock... Well, this was a drama wasn't it; it took 3 attempts to resolve this issue and numerous weeks- in the meantime we had been out to buy a new frame as we could no longer stand rolling off the bed each night. In the end, overstock gave us a $XXX refund and a $XX credit... So it was better then nothing but we did waste $XXX in buying this bed. It is a real shame as I loved the way this bed looked... And in the past, I've been very happy with my overstock purchases... This bed would be suitable as a guest bed, that is not slept in often.", 
    "You are about to get a plaid looking bed. It's pretty ugly and the opposite of luxurious. I consider myself someone who keeps up with trends, and has good taste with a good sized budget while living in NYC. The bed is not grey linen like you'd think - it has a ton of white stitching/material throughout the grey that gives it a plaid look which just makes it look young and hard to match things with. I was hoping for a West Elm tufted grey headboard look for half the price with this but should have known better.", 
    "There was a mix-up with the shipping of this item, but when it finally did arrive, setup was a breeze. The few tools needed are included with the purchase. The fabric is a nice gray linen, with hints of white throughout. The slats pop into the frame and seem very sturdy-- I'm using the bed without a boxspring. If you do a side by side comparison of this bed with one that costs at least twice as much, yes you can tell that this one is less expensive, but just by appearance it looks great.", 
    "We received the bed and loved it at first.... that is until we slept on it. The slat system falls to the ground almost every night which makes our mattress fall through. We purchased the recommended mattress so that shouldn't be the issue. I am working with customer service but we still don't have a resolution. Overall the construction is very poorly made. I would NOT recommend this bed to anyway. It is a major headache. Yes it's stylish, but only works if you don't touch it. Horrible.", 
    "The bed itself is a 5/5 -- seems durable and well made (had it for a few weeks now). We also love the style and it looks more expensive than it is. It was a pain to put together like most DIY/assembly required things are... that's the only reason for the 1 star dock. If you're not using a box spring, then you can skip on step and just do the European slats, but the directions fail to mention that. It's not too hard to put together, but do bring a sense of humor and carve out an hour or two to get this done.", 
    "The tufted fabric looks and feels great. There is a major problem in the construction the of metal bed frame. The screws do not stay in and within a few weeks the movement on the bed broke all the leg to frame connections. Reconsider buying this bed - the frame will probably break!", 
    "The Slat's for the box spring keep falling from under the bed. They do not stay \"in\" the plastic clips that attach them to the frame. This is disappointing and I am hoping for a resolution from you!", 
    "Unfortunately the poles in the middle of this bedframe are not very sturdy and the screws began to wiggle after a few months. I tightened them but the next time they came loose they were bent as well. Sad because I love the frame!", 
    "I absolutely love this headboard and frame. It is pretty easy to put together. Definitely a two person job though. It's so beautiful when it's put together. A little squeaky when you move around on it but really a nice piece.", 
    "Time consuming to put together, but good quality and very attractive looking. Women seem to love it and it hasn't fallen after testing in bouncy condition.", 
    "Despite other negative reviews, I took a chance on this bed given how much I loved the look. Unlike other reviewers, we have been completely happy with the quality of the bed, including the slats which are perfectly sufficient. We have now had the bed for nearly 6 months and have had no issues. Great product at a great price!", 
    "This is the first bed I have owned with fabric of the headboard, footboard and sideboards and I love it. The bed is comfortable and elegant--something I never had in beds of the past. This is definitely an upgrade!", 
    "The design of the bed is great, and the headboard looks even better in person. There are a few things about the bed you should know: 1. It's VERY low to the ground.2. A typical queen mattress is a few inches too short for the frame. I'm planning on covering it with my comforter, but I wish I knew that so I had gotten a California queen. I also got a 5 inch mattress, and I wish I had a slightly taller one so that it compensated for the low frame. 3. The installation is not too bad- the box I got was missing directions for the headboard, but I called Overstock and they sent them to me immediately. It took about 2 hours for me to do it by myself.", 
    "I bought this bed for my son's room. I love the fact that it is a platform bed and padded. He is only 7 and enjoys that the headboard is tall so he can sit and read in bed. It looks very high quality and the construction of the bed is great. I would highly recommend this bed frame. The color is rich and it looks great!", 
    "I bought this bed for our guestroom and it arrived quickly and it was easy to put together. The quality looks better than the photo, and it is a nice set. For the price, the quality is nice, and it looks nice in my guestroom. I wouldn't go out and purchase one for my bedroom, but for a guestroom it will do just fine.", 
    "Great item, easy to put together.", 
    "just as described and prettier in person", 
    "The bed is very accurate of the picture. The headboard is beautifully tufted and I also love the gray color.Con: The bed is low to the ground. Would have liked it to be sitting up higher.", 
    "I've had fun changing the look of this over the year with differ pillows and blanks and such. Only problem the slats are awful! .. I made my own to support the mattress properly.", 
    "I love this bed. Stood up well to a recent move.", 
    "Slot of reviews said bad things about this bed... The only complaint was that it took a little over a week to get here. The set up was easy and it looks amazing! It's sturdy I used only the marred no box spring and it's good love how it looks very modern:)", 
    "Easy to assemble, durable material, looks great! Happy with this purchase", 
    "Very attractive piece of furniture ❤️", 
    "This bed is a little darker than the picture but still beautiful and simple!. I have an adjustable ************ bed so I did not put the slats on the bed I just assembled the bed around my already exiting frame.", 
    "The actual bed is much darker than the photo leads you to believe. Also, the slat system arrived later than the bed so I had to find other sleeping arrangements while I waited for them to arrive. In addition, when the slat system did arrive it came with a totally different leg support system which interfered with the one I installed according to what came in the original boxes. Installing the new slat system supports involved disassembling the one that I had already installed. Very aggravating. Once assembled, very sturdy platform but the headboard wobbles around. Not thrilled with the dark color either.", 
    "great headboard for an excellent price", 
    "Love the bed...took three handy people to put it together...it seemed like there were 1000pieces! Light weight...not sure how it will hold up in the long run, looks pretty though. You need time, space and patience to put it together", 
    "This bed's construction is of high quality. It's made of solid wood and fabric is also of good quality. I did not give it 5 stars for two reasons:1.) there's a 7-8 inch gap from top of mattress and the headboard.2.) this is not a true platform bed. There are large gaps in foundation wood panels. Manufacturer recommends box spring or some other foundation along with mattress. foundation or box spring give the mattress or the bed that solid feel and also cover the gap that I mentioned from top of mattress to headboard.", 
    "I love this bed. Easy to assemble. I've had this bed for months and absolutely love it!", 
    "love this, & makes me want to be in bed all day!", 
    "instructions for assembly were good. alot of assembly needed. Be patient. Head board and side rail quality is nice. never fond of the slate but it will work for a teenager bed", 
    "great cost and expedite shipping", 
    "I Bed was for my son as a present. The main problem is in the assembling. There are a lot of intricate pieces that have to be put together precisely or it doesn't work right, but once you have it together it is beautiful.", 
    "purchased this for my toddler girls room and was nervous based on the reviews of it withstanding weight but it has been just great. I did happen to have a sheet of plywood that we had used on the metal bed frame and so did use that on this bed just as precautionary so maybe that did the trick. The one thing I will say is it seemed that the directions i received were included several variations of how you wanted the bed configured: with metal bed frame, with box spring, as platform bed. this was a bit confusing as I put together but ultimately, pretty easy assembly", 
    "This bed was incredibly easy to assemble and it looks beautiful! The only downfall is that the slats are a little delicate. My boyfriend has broken two already of the slats and I can't find replacements for this model anywhere. I would suggest using it with your own boxspring or super sturdy slats. But even with the two broken slats, it's still functional and looks great!", 
    "Sturdy, great looking and my daughter assembled it in a 1/2 hour.", 
    "I have gotten many compliments on this bed. The headboard is a little taller than I thought, but that is my fault for not measuring it. The color is great and I looks great with my duvet color. The only thing is it was really hard to put together and took me almost 2 days.", 
    "Easy to assemblethe color was perfect", 
    "It's a great bed and looks exactly as advertised!", 
    "I'm really happy with this bed. The only reason I didn't give it 5 stars is because the pre-drilled holes needed to join the headboard to the legs, and ultimately frame of the bed are slightly misaligned, so I have a noticeable gap between the bedhead and legs, that is, its not assembled flush together on one side. Its not a big deal because the bed is very secure (and no noise!!) and you can't see it because of the mattress covers it.Bed is very secure and therefore doesn't make any creaking noise,overall, very happy and I recommend this bed. Very good price.", 
    "Pretty easy assembly! Feels very sturdy and looks fantastic!! I am more than happy with this purchase! Highly Reccomended!", 
    "LOVE LOVE LOVE. This is great product", 
    "I was a little nervous to order a bed online without seeing it in person first. The bed was exactly what I was looking for and was represented well online. It came packaged well and was relatively easy to put together. I would definitely recommend this beautiful bed!", 
    "After reading the reviews on this bed, I was concerned that there would be issues. I received it timely, it set up quickly and easily, and it fit my queen bed. It looks regal!", 
    "It's a bit tedious to put together. Lots of parts - but can be done. I was missing 3 bolts -so that was the only assembly mishap. The bed is nice and supports the full mattress I got for it. I got a full size for a small bedroom area. Nice color and the side have a bit more extra room, around the perimeter - which makes tucking in sheets easier I guess. Overall I liked the purchase and would recommend it. I saw where others had problems - don;t know why? I's very sturdy for me, so I cannot understand he negative reviews. I did take my time and put together - so I don' t see where the slats could fall..........but it's fine with mine and no problems. I am using only a top mattress - no bottom box.", 
    "Beautiful bed. I love the built in spring. All that's needed is a mattress. I bought the 14 foam mattress and it was perfect. Looks curry modern. It arrived quickly too. Assembly was no problem.", 
    "Quality of the bed was great. Headboard is definitely a darker textured grey (My bf said it looked like denim. It doesn't, but gives you an idea)Used my existing box spring instead of the rails because of the other reviews. The bed sits a bit lower but not much and is a good remedy for any rickety bed issues. Also, the package was missing an important piece for the railing so in the end it was a win win I guess. All in all for the money it is a great bed and I would definitely recommend it!", 
    "Loved this bed. Was not that difficult to assemble. Looks very elegant and stylish. Good quality. Very pleased with item and the price. Reasonably priced for the quality. Would highly recommend. Although it says full, it's a little big. I may try a queen size mattress on it. With the full, comforter hides the excess.", 
    "Although the box was dauntingly huge, the bed was very easy to assemble. The tufted headboard looks exactly as I had impugned and even has a silvery sheen to it when sun comes in through the window.", 
    "The perfect bed! I love upholstered beds as they are so comfortable and very designer looking. The linen material was very good quality. The bed was easy to assemble and very sturdy. The best price I could find and the bed was excellent!", 
    "It was so easy to set up & built very sturdy, love the style of the tuft headboard & linen fabric. The color is a bit darker than photographed & since I'm not using the European slat that came with it because I have my own bed frame, I cannot comment on the rest. I've seen similar styles at furniture stores costing much more so I'm very pleased with my purchase, the look & price exceeds my expectation!", 
    "I was very nervous for the bed to arrive as I am a very picky shopper and have never purchased anything online. This was an amzing experience. The bed got to me earlier than expected. It was packaged great and the quality was great. Im in love with the style and quality.", 
    "I was initially skeptical because of the low price but this bed is fantastic. It provides all of the elegance of a tufted bed for half the price. It was easy to assemble the color is a true grey with the some white woven into the fabric. Paired with some black nightstands, also purchased from overstock, it really elevates the style in my bedroom.", 
    "Really nice Took a little to assemble But worth the effort", 
    "Good bed but headboard has a bit too much give. I hope it stays sturdy.", 
    "This bed exceeded my expectations for buying furniture on-line. Really good quality construction - nice and solid and the fabric is a lovely shade of grey - it does have a slight purple hue to it as others have described rather, but is still fairly neutral. Not sure on other comments saying the pattern has a \"plaid\" pattern. It is a woven fabric of greys and whites to create a linen style effect rather than a flat grey colour, but certainly not plaid. Would recommend this", 
    "Purchased for my new condo. Was looking for a gray tufted bed and they are hard to find at a reasonable price. The fabric on this is definitely linen so you can see the different colored gray and white threads in the material. I would have preferred a different fabric, but wasn't wiling to pay at least twice the price for it. There were a lot of pieces to assemble because of the \"platform\", but we had an assembly line going and it all went together relatively quickly. Feels sturdy. Happy with my purchase, and received quickly.", 
    "I love this bed.. It was relatively easy to assemble although the directions were horrible. The material is beautiful and the look is perfect for what i was looking for. Colors true to picture on the website. One complaint is i don't feel as though its very sturdy as i would like based on the design the head board has some wiggle room of where it lays against the wall so i had to wedge something in between the wall and the head board to stop the wiggle movement and squeaking every time i moved in the bed. That seemed to resolve the noise for the most part but still feel as though the support system could be improved upon. For the price this was a steal!", 
    "This bed is very pretty, I almost bought a very similar one at West Elm for $500.00 more. Glad I looked here first. Stylish and Modern. There was a very strong chemical smell when we put it together but it went away after a few days.", 
    "I really like this headboard, only it looks more like a beige than a grey, but it still is a very handsome headboard.", 
    "We received the bed and the packaging protected the rails and headboard well. No pieces were damaged or missing. Shipment came two days early. So that was awesome! Assembly was a piece of cake, only two little issues to mention a screw hole didn't line up and another hole was stripped both were in the headboard. The two screws don't seem to mess with the integrity of the headboard and seems to be firm. All-in-all we are very satisfied with our purchase and would purchase from Overstock again. Thank you for the quality product.", 
    "I like the look of the bed. The color was a little darker than I was expecting,more of a dark grey with threads going through it for color variation. It looks modern and updated the look of our bedroom. It was easy to put together although one of the slats is too small and one of the screws won't thread because there is no threading mechanism in the predrilled hole. It is still sturdy but very difficult to move once put together. We tried to slide it into place and some of the slats kept coming out. All in all though I am happy with the purchase and it is a very nice looking bed ...especially for the price.", 
    "I really like the look of this headboard. It looks very stylish and high end. It went together fairly easily but even once my heavy mattress was on it...the headboard was wobbly and seems like it needs extra support in the back. This was also shipped to us with 2 left legs and we ha to wait 2 weeks for a full replacement since they couldn't just pull the part. Overall, I like the look of this bed but it will not be something we hold into for years.", 
    "We have had this bed for only a couple days but so far we love it. Same mattress yet it feels softer, maybe because the planks have some give. This could be a bad thing down the line if it means a lesser quality, but thus far no complaints. I love the style, it has a romantic feeling with the tufting yet a mod feel with the color and fabric. The grey is a sort of feathered-retro-1970s, not a deep grey at all.", 
    "Unbelievable price, and gorgeous"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Sophie-Tufted-Full-size-Upholstered-Platform-Bed/8036633/product.html?recset=ff020176-31d1-4b0b-abf5-5f6504481c28&refccid=QLOTCR77AQMJGMKEIK5W6CXZS4&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8036633/TRIBECCA-HOME-Sophie-Tufted-Full-size-Upholstered-Platform-Bed-1da3dbdf-5da4-4e37-aa89-c219528af39d_600.jpg"
  ], 
  "description": "Make your room complete with this beautiful and stylish upholstered\nplatform bed. The plush foam upholstery of the headboard offers\nexquisite comfort to every moment you lean against it. The bed set\nincludes the headboard, foot board, side rails, and a complete Euro\nslats system.Platform bed designed for use with mattress; no foundation\n  requiredSet includes: One (1) Headboard, One (1) footboard, One (1)\n  set of rails, One (1) Complete Euro slats systemMaterials: Wood cover with linen fabricFinish: BlackUpholstery option: Grey linen, beige linen, dark grey linen,\n  white faux leather, dark brown faux leatherUpholstery fill: Polyurethane foam              Headboard: 52.8 inchesFootboard: 13 inchesLeg height: 4 inchesFloor to slat height: 11 inchesFull inside dimensions of frame: 55 inches wide x 76 inches\n  longFull bed overall: 52.8 inches high x 59.5 inches wide x 82.7\n  inches longStyleNauticalMaterialFabric, Foam, Linen, WoodFinishBlack FinishBed StylePlatform Bed, Tufted BedAssemblyAssembly RequiredColorBeige, Grey, WhiteFurniture Frame MaterialWoodFurniture PatternSolidGallery MatchYesGallery RoomCountry ModernProduct FeaturesIncludes Hardware"
}