{
  "name": "TRIBECCA_HOME_Parson_Classic_Upholstered_Counter_Height_Chairs_(Set_of_2)", 
  "price": "EUR 158.10", 
  "reviews": [
    "My recent purchase of the Parson Cherry Counter Chairs was pretty favorable.. My 4 stars was because the height was about 4 inches less for the counter in my current condo. They were easy to put together and I've gotten quite good at taking my time to make sure I get it right.. It took me about 1 hr. because after finishing the first chair I decided I could complete the second one without following the instructions.. My fault for being in a hurry.. Love Overstock.com . Just continue to make it easy as well as fun for us ladies...", 
    "Bought these chairs for a counter-height desk. They were pretty easy to assemble, feel very sturdy, and the cushions are soft and comfy. Pretty much exactly what we were looking for!", 
    "These chairs are very elegant and comfortable. I was a bit worried when it came time to assemble, but the instructions were easy to follow and assembly was quick and painless. I am thrilled with how great they look and how comfortable they are too!", 
    "I absolutely LOVE these counter height stools! I read the reviews before I bought and was slightly nervous about having to put them together myself. However; not half as bad as people made it sound. **One Tip-once you get to the point where everything is tightened about 80% have someone sit on the chair (or use weights) and then tighten the rest of the way.** They looked like they were going to be too short for my counter, but turns out they are exactly the right size. They are slightly darker than the picture I had on my moniter, but VERY close! They are very luxurious and are well made. They don't wiggle at all once I had everything tightened. I would suggest these as a purchase anytime. I just recieved them so I am unsure of how they will hold up long term, but they are much sturdier than other stools I have purchased. I am going to spray mine with that never wet stuff and that should keep the stains & spills at bay. Super happy with the purchase from overstock!", 
    "I love the chairs, they look great and were easy to put together ( I'm not good at that sort of thing so if I could do it anybody could!) very classy look and the price was very good.Shipping on time.I had never order furniture online but this was so easy!! Highly recommend!", 
    "I have had these chairs for a couple of years now. I bought them for my 3 year old to sit on at the counter. They clean up amazing. Very good chairs for the price.", 
    "I've been looking for exactly these chairs for a while. I found them a lot of other places and they were at least $100.00-$200.00 each. I found these decided to take the chance and I am so happy I did. My husband is very handy so it took him maybe 20 minutes to put them ALL together, I read that other people had a hard time, that was not the case for us. I haven't found the table I want yet, but these chairs are fantastic and I can't wait to finish my dining room :)", 
    "When we first pulled them out of the box, we were very worried about the height being too low but we were wrong and they were perfect. They are really beautiful in our kitchen and really comfortable and soft microfiber chairs. I would definitely recommend them.", 
    "These match my kitchen well. We have kids running around & these chairs have gotten many spills- but clean up nicely.", 
    "Easy to assemble. One leg a little shorter; added thicker felt pad to resolve. Ok springs but great deep seats for longer legs. Really look great. Clean up well. Very happy with purchase.", 
    "Chairs are beautiful and rich looking! You can't beat the price! They look so elegant at the counter and are very comfortable!", 
    "These chairs perfectly matched a dinning rooom set we had bought 4 years ago and we were so excited! We are now able to open the leaf of the table and have 8 perfectly matching chairs. They are very comfortable, easy to wipe clean, and sturdy (every once in a while you have to tighten the bolts). Just be sure to buy felt pads for the bottoms of the legs if you have hard wood floors.", 
    "I am so glad I purchased these! The price and quality are great! It was exactly what I wanted for the space.", 
    "Bought 6 of these chairs to go around the counter height round table also on overstock.com. They look great and are quite comfortable. Easy to assemble. They felt a little wobbly but when you sit on them, they're perfectly stable. Great buy for the money.", 
    "My husband and I love these. The are firm but comfortable.", 
    "We received our chairs quickly. Putting them together was a bit of a project. It probably took 30 minutes per chair, and required gluing of joints (glue provided), and screwing in a lot of bolts (hex wrench provided). One of the chairs has a bit of a \"wobble\" once we assembled it. We were verry disappointed with the height. We thought we were ordering bar stool height chairs. Unfortunately, as the description says, these are \"counter height\". Our fault for not reading carefully and measuring. We didn't realize there was a difference. These chairs come in one box as a pair, and the height discrepency wasn't noticed until one of the chairs was assembled. Too late to send them back. Bummer!! We will have to try and sell them now, as we cannot use them. Quality is fair (What you would expect for the price you pay)", 
    "We are very pleased with these chairs. Fairly easy to assemble and they look great! We use them more than we had anticipated.", 
    "I was very pleased with this purchase. The material is wonderful, already had a spill, (children) and it cleans so easy. Very comfortable too.", 
    "These look like real leather and are expensive-looking. I ordered the red vinyl, and it's a deep brick red color, really nice. They are very comfortable, too, I get compliments whenever we have visitors. Great buy.", 
    "easy to assemble and they are beautiful!!!!!!!!! better than i could of hoped for.", 
    "Upholstery ok and stain resistant, but legs do not hold up. Have had to tighten and glue them numerous times. I could understand if they were getting wear and tear if we had children. Sorry I purchased!", 
    "The quality on this set of chairs is not what I had hoped for. the cushions are stiff and the leg pieces do not fit together perfectly. This leads to the chairs not being as sturdy as I would have liked.", 
    "I love my new chairs! They are comfortable and the fabric is gorgeous!", 
    "Ok to put together but quality of materials was not well finished.", 
    "Took some time figuring out how to put together the chairs the first time, but once that was done the rest took a lot less time. We had to alter the end of the directions in order to make the pieces fit together, but they are holding up together very well. The fabric is soft and the neutral colors will go with any color scheme.", 
    "After must research, we chose these chairs. They were delivered in 2 days. My wife put them together, all I did was go behind and tighten up everything. They were fairly easy to put together just time consuming. They look great, So far we love them.", 
    "Very nice looking and comfortable. Only negative is that bolts seem to come loose after a while and need to be tightened again every 4 months or so", 
    "Received these chairs quickly. They were easy to put together and look great.", 
    "Love the look, and the chairs are super comfortable. Perfect height for counter. However, the screws keep coming loose the more you sit and it is hard to put together because the holes don't line up with the screws.", 
    "These counter stools added a bit of color to my kitchen. They seem very stories, but were a bit of a challenge to put together. Make sure you have your own bottle of wood glue. The tiny container that came with my chairs was all dried out. The wood glue is a must to ensure the slats between the legs stay in place.", 
    "Nice chairs for the price, but they aren't super well made and don't seem like they will hold up under heavy use.", 
    "Soft and easy to assemble and clean. Great purchase.", 
    "For the price they were a good purchase; should last a few good years (with kids)", 
    "Chairs came nicely packed and timely delivery. Easy to assemble, except for one screw I had trouble lining up into a hole. Only suggestion is get rid of the allen wrench...and get a screw driver type with an allen wrench attachment...love the stripe chair though...", 
    "Difficult to put together and cross bars kept falling off. Ended up taking them off. Look pretty and fortunately I use them only as back up chairs.", 
    "Great for the money. Very comfortable. Not sure how they will hold up over time since I've only had them a few days.", 
    "Good quality and very comfortable!", 
    "This is my second set of these chairs and I love them. They match my red microfiber couch perfectly. They are comfortable. They were simple to put together. Only thing is I wish they weren't so easily stained. I have 3 boys so I spend a lot of time shampooing my furniture including these.", 
    "Love them get lots of compliments", 
    "Shopped for kitchen counter stores that would be reasonably priced. These are good quality, sturdy and nice fabric. Very happy with the stools.", 
    "Purchased these to match my existing chairs. They're just as described. Great set of chairs!", 
    "I bought these recently in the striped pattern. They were easy to put together and seem sturdy. Hopefully the fabric will hold out", 
    "I purchased these for my kitchen island almost five years ago and I have to say they are holding up nicely. One thing I did have to do is get them reinforced. The screws are not enough for long term and high traffic. I actually used carpenters wood and then screwed everything together. As I mentioned, 5 years later and they are holding up nicely and look great with modern or vintage look. Also, they are reasonably priced.", 
    "These chairs are a lot nicer than I expected. They are very comfortable to sit on. That beige sandy looking color goes with just about everything.", 
    "I love the fabric on the chairs. They are really comfortable and easy to put together. I took away one star because the wood is a little light (as in weight) so I didn't feel they were as sturdy. But for the price, they are a really good buy", 
    "We got the striped pattern and absolutely love them. As far as the assembly, once you get the first one down, it's smooth sailing...", 
    "These are great chairs for the price! The color is a nice soft sand and looks great in my kitchen. They were fairly easy to put together, however one of the legs is a bit shorter that the other on one of the chairs, so it wobbles a bit.", 
    "These chairs are in my kitchen. We have spilled food & drinks on them & they clean off nicely. Once a guest spilled quite a bit of red wine.. used paper towels & water on it & you can't even see the stain. They are also very comfortable & the color is nice also.", 
    "no wiggles or wobbles..just a nice comfy affordable chair", 
    "Years ago, I bought similar chairs from Overstock.com. All was well, so I had high expectations. When these stools came the box looked like it had been dropped more than once. Pieces were missing. Reordered and the one stool that was assembled was uneven and did not sit level. Had to return the stool still in pieces, big project trying to get a new box and have it picked up. Finally all was settled and financially I was reimbursed except for my time and aggravation. For the price, next time I will just go to local furniture store, for the few dollars more. Since I ultimately paid to have 3 stools put together and for the boxing up of the 4th stool.", 
    "Easy to assemble and I have gotten many compliments on the quality!", 
    "Love these counter chairs. The six we purchased, arrived within the stated delivery time, were packaged extremely well, were easy to assemble and are very sturdy and comfortable. The overall rating for these stools is excellent for pricing, quality, looks, function. I do indeed like Overstock.", 
    "I've been looking for barstools for quite some time, but didn't want to spend over 1000.00 like all the other websites seemed to have to choose from. I saw these stools had great reviews and decided to give them a try. They are great! Comfy, easy to assemble, and clean up with ease. The price was amazing!", 
    "Arrived quickly and my husband had little trouble assembling them.", 
    "These counter height chairs are NOT comfortable for a 200# male because the support structure of the seat is insufficient to carry the weight permitting the thighs to rest in the chair frame, cutting off circulation. The seem to be OK for someone 150# or less.Assembly was not difficult except for the final use of screws to lock in the legs. Those need to be firmly seated and that requires a quality, properly fitting screw driver.Finally, I mistakenly thought these were covered with a \"wipe clean\" material. Not so! The material is microfiber cloth and can spot and stain easily.", 
    "easy to assemble, of course 1st chair took the longest time, then a breeze. looks great, feels good", 
    "There were a number of problems with this product. First of all, I had ordered the chairs based on the picture and description and was expecting a very light cream colored chair. When they showed up however, they were a deeper taupe color. It would have worked where I was going to use them and I had originally opted to keep them until the product was taken out of the box. The odor of must and mildew was overwhelming. I tried to keep them out of the box to air them to see if the odor would clear with air but every time we passed the chair (before even trying to put it together) the musty odor was was so strong there was no way we were keeping them! The design and quality was fine despite the wrong color, but the musty smell was more than we could take. They needed to be returned. I was very disappointed.", 
    "I was looking for a couple of bar stools that would work for my parents. My father is a bigger man (260 lbs) & I needed something that I felt was sturdy and would hold up. THESE ARE PERFECT! I could not be happier! They are very well made and comfortable! I was so impressed with the quality of this product, that my only regret is, I should of bought two more! My parents keep asking me where I found them (I think they want to buy more). Thank you for the AWESOME product!", 
    "Chairs were easy to put together. The small issue was resolved efficiently", 
    "Stools were very easy to assemble. Fabric color was a lot darker than expected - more taupe than cream.", 
    "These were a problem from the day they arrived. The bottom pieces where you put up your feet wouldnt screw in and I had to glue them repeatedly. After not even a year of almost no use at all, my husband sat and as soon as he laid his back down it snapped! Terrible. You really do get what you pay for with these.", 
    "These chairs are very comfortable and look great in my kitchen. I will say that the quality of the legs are a little questionable, but so far the chairs have held up just fine. Suggestion for purchasers: Be very liberal with the wood glue!", 
    "This was my first time buying any type of furniture online, and even more worrisome is I am from Canada. Which meant I had to deal with duties and expensive transport. Unfortunately I could not find anything similar near where I live and I really loved the style of these chairs. They matched our newly renovated kitchen colors nicely. We got the chairs and unfortunately one set was damaged in transport. Now this is where I was surprised and impressed. At first I was a little concerned about this whole process where we had to send chairs back across the border and I was worried about shipping and duty costs. Overstock let us return the chairs and we ordered a new set that was in great condition. They credited us the full amount on the one set that was damaged including shipping and duty costs.Overstock's quality of service and courtesy towards their customers is truly impressive. I wish all companies can offer the type of service I received. Understandably that buying online, especially furniture, can sometimes have risks involved in product being damaged on arrival. And to add to the mix it had be shipped up into Canada. The way Overstock handled the situation blew my mind, they took away the worry and concern and the best part we did not have to go anywhere. I am going to recommend to all my friends and family the check out these chairs and Overstock.comThank you for the great service.M.", 
    "The quality is poor with legs uneven. Comfort is poor as seat cushions sink down when sat on. When used I feel as I have to be careful not to break them. I am going to replace them with better quality soon. I do not recommend to anyone I would pay more for better quality.", 
    "Poorly made. After a year of daily use the fabric cleans up nicely, but the padding is loose and the the bottom of 2 of the 4 stools detached and can't be fixed. I would not recommend unless you don't mind throwing it away in a year or two.", 
    "I Just love my chairs. The quality of the chairs the look and the style is just what I was looking for. Couldn't be happier, this was a great decision.", 
    "The chairs are great except they are not the color as pictured so I had to return them. They are much darker and beigey.", 
    "I loved these....once I got them put together. They can be a little tricky, but after the first one, the other three were easier. Very pretty chairs, extremely comfortable and sturdy! These look very pretty around my granite counter top.", 
    "These are beautiful chairs, and comfortable. The assembly was easy with good instructions. Although the instructions state that the fabric is stain resistant,my one concern is that the fabric can easily soil due to the location where it is placed (kitchen food bar) I Had to put a protective covering over the back in order to protect them from food stains and general ware and tear.", 
    "I spent months looking for these chairs. I purchased a table 6 years ago that these chairs came with, but after having them for so long it was time to replace them (due to wear). The price was excellent compared to what the furniture stores wanted to charge to order. Now my dining area looks as great as it did 6 years ago.", 
    "These chairs are great! I put them together the next day after receiving them. I like the fact that they are just high enough for little bar counter.", 
    "You have to build the chairs yourself, the quality is not the highest but when they are put together they actually look really nice and high quality. The price is right for these chairs.", 
    "I think O should offer assembly ...could charge a small fee. The chairs look very good...just a bear to assemble......", 
    "We could not afford high quality chairs and even with all the poor reviews on assembling them we still took a chance. Make sure you have real tools, a ratchet socket set with an allen adepter and LOTS of patience. My husband said it is like installing an engine, you need to start all of the bolts then slowly tweak them down, lots of patience and proper tools and you will have good sturdy chairs for a low cost.", 
    "The quality of these stools is so poor. Color is much darker than pictured...more a tan color. I've put together my share of furniture in my life and I have to say these are not very good quality. I'm not going to complain too much because I needed something fast and these stools (and the 2 matching chairs I bought) were incredibly inexpensive. The upholstery is poorly done and I may put slip covers on them if it starts to bug me too much. They are fairly comfortable so not a total loss.", 
    "Didn't know what to expect from this purchase but when the chairs arrived they were beautiful and good quality! The leather is soft and 'true to color'. You have to assembly the chairs but it required minimal time as I do not usally like to purchase items for which I have to assemble. Chairs are comfortable and look great in their new space!", 
    "These chairs look nice but they are poorly constructed. After just 3 months the foot rest came loose and fell off of one chair and the othe one is very wobbly (I bought 2). I had to add some furniture pads to the bottom of one leg to make it even. My son drilled some new holes and fixed the foot rest but for this price you should not have to go to this trouble to make these usable. Very disapointed in the quality. There are better deals out there! My advice, look around.", 
    "3 out of the 4 chairs fell apart. They didn't last a year! They started out comfortable and then they lost their shape. So disappointed", 
    "I have never received such awful product in all my years of dealing with online ordering. Junk! Junk! Junk! Don't get slivers on the wood! Very disappointed!", 
    "I have a feeling this chair looks cheap. Otherwise the quality is ok", 
    "After having wooden swivel chairs for years at our kitchen counter, I decided to go more sturdy and comfortable, and these chairs are both. The fabric is a nice neutral color and the legs are a beautiful cherry wood. The fully upholstered backs are nice since the wooden chairs we had were all scratched up from bumping into things. Assembly is pretty straight forward, just be careful to pull out the staples used to attach the bag of hardware, or they might poke you later. Also get a set of little round chair pads to stick onto the bottoms of the legs to keep your chairs from scratching your wood floor. I'm happy with these chairs, they complement our decor nicely!", 
    "Arrived on time, Easy to assemble but facilitated with good tools. Initially a little unbalanced but adjusted to be just fine. We scotch guarded them and the wife is now thrilled. They fill out a table we bought that only came with 4 chairs.", 
    "Great stools! Very comfortable and a beautiful addition to my kitchen island. Love them!", 
    "These stools are perfect for island in my new kitchen . Sturdy & attractive. The price was great!", 
    "My family (which includes several husky men) loves these chairs. Not only do they beautifully complement my kitchen and dining area, they are also really comfortable! I shopped around at many name brand furniture stores for counter-height stools and did not find anything this well made for the price. Very highly satisfied customer!", 
    "Don't buy these. See specifics above. Legs don't fit accurately. One chair came pre-stained. Legs were so poorly planed that they gap. Major disappointment. They were also shipped in weak cardboard and arrived in misshapen boxes.", 
    "For the cost you should pass on these. Very hard seating for the money. Does not assemble well and tight fit of the cross bar and legs. No more comfy than a straight wood chair", 
    "I love these chairs. I'm very glad I read the reveiws before i purchased. They are very comfortable and everyone loves them! very sturdy is what i needed. i have a family of large men, and they love them as much as i do!", 
    "IT ONLY TOOK ME 30 MINUTES TO ASSEMBLE THE CHAIRS. THEY ARE VERY COMFORTABLE AND THE HEIGHT IS ACTUALLY WHAT I NEEDED FOR MY TABLE. THE QUALITY OF THE MATERIAL IS EXCELLENT FOR THE PRICE I PAID. I WOULD RECOMMEND ANYONE TO PURCHASE THESE SET OF CHAIRS.", 
    "Chairs are good for the price. They came in about a week. The box was ripped in 2 places so was nervous but inside the pieces were ok. 3 main pieces plus screws. Was not hard to assemble but since self assembly, its almost inevitable that they will be uneven. So I had to put some stoppers on some of the legs to even out. That said they are pretty comfortable and the wood legs are a great color and nice wood. Only had a few weeks so will see how they last. Could be more comfortable and wish the legs were not uneven, but for the price, cant complain. If dont have alot to spend and dont need perfection, these work and do look nice.", 
    "These chairs match perfectly to furniture store chairs I bought in 2009, I am so happy I found them as I needed and the price is fantastic!", 
    "Bought it to match my marble counter height table. Perfect match. Assembly was ok.......little ruff with the first chair.....a breeze with the 2nd chair.", 
    "Love these chairs, they are very comfortable and look great in my small dining room. The microfiber is good quality and cleans off well. Only complaint is that it was a little difficult to build. The legs for the chair were hard to get in, but other than that, everything is great! These chairs really transform a dining room.", 
    "Products are great. Shipment took about 5 days because we were across the country from where it was shipped.", 
    "These chairs are wonderful. Took time and patience to assemble them perfectly level.", 
    "Chairs arrived promptly and undamaged. They were simple enough to put together. I was not to happy about the sawdust but it was easy enough to brush off. They looked just like the picture so they matched the rest of my furniture perfectly. They are good quality, comfortable, and what you would expect for the money.", 
    "My husband put this together and had no problem with it. One was a slight bit wobbly but he put pads on the bottom to make it slide easily on our tile and that solved the problem. The description does state that it is 24 inches high but because it is not a solid wooden seat, expect it to give a bit. It will be shorter than anything you had previously that did not have the give of the springs. For the price, I would recommend these. They look good at our counter.", 
    "We needed two matching counter height chairs for our kids' desks. Since they are for kids and won't be used too heavily, I was reluctant to buy some of the more expensive chairs. I liked that this came in a pack of 2 and the price was really reasonable. We had to do some minor assembly - putting the legs and back on. But all the hardware was included and the instructions while not perfectly clear were easy enough to figure out. They are nice simple chairs that blend in to any decor.", 
    "The chairs are dining room table chairs, but imitated hem for bar stools and they were perfect. A little bit darker than the picture but it was ok with the color scheme I was going for!!!", 
    "I really wanted the colour that was pictured on line . and what I recieved was a tan colour I wanted white. should of read carefully because the description said colour PEAT. anyways the chairs are still great and match pretty well so I kept them easy to put together after the first one... (I bought 4) just follow directions", 
    "i ordered this item for our kitchen. when we recieved the first shipment not all the parts were there. we called and they said the parts dept. didn't have the parts and they would send 2 more chairs. we agreed. when we got the second set some of the parts were still missing. i'm waiting to see what they send me next. this was our first purchase and wll be our last. it sad when the shipping dept. can't double check to make sure all parts are in the box before shipping. we are now on our 25th day of trying to get all the parts. who knows what's next!!", 
    "Very nice! Instructions easy to follow Product is a great value!", 
    "I ordered these chairs based on the positive reviews they received. I was nervous when I took them out of the box because they didn't seem to be of good quality. I even considered sending them back but decided to keep them. So far I am happy I did. They look great and seem to be wearing well. They look much more expensive than they were and my family loves them. Take note however - they are definitely not the color they appear to be in the picture - they are most definitely beige/tan.", 
    "I was so pleased with the chairs, I ordered 2 more", 
    "Am thrilled not only with the counter chairs, but also how quickly they arrived. I was somewhat concerned when I saw how rugged the boxes looked on the outside, but the chairs were fine. Took my husband about 30 minutes per chair (we ordered 4) and we've used them daily since. Thanks so much - great chair, comfortable, good quality, GREAT price and quick delivery. I couldn't have asked for anything better.", 
    "These look better in person, but are a pain to put together. I'm very handy, and I love to put ikea furniture together. Easy, fun, productive. On these chairs, the directions were written by a drunkard - not that they matter. The drawings are very useful, but the pre-drilled holes pretty much suck. Unless you're a carpenter, do not start drinking until after you've finished putting this together. A hand held screwdriver will not suffice well unless you have the strength of Thor. I used a power drill and one chair still squeaks and creaks. Oh well, they look nice and are - for the price - good enough. PS, if you are a large boned or heavy person, these will squeak a lot. I wouldn't put anyone over 180 in these chairs for any length of time.", 
    "Only disappointing thing was the poor directions. They didn't really align with the product exactly, but enough to get the chairs assembled.", 
    "Stained the legs a dark merlot color to match my dining room table, and they came out perfect. I followed the directions and was able to have all 4 chairs assembled in less than an hour, with the help of a friend. Definitely recommend scotch guarding the fabric, because of the light color. I really enjoy these chairs and can't wait to get another set of 2, once they come back in stock.", 
    "They were easy to put together. They're so comfortable that we got another set. Great price.", 
    "Putting the product together there were a few holes that were slightly off; fortunately I had the tools (I'm female) and experience to fix it myself. Other than that, they are comfortable, attractive, and sturdy. A very good value for the price.", 
    "I love my new chairs they are extremely comfortable and arrived quickly. The fabric is easy to clean and the cherry wood is just beautiful. Everyone who sees them compliments me on them.", 
    "Decent hardworking chairs used by a two and 5 year old. Clean up well with a sponge and soap. BUT these were impossible to assemble. Holes were misaligned, parts were not properly labeled and it took two weeks & professional help to get them put together. Maybe I received a did set, but it was very disappointing, especially since I wanted to use them straight away.", 
    "I love these counter chairs! After the inital slight annoyance with assembly I am thoroughly enjoying them. The chairs came with exact parts needed for assembly. I needed a screw driver (and a drill is necessary to tighten the screws). The directions are very limited and not really helpful, so most of my annoyance came from not being immediately able to figure out where the screws went. The first chair took over an hour to assemble and 2nd chair was slightly less. All in all, it took about 2 hours in total. I had less of a challenge figuring things out the 2nd time around. However, the bolts and screws for chair 2 didnt go in smoothly which took up more time and posed a challenge also. Having said all this, I would purchase this product again.", 
    "over-all we are satisfied but I do notice the chair that is most used has developed some \"lumpiness\" in the seat. It is not visible but you can feel it when you sit. I can't be sure it wasn't there to begin with or has developed from wear.", 
    "Very good chairs. We love the way they look and add to the decor. Now and I am looking for a new rug!", 
    "easy enough to put together, good fabric, wood seemed fine. Just wish I would have realized they wouldn't slide under our counter...now we're looking at rectangular bar stools.", 
    "Purchased for kitchen/island seating, although haven't used them yet. In the process of remodeling house,but the quality is very good and fabric is also nice for the price. Had no difficulty assembling chairs by myself. The seat would probably be more comfortable if it were longer from the hip to knee surface, otherwise I am happy with them. Service and shipping, as always, is excellent with Overstock.", 
    "These kitchen counter stools are perfect. Very good quality and not too hard to assemble. Ordered 2 sets and paid about $$$ per chair, what a bargain!!", 
    "This was a gift for a dear friend. I showed her three choices before purchasing and thses were her pick for the new kitchen. You can't beat the price for two charis. We assembled them which took a little time because we were so tired from doing other kitchen things. They look great and very rich. We Scott Guarded them and the material took the product well. It is a nice touch in this beautiful kitchen. After seeing this, she is now a member and ordered several other O.Co products for her remodeled home. Thanks O", 
    "I kept waiting to purchase these marseille hoping for the best price. I noticed thy weren't changing and constantly out of stock. I figured they must be worth the money. I purchased them and they were delivered within a week. The first chair took about 45 min to assemble do to the parts being labeled wrong but once I figured it out the second took me 10 minutes. Great chairs! Very durable and look great in my kitchen. Good job overstock!", 
    "I was prepared to pay between $150 and $200 for each counter stool, so I was skeptical when I found these and they were priced so low. I was also concerned that the color would not be what I wanted but because of other reviews that said the color was true to what was shown, I took a chance. All I can say is these were way beyond my expectations. I have seen similar stools priced for $200 each and these look like they should cost that much. We ordered eight so it took awhile to put them together, but once we had the first one figured out, the rest were easy. Couldn't recommend these more.", 
    "I was aprehensive to purchase these chairs - sight unseen. When I got these chairs and we put them togeher (pretty simple). I was quite surprised at how beautiful they were. They are super comfortable and look great at our kitchen counter. Everyone that has seen them and used them quite frankly wants them. I couldn't be more happy with our purchase. Thank you Overstock.com.", 
    "I knew I'd like the chairs, but I didn't know I'd lovethe chairs! They're the perfect height, the perfect color and the perfect fit for my table. Elegant & stylish.", 
    "Love them - easy to assemble and very comfortable!", 
    "Love these chairs. Craftsmanship and detail are exquisite. Will make great addition to any lkitchen or dining room. Will be buying more chairs soon!", 
    "i recently purchased four of these to go at the kitchen island in my new house. They look great and i am very pleased with them.", 
    "These are nice chairs for the price, but one that I got was extremely difficult to assemble b/c of mis-matched screw assembly, and required extreme working patience to make it fit correctly. I figure I made up for the cost savings in sweat equity.", 
    "we love our new chairs. very easy to put together too.", 
    "very nice stools and they fit our needs perfectly. The back of one of the stools didn't come with a hole for the stretcher bar to fit into. Overstock understood and sent out a new one that we received in a few days. The rest were perfect and easy to assemble", 
    "I purchased these chairs to match a dining room set that was about 5 years old. I was nervous about the color matching, but when it arrived it was a perfect match. The quality of the chairs are superb! Very easy to assemble, it took my husband and I about an hour to put together 4 chairs.", 
    "I would recommend these chairs. Great price! I think they will be chairs we will have for a long time. They are very sturdy and comfortable. You get a little fabric pucking but overall these have good quality. I'm making slipcovers for them to get more of the xxxxxxx look I have been seeking.", 
    "I purchased 4 of these chairs to go with a round wood table for my kitchen nook (also from O.co). They probably took about an hour each to assemble; once I got the first one together, the other 3 were faster. Once they are together, they are reasonably sturdy, better than I would have expected for the price I paid. I carefully followed the instructions for how to set the bolts and screws to keep the chair legs against the floor and that resulted in their being quite stable. The most difficult part for me was putting the long screws into the legs to hold them together, but with the aid of a small drill'driver set I was able to handle this (I'm a small woman, no way I could have set the screws by hand; having a second person on hand to put pressure on the parts being joined would make it easier, but I was able to manage it with some effort). The fabric covering is a lighter weight sueded material, which creates a lot of texture to the set. I don't think it would stand up to a long term, family with kids type beating, but for me I suspect it will last a long time. Overall, I am very pleased with the purchase, and love the look they create with the table. Thank you!", 
    "This was the finishing touch on our kitchen remodel. These chairs were easy/quick to put together, are very comfortable to sit in for long periods of chatting at the bar, and the fabric is super easy to wipe down/clean up. Owned them for a year & are still like new. Highly recommended.", 
    "Even though I had read other reviews, I had expected the color to be more a light beige or off white. They are beige, the color of a chocolate milkshake. However, they do match nicely with my kitchen walls, instead of matching my countertop, and they are a very comfortable chair, so I'm keeping them. Assembly was easy the first chair took longer than the 2nd, naturally. Hint, when putting in the side spacer bars, look at the underneath of the chair and match the \"L\" and the \"R\" stickers. If I had noticed that sooner on the first chair, assembly time would have been quicker. Enjoy!", 
    "These chairs are great for the price. The fabric is easy to clean. Love the material. However, as others mentioned the color is more light chocolate milk than the creamy white. The height also is not exactly 24\". It's about 22\". So if you're looking for a lighter color or the right height chair, this is not for you.", 
    "These look very stylish, are built pretty well and I feel I got an excellent value for the price. Putting them together was straightforward, I did it by myself, using another chair to prop on. hint lay out all the screws ahead of time as a couple of them are very similar and you want to use the right ones. And, the set of phillips-head screws with pointy ends are NOT used so don't freak when they're left over at the end. I used lots of wood glue for the cross-bars. All were in good shape and no damage, but part of the connector on one chipped off when I tried to force it (hint - don't force it LOL). Still worked fine with a little extra wood glue.", 
    "love these chairs. they are a little darker then the computer shows but look beautiful. more of a beige color then cream color. easy enough to put together , took an hour for 4 chairs. Very comfortable for our island in the kitchen. they get a lot of use. kid friendly and definitely worth the price. this was our first time buying on overstock. definitely will buy again. reviews of the chairs really helped. searched quite a bit in stores and internet and found great chairs right here.", 
    "I bought a table seperate from the chairs and these match my table perfectly, they are pretty, the material isn't all that great but I'm satisfied with my purchase.", 
    "Love these chairs. Bought them to match dining chairs purchased from overstock of same style and they match perfect. Very comfortable. Excellent, fast shipping. Overstock.com a favorite site to shop.", 
    "I bought these chairs for my kitchen island, they look great. The color is a little off from the picture, they are more of a light brown shade. Pretty simple to assemble.", 
    "These chairs were an excellent buy. They are quite nice, comfortable and look more expensive than what they are. They are a good quality and look very good by my kitchen counter. I also have the dining chairs in this same style and I ordered these from Overstock too. Very pleased with this product.", 
    "Bought the chairs - first of all the server was fantastic, the chairs arrived with 3 days. They are great quality and exactly as described. Can't beat service when it comes to Overstock!!", 
    "Not only do they match perfectly with my couch, they are very comfy and the perfect height for my island. Plus shipping was super fast!", 
    "I am totally please with this product. It was a great price, as always got here quickly. reviews will say and I myself had this slight issue that they are wobbly and uneven. It took about 2 days of using them for that to stop, it just needed some weight to even them out. I bought felt bottoms because I have tile and they work like a charm. As always I love overstock.", 
    "The chairs overall are Great! However, it was not the color I wanted, But all in all, they are sturdy, fairly easy to assemble, and look Awesome in the new place!", 
    "I am not over the top excited about these chairs but they will do their job. The microfiber is really nice and a great neutral color. Putting these chairs together was easy enough. A lot easier than other counter height chairs we own. What makes it easier is the back is already connected to the back legs and the seat part is all put together. You literally only have to put the front legs and the pieces in between on. I am actually using them with a counter height desk I just bought for an upstairs office. Not sure if I would use these in a kitchen though. There is so much fabric I would be afraid of them smelling. If this is the look and type you're looking for: Go for it! You won't be disappointed and the price is right.", 
    "Recieved chairs in good time-didn't assemble till after we moved to new home. We bought 4 chairs and it only took a little over 2 hours to assemble all. All looked great and stain color matched in all. Only disappointmnet was they are not very level. They all wobble. I will find a way to correct. They look great at our center island and go with all our other cherry furniture. We used Overstock a lot for our new home and have not been disappointed with anything we've recieved.", 
    "I love the chairs, I wanted to order then months ago however the ran out, I really appreciate the email alert of the avaliablity. They look great", 
    "I was absolutely delighted with these chairs. The fabric is beautiful and the wood finish matches my existing wood. They were fairly easy to put together and we are enjoying them very much. My only complaint is that they are only sold in sets of (2). I only have room at my counter for (3) chairs, but I either have to buy (2) or (4). I purchased (2) but I need (1) more and I can't buy it. I think you should have the option here. I have always loved everything I have purchased on Overstock, but this is very disappointing.", 
    "Great chairs and great value. We searched and read many reviews before purchasing these chairs. They look great and are very comfortable at counter level. The only problem with assembly was the need to reinforce the foot rest bars with wood glue. Very well made and easy to install if you follow the directions. We purchased matching Parson dining chairs. Very affordable for excellent quality.", 
    "I am very disappointed, haven't received my products UPS tracking said I should of received them 12/11 that didnt happen then is said 12/12 and that didnt happen and now it is not showing anything at all. Cant rate the product since I have not received them.", 
    "Chairs are okay, not super impressed by them. I actually had them sent back when I first got them because I thought they had sent me the wrong chair, and honestly I not sure if the second chairs they sent are the right ones Or the color is just very different from the picture on the site. Not too hard to put together, but don't seem super sturdy like the ones we got with out table."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Parson-Classic-Upholstered-Counter-Height-Chairs-Set-of-2/3471658/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/3471658/TRIBECCA-HOME-Parson-Classic-Upholstered-Counter-Height-Chairs-Set-of-2-07c1d502-75e0-4820-960e-88d949e2b9c7_600.jpg"
  ], 
  "description": "Add stylish seating to your kitchen or dining room with these\nTribecca Home upholstered counter stools. This set of two wooden\ncounter stools features a versatile parsons design that coordinates\nbeautifully with any existing decor. The stools are covered in peat\nmicrofiber fabric and feature spring core seats for comfort and\ndurability. Set of two chairs are a simple, yet stylish addition to your\n  dining setDining furniture constructed of solid hardwood in cherry\n  finishStools feature peat microfiber fabricSpring cushion seat provides durabilitySeat height measures 24 inches highWood finish: Cherry brown or brownUpholstery color option: Light brown microfiber, red\n  microfiber, multi colors striped fabric, red faux leather, dark\n  brown faux leatherDimensions: 39 inches high x 19 inches wide x 23 inches\n  deepMaterialCherry, WoodSeat HeightCounter HeightSet SizeSet of 2AssemblyAssembly RequiredColorBeige, Brown, Cream, Gold, Off-White, Purple, Red, Tan, YellowFurniture Frame MaterialWoodFurniture PatternSolid"
}