{
  "name": "TRIBECCA_HOME_Uptown_Modern_Ottoman", 
  "price": "EUR 114.79", 
  "reviews": [
    "The cushion in the top part is a little sub par, it sometimes shows temporary dents after I remove my feet (i.e the material overtop seems leave a dimple in the fabric). I have a good feeling that over time it will be more noticeable since the cushion underneath isn't the best quality. However, overall, and especially for the price it is a nice ottoman. I got the beige one and unlike the abbyson living claridge beige velvet ottoman I had purchased and returned this ottoman IS the beige that it shows in the picture.", 
    "Super simple to assemble. Looks great!", 
    "Matches my existing loung perfectly!!!", 
    "The Tribecca Ottoman was even more plusher than we expectedThe great style fits in perfectly with our new sofa, love seat and reclinerMom can have her legs nicely elevated now", 
    "Very nice, would buy again", 
    "Very happy with it, using it daily and shape didn't change at all. Lighter in weight than I figured it would be, but that's ok.", 
    "One of the legs I got was chipped. Seemed easy enough to put together. The color is not exactly as shown and as another reviewer said, has almost a cheap denim color to it. I bought the dark gray linen... Def seems a little cheap for the price.", 
    "same quality , perfect match.", 
    "Great ottoman. Serves the purpose I intended it for.", 
    "The ottoman was suppose to be a dark gray. Maybe I am color blind but the color is definitely a dark blue. Would cost too much to return it. It really clashes with my other furniture, so I am going to make a slip cover for it. Lelia Townes", 
    "Did not like the color. Legs were diffective.", 
    "A little small, but great for the price.", 
    "My Shitzu loves this ottoman. It's a nice little piece to go with matching chair we bought", 
    "Absolutely beautiful....but one leg does not fit properly. It looks like it is about to fall off.", 
    "Nice piece of furniture, it goes very well with the decor.", 
    "Easy to assemble and a great piece for either our Uptown Sofa or Chair.", 
    "Perfect size and the color matches my other furniture perfectly. So pleased with this purchase.", 
    "This ottoman was perfect as a coffee table and foot rest for my small living room. It is well made and sturdy to hold a tray without bouncing around. I purchased it in gray and love the color.", 
    "Love this ottoman, sturdy and the fabric is gorgeous", 
    "Purchased the \"ivory\" ottoman and I could not be happier. The quality, color and design are very chic and classy. This was an absolutely wonderful purchase and I would recommend this ottoman.", 
    "Great full size well made ottoman.", 
    "Great addition-using in front of couch with serving tray", 
    "It's fine- good for the money but more of a brown gray than a cool toned gray so doesn't look great with the other grey in my room.", 
    "My mother was so excited to get her ottoman to complete her den. She now has a place to rest her leg's and can move it easily when she wants to get up. ( over 80) Thanks she and I love love it.", 
    "Feels cheap. Doesn't have much weight to it so it feels flimsy. We returned it", 
    "This with the matching chair puts just the right amount of class to my bedroom. also nice to sit and watch tv or read a book in.", 
    "Bought this to go with the uptown modern chair. Colors matched perfectly. So easy to assemble.", 
    "I was skeptical on the quality of this ottoman when I purchased it for such a great/low price. I was pleasantly surprised and very happy with it. I don't think I'll ever go anywhere else but Overstock for my furniture needs - great value! (and super easy to assemble legs to main piece)", 
    "I bought two of these in the brown leather look. They are very comfortable and nice looking in my den!", 
    "This is a little smaller than I thought it was going to be, but I like it very much. Easy to assemble. Good quality.", 
    "I love it! I bought it with the matching chair and the set perfectly completed my small apartment living room. Assembly was easy, you just have to screw in the legs.", 
    "matched my couch already and was super easy to put together. it gives the look of a high priced item. love it", 
    "Ottoman is as expected. Cute and functional. Only had to screw in feet and set with a nail. Great for the price!", 
    "A good ottoman for the price. Nice color and fabric.", 
    "Very easy to put together and looks great!", 
    "Matches my Tribecca chair perfectly and makes a much more comfortable set. Easy to put together and sturdy.", 
    "Compared to my previous ottoman I was replacing --this one was a disappointment. In photo it appears nice but it is actually cheap looking in reality. Very little cushion and very hard. I like using this piece as coffee table, foot rest and extra seating. This will probably only work for one. If you are looking for all those functions, spend more and get something more substantial. This isn't it.", 
    "Really good match to the Studded Club Chair by Christopher Knight. I purchased for my husband. Wonderful quality! Thanks!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Uptown-Modern-Ottoman/8767735/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8767735/TRIBECCA-HOME-Uptown-Modern-Ottoman-b03e655e-200b-4625-9dc4-2d45c1b7c8a8_600.jpg"
  ], 
  "description": "Bring comfort and style to your living room decor with the Uptown\nModern ottoman by Tribecca Home. This gray linen ottoman comes with\nample foam filling for maximum comfort while you lounge. The modern\nstyle is clean and simple, so it looks great as a standalone\nfurniture piece or alongside your couch or sofa. Set includes: One (1) ottomanMaterials: Asian hardwood, linen, foamWood Finish: Espresso or cherryUpholstery color: Grey linen, dark grey linen, light brown\n  microfiber, white linen, mocha microfiber, sage microfiber, dark\n  brown faux leatherUpholstery fill: Premium foam       Foam density: 24Cushion thickness: 4.5 inchesDimensions (overall): 18 inches high x 27 inches wide x 20.5\n  inches deepStyleModernMaterialFoam, Linen, Upholstered, WoodTypeStandard OttomanFinishEspresso, WoodSeat HeightCounter HeightShapeRectangleAssemblyAssembly RequiredColorBrown, Green, Grey, WhiteFurniture PatternSolidGallery MatchYesGallery RoomLorimer"
}