{
  "name": "TRIBECCA_HOME_Uptown_Modern_Sofa", 
  "price": "EUR 464.58", 
  "reviews": [
    "Overall pleased with the purchase. Like the look, color, size, & structure of the piece. The things you cannot tell from the description are that the cusions are not finished on the bottom so there is no opportunity to flip them if they get stained. The bottom cushions also slide out badly, we put that rubber no-skid stuff underneath that helped a bit, but they still slide out. The sofa is very firm and nearly bouncy. I would recommend it more for a sitting room than a family room, even though i really like a firm couch. You will need to buy bolsters or other throw pillows to put against the arms as they are very hard too. With two toddlers anything we bought would need to be replaced within 5 years anyway b/c they're going to get messed up which is why we bought these, and I think they'll do fine!", 
    "First of all this sofa is actually much darker then it looks in the picture. When it arrived I realized I didn't really know what color peat is, so I expected the couch to look like it did in the picture. It is more of a dusty brown, not chocolate but definitely more brown then tan. That being said I'm very pleased with the sofa for its price. My boyfriend didn't seem to have any trouble assembling it, although he is handy. It took him about 30-40 mins I would say. The sofa seems very sturdy so far and the three cushions are firm. Definitely not the most comfortable, but comfortable enough that I have spent Saturdays laying out on the sofa lounging. The sofa cushions arent attached to the couch so sometimes they will slide out of place. I don't know how well it will work with kids, because under the cushions there is a thin material covering the wood base and like I said the cushions will move. Overall I believe this is a good buy for a start out sofa or just an inexpensive sofa.", 
    "Great couch. I put it together with one friend. Was worried about the back not having cushions but it is very comfortable. Put it together with one friend and was quite simple. Remember to remove the velcro with screwing on the arms. Great and well made couch and worth the money. Wish the love seat was still in stock.", 
    "Sofa arrived in three packages and was easily assembled in approximately 30 minutes. Construction of components appears solid and well-made.Microfiber has a plush feel to it when brushed.Style works well with a variety of decors.", 
    "Also bought the loveseat. Very easy to put together. I did it myself, did not need another pair of hands. Read my review under loveseat.", 
    "I recently bought this sofa in grey. After reading the reviews I had a good sense of what to expect when this sofa arrived. I find that most of the reviews are accurate. First off, if you are looking for a \"main\" sofa for your living room or entertainment room where it will experience constant use, hit the back button on your browser and keep looking. You will be disappointed with the build quality and comfort.If you are like me and want something that looks good and will be used only on occasion but don't want to spend top dollar, this is the one for you. I bought this because I have a sitting area in my bedroom. I was looking for a high end looking sofa but didn't want to spend the money since we really don't sit there often. Keep this in mind before buying:1. It ships in three separate boxes and you have to put this together.2. Like all assembly required furniture, something is not going to screw in right3. The fabric is decent quality4. The grey linen is a tad bit darker than on the screen but not enough to cause concern. I ordered this sofa with the Q Inspire King bed in the same grey linen and they are a tad different in color but again it's not that noticeable.5. Cushions are very firm. Hopefully they will break in.6. BE CAREFUL OPENING THE BOXES WITH A SHARP OBJECT (I.E. BOX CUTTER, KNIFE). You might cut into the actual sofa", 
    "We love our sofa. Very attractive. Very firm cushions. Narrow arms means it takes up less space.", 
    "Don't be fooled by the looks. This couch is not only incredibly uncomfortable, the cushions constantly slip out, and we have had it for only 6 months and it is about to fall apart. The wood used in the frame is so cheap, 5 of the screws have fallen out and stripped the wood. We purchased the additional warranty on the item and are in the very very long process of trying to have the insurance company look at it. However, in reading the fine print of the warranty now, it says if they deem it to fall under the parameters of the warranty, they will send someone out to try and repair it. If they cannot repair it, they will refund the cost of the warranty- not the couch!!! So basically, there is no real warranty. It's ridiculous.", 
    "The shipping and arrival was much faster than I anticipated. The assembly took 45 min with the help of a friend and overall its a good couch for the price. It has been about 6 weeks and I can honestly say that the cushions do slide but I read an earlier review stating this. I purchased some velcrow and applied it to the bottom of each cushion and the wooden slat the cushion sits on and that has done the trick.", 
    "I recently moved into an apartment and am not sure how long I will be here thus - I didn't want to invest a lot of money in furniture. I went cheap and it remains to be seen if I will regret it. The appearance of the couch ( and matching love seat) is great - very cute, great dark beige color and I even like the material. But these are the hardest sofa's I have ever sat on. I had friends over the other night and noticed that after awhile some of them optioned to sit on the floor instead of the couches! Argh! I bought a bunch of very soft pillows to make the couches look less like waiting room couches and more comfortable - we will see if they soften up over time.", 
    "Very pleased with this sofa. Firm and good quality fabric that's washable ( a plus). The only warning I would give is that it comes without any assembly instructions; the parts are all there, just be prepared to spend some time figuring out how to put it together.", 
    "I saw that others mentioned that it was darker than the picture, but I wasn't expecting it to be that much darker. If you look at the Uptown Mocha version I think that is pretty close to the actual color of the couch. Overall though it's a nice sofa. Easy to put together.", 
    "After searching for days for a sofa and love seat set for my apartment, I decided to go with the Uptown Collection Peat Sofa and the complimentary loveseat and they are just fantastic. The reviews of these pieces are also very accurate so I was not surprised with what I ended up with. As other reviews have stated the color is darker but not dark. It's a much richer color than depicted and is still definitely in the \"beige/light brown\" family. Assembly wasn't difficult after my room mate and I deciphered the directions (they are more like Ikea directions - pictures only; and I would venture to guess for some the pictures may be hard to understand). It took a little over an hour to put together the first, but the second went faster when we got the hang of it!", 
    "I have had a two-seat version of this same sofa for three years and it is impecable. I just bought this three-seat and I am very satisfied. As other reviews describe, the color is definitively darker.", 
    "I really l.ike tthe couch, it is firm, and comfortable. Nice color, and was delivered promptly. The only thing is it is a little small. If a single person is laying on it, it's perfect. But if 2 people want to lay on it, it's impossible...i think I will be buying an automan.... but overall its a really nice couch.", 
    "This is a very poorly made couch. The pieces don't line up for assembly properly and the fabric is terrible.", 
    "I've never been so impressed with the blind purchase of a piece of furniture... we all know how scary that can be, and I have about 4 previous horror stories on doing so; which makes me wonder why I would ever try it again. But I took the plunge, and I am sooo extremely thankful that I did. This sofa is quality built for a great price. I'd say a medium-end sofa that has the esthetics of a much higher end sofa. I only say this bc this is not real linen, hence the great price; however, it mimics it beautifully. It's also amazing at wiping up spills without having to scrub or use crazy products that leave even bigger stains. For a mom of a 1 yr old little boy, this makes the sofa worth it's weight in gold.It was easy to assemble (I did it myself without the help of my husband, as he was angry I'd made the suprise purchase without his approval) but it took me less than an hour from start to finish.When I sat down, and then laid across the sofa, I was BLOWN AWAY by how supportive the cushions, arms and back were. I've spent double or more on sofas in the past, both online and in department stores, and the durability of this couch is comparably unprecedented. We've now used the couch on a daily basis for around 2 1/2 months and it looks and feels as good as day one. This includes long weekends of binge watching Netflix, and the occasional overnight sleep that came after not wanting to pause an episode for the next night... Making a Murder, anyone? I sing Tribeca Home's praises and dare say they've made a lifelong dedicate fan of their furnishing that I will no doubt purchase more of in the very near future. Finally, a furniture company with a well made product at a reasonable price. And no, I am in no way affiliated with this company or with Overstock. I simply felt compelled to write a thorough review of a well-made product, and I tend to get excited when something impresses me as much as this sofa has:-)", 
    "color not quite accurate, not all parts provided to put together, seems like this fabric is thin so not durable and the cushion material indents quickly.", 
    "The grey linen couch looks better than pictured! The quality of the fabric is definitely worth the price. I have been searching and scoping out different local shops as well as online stores--by far, overstock wins by a land slide. I was a bit weary of the reviews that said it was hard to assemble, however, I was able to figure out quickly how to put everything together (could be partly due to the extensive amount of ikea furnitures I have purchased in the back). The directions were all just pictures. All in all, I would absolutely recommend this couch to friends and family members. A good buy!", 
    "I love this couch. It arrived in 3 boxes, put together in less than an hour. The cushions are firm and springy, Had it for a few weeks now and the cushions have not squished down at all. Looks very nice in the living room. The color is darker but many people had said that so I was prepared for it upon arrival....no problem at all.", 
    "With the purchase of this sofa, my living room is complete. It is a beautiful taupe color and fits with the blue and brown leaf chairs I also purchased from Overstock. The size is perfect for a smaller room and was a very easy to assemble. BUY !!", 
    "Purchased the white linen sofa before the Holidays for a seating area near our breakfast room. Quick delivery, had the couch in 2 days!! Received so many compliments on this sofa as it's very stylish. Stylish it is, comfortable it's not. I would not recommend this sofa for an area that has kids, pets or both as I can't see how the fabric, which is very thin would hold up. It's fine as an accent piece. I do have to say that for the price I love this sofa!", 
    "The quality of this purchase is shameful. I *literally* have taken the sofa apart to not only fit it with better fasteners, but I have honestly had to cut out broken cross-members and replace them with solid pieces of pine with proper glue and nails. Do yourself a favor, unless you plan to simply have this in a corner looking pretty, save your money.", 
    "This sofa looks formal for a front sitting room but is actually quite comfortable. It seems to wipe clean easily enough which is good since it is white and I have 4 kids and 2 dogs.", 
    "Was fairly easy to assemble but the seating is short from front to back and rather hard and not very comfortable. Looks nice though.", 
    "We bought this to replace our oversized sofa in our living room and it looks great. The color is like other reviews have said. I'm glad I trusted their description of a little darker. It looks better. The only thing keeping me from giving it a 5 star is are the arm rests. The padding on top seems to be the same as the side which allows you to feel the wood below when you rest your arm on it. Otherwise, I enjoy the look, the style, the comfort, and the price.", 
    "Assembly was more intensive than I'd anticipated, but the results are beautiful!", 
    "it's beautiful, get a lot of compliments. sturdy. one arm came mis-drilled, but after a few go-rounds with overstock, they replaced (by shipping all 3 boxes, even though arms only came in one...blah blah blah). Easy to put together, once I figured out their construction error. I'd give it 5 stars if the cushions could be flipped over...don't know why manufacturers can't just add another 12\" or so of the same fabric. :?", 
    "It's fine for the value but the seats sit very hard and the depth of the seats are shallow. Upholstery is holding up and the color is fairly true to picture.", 
    "Not bad for the price but did have some issues with the interfacing used for the bottom of the piece tearing easily.", 
    "Turned out to be a pretty comfy couch considering the price. It fit perfectly as the measurements were accurate. Delivery was fast. The only complaint: Non-existent directions as to how to open the Velcro part on back of couch to screw in arm rests.", 
    "This is the hardest couch that I ever sat on. not comfortable at all.", 
    "This couch has the look and feel of a dorm couch. The couch's exterior material feels very cheap, as though it is made of pure polyester. The firmness is fine with me, but again, think the firmness of a new college dorm couch. The backs of the cushions are covered with a black material instead of more grey material. In other words, if you spill something on the cushion and it stains, there is no option to flip the cushion over. Assembly of the couch was not particularly easy and one of the legs appears that it is on its way to falling off after only a few weeks of use. Do yourself a favor: spend a little more money and get a couch that will last and that isn't made to be thrown away in a few years.", 
    "I read all the reviews before I bought this soft and I should have listened. I'm not impressed. The price was good, but the couch is just ok. I purchased this for a formal living room that doesn't get much use. The main downfalls of this sofa are that it is small and the cushions don't fit. They look awkward, like they are on the wrong sofa. I seriously debated about sending it back, but didn't want to deal with the hassle. I will most likely but outside at my next yard sale and I'll take a significant loss on it.", 
    "Started out very firm but became less firm after a few weeks. I've even fell asleep on it a couple of times. I'm not sure I would have purchased it if I'd had a chance to try it out in a regular store. it has clean contemporary lines and looks quite nice. I don't hate it but I'm not totally in love either. It's just okay.", 
    "Buying things online always makes one skeptical but I took a chance anyway considering this couch looks so chic in photos and I was in desperate need of living room furniture. Best decision ever!! It was easy to put together and that's saying a lot considering I'm the worst at assembling everything lol. It's firm but still very comfortable, it looks fabulous in my living space, it gives the room a look of modern elegance, and the price was perfect. Love this couch and you will too.", 
    "I actually hate this couch and wish I returned it before I threw away the box, but I was so eager to just have a couch to sit on in my new apartment, and returning a couch is just a ridiculous hassle. In an effort to save money I went with this sofa, and I expected it to look sort of cheap - but it looks and feels REALLY cheap - and I hate sitting on it because the cushions slip off the every time, very annoying. Its like there isn't enough space for the cushions to lay nicely. I decided I need to go purchase giant velcro strips to put under the cushions so they stay in place. I can live with this couch, it isn't that uncomfortable - but if I were you I would take your money to \"\"\" or wait for something you really like to go on sale before purchasing this one. The instructions to put it together are also really cryptic and annoying.", 
    "Sofa is much darker than picture - definitely a shade of brown and not grey. Sofa comes in 3 boxes to be put together. I put it together myself and only ran into issue when I realized that one of the predrilled screw holes didn't match the assigned hardware, by that time I couldn't get the screw out. I don't anticipate the sofa to last more than a year - but hey during that year it will be a cute addition to the room.", 
    "There was a problem with the delivery, which should have consisted of 3 boxes, but only 2 arrived. Overstock customer service was very helpful and polite and gave me a date when the 3rd. box would be delievered. When I got home that night, the box was there; so, all's well that ends well on that front. About the couch itself, well, it's a $XXX microfiber couch from China, and that's exactly what it looks like (this piece of surniture will not be knocking anyone's socks off). I put it together myself and had some difficult moments, but I'm sure it would have been easier with someone hleping me. What I wasn't thrilled about was that the legs didn't fit in as well as I thought they should have and it took quite a bit of maneuvering to get them to a point where they didn't feel loose. The couch does creack a little (doesn't feel completely sturdy, no matter how much I play around with the screws) and it's defintiley firmer than I would like. I suppose the firmness may subside as time goes on, but the creaking isn't going to get better. Also, it is smaller than it appears in the picture. I needed couch for the sitting room in my new house, and this couch certainly gets the job done at a price I could afford. My advice is that I would not expose this couch to kids, rough treatment, or situations in which it might get stained (it is a light brown color and I can't imagine that stains would come out easily) In summary, for the price, this couch does what I need it to do, but it uses are limited.", 
    "Easy to put together, with only a screwdriver and an allen wrench.", 
    "It's a cute couch. It's a little on the light side meaning the durability is still in question. Somewhat expensive considering the work you have to put in to assemble it. Other than that, I like it.", 
    "This couch is BROWN! It is nowhere near beige. I was so disappointed when it arrived and I will have to return it. I was hoping for a much lighter color. The couch is very firm and bouncy but we liked it...just completely did not like the color.", 
    "The color is darker than the picture, but very comfortable, perfect size for an apartment and very easy to assemble.", 
    "We like the size and color of couch. Cushions are firm, but not the firmest we have had. I did have to had some velcro on the inner to keep cushions from slipping. It was not excessive just a too much for me. I use it daily at 8 months pregnant and it has proved sturdy.", 
    "Amazing quality, firm and looks very expensive. I LOVE IT!!", 
    "Very chic, modern and very easy ti set up", 
    "A little firmer than anticipated.", 
    "You have to out it together (shock) eye-roll. If you want modern this is it. If you want visitors to sit for awhile and leave this is the couch you need! It likes just like the picture when complete. Moving around to adjust to your living space is easy.", 
    "This sofa is currently being used in my home office. Appropriate for everything from clients to grandchildren! It arrived quickly and in perfect condition. Cushions are thick and one piece back keeps it looking put-together at all times.", 
    "Just like the picture. Great price.", 
    "We love it... Legs were cracked at shipping but overstock sent new ones.. They stand behind their products. I love the color light brown and so prettytoo.", 
    "Once I put the sofa together, it was perfect size. The color also matched perfectly with the accent chairs I purchase. Love it!", 
    "This is not what I expected. Looks great in picture but quite small and unimpressive. Good for tiny apartment only. Returned immediately.", 
    "Great sofa. Easy to assemble especially when you know about the velcro pocket on the lower seat good firm. seating", 
    "Bought one sofa, loved it, and bought a 2nd sofa to match. We got grey linen, and the color is just right. Cushions are firm, and they move a bit, but not bad. I shopped everywhere and couldn't beat this price. It comes delivered in 3 boxes, and the assembly took us about 45 minutes. Note - the bottom of the couch has a Velcro opening so you can reach in to access the screw holes.", 
    "I bought this couch less than a year ago and last week, I was sitting on it as it fell apart. It came in three boxes on three separate days, and included the worst instructions known to man. It prides itself on not requiring power tools to set up, but you basically just set the back on the legs and pray that it doesn't fall apart. It's uncomfortable, flimsy, and I can't wait until I get rid of it. Don't waste your money.", 
    "Easily put pieces together, comfortable. We like it!!", 
    "Both my husband and I love it. We going buy the same one from Kohls till we saw it here for less price.", 
    "easy to put together, looks nice with blue grey walls , not as big as I thought it was going to be", 
    "This is a perfect size which can be hard to find. I love the slim arms which makes it space efficient without losing seat area. The fabric is nice and cushions are comfortable. Delivery was on time as advertised. A good value.", 
    "easy to assemble, took me 30 min to put all the screws in and voila, you have a cute couch for your living space.", 
    "The legs are fallen apart. now i have to rest the sofa on the wall for support. Buy it if no body will ever seat on it.", 
    "However, the cushions slide. I got Velcro to help stay in place but other than that it's great!", 
    "bad purchase,will never buy furniture online again", 
    "So beautiful but uncomfortable and a little bit tall other than that it's great!", 
    "This couch was everything I hoped it would be. It arrived within two days. I put it together by myself. I ordered the light grey and it's beautiful.", 
    "hi if you like to sit up straight and sit by yourself, this is your sofa, no relaxing here", 
    "I really like the style of this sofa and it has a decent quality. Bought it for a rental, so I picked gray. I would love to see it in the off white. The brown also looks like it would be a great color.", 
    "This sofa is not well built. Cushions are hard. Arms are not well padded. Luckily this furniture won't be used very often or I would be buying sofas again next year.I won't buy furniture online again. An expensive lesson learned.", 
    "I got my Sofa and it was just as stated! I had to assemble it but when it was put together it looks amazing!", 
    "We love our new couch! It was easy to put together and comfortable!", 
    "While the price point was really good and I actually assembled it myself, I am not fond of the fabric. Overstock ships quick!", 
    "I purchased this couch for my front living room that I don't use very often. It feels sturdy, and it was decently easy to put together. I ordered the dark grey linen, and it is pretty true to color. It almost has a bit of navy in it depending on the light and what you have around it to accent it. It's also pretty comfortable for the price!", 
    "Beautiful color and fabric", 
    "Very easy assembly, nice clean lines and gives the appearance of high end furniture. I'm absolutely a satisfied customer", 
    "It came quickly, was easy to assemble, and fits really well in our small space! It's comfortable and we're enjoying it.", 
    "I had been searching for a smaller sofa--bigger than a love seat for our family area. This just fit the bill. We hired a professional to build it and the matching chair--well worth it. Not a forever set, but it serves as a transition after our move.", 
    "Easy to assemble although it was missing a washer and screw so a trip to the hardware store was necessary. The color is perfect. The style is what I was looking for - modern and sleek. I'm very pleased with purchase. Delivered on schedule as promised.", 
    "It was fairly easy to put together. I find the legs a little too high, I bought shorter legs. The cushions are a little too big. It's rather firm to sit on. With decorative pillows it looks good.", 
    "This couch has been ideal for our living space and the gray color was exactly what we had hoped for. Easy to clean and looks great with its simple lines. On a side note, it is a light weight couch and does tend to be easily pushed back if it isn't up against a wall. But other than this, it's a great purchase for the price!", 
    "At first I thought the couch was to small but once it was put together it was great. I'm all about couches that sit high up and firm and this does just that! Only problem I can't get the love seat to match.", 
    "Not very difficult to put together, it's nice and solid.", 
    "Not a very strong sofa as thought it would be but serves the purpose.", 
    "Looks great! Just really not that comfortable.", 
    "It is nice. I was surprised to have boxes and not an assembled couch arrive. That mean an additional expense to get someone to put it together as neither my husband nor I are able to manage that physically. Also, one leg was cracked - made me think that the company didn't inspect the sofa before shipping it.", 
    "Not comfortable what's so ever!", 
    "We actually love this couch. Really easy to put together. Maybe we prefer firmer couches, but we also find that its pretty comfortable as well. Reading the reviews made me nervous, but I'm glad we ordered it because it is perfect for our family. The dark grey couch is like a charcoal grey, again, perfect for us, but heads up on that!", 
    "Have a Studio and wanted something that i could use infrequently for guest, to watch TV and to work on Laptop on. would recommend for a new studio owner", 
    "It's a very simple design that seems to work well. Not sure how it would handle 3 large adults, or some rowdy children, but its ok for the price.", 
    "The sofa was easy to assemble and the fabric is nice. But, one of the screw holes was damaged. Instead of sending the sofa back ( a lot of work), I went to the hardware store with the screw, bought a screw tap to match, and then rethreaded the screw hole. This worked and the sofa looks lovely in the living room.", 
    "very cheap feeling, very light weight", 
    "Cushions are extremely fluffy. Comes in three different boxes. Very easy to assemble(i had my own tools, but it comes with tools as well). The couch serves its purpose.", 
    "Not for average family room use; not deep enough or soft enough to sleep on. Just slightly stiff. Good for den or home office.", 
    "Definitely a hassle getting those 2 back screws to attach the arm sides but besides that the assembly process was quick.", 
    "sofa is narrow but my fault, did not do my research. Next time will definitely spend the money are a much better couch.", 
    "Took 15 minutes to put together and makes a nice addition to a small room. The couch is small so not to be used at a main living room piece.", 
    "We have a tiny old house that does not allow furniture to be brought in. Choices are limited. This couch comes flat packed and assembled easily, a plus. Unfortunately, it is stiff and uncomfortable to sit on. It looks good, not great. Hoping that it will \"break in\" and be a bit more accommodating!", 
    "The couch is smaller than I thought, and the cushions stick out as well as slip A LOT. It's otherwise comfortable if you don't move at all. I am going to keep it, but move it to an area that's less used and replace this couch with something better.It is sturdy enough though, doesn't seem weak. Just the cushion situation is annoying.", 
    "When I received my package, I found that one of the legs was missing! This couch is fair for the price. pretty uncomfortable. hurts my back every time I sit on it.", 
    "Easy instructions when assemble. Do do need another person to assist. Great quality. I would buy another similar ones.", 
    "I dont normaly post reviews for anything....but this is the most uncomfortable and ugly sofa. Poor design with no effort into function or comfort. If your wider then 14 inches lwidth wise, you will not be able lounge. Delivery was great as is the norm for overstock. Assembly of the \"hard bench\" was easy. Would love to return it but breaking it down and reboxing it is not an option. Its going on the front lawn for free today.", 
    "I was definitely skeptical buying online but the couch looked amazing when it came. It came well packaged in three boxes. The assembly wasn't the easiest but probably cozy I did it alone. but once put together it looks stunning. I bought the light grey color. I'm glad I didn't buy dark grey. This one was slightly darker than the picture but that was perfect coz I was looking for something in between the light grey and charcoal. So depending on how much light you get in the room the color may or may not be as dark or light as you expect. But overall really happy with the purchase. The couch is very sturdy. It's definitely on the firmer side but by no means uncomfortable to sit on. Perhaps the couch looks nicer and chic because it's firmer. Definitely recommend it.", 
    "this is a cheap couch, I won't put in my living room. And the bottom cushions stick out too far, looks like they don't even go to the couch. It looks cheap and feels cheap. I don't think it will last long. The bottom doesn't have much support underneath the cushions. No springs.", 
    "nice but the color is more green than i expected.", 
    "I was nervous picking a sofa w/o sitting on it, but all in all, evrythg turned out perfect. Happy w/choice.", 
    "A little stiff at first, but the cushions break in with use, they do not stay in place, though. The cushion is longer than the base and each slides out or gets tilted up in the back if whoever sitting on it puts any sort of pressure on it when getting up.", 
    "I'm happy with my purchase! Good \"bang\" for my \"buck\"!!", 
    "easy to put together, better for a bedroom or guest room or office not a family room", 
    "This is the perfect size for my small condo. The fabric is good quality and the gray goes with any color scheme. The first night I spilled red wine on it and it cleaned up great, no stains! Easy to put together too. I would recommend highly.", 
    "Purchased this sofa to use for staging homes. The sofa is nice to look at and easy to put together. The seat cushions are comfortable but the back is hard. I love it for staging purposes but wouldn't use it for home use.", 
    "Bought this for a room that doesn't get used much, it's firm but more comfortable than expected. Light gray color looks great although the fabric had two 5 and 6 inch flaws in it, it wasn't worth returning for this small issue though and overstock was nice enough to give me a $$ credit for the inconvenience as I had to buy two throw pillows to cover the flaw. Otherwise I would have given it 5 stars.", 
    "Pleased with sofa. I'm not sure that I would put it into my living room, but it's great for the family room. It takes the kids and the cats abuse and it looks attractive with the rest of the room.", 
    "Prob not an everyday sofa but looks good and for the price its great.", 
    "I'm glad I read the other reviews as they were helpful in the assembly. Overall, I'm very pleased with this couch. It did take about 45 minutes to an hour to put together. My cushions don't slide out very easily, but I can see that because they are not secured, and the way my dogs play, that they might come up. I will probably just get some velcro and attach it to the bottom of the cushions to keep them in place. Other than that, I really like it!", 
    "The sofa was easy to put together. I was sure I would need some assistance but it turns out I did not. I was able to assemble the sofa without the need of extra hands. The sofa is firm, which is not bad at all. I wish that the sofa was as wide as the cushions. The color is great. The sofa seems sturdy so far. I have had one person sleep on it and thankfully it didn't collapse underneath them. So overall I'm happy my purchase and the quality of the sofa.", 
    "Easy to assemble and really nice.", 
    "really nice couch for the price, a little narrower than anticipated but not bad. Firm, but comfy. We ordered the light grey linen and it's a lovely color.", 
    "It's a basic sofa, no frills. The fabric is a neutral, deep beige, slightly darker than pictured. It wipes down well, and looks refreshed with a light brushing. It's ok, nothing to get too excited about but it does the job if you need something simple at a good price.", 
    "Just what I was looking for...now to find pillows to make the room pop.", 
    "At first the color was not as white as I wanted it but at the end it turned out to be better it u have kids this will jump on the couch this is not for u but it's a beauty display.", 
    "We returned this sofa after opening only one box. It is by no means white.", 
    "For the price it's a good buy. It looks elegant dressed up with pillows and a throw but not super comfy.", 
    "Looks good, easy to assemble. I'm glad it came in pieces so I could get the boxes up my windy staircase.", 
    "cheap feeling material, cushions don't stay on, AND it caved in under one of the arms after a few days causing the leg to go cockeyed and inside the couch. so disappointing.", 
    "The couch comes in 3 boxes. 1 of the box contains the nuts, bolts, and screws. You would think they packaged those in a little bag, but no. There were just scattered everywhere in the box. And I was missing a screw. Very disappointed in this couch. Material feels very cheap as well. Couch is not sturdy. I definitely recommend spending a little more money on another couch.", 
    "small but perfect for staging our home that is for sale!!!!!", 
    "Easy to put together and looks nice. Don't think I would use for everyday use, but it is just was I was looking for to create a casual living room.", 
    "Great looking couch! Easy to assemble! Now I will say if you're looking for a couch to get cozy on and watch a movie keep looking this is not the couch. It's ideal for an office or guest suite, somewhere that you just need a sitting area. I haven't really had an issue with the cushions like some. Great deal though and looks beautiful!", 
    "We got this sofa in the light brown microsuede. I am disappointed in the look as it looked much nicer in the picture. It is very ridged to sit on, and the feet (due to secure screw hole placement - not threading screw) do not go the correct direction when they are screwed into the bottom of the sofa. If my husband didn't already recycle the boxes, I would send it back. I would keep shopping and not buy this sofa.", 
    "Inexpensive, easy to assemble. Not that comfortable, foam is hard", 
    "Easy to put together, attractive sofa. Seats are a little springy but they'll be worn in soon enough. Happy w/ this purchase :).", 
    "I read the other reviews that this sofa is firm. That is what I wanted, I hate when you sink in and can't get out of a sofa. So far it has been a few weeks, I feel asleep on it 3 times, I like it. It is not huge, it looks sleek and modern. My husband put it together and it took a little over an hour. He likes it too. I am happy with my purchase.", 
    "This sofa is exactly what I was looking for. Perfect size, perfect color, loved the style. The cushions however are made of some horrible combination of springs and foam. Unfortunately after only 3 months of owning the couch I can easily feel the springs pushing through the cushions whether sitting or laying down. It's too bad they skimped on the cushion construction when everything else is so great,", 
    "this is a started couch. i love it. but the cushions are a bit hard. which im guessing will get better once properly broken in.", 
    "Love this sofa easy to assemble . Very sturdy and moderm", 
    "great sofa for my new apartment. Very easy to put together and I received it the next day after I ordered it!", 
    "We are very pleased with this couch. It is a perfect fit for our living room. Took a bit of work to assemble, you'll need two people. The couch is very firm and comfortable. It's not used for everyday use. Perfect for when guests come.", 
    "I was sent half white and half grey couch pieces to my tiny apartment. They exchange process was so horrendous and took so long even though I followed their exact instructions. The couch works but it is NOT worth the hassle with this site.", 
    "the moca color is to dark, it is more like espresso. I had to return it", 
    "Solid piece and comfortable at that! Our neighbors love it too! Great construction, pleasantly surprised as to the quality and construction.Excellent deal!", 
    "If you are going for waiting room furniture than this is your sofa.", 
    "I bought this sofa for its classic, modern lines and neutral color. I was fortunate to find this sofa on sale at an incredible price and it was delivered in THREE DAYS! The instructions were simple to follow and it took me less than an hour to put together. The only \"problem\" I had was the hardware package had been torn open and some of the washers were missing. Luckily I'm a major DIYer so I had some that would work. The fabric is a nice heavy linen in more of an off-white. I read that it wasn't a true white in other reviews so I was fine with that. The cushions are firm, but not uncomfortable. I relax on it daily and watch TV on it every night. I made accent pillows to match my decor and can change them with the seasons which is why I love the color. I LOVE this sofa and I'm thinking of purchasing the loveseat.", 
    "This couch is really stiff and really light weight. I'm always worried its going to break when someone bigger sits on it. Also the light grey linen has a purple tone to it.", 
    "Nice looking, and fairly comfy but one of the front legs broke off the second day that I owned it.", 
    "As many of the other reviews stated this sofa is stiff.....but for the price it looks fine. I ordered two....one had a defective leg and stains.", 
    "I've never ordered a couch online, so was a bit apprehensive. It was a bit weird having to put a couch together, but it was delivered extremely fast and I really like the look of it. It fits my small space well and the fabric is nice (kind of a twill feel). It is harder than I expected, but does seem to be loosening up over the last couple of weeks. For the price, it is a good value, it probably won't last more than a couple of years with consistent use though.", 
    "Nice couch especially for the cost. Easy to put together and it looks good. Does not look like what it costs.", 
    "This is s pretty good sofa. It looks exactly like it does in the picture. Easy to put together. It is a little on the light side so when you have people over it does move slightly back over the night if it is not against a wall.", 
    "so far so good. I've had the sofa for several weeks, cushions still very firm. Lightweight sofa. Color is beautiful.", 
    "Good color and fabric, but a little stiff and needs some breaking in before really comfortable.", 
    "Nice sofa but it's not comfortable. Reminds me of a waiting room sofa.", 
    "Looks good, easy to assemble. Not as white as it looked in the picture.", 
    "I was in need of a smaller sofa and love seat for a smaller room in my home. This set looks beautiful online. Although the scale is perfect the quality is far below what I expected considering cost. There is very little padding on the arms, I am continually having to adjust the cushions after use ( they move ). The fabric on the cushions also \"shift\" its not a tight fit. I'm disappointed and fear this set will not last.", 
    "Very comfortable, easy to assemble, has held up well, so glad we went with it and purchased. Would recommend to anyone.", 
    "Not comfortable. The pillows slip off easily. The fabric hides stains. It is a fine transition couch.", 
    "Very happy with this sofa purchase. Very inexpensive but nice quality. Fits description exactly. Thanks", 
    "Found the Assembly to be simple and only needed help removing pieces from the box. Sofa is supper comfortable and looks beautiful in my living room.", 
    "This sofa is a great value for its price. It's relatively comfortable, and it is a great size for a smaller room (without feeling like it's a tiny piece of furniture). It looks like it cost more than it did. I highly recommend (in fact, I've bought 3 of them, since my dogs have chewed up of them already).", 
    "Couch is not comfortable. The cushions come out from the bottom of you when you sit or move around on it. It also has a tint of brown to the grey color. Not a fan. Returned it.", 
    "This couch is a nice couch, but would probably be most comfortable for someone who is shorter. However, for the price it's a solid couch. It was also easy to put together and it's aesthetically pleasing. Overall, not a bad purchase!", 
    "Very pleased with quality for price.", 
    "This sofa was fairly easy to put together and it is functional.. it is not very comfortable!I wouldn't recommend buying it..", 
    "good sofa for the price. looks great!", 
    "Beautiful sofa. Modern style. Very firm cushions provide excellent support. Color is light gray that is exactly like the picture. Easy to assemble. It'seems just what I was looking for.", 
    "First off the couch is great quality with a sleek design and for the price it is really a good deal. The only drawback is the color is not what I thought it was going to be. In my opinion \"dark grey\" is not blue. I expected more on the grey spectrum than blue. I wish you were able to order fabric swatches for a few dollars so you could see what you are getting. If anyone wants grey go for the lighter grey option. Would buy again, but would choose another color.", 
    "Love this couch’s design. Goes very well with any look you are going for. Overall very satisfied.", 
    "Not very comfortable returned it", 
    "Pros: Fabric seems durable, has nice texture and color, and does not attract pet hair! The lines are clean and would fit in many different styles. Cons: Construction seems a bit flimsy. Just enough, that would make me hesitate before plopping down on the couch. :)", 
    "Easy to put together. My roommate and I assembled in about twenty minutes. Not the comfiest of couches, very simple but still trendy. Got the dark grey linen and love it! Decided to buy the matching love seat after approval of this one.", 
    "I got the couch about a week after I purchased in 3 large packages, which was great bc my apartment building has tight hallways. When i open the boxes, I saw there were loose screws and washers NOT in a sealed separate plastic bag- so of course there were pieces missing. But i had to literally stop my progress building my couch to talk online with an overstock.com rep and order more pieces for installation. I did not receive the missing pieces til at least a week later in which i was i did not really have the energy to finish installing until a week after that. The installation is also longer than the directions tell you- the allen wrench they give you is tricky.Overall I am satisfied with the couch (event though the seat cushions stick out a bit). it looks good, is moderately comfty, but it was a good price and not a hassle coming up my apartment stairs.", 
    "This is actually a very nice little couch and well worth the price. Fabric is comfy/soft and the cushions are comfortable. For the price, you can't really go wrong here. I have it in my living room, It is a little stiff initially, but it was never uncomfortable. Recommended!", 
    "Easy to assemble, I wanted this for a sofa that is seldom sat on. It is quite firm okay to sit on for awhile, but you will not be comfortable lying on it to watch tv on read. Too firm, but great price makes up for that.", 
    "We've been using the sofa for a little over a month. It looks really nice and is actually very comfortable. It's comfortable to sit on and lay down on. It sits 3 comfortably. The only problem was putting it together. Most of it was very easy once we were able to attach the arms. Attaching the arms was a bear. You had to line up 3 holes, the first two were fairly easy but once the arm was up against the side of the sofa there was no way to see where to line up the 3rd hole to put in the screw. We took out the first two screws and tried putting the back screw in first, we tried everything and it ended up being a game of hit and miss. It took up about 45 minutes to put in each of those screws. Other than that it went well. The instructions a vague but easy enough to figure out. I would recommend this sofa to anyone who is wondering whether or not to get. It turned out really nice.", 
    "I wish that I could post a picture to show you.... the light gray is actually a medium gray... it is darker than it appears online but lighter than the dark gray. It is comfortable. It does seem smaller than the average sofa. I don't regret it but I don't love it either...", 
    "Well made couch but the pillows do not match evenly, making the couch look messy.", 
    "This sofa is a great value. It looks like the picture, was easy to put together, and I think it is comfortable (firm, not squishy comfort.)", 
    "I ordered the light gray version and really like to color. I also assembled the sofa by myself in less than an hour. I like to think I'm handy but I'm really not, so this was a good purchase for. I think its fairly comfortable (I've taken quite a few naps on it so far).", 
    "I ordered this couch in dark gray linen. I have 4 very active kids and didn't want to invest a lot of $$$. This couch is for our sitting room, so I also wanted something that would look nice when we have company over. This couch fits both requirements very nicely. Within an hour of setting up my new couch, I was horrified to find my 2yr old had smeared food on one of the cushions! However, I was pleasantly surprised (and relieved) at how easily it wiped off. The cushions do slip around a bit and I may use velcro as suggested in other reviews. Overall I am happy with my purchase. At this price point, this is a pretty nice couch.", 
    "Looks and feels more expensive than it actually cost. Very satisfied with my purchase", 
    "I made the mistake of not paying close attention to the measurements and was surprised to find out after assembling how petite this couch is....but it's cute. Buyer note that this is ideal for a smaller space, lovely color (sage), and firm cushions.", 
    "perfect size for my small house.", 
    "I originally ordered this sofa for my mom. I went to visit her and was not impressed. The color was ok, but the size was really a let down. This product is not true to the measurements.", 
    "The sofa is comfy and aesthetically pleasing. It goes great with our decor. You cannot flip the cushions and they do slide off...other than that its great!", 
    "Clear directions. Wonderful product. (If needed) Would order again!", 
    "The couch looks great and fits perfectly in my D.C. apartment. But, as others have noted the cushions definitely slide off easily (which is fixable with velcro, but frustrating). I wasn't expecting a really comfortable couch, but this was is definitely not anywhere close to comfortable. And, while I fully admit I'm not the best at building things, it was a NIGHTMARE to put together. It took me an entire night, lots of anxiety and tons of frustration. Honestly, I'm not even sure if I have it together the correct way. But it works.", 
    "We've been looking for an affordable couch for a couple years that we both loved and that wasn't going to fall apart at the seams. Overstock.com had a lot of choices for us. We went ahead and ordered the Sage color of this couch and it arrived very quickly in 2 Large boxes & 1 Small Box. They were super light which was easy for us to maneuver into our Apartment. Immediately upon opening I realized the Light Sage featured in the ad was definitely darker. But, being a photographer, I know that whatever you see on your computer can actually look very different in person. Despite that, I still loved the color! Assembling the couch was fairly easy. Seeing all the pieces separate worried me that we just bought a cheaply made couch. And honestly, I worried until we had it all put together and used it for a few days. The fabric felt like it could tear/rip so easily. Also, the long bar which secures the couch together had metal ends which were totally warped. We thought instantly that we weren't going to be able to fix them. BUT, we used pliers and bent them back into shape. After about 1.5 hours, our couch was put together! We sat on the couch and both were happy with it. My fiance is 6' and I'm 5'3. My feet dangled when I sat on it but I placed a stool in front of the couch. I agree with the other reviews, the cushions \"feel\" as though they could slide off. We haven't experienced it ourselves though. With two cats we were worried about them scratching at it. They definitely got to it a couple times and they easily poke holes right through the fabric-but we're doing new things to sway them from our couch and it's working just fine. Overall, the couch is comfy. We're not a rough household, we use the couch multiple times a day especially in the evening to wind down. It's long enough to lay down on (for both of us) yet small enough to not take over our small apartment. The style of the couch is so versatile, I could see it working in any setting. If you're looking for a new couch but don't have the funds for $1,000 purchase, this works. We don't foresee this as our \"forever\" couch but wanted to step up from our thrifted couch without breaking the bank. Who knows, maybe it will stand the test of time. For now, we're happy to have it and it works with our lifestyle!", 
    "I was a little concerned about the light gray and the linen when I ordered as I have cats and a child. This material is very easy to clean and it does not snag easily and the color is perfect, beautiful, and I loooove it.", 
    "ask me again later. bought now as it was the last one. have to paint the living room before unboxing and putting it together before making a real assessment.", 
    "I bought this small sofa for our dining room redo. I wanted a banquette style with mix and match chairs and stools. I originally bought a different sofa that was way too short. This sofa is the perfect size. It was not my first choice, but for the price I thought it would work and it does. While the color is darker than pictured, I would have preferred a darker grey linen fabric. The couch itself is springy and firm. For pulling up to a long, farmhouse style dining table it works perfectly. It is deep enough to be comfortable, but not too deep and awkward to be used for dining. I would not buy this sofa as a primary sofa for couch viewing and lounging. It is too small and not deep or long enough to fit two comfortably or lay down completely flat. This is an accent sofa. I'm sure we will replace it in a few years, but that's ok since I wasn't expecting an heirloom quality piece at this price. It is perfect for small cozy spaces. Also, this couch comes flat packed and you have to assemble it. It's fairly easy, but still requires a bit of effort.", 
    "It was easy to put together and very cute. One the ends broke away from frame within a couple months.", 
    "this looks great but is not a comfortable sofa. I use it for my staging company though so it was a great value for me", 
    "I ordered these because I wanted a classic style sofa for a good price. But it came in a million pieces, the quality is sketchy, its small, the cushions dont fit right (they stick out in the front past the base frame)", 
    "Definitely do wat others have suggested and by the velcro to keep the cusions from sliding. Other than that its a great little couch for the price", 
    "This item arrived today, and was very easy to assemble and looks fabulous! This was a great buy and well worth the wait; it took me forever to buy new furniture and I am quite pleased with this couch. Now to find coordinated pieces to go with this, besides the loveseat. It gave suggestions on a chair, which I purchased but the color mocha is not an easy one to match if it not the same maker. Otherwise still a really great deal.", 
    "If you have patience, this is an easy-to-assemble piece, taking under an hour. It is not near as long as most sofas, but comfortably seats three adults. The light grey is exactly as pictured and looks fantastic with the INSPIRE Q Peterson Grey Chevron Slipper Chair. The linen-like fabric is soft. The seats are very firm, which is what I wanted. I treated the arms and cushions with a fabric guard so any spills just bead, and are easily cleaned. I am very please with this purchase.", 
    "The couch arrived here pretty fast. It took about 20 minutes for two college students to put it together. One thing I don't like is that the cushions come out a bit. The color of the couch is a light grey. I wouldn't recommend this couch to anyone who has cats.", 
    "Quality is not that great, seems cheaply made. Not for everyday use. Uncomfortable.", 
    "We bought this couch to put in our living room. A place where we spend very little time. We didn't want to spend a ton of money as we had just moved. I think it would have served it's purpose and for $$$ lasted a couple years with minimal use. It looks very nice and the grey color is very pretty. Unfortunately ours came broken and the manufacturer did not have a replacement part.We decided to get a better made, sturdier couch.", 
    "Very Poor Quality. The support under cushions is a couple 1/2 inch flimsy boards with a cheap paper like fabric over it. This is not grey!! It is a light linen looking brown.", 
    "Easy to assemble, color was exactly what I expected. Sofa is a little stiff, not a comfy lounging sofa, more like a formal living room sofa.", 
    "I was very happy with the sofa. Exactly what I was looking for.", 
    "This couch is a disappointment. It is stiff and uncomfortable. It is not possible for two people to spoon on this couch. The seat area is too narrow. The material does clean up well, but it has an odd, plastic-like feel. Really regret this purchase.", 
    "I would like to first say that I put together this couch by myself in my living room and that it really wasn't that hard. The only thing the instruction could have done better at was telling me about the part where you need to lift velcro to screw the arms into the back. It's not deep and it's not soft. But for 2 relatively thin women and a small dog living in a tiny Nyc apartment, this is plenty good. I don't like my furniture to take up too much space.Don't buy if you want a big comfy couch. Buy if you like slim furniture and you don't need alot of space to sprawl out.", 
    "This a really nice sofa, it's very modern, great color and very has lasting style. Unfortunately after 1 month the cushions are losing their firmness and are becoming soft. This was extremely difficult to put together. The instructions were useless and I had to cut fabric, to make some of the screws fit for the legs of the chair. Very frustrating, it took two hours to put together. Instructions made no sense. Great for the money, but I will be buying a real sofa soon.", 
    "Assembling this couch was a nightmare - with help, I still could not attach the arms to the sides. I had to disassemble what I had put together and send the whole thing back. Cheaply made. Not worth ***.", 
    "I bought a bed and tv table on Overstock and really liked them. waited a long time for this couch (bad storm delayed it, not Overstocks fault) but when it came it was open! and dirty! and missing half of the screws/washers. when i finally got the thing together it was kinda just a \"meh\" moment. really cheap looking. not comfortable at all. makes a bad sound when you sit on it. kinda feels sike its full of hay or something. and the feet are a little wonky....screw hole in the wrong place. I really dont like this couch. I don't want it, actually. But after reading the return policy it looks like i will only get a partial refund and will have to pay for the shipping. So it looks like a better deal if i just sell it on C raigslit. Sad. There are a lot of good reviews for this couch...but im really not understanding why. Sorry to be negative!", 
    "Absolutely LOVE this sofa! Ordered 2! Overstock has the best customer service, ever. xx", 
    "Loved the clean lines and contemporary design. The material was linen-like for the light-grey color. Easy to assemble though I did have to read the graphics slowly and took my time. Sofa came in 3-boxes which made it lightweight to single-handedly move it into my apartment. Downside was some hardware was missing - I did contact Overstock and we resolved it quickly and amicably.Seat cushions are hard - which was what I wanted. Will have to see if they sag with time. The base is a simple board with a weave - nothing fancy or sophisticated but it does the job. As expected for the price - happy with my purchase as it does slightly resemble a R&B piece !", 
    "So far so good. It took us about an hour to put this sofa together while watching tv. It does help to have a friend help hold and line up the pieces. The seat area is narrow and I'll probably get a couple of ottomans to extend my legs out", 
    "I have now purchased 3 of these for my staging business. They are probably not the best choice if you are wanting to use it for everyday or for rowdy kids, or large people. But it sure looks nice and classic.", 
    "Easy to put together, great color, great price, and yes, it's firm as other reviews mentioned, but that's what we wanted.", 
    "We needed a make over in our living room, since the couches we had were given to us when we got married. They were still okay, but ugly and I wanted a trendy fresh feel. This met our needs until we can afford a real quality expensive couch. It is trendy, sleek, and a lovely neutral. I love the grey tweed fabric, as it has almost a brown tinge to it in the right light - which works well with our brown wool rug from Overstock we had purchased 3 years earlier! (See my review there - Hand-tufted Whimsy Chocolate Wool Rug.) This is quite firm, but the curve of the back fits my lower back perfectly and with a footstool is quite comfy. It is not a squish in, lay on it for a nap couch, more of a firm supportive piece of furniture, which will work well with our kids. This is NOT a high end couch, but seems very well made. Per the other reviews we put velcro on the bottom of the cushions to discourage sliding. Overall is is a good purchase, especially considering we got a new sofa for the same price as people were selling their old yucky ones on craigslist for. If it holds up for 4 years, I will be pleased.", 
    "I tried to cancel this order, but was unable to.. Regardless, I decided to keep the sofa since it is a huge hassle to return. I should have listened to my instincts. The construction of the product is terrible, on one of the sides of the back cushion, there was supposed to be a hole to screw in the arm, but it was not cut, so I had to find the whole, and cut it myself. The assembly is via screws and threaded pipe, in one of the pieces, the hole drilled was too large, and the threaded piece is lost somewhere inside the frame. I hope we can find the piece, and finish it, because we have already spent too much time trying to assemble this couch. The directions for assembly are terrible, and there was not the right amount of hardware.It's a cheap couch, but I've purchased cheap couches before, and this is simply not worth it. Made in China, and it shows.", 
    "Although a little hard, it's an excellent second couch for the basement", 
    "I am very impressed with this Sofa. Although, you have to put it together, it was easy to do and shockingly amazing!I went back and purchased the arm chair and ottoman after I received the sofa.I would suggest placing on a rug or carpet as I am continually afraid the chair and sofa legs will scratch my new hardwood floors.", 
    "The microfiber does not look nice. I would not recommend buying the peat color.", 
    "Good sofa worth the price, easy to set up, and feels comfortable. But if you like seating cross-legged or want to lie down, it would be kind of small.", 
    "I paid a little over $*** for a couch, I wasn't expecting world class quality and I got what I expected, NOT world class quality. Its firm, if you are not looking for firm skip it. My only gripe is with the seat cushions that keep sliding off. Its so easy to attach velcro strips to it to help keep it in place but I suppose you have to do that yourself for the price you pay for the couch. Overall I'd say its easy to put together, finished product looks nice, a lil darker than in the picture (I got grey) and the cushions slide off VERY easily. If all of this is ok with you then its a great buy! I have no issues, I will be attaching velcro to keep it in place.", 
    "This is a great couch for someone who doesn't want to spend a ton of money on a couch.", 
    "We love the couch, looks very classy and is very comfy. I only wish the instructions for building it had words, which makes me doubt I built it correctly. The visuals did not suffice, as it wasn't initiative. I'm hoping it doesn't break on us one day but so far we've had this couch for about a month and haven't had any issues!", 
    "was leary buying this on line...but boy! It really looks great and I get tons of compliments. Pretty comfy too!", 
    "It was pretty easy to put together, I only wish that it had been easier to see the places that the bolts needed to go better as it was slightly frustrating to allign the pieces. The frame is sturdy and the cushions are on the firmer side, which I personally prefer. Over all I am very happy with this sofa.", 
    "The couch looks very nice. The Gray color is perfect and as pictured. The couch is very firm-spongy but we weren't expecting a super soft couch that you fold into. We actually prefer that we can sit supported and more upright on it (we have another couch that we use to lay/relax on while watching movies, etc), so it is very comfortable for us. It arrived in several boxes and wasn't that hard to assemble but the directions were kind of challenging to understand because the pictures were tiny and a little faded. We are very happy for the price.", 
    "The sofa was very easy to assemble (completed assembly entirely on my own) and provides wonderful value for money. The piece is modern, stylish and perfect in a modern apartment. The cushions are soft and spacious, the sofa can be slept on and is very comfortable for relaxing. The fabric is a little rough and isn't extremely cool when sitting on it but I am sure with wear it will soften up.", 
    "Placed my order on the 16th, it arrived on the 18th! The picture do justice to this sofa,it looks just as I expected.It was easy to assemble but the guideline pictures were not that clear as it was bad black and white copy, so it took us time to understand what's going on.My brother took an hour and a half to assemble everything and he is not that handy so I guess if he did it anyone can!One last thing: I just want to thank everybody who took time to review this product, without your reviews I would never bought this beautiful sofa!", 
    "I'm so disappointed in Overstock. I have been eyeing this couch for the longest time and anticipating purchasing it for my new move. I was interested in a GREY colored couch with LINEN material since the beginning and this couch looked like the one. I filtered these requests on overstock and was even sent to this couch. I finally ordered it and got it sent to my house when I wasn't home. I opened it up and noticed it was this ugly brown color. Why? The color of the couch I saw featured on the item was this beautiful grey. It said on my order that I got it in Peat. Do you know what Peat means? Because I don't. For all I know, it was a glorified grey color. No, it was this hideous brown colored couch in this microfiber. I hate it. I called overstock and explained to them my situation. Even the rep said \"Yeah, you got the ugly.....I mean....the peat color.\" He explained what Peat is and that I ordered Peat. But tell me, when you look at this item, is it not deceiving? You go to this item and you see a grey colored couch and just click buy! Unless you go to the next picture, you wouldn't know you ordered an ugly brown couch in microfiber. It's so uncomfortable too. The seats keeps slipping off. I am a 110 lb girl. It's tiny and uncomfortable. So the rep says I can return it but I have to take it to a UPS. I don't have a truck to drive it to the nearest UPS. And I just moved to a town where I don't know anyone to help me or to help me move the heavy boxes. So I'm stuck with this ugly, overpriced, uncomfortable couch and I'm so disappointed.", 
    "I am very happy with the quality of this sofa considering the price. I got the peat microfiber, which was actually more brown than I expected (I think I thought it was more green in the picture). I was nervous about assembly considering I'm not really mechanically savvy and the instructions were just one page of pictures, but was able to put it together as one person in about an hour. I like this couch because it's decently comfy and I can lay down comfortably on it.", 
    "This is a great couch for the price. Easy to assemble. It's very sturdy and nice to look at.", 
    "Love it! Took some time for us to put it together but everyone who sees is loves it and we elderly mother, young adult and middle age females adore it. Color is perfect and quite neutral. Good buy and worth it.", 
    "If the price range is what you are looking for, the sofa is nice. The cushions fit well and overall the sofa is a trim piece of furniture. It does not come assembled and the instructions a terrible. I went on line and could not get help, they told me to call in and I still couldn't get any help. I was told repeatedly by each person I spoke with they were going to contact me with further information and no one every contacted me. It took me much longer then necessary if the instructions were complete and accurate.", 
    "This sofa is awesome. My kids love it. They have been jumping on it for two weeks now and it seems very sturdy. My five y/o and I put it together. Its beautifully made and was the exact match to other furniture I already had. Great quality for the price.", 
    "For staging it works fine - nice lines, neutral - and not too large. Not the most comfortable sofa - but it works well for what I needed and was a good value.", 
    "OK- it's not the most comfortable couch but it looks nice and for the price it's a great value. Color is nice and consistent with photos.", 
    "My Sofa arrived today in 3 different packages. It was very easy to assemble. We sat on it and feels very comfortable so far. Let's hope it keeps its firmness for a long time. For a good look and an affordable sofa this is the deal for you.", 
    "this product is of sturdy quality, a bit stiff, but still comfortable, rich color & nice micro-suede, easily assembled, fully functional, and exactly as I expected, no surprises; thoroughly happy with product, delivery & price.", 
    "I read every review and was still skeptical about purchasing not one but two go these sofas. However I had been looking for a year for small sofas and I was willing to pay high end prices....the problem was I could not find the size I needed. Took a chance and ordered these. My concern was the cushions slipping off but we have not had an issue with that. The sofa is compact, sturdy, comfortable and just what I needed. If you need a sofa that does not have rolled arms and is not super deep then this is a great deal.", 
    "I had to return the sofa because it was a totally different color than what was pictured. What I received was a tan/camel color. I love the style, and can't comment on the quality since I didn't keep it.", 
    "First of all, I have to say that reading the reviews helped a lot. This sofa was shipped quickly, easy to put together and the descriptions I read were very accurate. It is firm but we love that. I have it in a small living room and it's perfect. It's a very stylish piece and it can go with just about anything. For the price, it's a great piece and we are very pleased.", 
    "Pleased with this sofa.Purchased for my son's college apartment.For the price it appears to be sturdy and was easy to assemble.Also a nice looking piece of furniture", 
    "We love this sofa! It fits perfectly in our living room. It's a little firm but we actually find that much more comfortable than a couch you can't get out of. No one would believe what we paid for this sofa. It was just the perfect solution to fit in our smaller space.", 
    "The furniture is simple to assemble. The material is not of a very high quality. Price is good.", 
    "The couch was delivered on time but the warehouse forgot to include the screws to put it together!!!!!!!!!! so here we were with 8 pieces of couch in our one bedroom apt. After calling o.com several times we finally got the screws a week later!!! crazy. the couch itself has a very nice fabric but it is EXTREMELY FIRM. my husband doesn't mind but i don't like that. won't order another piece of furniture from o.com", 
    "Thanks to the other reviews, we bought this sofa for our office lobby. It's the perfect size, not too large or deep as many sofas are. We wanted a darker color than what was in the photo so it worked out well. So far people have said it is comfortable. Our only concern is how long it will stay clean or look good.", 
    "It's a beautiful, sturdy piece and my daughter's sticky hands and spills are easily wiped up.", 
    "Don't waste your money. Yes is affordable, but wow - it looks like it should go in a dollhouse.So sorry i bought."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Uptown-Modern-Sofa/3911915/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/3911915/TRIBECCA-HOME-Uptown-Modern-Sofa-97d62b41-7866-4312-bfed-999e4718f692_600.jpg"
  ], 
  "description": "Enhance any room in your home with this stunning white modern sofa.\nIts gently curving lines and modern style make it a perfect fit for\ncontemporary living spaces. Durable linen and microfiber upholstery\nwill keep this white modern sofa looking great for years to come.\nPlush seating and supportive cushions are designed to make your\nfamily really feel at home. Three (3) thick seat cushionsSolid cushioned backIncludes: One (1) sofaMaterials: Solid Asian rubberwood frameUpholstery color: Grey linen, light brown microfiber, white\n  linen, dark grey linen, mocha microfiber, sage microfiber, dark\n  brown faux leatherUpholstery fill: FoamSofa dimensions: 34.5 inches high x 76.5 inches wide x 34\n  inches longStyleContemporary, Modern, Nautical, UrbanMaterialCherry, Fabric, Foam, Linen, Microfiber, Rubberwood, WoodTypeSofaFinishCherry, WoodSeat HeightCounter HeightAssemblyAssembly RequiredColorBrown, Green, Grey, WhiteFurniture Frame MaterialWoodFurniture PatternSolidGallery MatchYesGallery RoomHampshire Woods"
}