{
  "name": "TRIBECCA_HOME_Flatiron_Nailhead_Upholstered_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 224.16", 
  "reviews": [
    "Got these to go with a new picnic style table. The table has a dark finish but I knew I wanted an upholstered chair and I'm a big fan of nailheads as my couch has that. I considered the light cream color but went against it for stain prevention however the material is very durable and probably would have been fine. I LOVE the light grey color. The wood is beautiful and he right dark finish. They are sturdy and easy to put together and comfortable. Couldn't be happier for the price.", 
    "LARGE SEATS, HIGH BACKS, VERY STURDY AND LOOK WAY MORE EXPENSIVE THEN WHAT WE PAID FOR. DEFINETLY WORTH BUYING", 
    "The chairs are exactly as pictured. The seat is a little harder than expected which is not a problem since we aren't sitting in them that often. The price can't be beat!", 
    "The chairs are absolutely beautiful! They are very large and tailored. I expected the color to be closer to white...it is a beige linen in color and the typical linen feel. The seat cushions are very, very firm, but I'm hoping in time they soften up some. Assembly was not difficult but I suggest at least 2 people to make it easier.Overall, the chair quality is fantastic so I would highly recommend these chairs aesthetically and functionally. So happy with my purchase!! Looks like a much more expensive chair.", 
    "Elegance meets contemporary. Very solid. Easy to assemble. Great buy. I priced some very similar from PB, and they were $399.00 each. You'll love these if this is the look you are going for !", 
    "Perfect with my table I'm going to refinish!", 
    "Sturdy construction and good quality. Assembly needed but easy to do with home tools vice the Rinky Dink tools provided.", 
    "Bought a set of 4 so 8 chairs total. They are easy to put together and are actually pretty comfortable for dining room chairs!", 
    "I purchased the winter white chairs and they look amazing with the Flatiron table (which is also beautiful). This set looks much more expensive than what I paid. So very happy with this dinning set purchase.", 
    "These shipped super fast. Very easy to understand assembly. But more than that, these are simply stunning in person. The seats are firm, without being hard. The construction is solid and excellent for the price. You cannot go wrong with these!!", 
    "The chairs are very nice. Easy to put together.", 
    "Purchased 6 of these chairs to give my dining table a new up to date look. The chairs are very sturdy, heavyweight and the fabric is just a beautiful beige. Great quality for the price. I just wish they had these in captain chair style.", 
    "I purchased these chairs with the matching dinging table. The entire set was very easy to put together and looks stunning in my new dining room. I cannot wait to show it off during the holidays!", 
    "These look great, easy to put together", 
    "Fast delivery! The chairs are absolutely beautiful and look elegant. Quality seems great and I've received many compliments already.", 
    "These chairs are beautiful, they were exactly are described and an amazing price. I'm one happy customer!", 
    "Love these chairs, they are exactly what I wanted"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Flatiron-Nailhead-Upholstered-Dining-Chairs-Set-of-2/10045531/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10045531/TRIBECCA-HOME-Flatiron-Nailhead-Upholstered-Dining-Chairs-Set-of-2-079361ca-03a9-439e-b8e0-e02beb899263_600.jpg"
  ], 
  "description": "Bring a regal yet contemporary look to your dining area with this\r\nset of two upholstered chairs. Featuring nailhead trim and a modern\r\nsilhouette, these dining room chairs coordinate seamlessly with\r\nmodern decor themes. The armless design and high backs create a\r\nmore formal look that is accented by the elegantly detailed wood\r\nlegs. Unique turned block look wood support legsNailhead accentSet includes: Two (2) chairsMaterials: Wood frame, off-white fabric or PU leatherUpholstery color option: Off-white, dark grey or grey fabric or Brown PU\r\n  leather       Cushion thickness: 2.95 inchesSeat back height: 24 inchesSeat dimensions: 18 inches high x 17 inches deepOverall dimensions: 41 inches high x 23 inches deep x 21\r\n  inches wideStyleCasual, Country, Rustic, Traditional, TransitionalMaterialLeather, WoodFinishGrey Finish, White FinishChair TypeDesk Chairs, Dining Chairs, Side ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardChair Seat MaterialFabric, Faux LeatherColorBrown, Grey, Off-WhiteFurniture PatternSolid"
}