{
  "name": "TRIBECCA_HOME_Evelyn_Tufted_Wingback_Hostess_Chairs_(Set_of_2)", 
  "price": "EUR 350.86", 
  "reviews": [
    "They are very well made, with quality materials and well done finishes. Also they are very comfortable. My wife likes the fact that they do not have metal nail head trim. They look as good as in the photo. You get your money's worth.The huge problem comes after they arrive. They are almost impossible to assemble. It takes hours and hours to put one of them together. The instructions are terrible (printed in China of course). The problem is that you CANNOT align the wholes with the screws. I used big clams and nothing. I hammered and hammered to no avail.After being upset, mad, furious, I decided to call Overstock to get help or to process a return.Well, I can tell you that they are very nice and helpful, but they also do not have any idea on what to do, except refer you to the crappy instructions. After a productive conversation, they called me back and put me in touch with the EXPERTS from the wholesaler. I insisted to talk to a person who had actually put one of those chairs together. That person, who was very friendly, was surprised that I was having problems. To him it was a piece of cake. Really? I asked him if he had put them together by using only the force of his hands. Of course not, he needed help from another tough factory worker. Your won't believe how they actually do it...I was asked to put the 2 back screws first. Then, put down the chair on the floor with the back toward the top. Then, I was asked to lay on top of the chair (back) and roll back and forward. Bingo! finally I could align the screws with the holes. And PRESTO the remaining chairs were finally done. Don't take me wrong. The difficulty comes because the chair uses heavy materials and you have to apply so much force to get the materials to flatten to align the wholes, that only your own weight and the help of a second person will help.I think that we should have access to a video to be able to understand how to do it.I have read that other people have had difficulty assembling similar chairs. Now they know. Place them on the floor (back toward the top), lay your chest and tommy over the chairs, roll back and forward...", 
    "Chairs look great, tufting is well done. However, once assembled, were not same size as specifications listed. Fabric was disappointingly polyester feeling.", 
    "They get loose pretty quickly but are comfortable for the most part. Not easy to assemble.", 
    "beautiful chairs but can be difficult to put together", 
    "I waited for these chairs to come back in stock in the dark grey and jumped on them when they were available. I was a little scared of what to expect in building these. After reading reviews that they took 40 - 6- mins each, and some cutting fabric to get the screws in. So they arrived Monday night. We started to build at 7pm and by 8:15pm all four were done. Looks like I may have purchased the easier batch. It was an awkward position you had to be in, in order to attach the seat to the back, but once one bolt was in, the rest lined up pretty easily and the allen key used could be a little more gently on your thumbs, but all in all not a bad experience at all. Love the look, love the fabric, love the quality. Can't go wrong with these.", 
    "I read the reviews and I was mentally prepared for battle. Chair #1 almost won but I walked away, had success with chair #2 and conquered the first beast. Here are some tips...#1. Wear a headlamp. It's easier to see the holes when you're upside down, face pressed against fabric. #2. Screw the back 2 screws in first as opposed to the side screws, as the instructions read. At least how they appear to read. LOVE the instructions written by an ESL student. #3. Cut away any overlapping fabric from around the holes where the screws will go. #4 Have a tiny screwdriver or similar object handy to dig out the pieces of fabric from the holes if you didn't do #3. Fabric fluff gets in there and the screws that you are trying to blindly place while awkwardly pushing on the chair with your elbow or whatever and makes it impossible to get the screws in. This was key for me and ultimately allowed me to place the last stubborn screw in chair #1. Best of luck people.", 
    "This is a lower review due to the difficulty of putting the chairs together. I had read the reviews and was prepared for the difficulty, but seriously. Also, I bought the light gray and it is much more of a heather gray than it appears in the picture. Other than those two issues, the chairs are great!", 
    "2 things held me back from giving 5 stars: 1. The seats of these chairs aren't as full (your rear sinks down quite a bit, and 2. Putting these together was some serious work! Attaching the seats to the backs was difficult and for some reason the bottom of each seat has the rough side of velcro attached to it - ensuring that you get scratched up while trying to assemble. Other than those two small details, these are AWESOME chairs. I purchased in charcoal linen. You won't be disappointed.", 
    "Make sure you see the \"set of 2\" indicated on this item. I mistakenly bought 2 sets. The chairs are gorgeous though.", 
    "Little flimsy foam seat otherwise nice", 
    "The only reason I didn't give 5 stars for this product is bc they are about 1/2 in lower than the other 4 chairs I bought that were in the picture with these chairs and I thought they go as a set. Picture was misleading I guess, otherwise great quality and very nice looking. Also - just beware that the seat is softly cushioned and sinks quite a bit when sitting on it.", 
    "These chairs are beautiful and well made. I did not finds them difficult to put together but maybe I was prepared after reading the other reviews. I get compliments on their comfort and styling.", 
    "These are great chairs, if not a little hard to start. The only downside is the holes don't line up perfectly. If you have two people, it's a little easier.", 
    "Beautiful chairs. Just like photo.", 
    "The material is cheap and flimsy... My bed sheets are thicker! Otherwise chairs feel sturdy and look nice. Hopefully that won't change.", 
    "Very comfortable and they look great at my dining room table along with the matching bench.", 
    "Chairs are nice but very hard to put together. One came with a broken leg and Overstock has done nothing to help except tell me that the chair is out of stock.", 
    "I really like these chair a lot, though they were somewhat cumbersome to put together. Now I just worry about keeping them spot free.", 
    "Perfect for neutral dining room chairs, but they were REALLY hard to get put together. It took two people!", 
    "They look great but are a bit difficult to put together, I'm a 48yr female and it took me about 30-45 min Per chair. They could be a little more comfortable but they will be serving as arm chairs in dining room and not used that often, and who could beat the price?! Thanks again Overstock", 
    "We love these chairs. Perfect price, color and comfort. Easy to assemble", 
    "Beautiful chairs, sturdy feel, nice fabric. The assembly was easier than expected (after reading the horrific assembly reviews) but i had tools that made it easier. Some pieces were missing but easily obtainable in a home improvement store. All worth the effort as price and look were amazing", 
    "Easy assembly comfortable", 
    "Comfortable and fabric is great quality. Kind of a pain to put together but that wouldn't deter me from ordering them again.", 
    "Very comfortable chairs. Got them in the light grey color and color was true to picture. Assembly was easy after putting the first one together. Chairs look like they came from very high end furniture store. Love, love, love these charis!", 
    "The chairs are great quality and fairly easy to put together. Happy with my purchase", 
    "The material on these chairs was poor quality and the legs did not fit properly into the sockets when trying to build them. Their are better options than these.", 
    "Matches the TRIBECCA HOME Benchwright Tufted Reclaimed 52-inch Upholstered Bench perfectly!", 
    "I really like these chairs. They are the look I was going for and look great in my dining room. They look larger in the picture but are small/average sized chairs. They are comfortable, however. The legs are also much lighter than described so I'm going to paint them darker", 
    "Love these chairs! I read the reviews about how sturdy they were and then how hard they were to put together so when I got them I was prepared for the worst but I didn't have any issues assembling them by myself. And all the holes lined up for me. I barely read the directions because it was pretty self explanatory. I did use a hammer and electric drill with a hex bit for easier assembly. I recommend starting with the legs, then 2 screws on the back of the chair, then adjust the seat to meet the holes on the sides. It took me about 15 minutes per chair. They look beautiful and are definitely sturdy! If they become loose I plan to tighten the screws. I would recommend these chairs to anyone. I love them!", 
    "I love the color I bought them in beige linen goes really well with the table that I bought really brings out the rustic glam look I'm going for ..fast delivery HOWEVER... I didn't get my legs with one of the chairs ( I called and they are sending some right over so that's taken care of) secondly they are kind of hard to put together it's not the instruction it's literally the chair I couldn't put two bolts in the side somehow they came together but yea", 
    "I think these chairs look beautiful with my new dining table, they were a little difficult to put together, but worth it.", 
    "You are getting what you paid for. They look good and are pretty comfortable. Quality of workmanship is fair. Be careful of underneath as there are ruff wood edges and splinters. Very hard to put together and the instruction are simple but also wrong. I suggest you do #1, then #3, then #2. It will be a lot easier to put together, but still not easy to do.", 
    "Love our chairs, so elegant!", 
    "Assembly of these chairs is not impossible, just difficult. Having a power driver helps tremendously since I had to assemble 6 of them. Chairs were also unbalanced once they were assembled, however they are starting to settle with all 4 legs on the floor. They do look nice though.", 
    "These get 3 stars mainly for assembly. They are pretty chairs and comfortable to sit in but the assembly is a nightmare. It can't be done without two people...I tried. You can't see the holes to screw into without a flashlight and it's such a tight fit that you have to have someone to push the pieces with all their strength while you assemble. So far they have been sturdy but we don't use them often.", 
    "Chairs are very difficult to put together. Also, the seat is not well made. I see the seat breaking down sooner than a well-made one. Would not buy again", 
    "Put the two posterior screws on first. Do not tighten them. Then aligned the side screws. Can use a flash light from the opposite site to visualize the alignment. Tighten the screws and Presto! You just put this together with no help from another adult.", 
    "The only drawback is these chairs are REALLY hard to put together. It is truly a two person job. Follow the other review with respect to how to position the chairs to assemble!", 
    "They are a little tricky to put together but I'm pleased with the overall look of them.", 
    "Beautiful, comfortable, sturdy chairs! Great for everyday use.....however putting these things together will make a preacher cuss! Assembly proves to be frustrating because holes never line up and it is definitely a two person job; two patient people who get along well. Take a deep breath and make sure you are not in a hurry. We used a rubber mallet and a flash light so we could see the holes through the fabric. I bought 2 sets (4 chairs) and they are substantial and just lovely, so it made up for the Saturday afternoon it took to put these babies together!", 
    "These chairs would be perfect if they came assembled. They were pure torture to put together as the holes that should line up on the seat of the chair do not. Honestly, we almost sent them back. But, they are lovely.", 
    "I read reviews before & everyone says that it's hard to put together. My husband & I are pros at putting things together. This was def hard to do (because the last hole you put the screw in..DOESN'T line up... but with a little MORE muscle, it's still do-able. Chairs are beautiful, very nice cushion & supportive seats. Def worth the money!", 
    "The chairs look so awesome. It was a bit difficult to align the seats to the backs to screw them, but once I got that on it was a breeze. Other than that, it didnt take too much time putting them together. So, worth the price!!", 
    "really hard to put together. very good looking. good quality and very sturdy. the seat padding is strange - it gives a lot and sinks in deeply when you sit.", 
    "Not as large as I had hoped they'd be. Very difficult to assemble. You will need 2-3 people. Scale just seems a little off on size. Good thick seat though. Finish is also very nice as well as fabric.", 
    "We love the look of these chairs. Comfortable, firm, and look more expensive than they actually cost. Only issue was that one of the chairs came defective.", 
    "My husband sat on this chair and it snapped in 12 pieces ..so cheaply made ..overstock returned with no problem", 
    "Very happy with these chairs. The quality and price of these chairs are great. Previous reviews on how complicated they were to assemble are fairly accurate. I figured I wouldn't have any problems assembling them myself but quickly found out it was a 2 man job. Have someone push down on the backs while you fasten the bolts. I didn't however have any issues with drilling separate holes or anything of that nature. Overall great looking chairs that should hold up very well.", 
    "Chairs are beautiful and comfortable when put together. Had an extremely difficult time putting together.", 
    "Ordered them in beige linen and I'm happy with the purchase. The material feels and looks nice.", 
    "You get what you pay for here. The holes have not aligned on any of the 6 chairs purchased. I had to improvide with wood screws. I would not purchase again.", 
    "designer perspective: this chair is uhh-mazing. we got it in gray and the color is fantastic! comfortable and solid.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Evelyn-Tufted-Wingback-Hostess-Chairs-Set-of-2/9973777/product.html?recset=00889916-e365-4ddc-a376-6b71d0747735&refccid=3UMWAMZNFQYLNFSKJ6EKK6BJ7Y&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9973777/INSPIRE-Q-Evelyn-Tufted-Wingback-Hostess-Chairs-Set-of-2-6439ad73-d65b-4eac-9ed2-f0d2636414c1_600.jpg"
  ], 
  "description": "Add sophistication and comfort to your living space with a set of TRIBECCA HOME Evelyn tufted wing back hostess chairs. These thickly padded, button-tufted back seats are fully upholstered with a natural stain finished, sturdy wooden frame. with a traditional flare, these pieces are available in a variety of colors and materials that will stylistically complement any decor.Shallow side wingsButton-tufted back with thick paddingSet includes: Two (2) hostess chairsMaterials: Wood frame, linen, bonded leatherUpholstery color: Dark Grey linen, grey linen, beige linen, brown bonded leatherCushion thickness: 4.5 inchesSeat dimensions: 18.5 inches high x 21 inches wide x 17.25 inches deepOverall dimensions: 38.5 inches high x 21 inches wide x 25.25 inches deepStyleCountry, Nautical, Southwestern, Traditional, TransitionalMaterialBonded Leather, Linen, MDF, WoodChair TypeAccent Chairs, Desk Chairs, Dining Chairs, Parson Chairs, Sets, Side Chairs, Wingback ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackColorBeige, Brown, GreyFurniture PatternSolid"
}