{
  "name": "TRIBECCA_HOME_Uptown_Modern_Accent_Chair", 
  "price": "EUR 280.47", 
  "reviews": [
    "End product is very nice, firm, and looks great - fabric is sturdy and has nice variation within the linen gray look. Maybe I didn't read the details well enough, but I had no idea the level of assembly that was required on this chair. Every other chair that I have ordered from Overstock is basically fully assembled other than twisting on the legs…not the case with this chair. It took over an hour for me to assemble it. But again, I love the product, hated the work involved.", 
    "Great chair for a great price. It does require assembly so I fee like it could been just a bit less expensive but overall, it seems like a good, quality piece of furniture, very attractive as well. I decided to order the ottoman to go with it since I liked the chair so much.", 
    "This chair has a nice look and is pretty comfortable, although it is a little smaller than I expected it to be. One thing that was a big surprise to me was the amount of assembly required. The product Q&A says it should be \"basically assembled\" but it was not assembled at all. The back, sides, seat, and legs had to be put together. You need your own screwdriver to do some of it, and other steps require the enclosed allen wrench. Once I got it together, it was fine, but it was way more work than I anticipated.", 
    "Loved the design and got 2 chairs.. It was easy to assemble but One of the chairs leg just gave it when a 165 lbs person sat on it.. This chair is not worth more than a patio chair at a local **** ****** .", 
    "this is a great chair. I used it in an office waiting room. It is chic, classic and a truly grey color (which I was hoping for). Only disappointment, was that the wood feet weren't as dark as I thought they would be. I was hoping for a darker expresso finish and it's definitely more of a medium maple finish. It's still a great chair!", 
    "This chair is not even... We put it together and it wobbled (one of the legs was about one inch shorter than the rest). So we took the legs off and put it on the floor, and the same thing happened - the chair isn't even! I am super annoyed with this.", 
    "Just received this. Some reviews indicated difficulty in assembly, but I had few problems and had the job done in about 1/2 hr. Nice sized chair and very comfortable. Very new, so don't know how the material will hold up to wear.", 
    "I got the dark grey color an it was exactly as pictured. . Took a few Mins to put the chair together but it's a very nice an perfect accent chair!", 
    "I am 2 years into having 4 of these chairs and they are great. Extremely comfortable and have held up perfectly. Would definitely purchase again.", 
    "I was so happy I had two work men here to help get it out of the box for me. After reading over the instructions, several times I tackled assembling it. Let me say her I have never done anything like this before. I was not easy but I did it! It is still standing and seems to be of really good quality. Better than I expected for the price. I got dark brow leather and the style and shape complement my traditional furniture very well.", 
    "Nice chair and really soft", 
    "I love it! I bought it with the matching ottoman and the set perfectly completed my small apartment living room. Before my purchase, I read other reviews about how the chair took a while to assemble and It took me about a half hour, BUT its a great, quality product, at such a low price, and you only assemble it once.", 
    "It doesn't always feel like the sturdiest chair, but they're beautiful and comfortable.", 
    "Took me hours to put together. Really a hassle! Otherwise, I would rate it higher. Once assembled, nice-looking chair. Actually bigger than I thought, which is good. Think I will get the ottoman. This chair is nice as seating area piece in master bedroom. I got the white.", 
    "I was looking everywhere for a chair for a smaller size living room. It had to be comfy, although not too small, and be able to fit through our narrow living room doorway. I was able to bring it up to our 2nd floor in pieces and assemble inside the living room. It had to be assembled and it wasn't hard to do with 1 person. It's sturdy and comfy. The cushion is firm but I like that and will most likely soften up as times goes on. I've only had it for a week now but I am enjoying it.", 
    "Once I figured out how to put it together it went well, the legs were a bit confusing. It was for me a two person operation. I also got the loveseat and they look great.", 
    "Looks good on page but really small and non-substantial. Went back immediately.", 
    "It is a nice chair but just looks a little too boxy to me. We use it as an accent chair at an entry so I cannot attest to how well it will hold up.", 
    "I like the design of the chair and was really excited to get it. The color is NOT as shown in the picture. Has almost a faux weird denim look to it when I was expecting the dark gray linen. The chair isn't terribly cozy and to be honest a bit cheap feeling for how expensive it was. I wouldn't buy this chair again.", 
    "Comfortable but first time I sat on it and moved to get up the legs collapsed.", 
    "it very nice to look at but I would like it to have been comfortable . It is not", 
    "sitting in it right now... so comfy", 
    "Very east to assemble, looks exactly as pictured. Great purchase!", 
    "I received the dark grey sofa that looks like it was made of denim jeans. Not at all like what is in the description. Looks much cheaper too. I returned it the same day", 
    "Easy to put together and comfy to sit on.", 
    "First off you have to put the chair together yourself. It probably took about an hour or so. If you want your guest to come visit but not stay long, you need this chair. The chair is cute, the cushion does overlap, but not a good purchase if your looking for comfort.", 
    "I like the fabric, the size, and the color of this chair (dark gray). The bottom cushion,however, sticks out a little too much- it is not flush with the base of the chair. Other than that, the chair is pretty comfortable.", 
    "I would not purchase again. Could not tighten the sides and legs of chair. Would not purchase again. Style is nice but would not trust it in my living room for normal use.", 
    "Great product very comfortable", 
    "Seems like it's good quality. Got it in green and it goes with the rest of the furniture", 
    "Easy to put together, looks great in our formal living room. White linen color is accurate to picture.", 
    "Nice chair for the price. Reasonable. I bought this for an occasional reading chair.", 
    "These chairs are great for the price. The look beautiful in my sitting area. They are light weight, so if you put them on hard floors, they will slide around. I put felt tips on the bottoms to preserve my hardwoods. I am please with these chairs for the price. I don't know if the will last for years since they are sat on daily, but I will definitely get my money out of them.", 
    "This is a nice chair. I think my cats think I bought it for them. My husband says he likes to sit in it while hes waiting for the coffee to be ready in the morning.", 
    "We are happy with the chairs. We spent a couple of hours putting them together. That should not be a deal breaker.", 
    "looks and feels cheap. bottom cushion sticks out too far.", 
    "I went back and forth about whether to buy these and I'm so glad I did. They were not difficult to put together at all. They are also bigger than I thought they would be which is good. The cushions are very firm so I think they will hold up well. I bought two in the sage color, and each chair was a bit different as far as pre drilled holes and extra parts, but it didn't affect the outcome. Very happy with my purchase!", 
    "I had to hire a professional to assemble this chair, who had ro improvise, since directions were so UNCLEAR! The box comes with arms, back seat and base ALL separate parts. It literally had to be BUILT.Quality of chair is otherwise good. I would probably not order this again.", 
    "Great looking chair and very comfortable. A great addition to our living room. Some assembly time but well worth it.", 
    "The back of the chair is kind of shorter than normal accent chairs. Material feels cheap. Not very sturdy. I don't expect this chair to last very long. It was easy to put together though and looks fairly nice if you put a throw pillow in it.", 
    "Comfy and fit perfectly into my space. Definitely a great purchase!", 
    "We got this chair to go in a nook that we have. It looks great and is actually pretty comfortable to sit in. It feels very sturdy and is a nice dark grey color. The chair, however, was a little tricky to assemble at times-the instructions were clear but the location of some screw holes in the bottom of the seat were difficult to get to and line up. But once we got past that, it was a breeze.", 
    "I ordered 2 of these chairs in dark gray linen and when I opened one up it was denim. Not at all like what is pictured. Not to mention I couldn't even figure out how to put it together. I returned them immediately because there's no way I could have looked at denim chairs in my living room. Would highly not recommend purchasing unless you see the color and material in person before you buy.", 
    "Nice chairs, pretty light weight, comfortable and a great price.", 
    "More work to put it together than I would have liked.", 
    "Looks good. Was able to assemble myself( 63 yr old woman). Not a great chair but fills the need.", 
    "The chair itself is very comfortable. However the white is not a true white but rather a green. There's also a lot of assembly required.", 
    "Great chair, required some simple assembly. Did have some slight stains on the white fabric", 
    "It's a bit stiff, but looks great!", 
    "I bought the \"white linen\" and it's really a cool beige shade (more of a stone beige undertone as opposed to a sandy yellow beige). The color on the website looks lighter and more cream colored than the chair actually is. It's very firm and not something I would consider for a living room or den - nobody will want to lounge in this chair. But it works fine in the corner of my bedroom as an accent chair. I'm not sure why others had trouble putting it together - directions were straightforward and there were only a few pieces. It took less than half an hour start to finish. Overall not a great chair but fine for the extremely reasonable price.", 
    "You're pretty much getting what you pay for with this chair, if not a little less. Looks are good and it's comfortable enough, but the actual quality of the chair leaves much to be desired. It's a fairly light chair (you could probably lift it with one hand really), but the legs were made of a softer wood than expected, and scratched pretty easily.If money is tight, this chair WILL make an attractive addition to any space, but I would personally recommend saving your money and investing in a piece of better quality.", 
    "Fabric is a noticeable polyester, so it doesn't look as pretty up close. This is a comfortable chair, the cushion is nice and firm. Easy to put together.", 
    "I really like the chair. Look very nice and is comfortable. The linen gray it true to color. Now I just need it to come back in stock so I can buy a second one.", 
    "I bought 2 of these chairs for my office, and love them. They are great for the price, and were easy to assemble. I may even buy another for my house", 
    "i love this chair. Easy to assemble, great price and is perfect in my bedroom. Fast shipping. Highly recommend", 
    "This chair goes perfectly with my gray/white furniture, is very comfortable and easy to assemble, for this price, it was great. I got what I expected!", 
    "If you are going for waiting room furniture than this is your chair."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Uptown-Modern-Accent-Chair/8763009/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8763009/TRIBECCA-HOME-Uptown-Modern-Accent-Chair-684e0262-ffc9-44d5-bd8a-fb1f65326f49_600.jpg"
  ], 
  "description": "Curl up with a book or welcome guests in style with this sleek\naccent chair. With clean lines, neutral colors and soft linen\nupholstery, this chair is an ideal finishing touch for modern or\ntransitional rooms. Try it next to an avant-garde coffee table for\ncrisp, contemporary appeal, or create a welcoming nook with a\nmagazine rack and warm afghan close at hand.Asian hardwood offers strength and durabilityRemovable cushion covers make cleaning easyNeutral colors blend with existing decorPremium foam cushions for comfortStandard back and counter-height seat for versatile\n  support6' cushion thicknessInterior dimensions measure 19'H x 23'W x 21.5'DOverall dimensions measure 34.5'H x 32.5'W x 33.75'DStyleContemporary, Modern, NauticalMaterialFoam, Linen, WoodFinishEspresso, WoodChair TypeAccent Chairs, Arm ChairsSeat HeightCounter HeightAssemblyAssembly RequiredChair Back HeightStandardColorBrown, Cream, Green, Grey, WhiteFurniture PatternSolidGallery MatchYesGallery RoomGood Conversation, Lorimer, Snow Dove Drive, White Seashells"
}