{
  "name": "TRIBECCA_HOME_Swindon_Rustic_Oak_Classic_Dining_Chair_(Set_of_2)", 
  "price": "EUR 159.19", 
  "reviews": [
    "Great product, sturdy, attractive and comfortable. Looks expensive. EASY to assemble if you read directions. Key: 3 different size screws. Make certain you understand which goes where. PLUS, short screw should not be totally tightened down to leave wiggle room when attaching other parts. Tighten short screw last!!!! Husband put chairs together in 15 minutes.", 
    "I ordered these chairs and the bench for a distressed farm dining table my husband made. I was looking for a dark country distressed look and that's exactly what I got. These chairs look like they were made for the table. They are very solid and a very good price. We are so pleased.", 
    "My husband does woodwork and furniture building. He built us a farm table with a bench for one side for the kids and we wanted the right chairs and after many furniture stores and much research online we decided on these. I can not tell you how great these look. They feel like high quality and four chairs went together in an hour with no problems. We had our order in less than a week and they were very reasonable. We could not recommend these more highly.", 
    "It is hard to tell via computer screen what the chairs actually looked like(color, size, etc) but when they arrived they were perfect. Assembly was easy and the finished product was a bit larger than I thought, but seating is comfortable and stable. Seven of the eight chairs arrived without damage. After contacting Customer Service and a month's wait, I now have eight perfect chairs that I love. My thanks to the Customer Service representatives who worked diligently to remedy the situation. The long delay(3 wks) was due to the warehouse waiting for new shipment of my style of chair. But as soon as it came in, they shipped the replacement part to me ASAP. Bravo!!! Look forward to many years of enjoyment.", 
    "This was part of my first ever order from Overstock which included a pedestal table. I was very pleasantly surprised by the quality of both items and the way they complemented each other. The chairs are very comfortable to sit one.", 
    "The packaging for these chairs was minimal with styroform about 1/2 inch thick. One chair had a piece of wood missing at the bottom of the leg. It was in the box. I know Overstock would have replaced it but I just glued it back. The chairs themselves seem fine, but the wood is so soft that just banging a leg against something makes a mark.", 
    "The chair looks good when put together with the quality of the finishes being decent. The wood used is pretty light and it's durability over time will be the biggest unknown. Overall though I would recommend it. My one tip would be that when it is assembled, do not fully tighten the screws. Sit on it first where you plan on using it, then tighten the screws. Doing this will level the chair and will prevent it from being uneven.", 
    "I am absolutely thrilled with my purchase of these chairs through Overstock.com!! I couldn't have found and didn't find more of a perfect match for my table. Delivery and customer service of shipment and tracking was spectacular! Thank You for making an online purchase so easy!", 
    "Better than expected. Simple Assembly. Well designed hardware. I ordered 6 of these chairs as replacements for 30 year old chairs and assembly took about an hour total. As an added note, the cushions are extremely comfortable.", 
    "Easy to put together and very sturdy. Exactly what I was looking for.", 
    "The title says it all! The chairs assemble easily and quickly. Fully tighten the center bolt last.", 
    "Little stiff when you first sit on them, will take some time to break them in. However, theyre really nice chairs..except the legs are all uneven so almost all of mine don't sit on the ground. I just put those felt things on the bottom of the legs, good as new.", 
    "We have had these for a little over a year now. Very easy to put together and, on the whole, I am pleased with them. However a couple of things......we eat at the dining table every evening and the cushions are definitely getting a little flat. I will probably have to re-upholster to give them a boost in a year or so. Also the screws on the seats don't seem to \"bite\" as well as I would like. Keep a little screwdriver (that comes with the hardware) in a handy place so that you can tighten them up every few weeks.", 
    "everything we purchase is superb these chairs are no exception", 
    "Very happy with the chairs. Liked them so much, I bought the entire dining table set with six more chairs.", 
    "These are uncomfortable and the screws constantly come loose.", 
    "Comfortable, elegant, sturdy and easy to assemble. Highly recommended.", 
    "perfect compliment to the table. we purchased total of 8 chairs and the whole looks is fabulous.", 
    "We looked around at dining chairs for our soon to be built farmhouse table. These were exactly what we were looking for. Something comfortable enough to sit around the table and eat/play cards anything you need. The seat is large and the height of the back of the chairs are perfect for us.", 
    "We bought these chairs last year, and just purchased the table to match. The set is pretty hardy. Looks nice, more on the rustic side which fits our decor and taste.", 
    "I wish I got 2 more. I love these chairs. Perfect for my table.", 
    "I absolutely love these chairs. They are beautiful and comfortable and have held up so well over time.", 
    "love these chairs should have gotten 2 more", 
    "Bought dinning set and then ordered 2 more chairs", 
    "Love the chairs, they are comfortable and look great. I would recommend this product.", 
    "These chairs are reminiscent of what you'd find at an Ashley's or a Nebraska Furniture Mart. They're not high end and they're just above low end. They'll last for years if taken care of. The cushions are firm and despite our initial misgivings, the handles in the top are useful for moving the chairs more easily. We recommend them.", 
    "Pleased. But a couple chairs were not even. Rocked a bit", 
    "We ordered 6 chairs to go with our rustic table. They arrived fast and were very easy to assemble. Very sturdy and look great.", 
    "Very solidly made, so far so good, BUT very uncomfortable to sit on.", 
    "Very comfortable, great color.", 
    "They are exactly what I was looking for and they look good", 
    "Quality made chairs real wood stylish", 
    "very well made, sturdy and easy to put together", 
    "These are great chairs for the money! They're sturdy, comfortable and they look really nice in our vacation home that we rent.", 
    "I bought a set (of 2 ) to see if I liked them before I committed . the are really nice, the cushions are nice and thick and the color is dark brown..a little darker than the picture..but not much.. they were easy to assemble..now I am getting a second set!", 
    "Great chairs! Very easy to put together! Would definitely recommend!", 
    "You can't beat these chairs for the price. The quality of the materials is great. They were packaged with care and were easy to unpack. Putting them together was a snap and required very little effort and time to assemble. They were exactly what I was looking for and couldn't be happier.", 
    "Had the chairs awhile and they are perfect with our table. Very sturdy and design is excellent.", 
    "Nice chairs, was as expected. No issues with assembly, in excellent condition, color was as expected. Seats are a bit hard, but issue.", 
    "These chairs are beautiful, solid and are a bargain for the price.", 
    "These chairs are much better than expected for the price. They are heavy, sturdy, and a nice size. They are well made and super easy to put together. The fabric is durable too. Love them!!", 
    "Great chairs for great price. Look nice, sturdy. Look more expensive than they cost. Easy to put together. Thank you.", 
    "These chairs are perfect for our needs, good quality, sturdy, easy to assemble, well packaged, and exactly as shown in the photo.", 
    "Bought four chairs. Very pleased.", 
    "Matches our table perfectly would recommend to buy.", 
    "Assembly was quick and easy. I did four chairs in no time. I like the hand-hold in the chair back..chairs can be so awkward to move. The color is not quite walnut. It has more red in it which I like, it's warmer, yet not cherry.", 
    "Bought these to replace two chairs that match my dining set that have become loose and wobbly over the years despite several tightenings and a final rescue attempt with gorilla glue. Not as good of a match as I had hoped from the picture ( wood is actually a little darker looking in my home at all times of day, in various lighting) but these chairs are nice looking. They were easy to assemble and seem sturdy. The chair pad is a bit stiff but is already softening up from regular use. Definitely not the most comfortable chair I've sat in but not exactly uncomfortable either. Pleased with what I got for the price.", 
    "The chairs I had that came with my table where so low. I have put up with them for 30 years, finally I ordered these chairs and they are wonderful. Everyone that comes in remarks how well they match the table and how comfortable they are. They were easy to put together. I had one issue with one of the legs and Overstock replaced it without difficulty", 
    "Not high end, but terrific quality for the price. I picked up four to go in our breakfast room. I was pleased with the ease of assembly and quality of the wood and hardware. The seats are almost burlap looking, which we love! They do not look like cheap microfiber or chenille (which is what they are) because of the square weave. Seats are hard but comfy.", 
    "The chairs were easy to assemble, even for my husband and me who have pretty well given up furniture that has to be assembled. The only problem was that the bags containng the bolts, etc. of 2 of the chairs had been cut open before we received them. It took a lot of searching to find the washers and lock nuts. They had fallen out and were loose in the box. I even left and went to the hardware store to buy lock nuts before we found them all.", 
    "Fabulous, could not ask for a better chair. The Price is great. replaced all my fancy dining chairs with these and, these look better. Can't go wrong.", 
    "I was amazed with the quality and durability of these chairs. I actually purchased four of them and I would highly recommend them if you are looking for this type of chair.", 
    "I am very satisfied with my purchase. We needed to replace our chairs but not the whole dining room set. They seem very sturdy and I like the style.", 
    "These chairs are a beautiful wood and the color is true to the picture. However, the seat isn't square and narrows from front to back. Dimensions of the seat cushion needs to be added to the details.", 
    "Easy assembly and very solid and comfortable.", 
    "Looks good ad matches my current table well. Easy to put together.", 
    "Great chairs. We ended up staining the table to more closely at church the chairs", 
    "\"I like the chairs, but they are not sturdy. We keep having to tighten them up because they get wobbly. One of the chairs was damaged and they did replace the damaged part quickly. However, it seems with just scooting the chairs in to the table, several of them have developed little nicks. The chairs were easy to assemble.\"", 
    "Great Chairs, nicely made and heavy. Will withstand a lot of abuse. Chair seat a little funky but we like it. Would definitely buy again.", 
    "TRIBECCA HOME Swindon Rustic Oak Classic Dining Chair (Set of 2): like it very much.", 
    "Ordered these chairs for my daughter's apartment to match a rustic table I made. Perfect match! Good quality chair for the money.", 
    "Great chairs. Packed two to a box. Double box packing. Impressed with the quality and the look. Not as red as the picture looks. More of a dark oak, almost chocolate. I really like these.", 
    "I bought these chairs to go with solid rustic table I had refurbished. Excellent compliment with bench. Very easy to assemble, impressed with the quality, and thrilled they came in pairs. OS is the best", 
    "Just received our chairs....easy to put together....very sturdy.....match our antique oak table perfectly....very classy ,,,,,LOVE them...will order from overstock again!!!", 
    "Chairs are very sturdy with clean lines & not too heavy. The cushion fabric is perfect; could be a bit softer cushion. We are very happy with the rustic oak color; matches our hutch and dining table. We are very pleased with how quickly the chairs were delivered and the price was great.", 
    "These are solid, high-quality very comfortable chairs. They were delivered quickly, undamaged, and went together easily. Mine seem a bit darker than the photo (but it isn't uncommon for colors to vary). I am very happy with my purchase and would definitely buy these - or this brand - again. Made in Vietnam.", 
    "These are very good buys. Comfortable & sturdy. Worth every penny.", 
    "Perfect to go with antique oak table-love the look-very easy to put together-only problems was the box arrived damaged and both set of screws/bolts were open . Quick fix and $3 to get replacement screws/washers at Home Depot. have only had for a week", 
    "I was surprised I had to put them together, but it wasn't too hard.They are beautiful, steardy, and everyone loves them.", 
    "I had this table and chairs for almost a year. Love it and would buy it again. I have a big family, 10 of us can sit around it easily. Cleans up easy too.", 
    "Nice quality for the price. Only one small damage in the wood that was easy to fix.", 
    "We have an antique oak table, with a fairly dark finish. When redoing dining room, we decided to look for new chairs. I ordered these (8 of them), based on positive reviews & they are marvelous -- very study, very attractive & very well made. My husband was able to assemble them easily -- he followed suggestion given in one review, to not tighten all the way screws holding seat to frame -- go back at end to tighten. Good suggestions! We sprayed linen seats with scotch guard & let dry, prior to assembling. Not only are these attractive & very sturdy, but they are very comfortable as well. Finish is medium-dark to dark, depending upon lighting. I highly recommend these chairs!", 
    "I put 4 of these together in less than an hour, they are very comfortable & well made. LOVE them!!", 
    "These chairs are good. I had a problem with the material on the seat snagging. They were promptly replaced by Overstock.", 
    "Chairs match table and are very sturdy. Assembly is more difficult than it should be. Recommend that you remove the seats and level legs, otherwise the seat padding causes the front legs to be uneven. Also missing a couple of screws.", 
    "Love these chairs - They look great", 
    "Well built, sturdy and attractive chairs", 
    "Very well made and comfortable", 
    "Shipment arrived when promised. I ordered four chairs and they came well packaged, no scrapes, no shortages of parts. If I had to find a \"flaw\", it would be that they are alittle darker in person than what the picture shows. I am definately glad I bought them and I would recommend them. Got our money's worth!", 
    "Seat cushions are very hard, impossible to seat comfortably.", 
    "These are well built solid chairs. They look fantastic and are very very comfortable to sit in :)", 
    "I received six of these chairs in three separate boxes. One box was compromised in transit, and costumer service was fantastic. I got a full refund for the damaged box. I did not replace them for the reasons stated below. The chairs are attractive, but the seat is very hard--I may purchase pillows to soften them. I had two friends try them out and they thought, yes, very hard, but not uncomfortable. I guess I'm used to my old dining room chairs which had more foam in the cushion. The chairs are a piece of cake to assemble--took me about 10-15 minutes per chair (by myself), once I got the algorithm. One thing I didn't like was the formaldehyde smell. I off-gassed them in the garage with the door open for about three days. The smell was intense, but has dissipated now. I would research that aspect more thoroughly in the future when buying foreign made furniture. All in all, the chairs are well designed and reasonably priced, just hard to sit on. Customer Service gets five stars.", 
    "Needed chairs that matched an older oak table - backs are a bit wider than I thought based on picture, but a great addition! Well made and solid quality!", 
    "Well made, easy to assemble and comfortable.", 
    "Got exactly what I ordered!", 
    "great chair for the money", 
    "Great product. Worth every dollar.", 
    "No complaints so far. They were easy for my husband to assemble, and look very similar to what you see in the photos. I like the color of the seat fabric as its very neutral. We paired these with a darker cherry table we bought from Pier One. I was unsure of this mis-matched wood at first, but after seeing it daily now, I like it! The price is great as well - that's what sold my husband!", 
    "When my chairs arrived, I was home alone. I called my husband he said that he will take care of them when he got home. I couldn't wait (lol) me and my Moscato (lol) we did it our self all (6) chairs! With the instructions, it was a piece of cake, he couldn't believe it. By the way they look marvelous !!", 
    "I have looked for over a year to find some chairs that would match my dining table. I love the chairs but wish they were just a little heavier made.", 
    "The chair is nice and comfortable but does not look like the picture color wise, it is significantly darker than it shows on the picture.", 
    "Good solid chairs. Fast delivery excellent choice. easy to put together.", 
    "The chairs are great quality and the price was hard to beat. The assembly was so simple and every chair comes with it's own tool.", 
    "I was a little nervous at first ordering these chairs but so happy I did. I read in someones comment that the chairs are a tiny bit darker and I was truly counting on that. Matched perfect with my dining table I already had and revamped. The chairs were seriously easy to assemble. I had four to assemble and it literally took me 20 minutes would have take probably 10 minutes if my little munchkins were so busy playing inside the boxes while wanting to help haha", 
    "Easy to assemble, very comfortable and good looking.", 
    "I bought 2 sets of these to go around my kitchen table. I wasn't in love with the seat coverings but I had intended to recover them anyway. Assembly was easy and pretty quick. The overall look of the chairs is very classic. I amvery pleased with the purchase and I think they will last a long time.", 
    "excellent quality and workmanship in these chairs. very comfortable and sturdy", 
    "Overall, I am delighted and very satisfied with these chairs. They were easy to put together and no additional tools were needed. They're sturdy and very attractive. I found the color of the wood to be a tiny bit darker in real life than in the online photo, but don't consider that a problem. The seat cushions are not overly soft (rather firm, actually), but they are comfortable and look great. For the price, I am impressed with the quality. I think these chairs are an excellent value and highly recommend them.", 
    "Looks nice, feels nice, easy to put together! Nice for the price!", 
    "They are pretty, but are made of pine wood, so don't expect them to last a long time.", 
    "Just as advertized and pictured. Great packaging. Easy to assemble with included allen wrench.", 
    "I was a bit leery about ordering dining chairs. However, I was pleasantly surprised to receive 6 beautiful all wood chairs. Good posture and durable fabric. No damages, timely delivery. Very easy to assemble. Made a beautiful addition to my existing table. I would recommend. Great quality and price.", 
    "Very pleased with these chairs and have received many compliments. They were not difficult to assemble. I did need to retighten the bolts after a few weeks, but we had just built our house and there was a lot of humidity in it from the plastering. I had needed new chairs to provided seating for our old table, which I kept because of its size. These work well and I also purchased the matching bench. This summer I will refinish my table to match.", 
    "The (6) chairs arrived in a timely fashion; packaging was excellent; the assembly was rather easy once you went thru the first chair. So far so good. I have had these chairs in used for about 2 months - I just noticed a small \"slice\" of the wooed came off the back of one of the chairs - can't miss it as you can see the actual color of the wood - real white. Another inconsistency - When I was about to place my order I contacted Overstock's Customer Service and asked where these chairs were manufactured, as I wanted to buy American made furniture - I was advised that these chairs were made in the USA by a small producer out of California. When I received the chairs it was clearly indicated in the packaging, as well as under the seat, these chairs are made in Vietnam.. Why lie? Disapointed. Just be careful with Overstock - they do not always tells you the truth (This is the second time I am being asked to rate these chairs -I wonder what happened to my previous rating?).", 
    "Chairs were very easy to assemble. Vey comfortable and great quality. So happy with this purchase!!", 
    "I needed two extra dining room chairs and these matched fairly closely. They are not of particularly good quality.", 
    "We are first-time customers. Our dining room table set is probably 35 years old. The table is in excellent condition, but the chairs were beginning to fall apart, one by one each year. So I was searching for new chairs to accompany the existing table. This was exactly what we were searching for - a high-quality, affordable set of chairs. We bought 10 for Thanksgiving dinner. When they arrived, I refinished our dining room table to match the color of the chairs. Excellent packaging - each set of chairs is wrapped in plastic and protected by a layer of styrofoam around all inner sides of each box. Assembly was easy - t takes about 15 minutes per chair to assemble. The photo and product description depicted on the website is 100% accurate. We especially like that the padded seat has a full wooden base so it is a very supportive chair. Beautiful color and comfortable style. We spent alot of time at the holiday dining table this year, catching up with family news, playing games, and of course, the Thanksgiving Feast. We are pleased with the price, the quality, packaging (no damage in transit), and service. Thank you, Overstock.com. We will definitely visit you again. :)", 
    "These chairs fit my rustic house and they are comfortable. They went together easily except for one hole in one chair my husband had to drill deeper. I had them just in time for Thanksgiving and everyone was suprised such great chairs came via Overstock and UPS! I tried to order another pair, but they were not in stock. Because I liked these dining chairs so much I ordered two chairs for the living room. If they are of the same quality I will be so happy. If the dining chairs come back in stock BUY THEM. But not before I get my other two.", 
    "I purchased two chairs. They were a little bit darker than I thought they would be. They were easy to assemble and look very nice. I would purchase again and recommend.", 
    "Very easy to put together. Lots of compliments from Thanksgiving guests.", 
    "These chairs are just what I was looking for. They are exactly as pictured and seem to be very good quality. My husband had them put together very quickly without me even having to ask him to do it. No complaints!", 
    "I received the chairs less than a week after ordering. The assembly was very easy. The color is darker and more even in person, which I am fine with. The fabric is less gold in person, which is what I was hoping for, it is a nice neutral. Cushions are very firm, but I'm sure they will break in nicely. Can't wait for the full set to arrive, we ordered these chairs to create a full set and not have to use the bench for formal dining.", 
    "I LOVE this table! It is so beautiful and is of such a great quality! It could easily fit 7 without the leaves! Shipping was fast too. Would definitely recommend.", 
    "I have to say it's hard to shop for furniture online without seeing it first hand. I must say i am very pleased with the product, color, quality and style. With sanding and staining my dining room table everything matches 100%", 
    "Easy to put together. Well made, and clean lines. Very good buy for the price.", 
    "This table his huge with the 2 extension leafs. The wood is beautiful the bench makes the entire farmers table look. I've looked for a very long time for a table that wasn't the light pine farm table and found it with this table. Need 2 people to put the table together well I did. The chairs are comfortable you do need to use a pad or lined mats or else you will ruin the table. I definitely would recommend this table to all. Note that you need a rather large dining room for this big table. You won't be disappointed with this purchase. Also I found it great that you can order extra chairs which I did. Also at a very good price. Hope this helps"
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Swindon-Rustic-Oak-Classic-Dining-Chair-Set-of-2/6751512/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6751512/TRIBECCA-HOME-Swindon-Rustic-Oak-Classic-Dining-Chair-Set-of-2-f57ed233-1134-40a9-a0d8-3443cef6b554_600.jpg"
  ], 
  "description": "Invite friends over to gather and relax on these Swindon pine wood\nchairs. These sturdy dining chairs have a deep oak finish and a\nclassic chic, all without looking overly formal - so they can fit\nin a variety of decors. Their rustic design adds a cozy, homey\nfeeling when paired with a similarly styled dining table.Two chairs included in the setMade of pine woodBeige linen upholstery is filled with polyurethane foamMeasures 40\"H x 19\"W x 22.5\"DRusty oak finishSeat is 18\"HStyleModern, RusticMaterialLinen, Oak, Pine, Veneer, WoodChair TypeDining ChairsSeat HeightCounter HeightSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBeigeFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion"
}