{
  "name": "TRIBECCA_HOME_Henry_Wingback_Nailhead_Upholstered_Club_Chair_with_Pillow", 
  "price": "EUR 378.16", 
  "reviews": [
    "I love the look of the chair. The fabric has a nice woven texture and the shape is pretty. Unfortunately, the quality isn't great. The back is stiff and feels cheap. For the price it's a nice chair. Not your lounging chair. As a separate note, shipping was awful. The bottom of the chair was torn and the bolts and legs were scattered throughout the underside of the chair. I did not take shipping into account for my rating--otherwise it would have been a zero.", 
    "I was concerned when I read other reviews talking about shipping issues, and ordered anyway thinking that may be rare. Well my chair also arrived with the box torn. The chair now has discoloration on the top where it rubbed again something in transit as well as having the fabric torn. The back is cheaply made- when you lean against the back you lean against the hard back. It also did not have all the parts- was missing two washers and without them the legs can't be tightened.", 
    "Received my chairs on Tuesday, 8/18 and one package did not contain all of the hardware needed to assemble the chair. The other was missing a couple of pieces. I've been in constant contact with Overstock support and am getting the runaround on getting replacement hardware. Extremely ineffective support processes and still not resolution to my problem. I've always been please with Overstock before but this is likely my last purchase with them.", 
    "I ordered this chair in the blue for my guest room and it is very nice and quite comfortable. I am going to add a larger pillow for the back for extra support, but overall it's great and I hope you get them back in stock. I would like to order more for my family room.", 
    "Love the look of this chair. I wish the fabric was a little thicker but for the price it is great. Also will use a bigger pillow to make chair more comfortable. First time I have ever ordered furniture online. I loved having it delivered to my front door. Putting legs on chair was a little confusing but once I figured it out -no problem.", 
    "I ordered 2 of these chairs in the darker brown shade and am pleased with the size, color and quality. They shipped and were delivered quickly. I'm pleased and recommend them to anyone looking for wingback club chairs.", 
    "Awesome chair for the price, many comments on how nice it is. The color and chair matched the picture.", 
    "This chair was easy to assemble and tres modern. Back of chair has linen fabric over a wood stretcher with no batting , foam or fabric rendering it substandard.", 
    "I purchased two of these chairs for a client. The scale and size was great but the craftsmanship was horrible.", 
    "I bought this chair for the sitting area in our bedroom. The look of the chair is Awesome however, this is not a chair for long lounging comfort as its not the comfortable but again its nice to look at and to sit maybe to read a magazine etc..also i must agree with the others concerning the shipping, the screws were thrown all about under the bottom if the chair with a few pieces missing, they should look into securing them better or taping them in the interior of the box. All in all though I\"m pleased with the look of the chair considering the price.", 
    "The hardware to attach the legs was broken in the box and was unable to retrieve multiple washers for the assembly. The actual chair is nice, but the cushions are not square.", 
    "I expected a little higher quality fabric and cushioning for the price of the chair. While not Overstock's fault, the package arrived in shreds, handling had caused some shifting of the fabric around the frame, and the bolts to attach the feet were missing. As always, Overstock provided excellent customer service in resolving the issue.", 
    "I ordered two of the tan color and the chairs are good-cushion is very firm, size is great and color is what I had expected from the picture! Installation went ok-getting the correct legs in their places was a little tricky but once it was figured out, all was fine!", 
    "We purchased two chairs in green color. The design was very beautiful and elegant but the chairs were made very low quality. Both chairs armrest kept making loud squeaking noise. Not happy with the purchase at all!", 
    "These chairs are beauitful. My only complaint is their hardware was stored inside the bottom of the chair for shipping and had all fallen out of the package before it arrived to me. I had to hold the chairs upsidedown and shake them to get all of the hardware out, and some of it was never found. Also, there were a few exposed staples that probably I will only notice.", 
    "I ordered two of this chair. Absolutely love it, minus the fact that the bag for the screws, washers, etc. had broken open so I am missing one screw and 2 washers for one chair and 2 washers for the other.", 
    "Used the chair in a stair landing.", 
    "Only reason I didn't give this chair 5 stars is because it needs a larger back pillow for comfort otherwise it looks nice", 
    "Well made chair and easy to put together.", 
    "Very attractive, comfortable, of good scale and makes any space look good in photographs! I am pleased with my choice.", 
    "Love it!! Bought it in the dark blue n just as shown!", 
    "Bought two of these for my front room. I couldn't believe how nice the price was. They are good quality and I love them.", 
    "This is a very pretty chair. We ordered the beige color & it came in a reasonable amount of time & it was easy to put the legs on. However, our only reason for not keeping it is that it is VERY uncomfortable. No back support even with the lumbar pillow and cushion is very hard. Pretty chair if you don't plan to sit in it any length of time.", 
    "we just received this chair for staging job and upon placing it,realized how beautiful it looks on our stage job. I can't vouch for the quality in terms of sitting because we will probably never use the chair for setting but it sure looks good in our project!", 
    "We wanted something different and nice looking for our living room so we decided to order 2 of these chairs instead of purchasing a love seat! BIG MISTAKE! First, the chairs arrived with one of the missing the nail heads and they both arrived with defects where the legs of the chair are supposed to be placed! Emailed customer service they claim the chair was now out of stock and they would contact me once it was in stock! Ordered chair in the spring of 2015, never heard back from them! Continued to check site myself and saw that chair was back in stock fall 2015 so I contacted them....explained everything they finally sent a replacement chair but wanted the defected chair back but I was responsible for finding a shipping box big enough!! Supposedly for my trouble they would credit my account $** THEY NEVER DID!! They legs on the chairs are constantly loose every other week and for the price I am upset!! They are uncomfortable and the back cushion is hard! We dislike these chairs and we wasted a lot of money in purchasing 2 of these chairs for our new home! Now we have to try to purchase more chairs to replace these and I guess just count it as a loss!", 
    "this chair is perfect for working on my computer and an additional accent chair, love it.", 
    "This is a perfect chair for an occasional chair in my living room. The color is exactly what I expected so I am not disappointed with the color or the weave of the fabric. The only thing I might suggest would be to Scotchguard two or three times per year for stain protection. This chair fit my budget nicely and I'm very satisfied with the quality.", 
    "We got 2 tan chairs for our library/parlor room & as reading chairs I wanted something with moderate comfort but also stylish because it's the first room seen upon entry to our home. They had been out of stock for awhile so I had been patiently waiting for the tan to come back in stock. Pros: clean lines, arms well placed, material although \"lightweight linen\" looks to be a rich linen blend (or luxurious linen), nail heads are lovely, comfortable to sit in (firmer but comfy) I found the back cushion adequate (as opposed to other reviewers who said they needed additional back cushioning.)Cons: shipping (arrived damaged! Both boxes, even the REPLACEMENT box came damaged- thankfully the chair was intact!), the legs & leg sockets are poorly constructed so that it is difficult to put together and get it to \"sit\" correctly or evenly, where the nailheads are inserted there are occasionally folds or \"whoops\" areas where the material is bunched up or folded backwards- just not professionally looking. Now- these areas are barely noticeably standing back 10 feet, at least not in the \"Tan\" color material. I doubt many people will notice. It didn't detour me from purchasing them at this price point. I didn't even think about sending them back when I noticed it. I just sighed. Meh.Overstock.com was great as always in fixing the damaged shipping problem and quickly sent out a replacement for one of the chairs damaged in shipment. As far as the manufacturing \"details\", at $***/chair, you get what you pay for and I believe it's a fair deal. I think the chairs are lovely. I hope they hold up to use over time.", 
    "It is a good chair. The seat is deep (5'3\" and feet hang if sitting all the way back) which is good because I bought it for my husband (6'3\") and he said it fits. The seat is comfortable and the stitching is well done. The padding on the arms are a bit thin for my liking. It is a good chair and we are happy with this purchase.", 
    "Love this chair, I'm short so it's a little big for me (5ft). They look good though!", 
    "Gorgeous and comfy too! Wonderful value.", 
    "It's a great buy! Adds elegance to any space."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Henry-Wingback-Nailhead-Upholstered-Club-Chair-with-Pillow/9824666/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=4", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9824666/INSPIRE-Q-Henry-Wingback-Nailhead-Upholstered-Club-Chair-with-Pillow-8ca793a9-27ea-43c8-b198-8f989cddc5c2_600.jpg"
  ], 
  "description": "Enjoy the classic look and superior comfort of this TRIBECCA HOME Henry club chair. It offers a contemporary update on the traditional wingback silhouette that pays homage to the past while looking right at home in modern interiors. Nailhead trim and a coordinating accent pillow complete the look. Select the upholstery color that complements your decor. Place a chair next to the fireplace, or use two chairs to flank your sofa. Sustainable rubberwood provides an eco-friendly and strong material for this sofa's construction, while thick foam cushions provide relaxing support. The chair's outstanding quality ensures years of use.Chair includes accent pillow for enhanced comfortWingback design, wood legs in dark espresso finish and nailhead trim provide a traditional lookLinen upholstery available in several colors to match your decor24.25\" arm heightD28 foam density for comfortRubberwood provides strength and sustainabilitySeat measures 19.5\"H x 22\"W x 24.25\"DOverall dimensions 41\"H x 29\"W x 37\"DIncludes one contemporary chair for a modern updateStyleCountry, Nautical, Southwestern, Traditional, TransitionalMaterialLinen, Rubberwood, WoodChair TypeAccent Chairs, Arm Chairs, Club Chairs, Wingback ChairsSeat HeightCounter HeightAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, Green, GreyFurniture PatternSolid"
}