{
  "name": "Tucker_Tan_Recliner", 
  "price": "EUR 270.73", 
  "reviews": [
    "This recliner is kind of small, not for bigger people. I weigh 120 lbs and can fit in the seat, but I'm not sure how comfortable it would be for someone 50lbs bigger than myself-I think they would partially sit on the arm rests. It feels flimsy, but I gave it an average rating because for the price, it was worth it. It is very light weight, my teenage daughter and I brought it into the house easily. The box is big, it will not fit through an average sized door. You can see the shape/form of the mechanism under the fabric on the footrest, which makes me think it will wear down and look worn out really soon-it's not padded very well there. The padding on the seat and back seem average. I honestly think the recling back will break a lot sooner than you would expect one to. It moves and doesn't seem sturdy. Assembly was easy, it comes in 2 pieces, you just add the back to main part of the chair.", 
    "This recliner does not work for me. It is not comfortable, the leg rest springs up but you will find it hard to put back under the chair. Looks inexpensive because it was. Recliners must work hard and this one will not last. I figure I shall put it in the guest room and it can be there for a year before I donate the thing. Just keep looking.................Overstock has been a main source for furnishing my home and this is the first time I was disappointed. So pay a couple more hundred and recline in comfort.", 
    "For just under XXX dollars, this is a great recliner. Some have complained about the size, but I actually prefer a smaller fit as opposed to those bulky recliners with excess space. By the way, I'm 6'2- 200 lbs. My only complaint with this chair is that its a little on the stiff side. I was hoping to have that soft sinking feeling when my butt drops in, but right now its a little firmer than expected. Take that with a grain of salt though, because this review is being written on the day I received the chair. Its quite possible that the seat will wear in and soften up as time goes by. I'll post an update in a couple months. Overall though, this chair is well worth the money and I do not regret buying it.", 
    "GREAT recliner. I was a little skeptical since the price was so low- but it is really high quality. Color is as shown- very soft, very comfortable- especially when all the way reclined. Not flimsy either- definitely recommend- cannot beat the price! Shipped fast as always.", 
    "We bought this recliner for my moms 67th birthday it arrived the day before !!!!! My mama LOVED IT!!!!!!!!!!!! Shes already told other people about it! The value was the best I have ever seen and my hubby says it was an snap to put together!!! I would definitely recommend this recliner to others worth it couldnt believe the shipping was only 2.95!!!!!!", 
    "I bought this chair for my mom who had lost allot of weight and the chair she had was worn out. I thought it would have been larger and more plush than it is. It is a nice little chair, My mom is around 5/9, and it is really a short chair, she only weights 120 so its small enough for her little butt to fit in but its not built for comfort.", 
    "Purchasing a recliner on the internet was not a great idea and would have not been able to send it back because you have to cut the box up to get it out. I am a 5'8\" woman and it is too small (short) for me. This is definitely not a chair a man would use. The fabric is fair but it is very cheaply made. I could have gone to Big Lots and gotten more for my money and should have done that. 20/20 hindslight - will never purchase another chair on line.", 
    "My father came to visit and his back only allows him to sleep in a recliner. I purchased this cheapy recliner since he only visits once a year and I didn't plan on keep it in the living room. the recliner is LIGHT, i put it together myself (2 pieces). It reclines back all the way, it wasn't uncomfortable. Dad said he slept okay, however the recliner looks like it's been used for months when he was only here 9 days. the head cushion was stained and i tried to clean it and it wouldn't come out. Hard to complain about quality of material etc when it was so cheap. If you need a recliner and don't want to spend a lot it's a good buy. My father is a big guy, 5'11\" 220, i was worried he would be TOO big for it, but he made it work, I don't think it was the most comfortable option for him. I am 5'7\" and it was just about right for me.", 
    "LOVE THIS CHAIR. I purchased this chair for my elderly uncle. He is short in stature with a fused neck, so he always needs a pillow under the back of his head to stop the pain. First, when the chair was delivered, I was able to carry it (it comes in two pieces) upstairs to his room with ease and assembly was a snap. When I had him sit in the chair and recline, his head fit on the chair like it was custom made for him and his health conditions. I have never been so happy with not only an item I purchased, but also with an item I purchased online on OVERSTOCK.COM. Thank you for the great products and the prices that anyone can afford. AM H.", 
    "I was disappointed in this purchase. The chair only slightly reclined, which was the reason for the purchase.", 
    "I bought this recliner for my bedroom, its small but it fit great in there, I'm a large Lady(250) it fits me ok, I'm 5'4, the seat is firm but I'm sure I will brake in, I like the color and it looks just like the picture. The price was great, would buy it again. Love Overstock", 
    "Purchased for my husband as a gift. He said that the recliner was too short for him, he is 5'11. In the sitting position his feet and ankles hang over the foot part. He does however like it when it recliners back. Construction could be more durable but for the sale price it will do.", 
    "I am very pleased with my purchase. It fits well in my living area, is a very nice contrast to my other furniture which is like a shade lighter. It is the perfect size for me. I am a thin petite person so it is very comfortable for me. I fall asleep in it (probably too much). My daughter complimented me on it and wanted to know where I got it and she has extremely good taste in products. She could not believe the price either. Would definitely recommend this to a friend.", 
    "Got a pair for our 25th Wedding Anniversary and we just adore them. Find ourselves on Saturday afternoons snoozing real nice like. Good investment and easy to assemble.", 
    "Great for the price, soft and perfect to watch tv and to use while my husband recovers for surgery. Good buy", 
    "This chair will not recline without a lot of extra effert. like theirs a catch in it, not at all what i expected", 
    "I'm enjoying this recliner fix prefect for my spare room.", 
    "I like it, its small and I don't have a lot of space so it fit perfectly. however, I was forced to buy this color because every color had a different price and I went with the most affordable. It shipped within a reasonable time. I would have also like to see it next to another recliner to see the different in size compared to a large recliner.", 
    "I needed a recliner that wasn't as big as most. This fit my needs exactly. Very comfortable too! Will definitely check here first for other home items!", 
    "like yhe color and very pleased with the chair and the sofa", 
    "this chair is a piece of made of PLYWOOD really crappy, not durrable at all for 170 lbs. will not ever suggest to purchase this again..", 
    "This recliner is comfortable, but I would not recommend it for larger men. We got it for our son and have only had it for 7 months and the seat sags and it seams like I am falling into a hole when I sit on it.", 
    "Hey for the price you can't go wrong. My husband wanted one but I can't afford $XXX for a recliner. This is in our budget for now and I don't feel robbed if it breaks in a few years. For the price, it's nice sized (he's 5'7) but I would not get this for ANYONE over 6'. I'm 5'10 and it barely fits me comfortably. For a smaller person yes...larger (size/weight) no.", 
    "i bought this chair for my elderly mother, it was very firm, and not comfortable at all. This would be a good chair for someone of small stature that likes a very firm recliner", 
    "This chair I s like sitting on concrete. Another waste of $$$$$$$$", 
    "Although I didn't pay a great deal as far as recliners can run, I have come to expect much more from Overstock's products. This chair is very small, hard and flimsy feeling. It is not at all what I wanted. Given that the box it arrived in was absolutely huge and it would take me a great deal of repackaging time and effort to mail, I will keep it. My furniture buying will be from another source in the future.", 
    "I would not recommend this to a friend because it is covered in like cornmeal. Had you sold it before?", 
    "Pretty chair, but it leans back when it is in the upright position. Foot rest would not go down; so I had to climb over it in order to put it down with my hand, then it popped back up. I finally realized that in order to make the foot rest to stay down was to push it backward until it caught. This is very difficult for a senior citizen with a hand injury. To add insult; I could have purchased a better quality chair for $** more at a local store.", 
    "Horrible! The worst recliner I've ever owned. Rough material, rock hard seating, small seating area, short length when extended..... I could go on and on with reasons that this is a terrible purchase. Definitely DO NOT BUY! Very very disappointed!", 
    "This is very comfortable and a good value for the price.", 
    "Very Happy with the chair. We were both very happy with the quality of the chair.", 
    "Perfect for my needs and the price was right. This is not a high end recliner but I am satisfied with it. I needed something and did not want to spend a lot of money. I am 5'6 and the chair fits me fine. My husband tried it and it's a little small for him and he is 5'10. It is definitely not for a large person.", 
    "The chair is very nice, but very small...be good for an older thin woman...it's attractive enough, just not soft and comfy.", 
    "This chair was ordered for my girlfriend in Florida. She loves the chairs! She says they are very comfortable and look fantastic in her living room!", 
    "Nice chair, the only thing I would mention is it has a fairly narrow seat, so larger people may find it to be small. No rocker on this one either.", 
    "chair came quickly,and I was pleased.Not a large chair, but comfy. This works for me, I won't worry about the dogs, the kids, etc. If it lasts a few years at this price i will be pleased", 
    "Good enough for the money we spent. The only thing is very light weight item. but worth to buy this product.", 
    "I am extremely pleased with my purchase. It was delivered early even! It's comfortable, perfect size... Fits better then most recliners.... Soooo soft..... And for the price ? I love it!", 
    "I ordered this chair for my Parents Den and they Love it. It is just the right size for the room and it sits well. It took less than a week to arrive. They like this one so well I'm ordering other one to match it. Thanks again for offering good products for a good price.", 
    "Bought for Hubby, didn't like at first. Some wear made it comfy.", 
    "Fabric looking good after a year", 
    "For the price it was worth the purchase. I like the color and it was very easy to assemble when it came. A couple of things I don't like is the fact the back doesn't recline back any and the footrest doesn't stay in place when I put it up. It tends to lower some when my feet and legs are on it.", 
    "Mine arrived damaged. Other than that I really like it. Very comfortable.", 
    "This product is awesome. Very comfortable chairs", 
    "Good recliner for the price! Comfortable as well", 
    "Ordered this for nephew's first apartment. A little smaller than I expected but overall good for the price and convenience of shopping for gift without leaving living room.", 
    "THIS RECLINER (TUCKER) IS THE WORST ITEM I HAVE EVER PURCHASED AT OVERSTOCK. IT WILL RECLINE BUT NOT SIT UP AGAIN. THE FOOT REST DOES NOT WORK. I WOULN'T PAY $$ FOR IT MUCH LESS THE BIG AMOUNT THAT I DID PAY, IT IS BEING RETURNED.", 
    "Cheaply made, didn't have 1yr and it started to come apart. The fabric stains easily and is very hard to clean. I would not recommend this recliner", 
    "It was cheap, so I guess I should not expect much. Very hard, sets up too high and already loosing it's shape.", 
    "it is very comfortable and durable best recliner we ever owned", 
    "I like the look and size of this chair but it's very firm and not very comfortable, unless the footrest is up. Maybe in time the cushion will soften a bit.", 
    "is satisfactory for what we needed", 
    "unfortunately, i can't say anything good about this chair. the right side broke down almost immediately----under 3 weeks! i haven.t finished the return on it yet.", 
    "Not easy to decline, or built got a large frame.", 
    "to small to firm seat and back", 
    "not very comfortable ended up giving it away", 
    "Hard to shut, low head rest", 
    "Very comfy love easy to put to gether", 
    "small and cannot close when opened. too lazy to return wish i could get a refund", 
    "We have had this less than 2 years and there are springs popping up from the inside. I am paying my township to haul it away. Total cheap junk.", 
    "Very comfortable and nice value.", 
    "Every one liked it but it is hard to put down once you have it up. Very comfortable but it does need a lot of pressure to get in lying down position amd doesn't stay there. The fabric is awesome and the color is great. All in all it is what I was looking for", 
    "Lightweight, comfortable chair.", 
    "It's okay for me but I think it would be a little bit smaller for a man.", 
    "While some people are correct that the seat is smaller I actually like it. I am a larger person. I am 6ft and larger build. I fit perfectly into the seat. The chair is slightly higher than I thought but then again it is just right for me. I have recently had problems with my knees and this chair is easy to get out of. I am very pleased with the chair and the price was perfect!", 
    "He says it was not a good purchase. Not a comfortable. Lounge chair.", 
    "nice price for such a nice small space saving chair. comfortable and just the right size for my small space.", 
    "It's an OK chair for the $, the seat cushion is a little hard, so I'm trying to break that in & it's a little stiff pushing back, but other than those 2 things, it's pretty good.", 
    "This chair is comfortable.", 
    "Chair needs to be bigger a little on the small side", 
    "Very comfortable and nice looking chair...a little smaller then I expected, but works fine for my 6'2 husband.", 
    "I've used this recliner in my son's room to read books and for the price it is well worth it!", 
    "Nice Chair , Great Price , A little on the Small side , but great to fit in my bedroom.", 
    "These recliners are comfortable. Very firm seating and a very nice range of inclination; more so than others I have owned.", 
    "I brought the cocoa recliner for myself and once I realized how easy it was to put together I ordered one for mom. She loves her chair! Decent chair for the price.", 
    "Bought this for a disabled son that spends lots of time in his chair. He seems to be really happy with it. It was very easy to put together.", 
    "Great value, for smaller size folks", 
    "Easy to assemble, comfortable, nice soft fabric, great neutral color that works well with my decor, arrived quickly. Very satisfied!", 
    "Sits very well and looks great", 
    "The chair is comfy, strong, beautiful, and worth the price.My husband and I are on the short side of normal, and the chairs fit us well.My tall brother, says it's still comfy, though.The foot rest pops up easily, with the pull of a small lever.CON: It's very difficult to get the foot rest back down and into its locking position.If you don't have strong legs, you'll easily get stuck in this chair!", 
    "Great chair for the price special if is young children's you can always get another one.", 
    "looks nice , but very hard to adjust to upright position after reclining..", 
    "The recliner arrived in a timely fashion and was extremely easy to unpack and assemble. It is a reasonably priced and comfortable recliner.", 
    "It's a smaller chair than we had but is very comfortable.", 
    "This recliner is fabulous. So comfortable, firm support, easy to put together. My husband's early Father's Day gift and he loves it. Great price easy to put together. We live in an apartment and it is a perfect size!", 
    "very good chair for the money", 
    "seemed a little smaller than the picture shows but still a nice recliner", 
    "Was kinda weary when it came in such big box but needed to be put together, but two peices that slide together, no bolts etc. NO TOOLS", 
    "A mothers day gift and it was the best one I have ever given. I put it together and my mother climbed in it and fell asleep within 20 minutes. She loves it and it is very comfortable.", 
    "I ordered two of these chairs. They were shipped promptly They arrived in perfect condition. They are perfect for a small space and very comfortable.", 
    "Agree with previous posts, it is perfect for small people, my mom is 5 feet and she loves it, also closing mechanism is hard but you get what you pay for. Overall is a very good product for the price.", 
    "Very comfortable, beautiful color, and perfect size.", 
    "I actually bought this chair for my boyfriend but when we got it put together, it was smaller than I thought it would be. I will pay closer attention to the decripition next time. it is MY chair now! LOL more my size.", 
    "I purchased this for a dear friend whose recliner broke, and being the great Mom that she is, wouldn't make replacing it a priority. Well, she is really happy with it and I was happy to purchase this so easily and at a very good price! It was delivered when expected!", 
    "This chair should have a sized for women on it. I find it to be very small and wish they had mentioned that it was a small chair,", 
    "An added touch to the family room with this Recliner. after spending hours watching my favorite shows on tv, it feels great to be comfortable.", 
    "This recliner is OK, but it is not for large people. Don't waste your money if you weigh over 125 lbs.", 
    "You get what you pay for.", 
    "Received the Recliner on time. Put the back on it very easy. Liked the size of the Recliner. Sit in it and it was great. Just what I wanted. Very good price too. Thanks Overstock.", 
    "As comfortable as it looks, it's a great chair to relax in.", 
    "This chair arrived quickly and was easy to put together. I purchased it for our bedroom which has limited space, so it is perfect for me. It is light weight and easy to position for watching TV.", 
    "Replaced an over-sized recliner. Good lines and comfortable. Perfect for our room's decor and style. Everybody who has sat in this recliner, relaxes and smiles...that tells you something. Priced right in my book.", 
    "I purchased this for my teenage sons room 6 months ago. He loves it. It is very firm and is holding up nicely. very good buy for the money.", 
    "I am VERY disappointed! This was a gift for my physically challenged mother and it is horrible! She is only slightly over 5 ft tall and the chair would be fine for my 7 yr old granddaughter or a very small person. It looks nothing like the picture featured on your website. I want to return it for a FULL refund. I will never shop with O again. Totally disgusted!", 
    "Most uncomfortable chair I've ever sat in. The seat is so firm you feel like you are sitting on the floor.", 
    "Beautiful chair looks exactly as shown on screen and color is a perfect match. Super simple to assemble (two parts) and although it is a heavy chair it was easy to slide into place. Single reclined position is perfect for me and it is easy to recline and return to original position. I love this chair and what a great value! I definitely recommend this product.", 
    "This is the second tucker recliner I bought from overstock. The first one in sage and I could have matched the two but decided to mix up with similar color tone but different color. This tan tucker color was exact. The assembly was snapping the back rest into the seat frame; basically a two pieces - one part seat the other back rest. The reclining mechanism is smooth and the sofa is comfortable.The UPS delivery was great; exactly on the day of estimate.", 
    "I bought this for my grandfather, and he absolutely loves it. We cannot get him to get out of it! The only warning I would have is that one of the brackets had been bent, so my dad had to manually bend the bracket with a wrench to get the chair to go together. Definitely worth the extra five minutes though.", 
    "We are so happy with the two tucker tan recliners that we received. They went together easily and were light weight compared tomany others. They open without hitting the wall with very little loss of space. Highly recommend!", 
    "The chair is nice and firm, very strong. However it is difficult to get into the full recline and also difficult to bring back to chair position. I am hoping it will get easier as we use it more.", 
    "The recliner arrived in a timely manner. It only required one process to put it together, super easy. It was a bit too firm for me at first but the more I sit in it the more comfortable it becomes. I love it. Very glad I purchased it. The color was spot on to what I thought it would be. I would definitely recommend this recliner.", 
    "I was a little concerned about buying furniture through the internet but everything turned out so well I have made several more items. Also, the call center reps were fantastic. I especially enjoyed the less than a minute wait time. Customer service seems to be important to Overstock.com , so I will always check there first before future needs.", 
    "Best value. Unbeatable price and quality. Flawless delivery.", 
    "Small recliner but is functional for the space. Nothing fancy, just functional.", 
    "Not a big as I thought. Great for a space saver. The color is very nice and matches everything.", 
    "This chair was very uncomfortable and cheaply made. The padding on the seat was stiff, it did not rock, the mechanism to recline it was cheap. And the chair arrived broken! The frame was broken at one of the arms, so it was totally irreparable, I had to send it back. I asked for my money back, which Overstock credited right away. But even if the chair wasn't broken, I knew I didn't want it. Very poor quality, so I guess you get what you pay for!", 
    "The recliner is very firm. The force of opening it is very strong. It will not close, without a great deal effort. It is worth the cost, but I will not be buying this, again", 
    "I call this my cats chair. VERY low arm rest. The arm rests are at strange angle. Nice material. Looks good but u able to use it.", 
    "This chair is for small people. Very firm. Quality seems fine, but anyone over 5' 5\" would find it too small.", 
    "An excellent chair for the price. Prompt delivery and very easy assembly.", 
    "I needed a smaller recliner because my house is small. This recliner was the perfect size. Since ordering this recliner, I have ordered another recliner and kitchen table. All three were delivered on the date I was given, which helped greatly with my work schedule.", 
    "this was also a gift and they really enjoy it. it's very comfortable and theyloved it.", 
    "Great product .Assembling was very easy and came with all items .", 
    "I bought this recliner for my husband and he loves it.", 
    "ordered this for my husband, he wasnt impressed when it came ( way different than his last one) He has been using it daily and even sleeps well in it!! He is very happy with it", 
    "I bought this product for my daughter, she loves it. It is very soft, nice color. I will buy one more for my son. That's the really good reclining chair for the small person.", 
    "Great service! Product delivered in a timely manner and in great shape!", 
    "Chair arrived within a few days of ordering it. I was able to put it together in a snap, fits perfectly in my family room. The color is great, just what I was looking for and is very comfortable. I weigh about 150, not sure it would be suited for someone much heavier.", 
    "A little hard to sit on, easy to put together, quick ship. Perfect fit for me.", 
    "I was not happy in the way the product was shipped to me. But was very satisfied in the way overstock customer service handled my order concerns. About the reclining chair: It was very easy to assemble only 2 pieces that connect together. Its great, comfortable and just what I was looking for to complete my living room design. It does not rock and I wouldn't recommend it for someone on the larger size 200lbs or more the fit most likely would not be very comfortable. But awesome for the price.", 
    "The couch will fit right in an apartment or a small room. It stays steady , so it can be put against the wall. I say is small and its good for a teenager or an average person.", 
    "This chair is very relaxing and comfortable. It fits perfectly in my living room with my other furniture. The only thing is that I thought it would be much sturdier. I can lean forward and almost tip out; or to the left or right, almost fall out. All in all, I guess I got what I paid for.", 
    "This is an excellent high quality reclining chair! Better than I expected. Easy to assemble, seems strong and well made. It was a good purchase and well worth the money. Shipping was great too,", 
    "love it I have in in my women's cave lol I like to read away from the Tv noise. Perfectly fits in a corner . The color is as shown its also light weight so I can move it easily.", 
    "I bought this recliner for my father for Christmas. He absolutely loves it, can't say enough good things about it!", 
    "I have for a while been looking for a mama chair. After my research, this chair what I wanted. It is not too overly large, just right for my Condo. It is very comfortable. I love the way it leans all the way back, so that I can take a nap. I find my self spending more time in my standing room, in my mama chair, I truly love the price I got for it also. All the other recliner I look at was very over priced. *** What a wonder deal. Love my Chair!!!", 
    "A good recliner for its price. A bit smaller then majority of recliners, but is a good quality for the reasonable price. Should be careful when getting up of it as it gets fold forward, but after a small adjustment we've used to how safely to get up. We bought two of these and my whole family just love them. I'm 5'8\" and a medium size.", 
    "I ordered 1 of these and had to return it. It would be okay for a very small framed person or adolescent, but I am 5' 11\" & weigh 250, and I was way to large for it. The 1 I had wouldnt recline nor would \"Lock the leg rests when lowered\". Maybe the 1 I had was just Defective, But 1 with a Handle operates Much Better than these with a Plastic Button on the side. It has a very Flimsy Structure & Really relates to the old Adage. You get what you pay for. I have tryed to be Positive with my Review, But No, I would not reccomend thiis product to anyone.", 
    "I bought this chair for my dad an he loves it!! He has it in his office an its his favorite place to sit!!!", 
    "Was not tall enough even for short people like myself. Other than that it was alright.", 
    "The recliners were purchased as a Christmas gift for my son. I couldn't believe the quality...I purchased a pair of brand name recliners a year ago from someone else. They do not have the quality of the ones I ordered from Overstock.com", 
    "For the money... Can't go wrong. This is not \"High-End\" furniture so... I weigh 230 lbs. Six feet tall. Fit just fine. Needed a chair to sit in. Works great.", 
    "It was hard to make a decission to buy as I could't find any demensions...I wanted something bigger and comfortable.", 
    "Brought this sofa for my grandmother who came out of a surgery and wanted her to be more comfortable than bed, as she put it. She's very pleased and I'm satisfy by the shipping and timing.", 
    "The color match is perfect for the sofa and loveseat in my living room. My brother thought I'd purchased my new recliner at the same place I purchased my sofa/loveseat. He was surprised when I told him I got my new recliner from Overstock. I really like it a lot! Though I've only had it a few weeks, it seems to be of good, solid quality. I anticipate enjoying this recliner for years to come. I'll have to check out more of Overstock's offerings.", 
    "Exactly as pictured and described. The color was exactly what I needed and shipping was quick!", 
    "The best .I mean this truely from my heart.Amazing quality and the price is very cheap comparing the great quality.It is comfortable and not hard either.Ofcourse it is not smooth and silky either.But overall 5 out of 5. Thanks Movahid", 
    "This is really a nice chair for the price. It is a normal size recliner. I am going to buy another one soon.", 
    "I bought this as a gift for my 88 year old Brother who has just come home from surgery and needed a recliner to elevate his feet. He adores it and uses it to watch TV off and on all day long. The chair fits close to the wall and is small but fits him and the room perfectly.", 
    "This chair takes up little space and is a nice neutral color. It is comfortable and easy to use. I am delighted with it. I am 5'5\" and it fits great.", 
    "Totally not knowing what I was getting I pprchased three of these recliners...simply because they were affordable, and the description with measurements, were right on the mark. We receied them in less than a week, and were e-z to put together, and are very, very, comfortable. They seemed small at first (just because our old was was worn out and stretched, but once you sat down...you just kind of melt into the chair. Very user-friendly...and looks like it will repel stains and/or at least e-z to clean up.", 
    "very comfortable. good for the price. no problems overall.", 
    "It is beautiful, very comfortable. It arrived on time.", 
    "good solid chair. not soft. firm. reclines well. small for big person but can be broken in. east assembly. no issues. decent product. no complaints", 
    "Totally worth the price for the product a little small but comfortable", 
    "A nice chair for when you have limited space. It is nowhere as large as most recliners, but if you are looking for something a little smaller, like I was, then this chair will work out well. It is comfortable, and the fabric is nice and soft. The seat is a little hard at first, but it does soften up quickly. Good buy for the price.", 
    "We received the chair exactly on the time quoted by UPS. The chair was rolled in my front door and left for me to open. Opening the box was a bit cumbersome but the chair came out easy enough. The chair was in two sectiions the top section has prongs that slide into slots on the bottom section. The chair is best for shorter persons. It reclines quickly when the side latch is opened but it is hard for a weaker person to push the chair back into an upright position. I would have to say that I like the color and the fabric o.k. It is not in the same league as my Lazyboy but is just fine for the price I paid and it fits in perfectly with the blue in my living room. It is a satisfactory recliner if you are short. Also I believe that if taken very good care of and not let children or large people climb on it or fall down into it that it will last you 5 years or more!", 
    "WE BOUGHT 2 OF THE RECLINERS BUT IN DIFFERANT COLORS--WE ARE VERY HAPPY WITH THE RESULTS..:>)", 
    "I bought 3 of these recliners and have zero problem.Installation takes about 2 minutes.The recliners are small but are jOK for what we needed them for..One for me,one for Polly and one for our dog Tia.Super buy and FREE shipping.", 
    "this chair is small & comfortable. great product for the price!", 
    "This reclener was an excellent purchase. The qualty far exceeds what I expected. As it was a gift for my disabled uncle; I was concered about the ease of use. My fears were unfounded. His home health aid actually called me to find out how to get one for herself and her other patients.", 
    "This recliner is everytinh I could ask for except for one very small detail. When in the recliner position, I like to bend one leg, and the pading is not enough on the back end of the footrest closet to the chair. Otherwise thius product lives up to its billing. I'm thankful that I purchased it.", 
    "It's a wonderful and comfortable recliner. But it is really hard to get the foot / leg piece to come back down and locked into place. I would NOT recommend this for someone frail or has any kind of weakness in their legs or knees. The only instructions that came with it were for how to get the recliner put together. So if I am doing something wrong I have no way of knowing it. If I were disabled I would have to return the recliner.", 
    "The delivery was quick and for what we paid for the chair, we can't expect anything better. However, for a few more dollars we could have had much more comfort and a better quality chair. Live and learn.", 
    "Bought this chair to finish off my wife's Christmas list. Wasn't sure what I would get for such a low price. When it arrived we were both extremely pleased with the look and quality of this product. Assembly was a snap. Matter of fact she is enjoying it right now as I write this. One of my first purchases through overstock,com and everything went as smooth as could be. I will be back for more good deals!", 
    "seat smaller than expected,seat cushion sticks up in middle(foam of some sort) hard to push foot stool back in", 
    "The chair is perfect in my living room it goes great with my chocolate sofa & love seat", 
    "Great price great chair I even put it together myself", 
    "Very comfortable for the price. Super easy assembly.", 
    "Just used it twice, the back supporting wood was broken. I had to go to HomeDepot to purchase some metals to support the broken wood. After a few hours torturing efforts, i still dare not sleep on it. Don't recommend to my friends.", 
    "They shippped the correct itiem in the correct color. It came quickly and well packed. It came in two simple-to-assemble pieces that I easily fit in the trunk and rear seat of my car to take to my sister's place.. Assembled in seconds. We both loved the color and the sumptious comfort of the recliner. Could serve as a guest bed!", 
    "When reading the reviews before purchasing I saw that a few customers had mentioned it was a small recliner. That was exactly what I was looking for. I bought it for a great price. It arrived in a week or so. Once I openned the box and vaccumm it, I put together in a matter of minutes. It is small for a person weighting more than 180lb. On the other hand, fits perfectly in our living room apartment which is not that big. Very comfortable and the neutral color goes with everything.", 
    "I bought the chair for my husband and he absolutely loves it. The color matches our other furniture great. It is very comfortable, roomy. I would recommend this chair to everyone.", 
    "Comfortable chair that is truly a wall-away for tight spaces. Able to get inside home with no trouble. Back of chair fit onto chair and snapped into place with no trouble. It is light enough to move around with no trouble or damage to carpet.", 
    "I bought this chair for my 86yr old dad and he love's the chair", 
    "This is a simple comfortable recliner. It does not have the extra padding that other costly recliners have but does the job, At the price, a very good buy", 
    "I could not believe the quality for the price!! Also it was recieved in six days. Excellent service. I will definetaly buy other items.", 
    "I don't know how long this reclincer will last but can't beat the price. It's pretty unbelievable that you can buy a recliner like this for under $200.", 
    "I really liked it. Its worth the money you spend. I also agree that it is very light weight and build quality is not that great. But you will only get what you pay for. If you want best quality and highest comfort... then you need to spend something like 500+ dollars. I needed one for relaxing while watching movies or during playing games in PS3. It satisfies my need perfectly. You definitely need to look into some other option if you are tall and hefty. Overall... Great recliner and worth money spent.", 
    "This is a very nice chair for the money! I'm 5'8\" and 160# and this chair fits me great. When reading the reviews I was concerned about the difficulty of using the recliner release mechanism and how some reported it was difficult to return the chair back from reclined position. This chair works very smoothly and without a lot of muscle needed to return chair from recline position! I was pleasantly surprised to learn just how far it reclines back;this chair goes the whole way back to almost flat. I can see myself falling asleep in this chair! As always, a great product,fast service and accurate description. With Overstock.Com I know what to expect when I make a purchase. MY FAVORITE .COM STORE!!! Way To GO \"O\".", 
    "Very comfy and nice chair. It is a \"smaller\" recliner. Love it!", 
    "I ordered this for my husband for father's day. He is 6'2 an the chair was way to small for him. If he reclines back, his feet hang off the bottom and his head hangs off the top. I think the chair is great, but it is made for a small person. I would say no more than 5'6 or so. So instead of my husband having a new chair for father's day. I have a new chair.", 
    "Easy to assemble, but constructin is very lightweight. Can't expect too much for the price paid. Have not used yet, but do not expect that they will last long. With light use these chairs may last a couple of years.", 
    "you get what you pay for... this is a very small persons chair. anyone over 5 feet is too big.", 
    "The chair is VERY comfortable. It fits my wife and I perfectly so if you are not over 6' 2\" and are medium build, the chair will hold you just fine. If you are fairly large then it might be a tight squeeze. My only gripe with the chair is that mine did not come with \"feet\" for the back \"legs\" but I didn't realize that until I set the chair up and my wife sat down in it and it made a funny sound as it moved a little. I lifted the back end of the chair and found where it had gouged my hard wood floor. So be forewarned to check and see if it has feet when you unpack it. Assembly is a breeze and the mechanism works very smoothly. For the money - great chair.", 
    "Color goes perfectly with my living room and very cozy.", 
    "I am only 5'2\" if i were any taller this would be an uncomfortable chair to sit in. The leg lift is kind of flimsy but over all not a bad chair. After a coupon and my O club rewards I only paid $125 for this chair, it was listed at $***, I dont think it was worth the 200 they asked for it. Again not a bad chair great for a small space and a small person.", 
    "For me it has been excellent. Would recommend to all my friends. The attention and service you as a company is unsurpassed", 
    "would not purchase again it looks like it was made for a child about 12 years old", 
    "Chair arrived as planned..Delivery company brought chair inside for me..Was easy to assemble. Chair is very comfy and does not require much space. Great chair for the price..", 
    "The chair was nice, the only problem I had with the chair , is that it was really too small for my son who is 6' 205 lb . It was a little short.", 
    "Chair very light weight not too comfortable. But not bad for the money spent. Will probably last a few year. not sure I would recommend", 
    "This was a gift for my mother-in-law, who thought it was very comfortable. Great value for money.", 
    "This was a gift for my Mom for Christmas so I haven't actually seen the chair. With that said, Mom was exteremly happy with the color, comfort and looks of the chair. It was delivered just when it said it would be, a plus especially at Christmas. Great value, great price.", 
    "The other posters were right in it is not made for a big person but my husband is 6 ft and he is comfortable in them. Not tall in the back but comes to the mid of the back of the head which may adjust after seat is less stiff with some wear. Over all I am happy with them. One other thing the directions came in only spanish! Way easy to put together so not a big deal just principle.", 
    "Recliner is very light and easy to move around. The color is accurate. Delivery excellent. It was inexpensive,l so I am not sure of the durablity, but so far I like it.", 
    "This recliner is very comfortable and it's not so oversized like the others. It was easy to assemble snap the back together and your good to go. Thinking of purchasing another.", 
    "This is a great chair for the price. This is the first time I have bought something like this online. I couldn't be happier. It arrived in great time and shape! I would do this again in a heartbeat. Thank you Overstock.com :)", 
    "The chair was just as I expected. EASY to assemble, slip the top of chair into the slat and set up is complete. It is comfortable and durable.", 
    "I needed a recliner in my sitting area and I saw this one and the price was right. The recliner serves it's purpose however it is very small. I am 5'6 and my feet hangs over when reclining back. It is not a oversized or overstuffed recliner so the comfort is not the best. However, the price was a good one. If you are tall , this might not be the recliner for you however if you are just looking for a nice chair that reclines then this is definitely the one for you.", 
    "While it appeared to be well worth the money, after about one week, the springs can be felt in the seat cushion. It is very uncomfortable and something which I have never had happen with a recliner. I believe it is due to the opening and closing of the foot rest. It gets used by smaller sized people, so weight was not an issue. This is the main reason it was purchased, due to the smaller size of the recliner. I would not recommend this recliner.", 
    "I was surprised at how quickly we recieved our order. We have a winter home and don't want to spend a forturn on furnishings. This recliner is great. We've only the chair for a month, so the test of time remains to be seen. I am sure it wont' last as long as more expensive products, but the price was great.", 
    "Wow, I was so impressed with my recliner. Great bargain. So comfortable and meets all my requirements. The value is fantastic. I love this chair, fits my body perfectly.", 
    "Pros: Very easy assembly Leight weight, just incase you want to move it around its easy. Does not occupy much space Cons: Its very small. Fit probably 160 lbs person. More than this weight, probably its too small. They did not deliver to my apt on 3rd floor. They left it on the ground floor. The back rest does not move. Its fixed.", 
    "Very easy to put together, doesn't take over a room, comfortable, very good!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Tucker-Tan-Recliner/5612169/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5612169/Tucker-Tan-Recliner-681cf2d6-6172-43c3-adcc-435d45fef75a_600.jpg"
  ], 
  "description": "Kick back and relax in this Tucker tan recliner made from soft\nmicrofiber. This plush recliner's steel-enforced backrest ensures\nstability as you recline, while the foam-filled cushions provide\nlasting comfort. Use this casual piece to create a welcoming\nreading area in your bedroom or as a complement to your living room\nfurniture. Six pull-string supports and a steel-enforced backrestFirst option: Normal seating (leg rest not in extended\n  position), back rest about 110 degree angleSecond option: With leg rest extended, back rest about 110\n  degree angleThird option: With leg rest extended and back rest in recline\n  position, about 150 degree angleIncludes: One (1) reclinerMaterials: Foam, metal, microfiber, Asian pine hardwoodUpholstery materials: MicrofiberUpholstery color: TanSeat height is 17 inchesDimensions: 38 inches high x 38 inches wide x 37 inches\n  longStyleTraditionalMaterialWoodFinishMetal, Steel, WoodChair TypeReclinersAssemblyAssembly RequiredColorTanFurniture Frame MaterialWoodFurniture PatternSolid"
}