{
  "name": "Tucker_Camel_Recliner", 
  "price": "EUR 238.24", 
  "reviews": [
    "Just got my Tucker recliner in the mail a few days ago and I'm pumped! This chair is the essential piece to complete my man cave. For under $200 you can't beat the price and the overall quality is quite good. The seat is firmer than expected but still very comfortable. The reclining mechanism works smoothly and can recline to an almost flat position without requiring too much extra space between the chair and wall. The chair is on the narrower side so bigger dudes will need to look elsewhere. I read one review that said the chair was too short but for me (5'10\") it seems just fine. Assembly was easy and the chair came in two pieces so it was easy to move through narrow door frames. Assembly instructions were in unusually bad English which makes me wonder where this thing came from...but whatever. Overall: love it.", 
    "I AM VERY UPSET WITH MY PURCHASE. i REGRET IT EVERY TIME I SIT IN THIS CHAIR. THE MATERIAL IS VERY CHEAP AND THIN. IT HAS RIPPED IN SEVERAL PLACES (AFTER ONLY 5 MONTHS OF USE) . I HAVE NEVER SEEN ARM CUSHIONS LIKE THESE. THEY ARE MISS-SHAPED AND PULLS INWARD. I REGRET NOT SPENDING ANOTHER $50.00 TO $100.00 ON A DIFFERENT CHAIR. SAVE YOUR MONEY AND TIME ON THIS ONE AND LOOK ELSEWHERE. IN THIS CASE.... YOU DO GET WHAT YOU PAY FOR.", 
    "This chair arrived to my apartment door in Los Angeles 3 days after I ordered it. Came in two pieces in very large box. Weight is not as described - I'd say it was more like 35 lbs. Assembly could have been done in dark; top half fits on to bottom half, that's it. Soft cushy fabric and comfortable seating. Would not be appropriate for very large man, but most women will be very comfortable in it. Good for rec room or large bedroom, would not recommend for formal living room. If you need a quick, cheap chair, this is it. The price already tells you this is not an investment buy. It was just what I needed for a temporary fix.", 
    "This recliner fits into a small room nicely. It is a very comfortable for an average size person. A tall or heavy person would not be comfortable. It reclines easily. I am very happy with my purchase.", 
    "I love the color and texture of the material. Looks just like the picture. Very comfortable but I wouldn't recommend it for an overweight person...rather a snug fit. I am short and have trouble closing the chair but I would recommend this to my friends.", 
    "I needed to find a chair to sleep in from time to time due to sleep apnea. This chair almost reclines to flat, but keeps my head just high enough to help with my breathing. I sleep though the night because it is so comfortable. I am a average sized woman, so this chair would be too small for most men. Has a bit of a problem staying fully reclined though.", 
    "THE CHAIR LOOKS NICE BUT ITS KIND OF ON THE CHEAPER SIDE, TIPS EASY AND NOT THAT SOFT OR PLUSH.", 
    "I love this chair! Just beautiful and oh so comfortable! I can't believe how plush the padding is. Yet another reason to check out Overstock first. Thank you Overstock, again!", 
    "I like the looks and the value of this product. However it is for short to average people. I would have keep it if it was made for a tall person. It look well in my home and matched my decor nicely.", 
    "I live in the I.E. and this chair arrived in 3 days, which was great. it came in a cardboard box that must have been custom built for it because it fit inside just perfectly. Be careful opening it with any sharp - there is little room for error! Pretty, soft chair arrived in 2 pieces that clicked together in a second. I'm 6 feet tall and found it a little short but have since found other perfectly comfortable positions and wouldn't have been a deal breaker had I had the chance to sit in it first. Fantastic chari for the price.", 
    "This recliner is not for a tall person. Anyone over 5'7\" may not be comfortable. I love it - I'm 5'1\" and it fits my small frame. Don't know how long it will hold up, but for the price, I am very satisfied. Easy assembly. Would recommend this recliner to a friend.", 
    "Not enough padding, AND MUCH NARROWER than it looked.Very small..", 
    "Excellent for the price! Able to sleep in or relax and watch TV.", 
    "I have had my neighbors over and they tried it out and actually want to order it. They said it was so very comfortable. We are just average sized women and it fits us wonderfully. It is very rich looking. Previously to purchasing it online I took the measurements to an upscale store and measured one that looked exactly like the one I was purchasing. I sat in it and it was comfortable and measured exactly what your recliner measured. They wanted in the area of $XXX. No free shipping and there was also sales tax. So I ordered yours the Camel color for that low price. That is why I am very pleased. All of you out there take the measurements to an upscale store and find one that is the same style, style, etc. Then you will know if it is what you want. I am so very happy and so are my friends when they visit. I am planning on now furnishing the rest of my new Apt. with things online on your website. Thank you so very much and everybody try one out before you buy it. Word to the wise. Thanks again Overstock.com. I am now seeking a couch and do have one in mind. Sincerely, your happy client. **************.", 
    "I just ordered another chair ,,, I hope this one will fill my needs , It was not what I expected ,,,,the knob to recline was so hard to pull and trying to get it back down was impossible.....had a lot of trouble.....", 
    "Less than I expected, but worh the low price. Looks good and performs as advertised.", 
    "This is an excellent value for the money. I have seen similar recliners selling for up to ****. It is not the fanciest quality you will find on the market, but it looks decent and it seems that with gentle handling it will last for long. I covered it immediately to protect the light color but also to avoid static electricity (I knew that problem with microfiber furniture from before). Now it is very comfortable, lumbar support is good and the mechanism seems sturdy. As many reviewers noted, the seat is relatively narrow, but an average built person (and with a few pounds extra) can sit on this chair comfortably. I was afraid that armrests would be too low but they are just right. For the price, it is a steal.", 
    "when i saw this item on the internet i thought it was a good buy and deal but the same day it was deliver its damage i am so disappointed. i wouldn't recommend this item to anyone.... The making of the chair is very poor the material is not good very cheap !!!", 
    "I just received the chair I ordered for my husbands father's Day gift. & not only was He excited about it, I was as well as friends of mine, ( my husband is enjoying it as i type Lol!) My friend & neighbor David ( who was the one who turned me on to you wonderful people) Now I now that alot of my friends/family will be \"Paying\" you a visite, Thank you sooo! Much for helping me (who is disabled & on a buget) do something wonderful for us both. Sincerely Fatima Lowe H..", 
    "We have really enjoyed these recliners. I ordered two of them. We sit and watch TV at night and feel very relaxed. The recliners came in two pieces in a big box. Easy to put together, just slide them together and it locks into place. I am very pleased with them.", 
    "We moved and had been shopping for a recliner for my husband to replace the one that we left behind. Couldn't find one under $400 - but this one was within our price range. Seat is a bit more narrow than expected - but fits my husband well. (he is not a BIG man). Quality appears to be good...time will tell if this holds up. Assembly was easy - 5 min. to put it together. He is happy and....I'm happy with this purchase.", 
    "I am pleased with the chair and it is in use. Very Light weight, and moves a bit on carpet, but other than that you cannot beat the price and the easy assembly.", 
    "A bit disappointed in the wrinked fabric but that may smo0th out over time. Have only had them set up for less than a week. They are not the big overstuffed chairs you normally see in the furniture stores and we have a fairly small living room and the 2 of os each wanted our own reclinter so these are working out very well.", 
    "iT'S COMFORTABLE AND ATTRACTIVE AS WELL AS HAVING GOOD UNDERPININGS, THOSE OUT-OF-SIGHT FACTORS. WELL PLEASED. THE TWO WERE DELIVERED IN A FLASH!!!!! IF I RECALL,THEY CAME WITHIN TWO DAYS OF ORDERING. WHAT MORE CAN YOU ASK?", 
    "This chair came as described. We noticed the seat is very firm, but not uncomfortable, if you are looking for a cozy plush chair, this is not one. It was very easy to assemble. The chair is fairly small and will not take up a lot of room.", 
    "NEED I SAY MORE, FOR A FIRST TIME SHOPPER, I AM IMPRESSED BY YOU @ \" O. \" AND I TRULY MEAN THAT. AS I STATED AS SOON AS I OPENED THE BOX AND SEEN HOW EASY IT WAS I ORDERED ANOTHER AND SHIPPED IT TO/FOR MY MOMS... ONCE AGAIN LET ME SAY THANK YOU", 
    "This is an excellent recliner. We purchased it for my father-in-law and he loves it. All of my family love it actually, including my little daughter. It's such a great recliner with great price!", 
    "I was looking for an inexpensive chair that was comfortable to fall asleep in, this is great for the price.", 
    "I havent seent the recliner in person, I had the item sent to my Mom, She loved it. was put together in 5 mins. very comfy.", 
    "I bought this for my 89 year old mother and had it sent to her. She is 4'11' and it fits her great and she and a friend put it together! Great purchase for the money", 
    "This recliner is awesome! It arrived quickly and was soooooooooooo easy to put together. (only two pieces) It is very comfortable. It is best suited for veritcally challenge people like myselft (5ft 4in) It is smaller than most recliners which makes it perfect for tight/small spaces. I wanted to buy another one but it says it is OOS : (", 
    "Don't always trust reviews...", 
    "Comfortable and easy to assemble", 
    "not as comfortable as I would expect. the price was good, but I'm afraid I got what I paid for. I'm looking to replace with a larger recliner.", 
    "my husband loves his recliner. Best thing i have ever bought him he said.", 
    "Its a good looking rocker but my husband has medical issues and couldn't close the footrest :( Easiest return process ever", 
    "Nice chair is for smaller person.", 
    "Small enough to fit in the corner of my bedroom for reading in the evening. I love it.", 
    "Just not as comfortable as I expected", 
    "The locking back to upright mechanism does not work well", 
    "it does run a little narrow. craftsmanship is very good.", 
    "This is a very comfortable chair and for the price it is well worth buying.", 
    "This chair met everything I was looking for, yes I could have spent more on one of a higher quality but for the use I have for it this chair is perfect. I would recommend.", 
    "Bought this chair for my Mother who is 79.. She had difficulty with the leg lever. There is a board in between the bottom cushion and back cushion. Made my Mother's back hurt. No padding. Fabric was nice and durable. Would not purchase again. Bought different chair after one month. My Mother stuffed a blanket in between for padding. No help.", 
    "Easy assembly and very comfy", 
    "I am 5'4\" 150lbs. and this chair works well for me - my feet hang off the footrest just a bit, but not badly. I have a small pillow at my lower back, but that's just me. I would not recommend this chair for a larger person. I was looking for a chair to \"fit\" me and I am very happy this worked well - comfortable and the fabric is OK - soft and warm - I would not have this chair where it would be subjected to ruff & tumble kids, etc I would be afraid of rips and tears. Me, I love it. Oh, and my cats approve as well.", 
    "It looks as good as I expected, and is very comfortable.", 
    "This is a great little chair for the money.It's not used often,it's in a home office,but it's comfortable.", 
    "Very comfortable at times sleep in recliner that's how comfortable it is", 
    "Glad I found you and your product (made in China) It is comfortable I slept in it the first night. I would like to know the cleaning instructions if you please", 
    "Next time I'll spend the money and buy a good chair. This one is crap with the foot rest arms becoming bent and the recliner release not working to. . . and it's not all that comfortable.", 
    "The chair is flimsy and small", 
    "THIS PRODUCT UNFORTUNATELY HAS A MAJOR FLAW. IN ORDER TO PUT THE FOOTREST BACK IN PLACE, YOU MUST KICK IT HARD! THE ORIGINAL PRICE I PAID FOR THIS ITEM WAS ADJUSTED BECAUSE OF THIS FLAW AND I SUGGESTED THAT OVERSTOCK TAKE IT OFF THE MARKET WHICH TO DATE THEY HAVE NOT TO MY KNOWLEDGE. THE CHAIR SITS VERY COMFORTABLY BUT THE FLAW AT TIMES DRIVES ME TO DRINK. BUT I DON'T DRINK IN THE CHAIR BECAUSE I DON'T WANT TO GET IT DIRTY!", 
    "Just lasted a little more then 1 year. Springs in the seat went 1st. Not long after, the reclining function went.", 
    "I bought this recliner for my grandfather because his old one was no longer any good, it does require assembly but it's literally just in two pieces and you simply snap it into place. It felt good to me but it's not my chair so I'll share with you the two things he doesn't like.My grandfather says the foot rest won't stay up he claims that wih any pressure it starts to fold back into its upright position I don't know how true that it.His biggest issue is that there is no where for his head. Since it has no sides there is no where to lay his head so he still doesn't sleep I it which is what I bought it for him for so that kinds of sucks. My personal complaint would also be the color, that light tan would get dirty so easily I currently have blankets it over it as a protector to try and keep it somewhat clean.He does says it's comfortable though", 
    "this chair is neat looking, was easy to put together, only 2 pieces. It was light enough for me to move myself. It is comfortable & soft enough for me. The seat is small, but so am I.so , perfect fit. Only thing I am not real happy with is difficult to put down from reclining position, but will probably get better with use. I am always happy with service, products & price", 
    "I'm very happy with this purchase! The reclining chair is soft, comfortable, nice quality, and I feel personally for a reclining chair the value was affordable.. It comes in two pieces and it took me seconds to put together.. It was so simple! I have a studio apartment and I wanted a comfortable chair to have for when I use my laptop and if I'm tired and want to take a nap, I can rest in the chair.. It reclines to almost as if you were laying in a bed which is very relaxing! I'm glad I was able to find this reclining chair and I'm very happy with everything :)", 
    "Chair is low priced but poor quality.! 45lb child sat in the chair let it out to recline and it broke. Unacceptable", 
    "Nice chair and comfortable. Good deal for the price with free shipping", 
    "POOR QUALITY MATERIAL. MECHANISM SO STIFF THAT I AS A SMALL WOMAN AM UNABLE TO PUT ENOUGH FORCE ON CHAIR TO LOCK IT BACK IN UPRIGHT POSITION. AFTER JUST A FEW WEEKS CAN ALREADY FEEL THE BARS THROUGH WHAT LITTLE PADDING THERE IS IN THE SEAT. MY DOCTOR HAD REQUESTED I GET A RECLINER RIGHT AWAY AND THIS WAS A FAST WAY TO OBTAIN ONE ARRIVED WITHIN 2 DAYS AND WAS EASY TO ASSEMBLE BUT DOUBT IT WILL LAST 6 MONTHS", 
    "so uncomfortable. would rather spend *** more dollars on something that is comfortable. very disappointed", 
    "Product is great -- UPS delivery was terrible, box was rolled/drugged through the snow not carried, box was almost destroyed and product was wet from broken box leaking", 
    "Great chair for the price! Assembly is VERY easy! Loved that. If you are a bigger person, though, this chair may be a little snug for you.", 
    "I loved it so much I got 2, very firm, very soft, easy to assemble, slides right into each other", 
    "I WAS VERY DISSAPOINTED IN THIS CHAIR I PURCHASED FOR MY MOTHER. I THOUGHT IT WOULD BE EASIER FOT HER TO WORK SINCE IT HAD A FLIP BUTTON TO PUT YOUR FEET UP.BUT DIDNT KNOW YOU HAD TO USE YOUR LEGS TO PUT IT DOWN WHICH IS VERY HARD TO DO.WHEN SHE TRIED TO PUT HER FEET DOWN THE BACK OF THE CHAIR CAME OFF THE GROUND AND THE CHAIR TIPPED UP TILL THE LEG REST HIT THE GROUND. IT DID THE SAME THING TO FRIEND THAT SIT IN IT .MY MOTHER WILL NOT SIT IN THIS CHAIR AT ALL NOW AND IF SHE DID SHE CANT GET OUT OF IT WITHOUT SOMEONE PUSHING THE LEG REST DOWN.", 
    "If you're looking for a small recliner that doesn't rock, this is a nice recliner. However, I prefer a rocker recliner, so we actually got another chair and are moving this to the basement. It's very narrow and made for more petite people. I don't believe my husband can comfortably sit in the chair because he's 6'+. I have a tendency to tuck my legs up under me and that's really not an option with this chair because it is narrow. Color is nice and it's good for my back, but I much prefer a bit bigger rocker/recliner.", 
    "The foot rest is to hard to put down, I have hurt myself trying to get it down.You have to lean forward and kick the bottom and if you can't get it to lock, the chair tips and out you go", 
    "We were looking for a recliner for our little grandma, and that is exactly what we got....we loved the size, the color, and how easy it was to put together. This chair looks awesome in her living room and does not look like one of those huge, overstuffed recliners. She loves it!!", 
    "I an small in stature and the chair fits me so very comfortably.The recliner part is great because it lets me sit back in a correct prone position without forcing my chin into my chest. Thank you very much.", 
    "I WAITED FOR THIS ITEM ALMOST A WEEK I COULD HARDLY WAIT TO RIP OPEN THE BOX. ONLY TO BE DISAPPOINTED!!!!!! THE CHAIR IS MORE TEENS OR LITTLE KIDS NOT AN AVERAGE SIZE ADULT. WHEN I FIRST DOWN IT FELT BRICKS. NO SINKING IN NO WARM FEELING... NOW GRANTED I KNOW YOU HAVE BREAK THE CHAIR IN BUT THAT OVERALL COMFORTABLE FEELING IS NOT THERE. I NEEDED A CHAIR FOR MY LOWER BACK PAIN (L4 &L5 DISK) SUSTAINED WHEN I DEPLOYED TO IRAQ IN 2011 THIS WAS NOT THE ANSWER. I WANT A REFUND, COME COLLECT THIS GARAGE OVERSTOCK :(", 
    "great price looks and feel real good i just may buy the other", 
    "This recliner is very comfortable for me. It fits well in my small apartment, and it fits my body size which is small. It is not a cheap looking chair at all. I love it and am happy with my purchase!", 
    "CHAIRS ARE A GOOD BUY IN OVERALL COMFORT, STYLE AND PRICE.", 
    "just a small cheap made chair not enough padding around the wood that was used in making it. with a cat in the house that loves to leave fur balls on anything new it serves its purpose. it is not for tall or very large people it is very small at 5 foot it fits me fine.", 
    "We were looking for a recliner to replace the rocker we had in our daughter's room. It is a small enough size to fit but is comfortable to have her night time stories. Just what we were looking for at a great price!", 
    "My husband bought this chair for me when I came home from surgery. I LOVE sitting in this chair. It is very comfortable, the color is nice, and it goes with our room decorum. It was easy to assemble also. I give the chair and my hubby 5 stars! I only wish it included material to cover where the head and arms rest to protect the chair from stains.", 
    "The shipping was very fast; the recliner is extremely easy to set up; it is easy for one person to handle and move around; the color is very good; it is comfortable to me; the price is very good too.", 
    "However, the back of the chair came crushed, I believe it was from shipping. I received a new chair within a few days which was a great turn around, however, the broken chair was re-packaged and in the shipping box it came in but no one has come to pick it up. Do you know a date or is this item to be discarded since it is unusable? Please let me know what I should do with it, it is in the middle of my garage and need to park my car.", 
    "It is very attractive chair and the color fits in with many other pieces", 
    "Its a nice chair for the price. Its not for your every day fave spot to sit. With time (I had mine for 2 months) it has got very uncomfortable and not as nice. Very good for a spare bedroom or similar, dont buy for long term exclusive sitting unless money is an issue (my case).", 
    "I bought this chair for my bedroom and it adds to the earth tone decor I have. It is not an oversized recliner...it will not accomodate a large person but it is perfect for me and my room. The cushion is firm and it provides good back support. I am happy with it. The color is exactly as shown. The material is definitely thinner than what you would find on a higher priced reclyner but for the money, it's a good chari. Received the shipment fast!", 
    "My wife loved the recliner and uses it every day. She couldn't be happier.", 
    "This is a nice chair for the low price. It fits me fine but it is too small for my husband (6'3\"). It tips a bit when getting up from chair, if you are a larger person. Great for the game room or family room. I am happy with it for me, but I will have to buy another, more study, chair for my husband.", 
    "I thought I was getting a really great buy--but you get what you pay for. This chair is so poorly constructed, it is not worth even the low sales price. It started coming apart after only 3 days, and I'm sure that after 1 month, I will have to throw it away. I really wasted my money on this. Do not buy this chair, unless you only want a temporary chair for a few weeks.", 
    "exactly what I was looking for. I needed a small scale recliner for our motorhome. nothing fancy, only two pieces that went together easily.", 
    "recliner came right away, assembled easily and was fairly priced.", 
    "WORST PURCHSE EVER! SAVE YOUR MONEY AND BUY A BETTER ONE. THE SEAT IS HARD. BACK IS LOPSIDED. ALL PARTS OF THIS CHAIR ARE SO CHEAPLY MADE IT WOBBLES LIKE ITS FALLING APART! SORRY RECLINER...WILL NEVER PURCHASE FROM HERE EVER EVER AGAIN", 
    "Thank Overstock.com I am very Happy and well be useing it for Christmas. I was SHOCK at the Price.. Well be shopping again soon.. Merry Christmas to you all.", 
    "I was looking for a small recliner (I am 5 feet 100 lbs) for the den. At this price I got two; one for me and one for the dog. The seats are small. My hips touch on both sides but the depth of the seat is fine. For me (and the dog) this is great but a larger person may have problems. I was worried about the color but is is a very soft camel color that would blend with just about anything. It was a breeze to put together. The only issue I have is that, when reclined, the leg section does not come up very high. All things considered, I would buy it again.", 
    "If one is looking for something to place in small living room or large bedroom, this is it for the price and quality.", 
    "I'm very satisfied. A good, comfortable chair. Not large, but plenty comfortable for a snooze or a good read. It fits well in my tiny house, giving me the comfort I need without taking up a lot of space. I couldn't be happier. The chair functions perfectly.", 
    "The chair is a little small byt I found it to be comfortable. Good value for the price.", 
    "I'm pregnant and my husband has been looking for a nice recliner for me that is not too expensive (the price is my personal issue). I am 5'2\" and this is perfect for me. My husband wants 1 for him too and even though he's tall, he still fits. Highly recommended!", 
    "This chair was exactly what I needed and expected. I did not want big, overstuffed chair that takes up a lot of space. This chair is smaller and fits me just fine. It's a great chair for people who don't want to be swallowed up in a big overstuffed chair. The only problem is getting the chair upright from the reclining position. You have to use your legs to push it back up. For anyone weak, this could be a problem. I would have like a handle on the side to help with setting up. But, it's perfect for those who don't have any leg problems.", 
    "The recliner features typical 2-piece construction. The mounting rails, that accept the back of the recliner are not metal--they are heavy PVC. Frequent use will fatigue this component and the user will end up on the floor. This is a single position recliner and it does not bring the foot rest horizontal with the body leaving your legs hanging down a bit. I bought this piece for my 99 pound mother to use but she can't sit in it for any length of time due to the down sloping angle of her legs.", 
    "the chair is just what I wanted, its not too large, fits right in, thank you.", 
    "I don't know if the recliner was damaged during transport or before, but the wooden frame is made of very thin wood and we noticed that the frame was broken when the recliner was used the first time. The fabric looks nice but you can feel the wood through the cushioned armrest. The seat is very narrow, but I wouldn't mind this, but you can feel the frame everywhere. I am pleased that Overstock refunded the money and I will return the recliner.", 
    "bought as a birthday present for my 87 year old father. He was able to put it together fine, but put it in a back bedroom. He would NOT use, waste of money for me. He felt the seat was too narrow for him (5'10\", 185#). If you are looking for a cheap chair to last only a few years, this is ok, but one that will last for years to come look elsewhere, When we looked on the underside, felt it was poorly made. Returning it would be a waste of time and money.", 
    "Well I just received my recliner today. The UPS guy, delivered it with a smile. It came in two pieces. The assembling was so easy. Two Snaps and I have a new chaIr. I put it together; while watching \"Braxton Family Values!\" It is so comfortable And it fits me perfect and is a wonderful addition, to my bedroom!", 
    "Chairs arrived when they were supposed to - we had them together in a jiffy. The seat is harder than you would expect, but quite comfortable. I bought two and they fit us very well!", 
    "This chair is so comfortable, I can't stay awake when I'm in it.", 
    "Assembly is a snap, literally. Tangs on either side of the backrest click into the corresponding receptacles in the seating unit. I remember in particular observations made by two reviewers. One remarked that this recliner was not a showpiece, and probably wouldn't belong in your most formal room. The other complained that the seat cushion was rather stiff and uncomfortable. Seen head-on, the recliner does resemble a chair with elephantiasis. But it's not a shoddy product in any way, especially given the price. I didn't find any defects when inspecting it. I'm 6' 2\" tall, and my feet dangle over the footrest. But with my back firmly up against the rear of the chair, I don't find the foot-dangling fatiguing or uncomfortable. An added benefit to adopting this posture is that the seat cushion's firmness is less noticeable. I would caution against sitting on or leaning against the footrest -- the chair is tippy in this situation, and the backrest will abruptly tilt forward.", 
    "Piece of junk DO NOT BUY THIS CHAIR. Awful!! Poorly made bad quality. Got took on this one.", 
    "GREAT CHAIR AT A REASONABLE PRICE. IT IS VERY COMFORTABLE AND ELEGANT LOOKING.", 
    "A very nice chair for the price. Made for a medium size woman that is not too wide in the hips or too tall. Very firm seat that doesnt give much, but fairly comfortable. Easy to recline and a little harder to lock in the upright position. Over all a good value and good looking .", 
    "Pretty chair, nice fabric. Recliner could be more comfortable; locking mechanism does not work on the foot rest. It reclines just fine, but the foot rest will not stay down unless one gets up and pushes the foot rest with both hands until one hears a click. I returned the first chair because it had the same problem, and this chair is not better. If I did not have to pay for the return shipment I would send it back. My advice is NEVER buy furniture from this site and it is cheaply made in China!", 
    "We had to replace an old recliner in our family room. This one was the perfect choice. It went with out existing love seat well and it was the right size. It is sooooooo comfortable and the price vas very good!", 
    "I am very pleased with the chairs and pleased with overstock as a great company to do business with", 
    "The Closing Mechanicism does not work. You must get out of the chair to close it. If you sit in it and try to close it, well mine won't. I have tostraddle it and bend over and push really hard to close it. It should not be that way. On the plus side, the chairs look good. Smaller than what I had, but fit better in the room. They are not real comfortable, but for the price they fill the spot.", 
    "I cannot believe this recliner comes ground UPS in a box to be assembled. too heavy to carry to my apartment. What a mess. had I know this info I would not have bought the chair. Maybe that's why the details are sketchy"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Tucker-Camel-Recliner/5612166/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5612166/Tucker-Camel-Recliner-b0f0bfee-6f60-4ae0-b829-0fdf27305992_600.jpg"
  ], 
  "description": "Take a moment to relax in the Tucker microfiber recliner. The\nsteel-enforced backrest provides support in any of its three\npositions, from upright to reclined at 110 or 150 degrees. The rest\nof the frame is a product of Asian pine hardwood for durability and\ncomfort. This versatile microfiber recliner works well in family\nrooms, dens, or sitting rooms. Materials: Foam, metal, microfiber, Asian pine hardwoodUpholstery materials: MicrofiberUpholstery color: CamelReclinerSix pull-string supports and a steel-enforced backrestFirst option: Normal seating (leg rest not in ext position)\n  back rest about 110 degree angleSeat height is 17 inchesSeat dimensions: 20 inches deep x 15 inches wideSecond option: With leg rest extended back rest about 110\n  degree angleThird option: With leg rest extended and back rest in recline\n  position about 150 degree angleDimensions: 38 inches high x 38 inches wide x 37 inches\n  deepStyleTraditionalMaterialFoam, Metal, Microfiber, Pine, Steel, WoodFinishMetal, Steel, WoodChair TypeReclinersAssemblyAssembly RequiredColorTanFurniture Frame MaterialWoodFurniture PatternSolidProduct FeaturesPower Recline"
}