{
  "name": "Tucker_Almond_Bonded-Leather_Recliner", 
  "price": "EUR 297.80", 
  "reviews": [
    "This is NOT a full size recliner...sized for a child not an adult", 
    "The chair is comfortable and the mechanism works well. The problem is the low quality materials. Leather is supposed to last forever, but this artificial material is really bad quality. The header section started peeling off only after a couple of years of mild use. I would recommend going with Microfiber or any other material...", 
    "I am replacing a velvet-like recliner for leather, as I prefer everything leather. The chair had a musty almost mildewy smell, Once set up, I did not use it for three weeks, then I washed it down with a light solution of Mr. Clean, and used leather cleaner wipes, that took care of the odor. Chair is smallish, I am 5'1\" so it is perfect for me. Wish I could buy a second one, but it s out of stock.", 
    "I have purchased several items from Overstock. com. The colors have always been correct. This time they were not. We built a sun room so I purchased all new furniture. I had a color plan in place. My face must have dropped through the floor when I saw this chair. Almond color is what the stated on the box. That is not cream. I kept the chair because my husband said it was comfortable and with a change in throw pillows I can make it work. THIS CHAIR IS NOT CREAM.", 
    "The color is just what I expected, the size of the chair is fine for me. What I (and anyone who sits in it) totally hate is trying to get out of it! It ALWAYS takes at least 3 strong leg kicks to get the foot rest to stay down. Often have to climb over the armrest to get out and then still takes 2-3 hard pushes to get it to stay down. When family comes over they won't sit in it unless they don't put the foot rest up. It's pretty embarrassing to not be able to get out of your chair without putting on a show!!", 
    "Exactly what we needed! Smaller size , very comfortable and elegant chairs for summer cottage!", 
    "After reading all the reviews and trusting Overstock,com as I do, I made the decision to purchase and am so happy I did. The chair is exactly what I wanted for our bedroom, very comfortable......size is perfect for me and our dog, Sissy!Thank you all reviewers that gave an honest review of the size and comfort of this chair.......love the color, the color is exactly what I wanted and expected. No whining here! Sissy and I Look forward to enjoying this recliner for a very long time! It's evident why some some are ordering another, to have a pair!Delivery was speedy, packaging was very protective and anyone can assemble the back on to the seat in a matter of seconds.......", 
    "I bought this to replace a recliner that was showing its age. We figured this one was as close as we were going to get to matching the leather sofa that the original recliner matched. We were pleasantly surprised that this one EXACTLY matched our couch that was bought in 2003!!!! It is a smaller recliner, but we like that it doesn't take up as much room. It is DEFINITELY not a child size recliner like someone else said. I'm not a small person weight -wise and it is just fine. We like it so much that we are waiting for a coupon so we can buy another. My adult children were fighting over who could sit in it. it came very quickly and is simple to put together---five minutes at the most. it is comfortable and attractive, especially for the price!!!", 
    "Not comfortable .made for someone under 140 lbs. Looks nice. Fills up a space. Foot rest not working correctly Problem to ship back so don't buy", 
    "When this chair was delivered I was worried that I would have to put something together but it was a snap. The back just slides on. The chair is comfortable and looks good. I'm happy with this purchase.", 
    "Absolutely beautiful and confortable recliner. Very easy assembly and high end for the more than reasonable price. Rich and soft leather confort. A stunning addition to our home", 
    "Very nice soft and comfortable", 
    "I do like this very comfortable recliner even though the color was just a little off from the picture on-line. The arms are also just a little low for my comfort but all-in-all, it is a very comfortable chair and can be placed very close to the wall without knocking against it when reclined. It's a good napping recliner!", 
    "Easy to assemble and quite comfortable.", 
    "It is a chore to push the leg back .", 
    "for a smaller recliner, which is what I wanted, not something to consume my living room... its perfect!", 
    "Quality is not great. The chair is small. Can't beat the price though.", 
    "Perfect size for a small space, comfortable. Only problem is you have to let it down manually so can be a little difficult to push it down and lock with your legs when trying to get up.", 
    "Perfect for a petite person. I'm 5'3\" so I'm about 2 inches too tall for this recliner. But it serves my purpose. Material has held up well. Color matches pics. I've had it close to a year and its held up well", 
    "Was very suspect of what quality to expect at this price but the color was perfect for my needs so I took a chance. This is a very nice, very good quality chair especially at this price. Outstanding value.", 
    "This is a small recliner so take the measurements .", 
    "This is a great value for the money. Made for smaller spaces but I like it. It can sit right up against the wall too which is nice.", 
    "Color is way off from what is shown, looks to be almond and it is not - it is a tan color just too dark for what I wanted. It is comfortable on the positive side. Will have to be more careful in trusting the pictures and description in the future.", 
    "The color was much deeper than the picture or description indicated. However, the chair is definitely worth the price.", 
    "We just got them.,they look nice, they are a bit firm but I assume with time they'll soften. We don't intend to use them often; just to fill a couple of spots.", 
    "A little small for my liking. Feels good though. I'll let you know in 4 or 5 years.", 
    "I really like my chair. I read a review before buying that said it wasn't a good color, but I found it to be exactly what was described.", 
    "Looks nice, but its cheap. I am giving it away and buying a real recliner", 
    "Wish we'd have bought this sooner. a very nice addition to our decor. Great value too", 
    "Very comfortable. Arrived in two pieces; super easy to assemble, took us 10 seconds. The chair has a power open; though you do have to press back to close the chair. The texture and feel of the bonded leather is nice. Only negative: The photo's color looks like almond milk -or- the inside of an almond. It is slightly darker. Like a VERY PALE interactive beige on the Sherwin Williams chart. The actual shade still works well in my condo.", 
    "Comfortable but definitely not going to last long. Color is nice. I have cream sofa and chair is slightly darker.", 
    "Super satisfied!! Great buy for the price. I agree that it is not for large persons but it fits our needs.", 
    "light tan color with very small footprint and narrow. I am only 34 inch waist and the armrests surround my hips. the material is just so so and makes me sweat easily unlike my leather sofa. You get what you pay for...so don't pay too Much!", 
    "Before, I had purchased these recliners I read all the reviews out there, I can agree that the recliners are not made for persons over 250 and up, or 6'3\" tall, but they are really nice and the color is just what I needed. Easy to setup and really completed my bedroom. Thank you Overstock, pretty pleased here in Kansas.", 
    "For the price, this is a nice recliner. It isn't as large as other recliners and hugs the wall so you can place in a good place. However, if you are a large individual this chair may not work for you.", 
    "my husbands chair, we love it in our palm beach, florida condo", 
    "This chair is lovely and a good deal but if you are tall beware! I'm 5\"1' and 130 lbs, this chair is almost to small for me... So look at measurements before purchasing so you are not disappointed!", 
    "Bought two of these for our motorhome to replace uncomfortable couch. They are providing the comfort we were seeking. Because we have them against a wall with limited floor space, it was necessary that the back not go back when the footrest was raised. These chairs do just that. They seem quite durable although the bonded-leather is by no means the quality of real leather. The material is soft so should not crack easily. Can't beat the comfort for the price.", 
    "A little on the small side but nice.", 
    "This recliner is nice. I was worried because the price was so great, but we love it. It's firm and comfortable. Does not rock. I like the leather because it wipes off nicely.", 
    "My son even felt truing to stretch the legs.", 
    "Turns out the color matches perfectly to the chair I purchased used from a friend. Gambled on the \"almond\" color as opposed to vanilla, tan, ecru. It arrived in record time. In time for Christmas, which pleasantly surprised me. I love the lower lumbar built in cushion and the firmness of the chair overall. Not overly firm, but just right. Would recommend.", 
    "I bought 2 of these for my TV room and they are exactly what I was looking for. I was hesitate to order on line, but, much tio my surprise, they arrived on time and were packaged very well. Very easy to put together. No tools required. I recommend these if you have a small room, and need a comfortable chair to sit in. They are not over stuffed, so not a large chair. Was perfect for me.", 
    "After pricing several models of leather recliners, I found this one. I wanted a style and size that this product displayed. I read several of the reviews and found all of my wants listed so I purchased it. The price was right! The recliner arrived in 2 days. I was concerned that I would not be able to assemble it since I'm 72 years old with back issues and cannot lift more than 8 pounds. I was able to unpack the two pieces, slide them into my bedroom and lift the back (not heavy at all) and click it into place. I have been using the recliner every evening since receiving it. The pull out footrest works well and I can push it shut with no difficulty. I am absolutely delighted with my recliner.", 
    "We had our basement finished this summer and bought some dark furniture to decorate, but we felt we needed something lighter too for a change. The two Tucker Almond Bonded-Leather Recliners we bought were perfect in front of our wall mounted TV. They're chic and comfortable and many people who have visited us since then have also liked them and complimented us for our good taste!", 
    "Just bought this recliner and love it. it is not too small, perfect size and beautiful cream color. Plan to buy the second one.", 
    "For the price, it's great!!! I paid much higher for about the same quality before this. I love the color, the ease of putting it together, the fast delivery, I couldn't ask for anything more. I'm very much pleased with the looks and my husband loves taking his naps on it.", 
    "Redecorating ! My bedroom...thought it would great to have a recliner. Saw this one the color, price and durability(leather). Just I what I need! Received it, love it. Reviews said that its small and lighter in color. I agree... But I still like it. Not too small and the color is even better because I like creams.", 
    "is what I would expect. a bit firm, but what I wanted, looks nice and is of medium size, not real huge.", 
    "Just received my 2 chairs. I was very happy. Color was what they said it would be. We have home in Florida, will order the same 2. For the home there. Very happy shopper. Thank you. Overstock. Love your stuff.", 
    "Down graded from plush, oversize recliner. Not too happy for about three or four days, then I began to adjust to smaller and less padding. Now I really like it, doesn't overpower the area and is quite large enough.", 
    "I saw similar recliners at Ashley and Rooms to Go and they were **** each plus over ***for delivery. I purchased 2 reclinersfor **** with NO shipping. These are excellent chairs for my rec room and I would not hesitate to buy from Overstock or from ****.", 
    "I was very impressed with the speed of delivery. The recliner is beautiful, very soft and comfortable. The dimensions listed were accurate and I was able to place it just where I wanted. Would recommend this chair to all because I am of large stature and it fits me just fine. Just wish I'd gotten two of them. I am new to Overstock and have been very pleased so far.", 
    "We purchased this for our baby's nursery after searching and searching for a small recliner. We didn't want a traditional glider rather something comfy we could actually sleep or spend a lot of late nights in. We are very satisfied with this recliner!! It is small but that's what we wanted and if the previous reviewers had actually paid attention to the chair's measurements they'd have realized they were spot on! Leather is very soft, color is exactly as picture shows (a light almond/dark off white). I have no clue why people are complaining about the recliner being hard to close, it is not! I am 5'9 and my husband is 6'2 and we both think its comfy and he said its perfect, exactly what he pictured in her room! Shipped right on time to the day and it took my husband longer to take it out of the box than to put it together! We are happy, satisfied customers :)", 
    "TIS IS A POOR PRODUCT.IT IS POORLY BUILT,TO LOW TO THEFLOOR,TILT OVER ,WHEN GETTING OUT OF.THE ONLY GOOD THING IS IT IS SOFT.", 
    "customer for life .chair went on sale the next day ,so they gave the rebate with no question", 
    "The chair is nice- the leather is really soft and good. The chair, however, is not really comfortable. It is very hard to close the footrest! The chair was smaller than I expected, but overall a good purchase.", 
    "I was amazed just how wonderful this was. it was a gift and he was just as excited to receive it. this is a great deal!", 
    "I've never bought a piece of furniture on line before, so I was a little skeptical. But the description sounded just like what I wanted, and the price was right. To top it off, since it was over $50, there was no shipping charge, and I was thrilled! So when it arrived (even sooner than anticipated!) I was very happy with the product. The only drawback was that it was delivered when I wasn't home, and it was left outside my apartment door. Luckily my daughter came by and brought it in, but otherwise it would have been left unattended in a busy apartment complex for a couple days until I returned from a trip. I would have preferred to know at least the exact day, if not the approximate time of delivery. Other than that, I was very pleased!", 
    "Recliner color is good, style and body is fair, the recliner sits too close to the floor and is too small, I had problems attaching the back to the base of the chair as well as trouble with the foot rest, I will be returning to Overstock. Shipping was fast and Customer Service was great."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Tucker-Almond-Bonded-Leather-Recliner/7356557/product.html?recset=cf4ddae2-7d8b-42ff-a0f0-83605bcafe7e&refccid=IH6NK5GHHRHK5OSHWMTAULW4OE&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7356557/Tucker-Almond-Bonded-Leather-Recliner-e0e37fa1-ff5e-46a6-a0a2-554e130da1d4_600.jpg"
  ], 
  "description": "Warm up your favorite relaxing corner with this extra-soft Tucker bonded-leather recliner. The overstuffed seat features a soft almond shade and pleasantly plush foam-cushioned seats that let you sink in for long reading sessions or vegging out with the television after a hard day at work.Six pull-string supports keep your chair lightweightSteel-reinforced backrest provides strong supportTough metal and wood construction topped with foam upholstery fill and soft bonded leatherSeat dimensions 18\"H x 17\"W x 21\"DOverall dimensions 38\"H x 38\"W x 37\"DStyleContemporaryMaterialBonded LeatherChair TypeReclinersAssemblyAssembledColorWhiteFurniture PatternSolid"
}