{
  "name": "Tux_Solid_Accent_Chair", 
  "price": "EUR 185.17", 
  "reviews": [
    "My first purchace and very disappointing. The price was low And i needed a chair, so I gave it a try. The price was about half of what I saw in the stores. Unfortunately, I paid about 3 times what it is worth. I was shocked when I turned it over to assemble the legs. It did not look like furniture wood, but like craft wood. It is splintered and split. Every nuckle on my right hand was bleeding by the time I got the legs screwed on. I am truly afraid for anyone to sit on it. However, it would not be fair of me to say that and not say this. I had a problem with the projected delivery date, as I tracked my order. I called Customer Service, they treated me like I was their biggest client. She solved my problem quickly and her attitude made my day.", 
    "Didn't like this, material wasn't nice and size was not good for livingroom. Maybe an apt bedroom or small living room", 
    "The price was right on this chair but I don't like how they made the back in a separate piece. There is an unappealing line from the back. Probably would use them with backs to wall in future. Fabric is cheap looking too - but the chairs are inexpensive, so what can you expect? I got 2 in the gray color.", 
    "This chair was a great value, but I wished I hadn't purchased it. It's decent, don't get me wrong, but it just has a slightly \"cheap\" look to it. Though I did put the chair in my front room, and wouldn't just throw it out/sell it, I have been thinking of other ways to use in a less-conspicuous location of my home. Maybe a kids room or something. I wouldn't buy this chair again, or recommend it.", 
    "The chairs match our decor perfectly, and are quite beautiful to look at. However, when assembling, the pre-drilled holes on the legs did not line up for where the screws were supposed to go. Also, the back of the chair comes off which seemed to be for ease of shipping. The problem is when you sit in the chair and put mild pressure on the back, it knocks the back of the chair loose.I would recommend these chairs if you don't intend to sit in them.", 
    "These chairs are great. Initially I wasn't sure about them but my husband like them so... what the hick. I'm glad I got them, they look better in person and they took absolutely no time to put together. They're kind of firm but comfortable. I sit to the side and fold my leg up by the arm while conversing with my hubby or reading or like now writing a review.", 
    "It was a little late coming .. but thats ok...lol.... the chair i bought was much more better than i expected. It was my first purchase from overstock... and i will continue to buy from again and again.... thank you so much.!!!", 
    "The two chairs bought were selected for their design and color. It was a struggle to attach the legs. Also the the seat fabric has stains (dirt?) on both. we kept them because of the hassle to repack and return them.", 
    "nice bedroom sitting chair. color complements my decor", 
    "I love these chairs I'm very pleased with my chairs they're comfortable and durable and sturdy and look very nice for the price the color is accurate and the material is very nice", 
    "I ordered this chair in blue and I am somewhat pleased. First of all, this chair is not blue. It is more of a teal, because there is a lot of green in the color. I placed it against a blue wall which shows that it is not a blue chair. As for the comfort level, it's not very comfortable. The back is straight up and down, so it's not meant for lounging. However, it is very stylish looking. So you trade the comfort for the look. I would not recommend this chair to be in your main living room since it is not that comfortable. I put it in my formal living room which will not be sat in as often and it will work for the few times a year we actually use the room.", 
    "we bought 2 of these chairs, color matched what was online and completed the look my wife wanted in the livingroom", 
    "The chairs look great for the price! I bought two for my front entry room. I think they could use a blanket over them to kinda hide the crack where the back attaches to the base. Putting the legs into the holes was so difficult. I have put together a lot of furniture and this one was hard but I do like the chairs and am happy with them overall after using some elbow grease and drinking a beer, I was able to get them put together.", 
    "Fits perfect in our bedroom. Would not use in living room as it doesn't get a lot of use in bedroom.", 
    "the problem is getthing the fourth leg on the same problem for both chairs", 
    "I ordered one of these chairs 5 months ago for one daughter's bedroom and ordered a second chair this evening for my other daughter's bedroom. The \"ivory\" chair is more taupe in color. My 12 year-old sits in the chair almost every night to watch TV. The chair was easy to assemble and has proven to be both comfortable and relatively durable. My kids are not hard on furniture, but so far I have been very pleased with the results from light but consistent use. We looked at Home Goods twice, but found this chair to be the best option (color, durability) for the price point.", 
    "Very nice charge for the money plan to get another", 
    "We're both under 150 lbs each, and we sat in this chair a handful of times over the course of a month. One day, a very sharp, very pointy, piece of metal broke under the seat. Now, the seat doesn't have much support under it, not to mention there's a very dangerous piece of metal sticking straight down under the chair. Maybe not a big deal for some people - but we have cats, and that pointy piece of metal is now at cat-height. Plus the chair is no longer comfortable to sit in.We spent enough money on this piece of furniture that I expected better. Very disappointed.", 
    "Chair arrived in a carton and I had to attach the legs to the chair according to instructions. Hardware was too short so I went to hardware store to purchase new hardware. When chair was finally assembled the legs did not cockeyed. Secondly, the fabric was not consistent in color.", 
    "i think they look cheap-and they are not comfortable", 
    "luxurious look for an excellent price", 
    "great chair. not sure why people complained about quality. I thought it was great. of course keep your expectations according to price you pay. I am really glad I bought this. I actually got two and paired with the espresso finish wood single drawer table. looks great!", 
    "These are really nice looking chairs. Full size. I got the red and they are beautiful. More of a black cherry color. The legs could be a little more sturdy. But that can be fixed.", 
    "We ordered these for my mother but then she took ill and passed away before we even opened the box. Overstock.com was very caring and offered to let us return them. Thank you for being so compassionate!", 
    "The chair is not good for sitting for long periods, as a lounging chair, but comfortable and well made. the fabric is lovely and so is the color (aqua blue) Delivery was on time and I put it together easily. Very happy", 
    "The chairs arrived and the color was perfect! Nut when we took them from the boxes, we found that the zipper on bottom of one chair was broken,and the legs where scratched badly. The other, one one of the bolts was stuck part way in chair hole and you could not get it in or out. I think at lest one had been returned. I called customer service and they where very helpful and sadly my color was sold out. So they refunded my payment.", 
    "Chairs look great in the picture, but the legs are splayed as seen in the picture and the directions for assembly aren't that clear. Just as a point of reference - I have built so much furniture over the years, I can practically assemble Ikea furniture without needing to look at the directions. These directions had terrible drawing and they were too small to see the orientation of the legs. Plus, the legs are placed in such a way that using a drill to screw the bolts makes it impossible to do, so you have to do it manually and the bolts are long. After a few days of sitting on them the legs loosened and I have to flip the chair and retighten the bolts. Plus it sits up a little higher than average chairs. For the price I should have returned it and bought another product but it looks good.", 
    "Very fast shipping on these chairs. Putting together was a little tricky getting the right legs in the right spot. Ordered two and after the first was assembled the second was a breeze. Cant beat the price on these chairs. They became our favorite chairs to relax in.", 
    "These chairs are visually beautiful. However they are not the most comfortable. They are also a bit oversized so if you sit all the way your feet may dangle a bit", 
    "fairly easy to assemble. good value for low cost, but looks like office furniture"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Tux-Solid-Accent-Chair/8614575/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8614575/Tux-Solid-Accent-Chair-84917558-0b70-49c9-883f-e8eb304392c3_600.jpg"
  ], 
  "description": "Place this Tux transitional accent chair in any living area to\noffer comfortable seating for family and friends. High-density foam\nfilling provides support, and a choice of several colors gives you\nflexible options when coordinating with your other furnishings.\nCombine this contemporary accent chair with other seating to create\nan intimate conversation area where you can enjoy a visit with\ncompany. Kiln dried hardwood frameSet includes: One (1) accent chairMaterials: Wood, upholstery grade fabric, high density\n  foamFinish: EspressoUpholstery color options: Brown, red, blue, charcoal, bark,\n  ivoryUpholstery fill: High density foamSeat dimensions: 19 inches high x 20 inches wide x 22.5\n  inches deepDimensions: 35.5 inches high x 28 inches wide x 30 inches\n  deepStyleContemporary, Modern, TransitionalMaterialFabric, Foam, MDF, Polyester Blend, WoodFinishBlue, Brown, Charcoal, Espresso, WoodPatternSolidChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, Grey, Off-White, RedFurniture PatternSolid"
}