{
  "name": "Tux_Sunflower_Accent_Chairs", 
  "price": "EUR 198.71", 
  "reviews": [
    "Wow. This is a very cheaply made chair-- basically a frame of splintered plywood clued and stapled sloppily, and fabric stretched around it unevenly, with stitching at about 4 stiches per inch. Don't think you are getting a good deal on a nice piece of furniture-- it isn't worth more than the price you pay.", 
    "Loved the fabric and style of my chairs. They are very firm and moderately comfortable. We had trouble attaching one of the legs as the bolt holes were not in line, so we're only able to screw one bolt in instead of the recommended two. Overall good quality and will keep them.", 
    "I purchased the grey w/white flower. It gave my bedroom a \"spark\" of pattern it needed. I loved the overall appearance. The fabric is very nice, and looks expensive. The construction of the chair is average and probably would not hold up well with heavy use, hence my 4 star rating. If you need a chair for hall, bedroom or ect. this was worth the money. As they say 'you get what you pay for\". I order another similar one for my hallway.", 
    "This is a great additin to any room. Amd it is very comfortable as well.", 
    "Love everything about the chair and am glad I made the purchase, but the hardware was not included and I was too impatient to order it, so I took one of the legs down to the local hardware store and purchased 8 bolts and 8 washers and used my own hex wrench. Frustrating but happy in the end.", 
    "Good quality, gets lots of compliments", 
    "I am extremely happy with this chair..the design..fabric..sturdiness.. Overall it's a fantastic chair for the price they offer. I've never ordered online before so I was hesitant in purchasing something I couldn't see. Fortunately it was a great decision. My only complaint is that there is a zipped up compartment underneath the chair that holds the legs..we were taking them out and the zipper broke off leaving black material dangling underneath the chair. I just ended up velcroing it shut..", 
    "Can't beat it for the price! The fabric is so soft and the colors are true to the picture. It's not the most comfortable chair, but it isn't uncomfortable and definitely works as a living room accent chair that won't be used everyday. Easy to assemble too! The only complaint is that one of the plastic floor protectors was broken, but that's less than a dollar to replace at the hardware store.", 
    "Overall the chair looks nice and is comfortable to sit in. My issue however, is with the construction. None of the holes line up properly on the legs which means we have to re-drill holes to make them line up. I think this degrades the stability of the chair but there was no other way to attach the parts.", 
    "I read all the reviews, good and bad, and ordered two of these chairs. Really wanted the red, but the only color available was the light brown. They arrived within a week, packed really well. The first one was assembled in about 15 minutes. The legs seem to be everyone's issue. Yes, you must read directions, placing each one in its specific slot. The back of the chair just slides in. Made us wonder, was this too easy? The second chair was a tad bit more difficult. The holes in one of the legs were slightly off, so that when we finally were able to tighten the screws the leg is slightly off angle. It's annoying, but not readily noticeable to anyone else. And, it doesn't affect the functionality. So aside from that little annoyance, we are very happy with these chairs.", 
    "I wish I could give these a higher rating. We purchased two of these in the lighter brown fabric. We were looking for two occasional chairs that were small scale. The tone on tone fabric is very nice and our color was accurate. The seat back is a bit short. They look very nice paired together. These require assembly. We are not shy about assembling furniture and regularly do so. But these were, without question, the most difficult piece of furniture we have had to assemble. It is the connection of the legs to the chair base that is troublesome. The shape of the legs and the instructions make it confusing to tell which leg goes in which position. The connection point between each leg and the chair seat is at a difficult angle and hard to see, and in our case, excess fabric from the upholstery on the chair seat has made it difficult to achieve a tight connection. We have had the chairs a little under a year. We have had one leg fall off, and we routinely tighten the leg-to-seat connection.", 
    "This item actually came as a different item altogether!", 
    "This chair looks nice but the legs never went on right & it sits kind of lopsided...I am afraid to sit in it because I feel the legs will snap off. But otherwise the fabric is good quality.", 
    "These 2 chairs are very attractive. I am staging my home to sell and they fit perfectly in the entry, making the it feel clean, soft and inviting.. They are sweet.", 
    "As many of the other ratings have said, this is poorly made. I've had this for only a year, rarely use it an one of the legs is already bending from the cheap plywood. I cannot imagine this lasting with a full family. Save your money for something of better value. I would not buy this again.", 
    "comfortable & looks a lot more expensive. It makes you use correct posture when sitting. Simple to put together.", 
    "Legs are a bit wobbly and do not screw into place easily. Otherwise the chair is pretty nice.", 
    "Great chairs, average size and true color to picture. Firm seat and easy to assemble - legs are concealed underneath during shipping in nice zipper compartment. Carefully follow instruction to place legs properly. Good purchase", 
    "Excellent upholstery work. Would have given it a 5 but the back legs did not go with this chair. Holes and bolts did not match up so we had to improvise by drilling new holes and using different type of bolts. A big nuisance and mildly irritating.", 
    "Love the pattern stitching - chose the neutral beige and goes perfectly in my bedroom. The price was great for something this comfortable and attractive.", 
    "Chairs look great but that is where the positive review stops. The chair comfort is okay. I bought two chairs fit a sitting area and wasn't too concerned with comfort. These chairs are not for use in a living room. The chair quality is terrible. I had to return one chair because the leg buckled. While I was waiting for the exchanged chair the leg on my other chair started buckling. The chair wasn't sat in for more than 30 minutes and the issue developed. I will be returning both chairs and spending the $$ or so more for better quality chairs.", 
    "They were purchased for seating at our church lounge. They're adequate, but I certainly wouldn't want them for a place that was getting a lot of use!", 
    "these chairs where manufacture wrong the top looks good but the guts inside where you have to install the legs looks like a 10 year old put it together the legs are impossible to install yes impossible only if you get longer screws or drill out the hole like I did will the back legs go in.. save your money you will not be happy no blue in it turquoise and light grey again you get what you pay for ..", 
    "Good chair for the price. Comfortable height.", 
    "This chair arrived securely packaged and there was no damage. You need to install the (4) legs using the (8) bolts and washers supplied. The underside is constructed using thin plywood with (8) very crudely drilled holes for the bolts. For the first (3) legs, I had to wiggling the bolts quite a bit to get them into the holes in the legs; each leg has (2) threaded inserts for the bolts. The 4th leg did NOT line up at all!! Both holes were off by over 1/2\". There wasn't enough room to drill new holes because I could not get my drill into position due to the location of the cross supports. I had to drill out the existing 3/8\" holes using a 1\" drill on an angle, which created two very large holes. What a mess!! I had to get larger washers for the bolts otherwise the bolt heads would have just fallen completely through the new holes I drilled. I finally got the last leg installed (with much ado), and went back to re-torque the other (6) bolts.Total time for assembly was a little over an hour, which also includes unpacking the chair.I set the chair upright, and the chair did not feel very secure because of the cheap plywood used for the frame. When sitting in the chair, however, it did feel secure. Personally, I did not think it was very comfortable, but my wife liked the way it looked. To her, the look was more important than comfort. As an engineer, though, I was more concerned with the stability of this chair and its comfort. This must be why women are from Venus and men are from Mars!After I was done with the assembly, there was a big mess of plywood shavings and other debris on the floor from all of the drilling. My wife was so appreciative about my efforts to assemble the chair that I *LET* her clean up the mess! :-P", 
    "This was actually my first big purchase on line. I didn't know I would have to put it together. I was able to, but the legs gave me a little trouble. I placed the chair in my bedroom, with a big orange pillow for back support. It is a very hard chair, from all angles, so the pillow was a must. I love shopping on line and will continue, but will try to make sure the quality is a little better.", 
    "The chair arrived and looked awesome. However, I was very disappointed to find that, when attaching the legs, the holes in three of the four legs didn't line up with the pre-drilled holes. They were off by a good 1/2\" but since I had already unpacked it, I decided to drill my own holes instead of sending it back. After about an hour, I managed to secure the legs and the chair looks great.", 
    "Chair is cheap and not sturdy. Does look good but that's all", 
    "These are gorgeous chairs, a bit large for me, but then again, they fit the \"menfolk\" in my world just fine. I am good with sitting in them with a pillow at my back. Prettier in person than in the photo. The black \"sunflowers\" on the brown background pop out better in reality than in the photo. That would be a hard thing to photograph. Great value for the money, and relatively easy to put together. I was surprised.", 
    "Purchased two chairs for an office. They look nice, though the fabric is puckering on one of the backs. They sit deep and a little high. Fit taller and bigger people best. The seat and esspecially the back feel like they are not well padded. The materials seem nice enough, but the lack of strength/support in cushioning in the seats . I don't expect they will last more than five years of minimal use.", 
    "I purchased this chair to coordinate with a teal sofa and it looks perfect.Fabric is nice quality and chair sturdy and very well made.Thinking of getting another.", 
    "Very nice, hope it holds out...looks quite stylish", 
    "I bought this chair for my bedroom. It was easy to put together and looks lovely. The seat is really deep, so it is a great chair for anyone with long legs.", 
    "Great price for this chair", 
    "Pleased with the quality and look of this chair.", 
    "These chairs look great but when you assemble them they are a bit loose. I think they are a great deal, just unsure how long they will last.", 
    "Nice chair, even bigger than expected!", 
    "I like the chair, it was easy to assemble. The seat is very deep, It does not take up much space, It is not very comfortable as you sit in a very upright position and the cushion is very firm.", 
    "I read many of the reviews for this product before purchase but decided to try it anyway. The reviews were right! I followed the instructions exactly as written and the back legs went on all crooked. We were looking for a smaller arm chair and it's a great size for what we needed. The fabric is nice and it looks great. Even though the legs look weird from the side view, it's sturdy so we put it in a corner so it's not as noticeable.", 
    "WOW works great for my living area, nice color and look very expensive. Great color work together with my 2 new love seats from overstock.", 
    "Nice looking fabric for a slipper chair but not very comfortable to sit in.", 
    "These chairs are awful. First, there's a lot of assembly you have to do, and the bolts are cheaply made and strip easily. They were a bear to get to screw in to the inserts. And the chair back just sits on the seat- it doesn't attach at all. It feels like if I leaned back, the whole thing could just pop off at any second. Second, one of the 2 chairs I ordered was a mess. The back of the chair had two ripped seams, one of the legs was severely scratched, and no bolts were included. When I contacted Overstock, I was told they no longer carried the parts required, so my options were to return the chair or get a $** partial refund. Neither option is great, especially as I only discovered the damage to the 2nd chair after spending an hour assembling the first. So I could unassemble and ship back both chairs, or go to the store and purchase my own bolts, which is what I did. Even so, I had to take out the cheaply made nuts because they were stripped and wouldn't hold a bolt, and replace those as well. So I spent $** on parts and 4 hours of my time. Nice. At least these look nice, because that's all I can say for them.", 
    "Love this accent chair! It's a great addition to the living room and I have gotten many compliments on it. Super easy to put together. The only issue I had was that the zipper on the bottom to access the parts and instructions didn't work, so i had to cut it out. Oh well, completely unnoticeable now!", 
    "What's not to like about this chair? With coupons and discounts, we got the blue sunflower one for $*, delivered. It arrived quickly and was very easy to put together. The quality is average, but I wouldn't have expected for than that for this price, and I wasn't wanting to spend any more on an accent chair. No, it is not a stairmaster and probably shouldn't be used as such, but for sitting on... there's absolutely no reason it shouldn't hold up. I don't see anything flimsy about it. Definitely recommend.", 
    "I was looking for a small but firm accent chair and this is perfect.", 
    "Fits in well with my apartment. Nice comfortable chair. Material feels very nice.", 
    "These chairs look great. The varied red-on-red in the pattern makes them versatile; you can put them with nearly any other red/wine/burgundy, and they look good together. The way the seat back just inserts down into the base of the chair with no anchor is odd, and seems vulnerable to breaking or popping out of place. Assembling the legs was a major pain--the holes were not drilled straight so it was extremely difficult to thread the bolts into place.", 
    "The only problem we had was the back legs were marked wrong. My husband had to remove them and exchange them. Also we like the pattern but it seems more like mums than sunflowers.", 
    "If they were looking for a small chair that is just average, this is a great buy. If you wanted a WOW factor to light-up a room, move one to another item.", 
    "We purchased two Aqua blue chairs for our office and they are lovely. I would recommend this purchase.", 
    "The item was very nice looking. However, very difficult to put together because you are given a small wrench and the bolts were difficult to see. We also had a leg on the chair that was broken. The company did work very quickly to replace the entire piece of furniture though."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Tux-Sunflower-Accent-Chairs/8614570/product.html?recset=1f3cf96b-cbb9-426f-8d5b-766044480995&refccid=EPDVSCSS6HXKM32H3WNOVUZTZ4&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8614570/Tux-Sunflower-Accent-Chairs-a559df1c-e901-4f93-872d-463fb982611d_600.jpg"
  ], 
  "description": "Charm your guests with these lovely wood accent chairs. These\nespresso accent chairs are constructed from beautiful kiln dried\nhardwood. The modern design features clean lines and gracefully\ntapered legs. Upholstered in a comfortably soft patterned polyester\nblend and filled with supportive high density foam, this accent\nchair is the perfect addition to any living space that needs extra\nseating without sacrificing style. Kiln dried hardwood frameSet includes: One (1) accent chairMaterials: Wood, upholstery grade fabric, high density\n  foamFinish: EspressoUpholstery color options: Brown, red, blue, charcoal, bark,\n  ivoryUpholstery fill: High density foamSeat dimensions: 19 inches high x 20 inches wide x 22.5\n  inches deepDimensions: 35.5 inches high x 28 inches wide x 30 inches\n  deepStyleContemporary, Modern, TransitionalMaterialFabric, Foam, MDF, Polyester Blend, WoodFinishBlue, Brown, Charcoal, Espresso, WoodChair TypeAccent Chairs, Arm Chairs, Club ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlue, Brown, Grey, Off-White, RedFurniture PatternFloral"
}