{
  "name": "Villa_Faux_Leather_Brown_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 107.20", 
  "reviews": [
    "I bought my first set to make sure the color and quality of the chairs would be what i was looking for. When the chairs arrived i was impressed and even more satisfied with the quick assembly. I needed four more chairs and was lucky enough to get the last two sets before the sold out. The chairs are sturdy have a great look and sit comfortably. Great buy, thanks for all the reviews above I read most of them before selecting this brand to purchase.", 
    "Love the look of these chairs. They are a deep rich brown color and look fabulous next to the table. I would recommend this product to anyone looking for simple design chair that looks like a high priced chair!", 
    "Easy to put together if you follow the instructions. They look great with my dining table. I would love it if they had matching bar stools to go in my kitchen.", 
    "The chairs were easily assembled. After the first chair they took about fifteen minutes each. I used the leveling instructions in the package as I assembled and only one of six purchased wobbles a little. I will either install and adjustable leg cap at little cost or simply cut a small spacer out of wood to go above the original cap. I found no combination of price versus quality anywhere else. The low shipping costs of Overstock.com really puts the value over the top. If you did not know better you wold think they were leather, and they are most comfortable to sit in.", 
    "I have an oak dining table that I need chairs for and I love the way that these look with the wood tones of the oak, the construction is great and the price for 2 chairs is a steal.", 
    "I was worried about the term faux leather, but the good reviews convenced me to buy. I have had 6 of these chairs in daily use for 2 years now, and they look as good today as the day I got them. They are easy to assemble, easy to keep clean, and comfortable to sit in. A great value.", 
    "Solid...construction. Even though not real leather, material is soft and flexible. Clean is super easy...just clean with damp cloth. (which is great when you have messy kids!)", 
    "Bought a pair of these chairs to bring my total dining room chairs to 8. My others are antiques, dark oak Craftsman style, and these complement the antiques very nicely. I had read all the reviews before buying, because I knew I would have to put them together myself, and found a mixed bag of opinions on how easy/difficult it would be. However, I had absolutely NO trouble putting them together myself, did both in about half an hour, and they are now sitting at my dining room table looking great and standing rock-solid on the floor, no tipping or having to adjust or anything. The one thing I would have changed is that I would have had the backs a little higher if I could, because these are at the head and foot of the table, but they are a comparable height to the other chairs and look just fine. Very sturdy, very high-end-looking, and one of the greatest deals I have ever found online. I do recommend these chairs, you won't be sorry.", 
    "I feel that these chairs were a fantastic purchase, I had been waiting quite awhile to purchase replacement chairs for our carved pineapple pedestal, glass-top table, and I am truly ecstatic over the way these chairs look with this table, they are really perfect...I am also looking forward to the easy cleanup of these chairs. Fortunately my husband was home on leave to put them together, from working in Saudi Arabia, when they were delivered....YEAH! He was able to mark that one off his \"honey do\" list pretty quickly! These chairs were a wonderful purchase.", 
    "Very easy to assemble and very comfortable chairs.", 
    "Chairs were easy to put together and are 'spot on'! They look great, are sturdy and have a high dollar feel/look at a great price!", 
    "These chairs are a beautiful rich brown, almost black that are very sturdy, easy to assemble and look stunning in my dining room with my table and china cabinet. Love them and just ordered 2 more ! Great chairs and you won't find anything of this quality for this price", 
    "Thanks to all the others who reviewed these chairs; I made my decision after having read everyones input, which proved invaluable. I used a flashlight and checked each hole to make sure they weren't blocked by staples (none of them were), put them together \"loosely\" then had a lightweight sit gently in them on the tile floor so I could then tighten the screws that way (didn't have a single \"wobble problem\" some others experienced), etc. They did have a slight fishy smell from the \"faux\" coverings, I think - went away within an hour or two. Love the chairs! I've always wanted Parson chairs and have looked for several years; these fit the bill nicely and within my price range.", 
    "I ordered 12 of these chairs in December 2013 and by May 2014, at least half of them were split or broken. Now, I did not expect them to last forever, but 4 months is less than acceptable. I have 3-4 that were completely broken, another 4 that were split and the rest are wobbly. If you have the money spend more and get something more durable.", 
    "I was seeking chairs to accompany the dining room table that my late father built for me. These are perfect chairs for the occasion. My husband with only a little assistance from me put all six together within a couple of hours. Everything we needed was provided in the packaging. They blend nicely with most styles from traditional to contemporary. So glad I purchased them ... highly recommend them.", 
    "If you are looking for some accent/dining chairs for occasional use, these chairs are for you. The quality is far better than anything found at a comparable price. They look terrific.", 
    "We really like the chairs. We ordered four and after they came, we ordered two more. They look good ans are comfortable to sit on.", 
    "The faux leather feels nice and I didn't have too much trouble putting together the chairs. I bought 6 chairs and it took me about 15 minutes to assemble.", 
    "Decent chairs for the price. The wood is a reddish brown, which did not work for us, so I sanded down the legs and painted them black. Was a pretty easy task to do. The worst part was getting the legs so they didn't wobble - you just need patience!", 
    "I love these chairs, they look great and are very comfortable.", 
    "For the price, these are perfect chairs! They are easy to put together and I love the smallest detail of the bottom of the chair with the velcro covering. They are easy to clean up (after a messy 4 year old). They are perfect everyday chairs and have the look of fancy dining chairs. Love them", 
    "The chairs arrived just as described. I had purchased a dining table for our breakfast area, but it did not come with chairs. I wanted 6 casual, but classy looking chairs, and did not want to pay a fortune for them. These chairs fit the table perfectly! And for the price I couldn't be happier. Assembly was really easy and they look to be pretty sturdy. My husband and his grandfather put together 6 chairs in under an hour.", 
    "I would recommend this product esp. for the price. You will not find a better product for this price.", 
    "comfortable looks great.easy to assemble. Well worth the money", 
    "We bought 6 of these to use at our kitchen table. They took a couple of hours to put together, but were well worth it especially for the price! They are comfortable, look nice and look like they'll hold up to our kids using them.", 
    "The assembling process was easy and according to the information leaflet", 
    "Bought them for chairs for desks located in a couple of bedrooms, and they fit perfectly..look great! Not like a bulky expensive desk chair...just right!", 
    "I ordered 6 chairs. They were very easy to put together. If you level them just like the recommend, they will not wobble. I was also able to take the white plastic things off the bottom of the legs so I could put the felt pads on the bottom of the legs correctly. You can just ply the white things off with a knife. Very happy with my purchase.", 
    "these chairs was the best the quality of it and the feel is great right price i would recommend these chairs to anyone cause they are the best easy to put together", 
    "The chairs are perfect for what I was looking for. They took a little time to assemble but were not hard to assemble at all.. Definitely worth the effort since the chairs I was looking at locally were twice the price. I don't mind assembling them for that price.", 
    "This is a great value for the price. I couldn't find anything similar for a cheaper price, and at such high quality! The chairs were easy to put together and look great with my espresso-colored table. Love them!", 
    "These chairs are fabulous. I ordered six chairs and I was able to put them together by myself very quickly. They are sturdy and very comfortable. I am very happy with them, especially because I have 2 small children and for the price I am not worried about them spilling things on them. I ordered them standard delivery and received in 2 days! $2.95 for shipping of all six chairs. Love Overstock!", 
    "We were amazed by the wonderful deal we got on these chairs -- they are comfortable and look great, they were delivered immediately, and the price was right. This was our first purchase on overstock.com, and we were impressed with all aspects of it.", 
    "I absolutely love these chairs. You can't beat the price! They look sleek and stylish in my kitchen table. I'm so glad I bought them. Thanks O!!", 
    "These chairs were assembled quickly and look great. I am a home stager and have used these chairs to stage a few properties. They have held up well and look much more expensive!", 
    "I had put off replacing my existing 50 year old chairs due to the expense. These chairs are stylish and comfortable, and a fantastic price.They arrived quickly, and actually had MORE hardware included than was needed. It may have just been me, but I did have a bit of trouble getting the screws set up perfectly to begin tightening. It took me about the amount of time estimated to assemble them, however. I am very pleased and have already recommended them to my friends!", 
    "These chairs came fairly quick. They were pretty easy to put together and seem to be very sturdy.", 
    "These chairs are great. We bought 6 of them for our dining room table and we love them. They are light weight yet very sturdy. Simple to put together and directions were spot on. Thanks for making and selling such a good product.", 
    "I'd been looking for chairs for a few weeks, which the Internet shadowers obviously knew: an ad popped into my line of vision that these chairs were on a one-day only sale. Two for the price of one! I was and am thrilled. The chairs look very sophisticated and are perfectly comfortable.", 
    "Bought these chairs for our game table. They look expensive, are well made and very comfortable. The back is high so your own back is supported which was our concern when playing games at the table. Loved them and would recommend them.", 
    "I bought 2 sets of these chairs. I was looking for parsons chars that had simple lines and brown \"leather\" with espresso legs. I searched for 3 months for the right ones. These were such a good deal I couldn't resist. Definately got \"bang for my buck\" with these chairs. They were packaged nicely, arrived on time and when put together they are sturdy.", 
    "I was looking for a set of chairs to match the new table I just got and these were perfect for it. Great value and pricing and fast delivery.", 
    "These chairs are exactly what i wanted and was happy to get them at a decent price. Online shopping is great!", 
    "I love these chairs. The color is exactly what we were looking for. The price was the best I could find for the quality. The only issue I had was that I had to have my husband help me with fitting the legs into their designated areas before screwing them in. It was a pretty tight fir, but then again I would want them to be flimsy. We bought 14 chairs total. I have only put 8 together so far. The directions are super easy to follow as well. They look great at our dining room table.", 
    "These chairs are nice and very sturdy. One tip is to put in the back center screw first and do not tighten down until rest of back screws are in. That makes it easy to make the chair sit level.", 
    "My husband and I ordered one set of these chairs and we liked them so much we ordered a second set. Assembly was easy to follow. I have had several friends tell me how attractive and comfortable the chairs are.", 
    "Great quality chairs, look good, very comfortable, easy assembly. No complaints whatsoever. Look great next to my table.", 
    "I have been looking for chairs to match my existing kitchen chairs. and it is the perfect match ! The leather looks good and I love the style. My kids are using them everyday. It was packaged securely and received it in good condition.", 
    "these were affordable, easy to assemble and look rich. And they are easy to keep clean with my toddler", 
    "Super fast shipping as always! Surprisingly good quality considering what you are paying for these chairs. Very comfortable and easy to keep clean! I would recommend these chairs.", 
    "I usually don't do reviews, but I was extremely please with how these turned out! Super easy to put together (as in required no tools other than what is provided) and they go perfectly with my oak wood table! I also love the fact that there is a velcro cover underneath the chairs to cover the bolts! I bought 4 in hopes that I could find a bench to go on one side but I love the look of these chairs so much that I just might by 2 more :) I also love the fact that they are faux leather so I can clorox wipe these down when my kids get them dirty.", 
    "These chairs are gorgeous, comfortable, and fun to put together. No problem at all. They look like much more expensive chairs. I'm thrilled.", 
    "I have two other dark brown chairs and needed some to complete the set. These chairs match the color of the other chairs and are just as comfortable. A great buy;", 
    "Loved these chairs! They do not look faux at all! They are extremely comfortable and we always receive compliments on them. They look very expensive and elegant. I also like that the material doesn't make a lot of noise when sitting on them. The only drawback is that they were kind of a pain to put together, it felt like we were literally building the chairs...but other than that, no complaints. Super fast shipping, as always, and the product was delivered true to description. I am thinking about buying two more to add to my dining table!", 
    "These chairs arrived all in good condition. They take a little while to assemble but are well worth the effort. They look stunning and are very comfortable to sit on. I was looking for something for my nice new table that my grandchildren would not hurt if they (or us) dropped some food on them. They look and seem way more expensive than they were. Great buy and I am planning to buy 2 more. I had already purchased 8.", 
    "These chairs look great, solid built, and were easy to assemble. They fit very well with my table.", 
    "I was very pleased with my experience in buying these chairs. The delivery time exceeded my expectations and the instructions on how to put them together were simple to follow. Everything was just as advertised and the quality is excellent.", 
    "Easy to put together. As other reviewers, the first chair went together easily. The second had uneven legs when assembled, used felts to level the chair legs.", 
    "This was a gift and my brother was so pleased with the quality of the chairs,", 
    "THESE WERE VERY NIE LOOKING CHAIRS I WOULD RECOMMEDED TO FRIENDS", 
    "I had chairs that had been ruined in my storage unit, therefore I was trying to find chairs to fit an existing dining room table. As usual, Overstock has come through for me. As soon as I saw these chairs, I knew they were perfect for me. Although they are very lightweight, they are extremely sturdy and have a very nice faux leather finish. Since I do not use the dining room table that often, they probably will hold up for a long period of time. Very easy assembly and the price is a bonus!", 
    "The Chairs look and feel great! There are soft, sturdy and look fantastic, I am very pleased with the chairs. The good price makes them even better.", 
    "love these chairs! they are the perfect color and they match exactly what is on the website and they shipped very fast!", 
    "Bought 8 chairs and 2 of the 8 were sturdy and usable. Six of the chairs either were so unstable that they were unusable or holes weren't drilled in the proper places to screw the chair together. Returned all the chairs and was charged for return shipping. Will not use site again.", 
    "We bought 6 of these a year ago and rarely sit in them as they are at our dinning room table vs. our kitchen table. One completely broke while a dinner guest was sitting in it! Talk about embarrassing! For spending $** on a single chair I would rate the quality very poor.", 
    "I knew I wasn't buying first-rate, but needed something for my dining room until I could afford better. But for some reason the manufacturer decided that wood just a smidge sturdier than balsa would be a good brace for the legs. They repeatedly required tightening and finally one of them just cracked right through. So it ended up in the landfill in a matter of months. They looked OK for what they are, but the wood is simply too cheap to stand up to normal daily use. Don't wast the money or you'll end up throwing them away one by one like I am. I'll buy other stuff from Overstock, but I'll be more careful in the future.", 
    "I purchased 6 chairs for my kitchen in may 2012, the legs cracked and are breaking and spliting. I have to throw them out. I am so upset since the reviews were decent. There is no support between the joint and legs. I can't believe the previous reviews are good. I can understand if one chair was a bad batch but all six are garbage. We aren't heavy people to say its a weight issue. 3 kids under 80lbs and my husband and I. I am extremly unhappy with this purchase.", 
    "These chairs are horrible. They are cheap. The legs have to be tightened about once a week. One of the chairs broke within the first 3 months. They look nice, but are not functional for sitting.", 
    "I am very pleased with this purchase. The chairs are of a good quality. They were easy to put together.All of the tools were included. The color was just what I expected. It goes well with my table.", 
    "These chairs are pefect for what we wanted. They are being used for guests in an apartment office. They look modern and attractive but did not cost a fortune. Love them.", 
    "I am pleased with my chairs. They look great in my dining room. They give the room a modern, updated look by simply switching out the chairs. I put 4 of them together myself. It was not difficult at all. They provide everything you need.", 
    "First off, the color is espresso, not brown. Aka a brown so dark that its almost black. The finish on the legs is much better than on the north canyon parsons chairs, which I've bought many of but often show up with bubbles in the paint. The leather feels a little cheaper, and the back is on the narrower side which is fine, just unexpected. The assembly with these was also easier than the north canyon parsons chairs. For those with wobbly legs, most of the time this can be avoided by not tightening the legs all the way during assembly. Stand it upright on a level floor, then gradually tighten the legs. This usually does the trick, but even so one of my chairs had a slight wobble to it. That's just what you get at this price!", 
    "I'm so glad I got these chairs. They are exactly what I was looking for. They are almost identical to some I've seen at Target, but cost about half the price. They arrived promptly, were easy to assemble, and best of all, look great with my table! They are comfortable and worked out perfectly for me. I had never ordered from Overstock before, so wasn't sure what to expect, but this transaction was very smooth, and the product is a winner. I'm very pleased with my purchase!", 
    "I have a 4 year old, so these chairs are perfect for him. for the price its a good buy. you do have to keep tightening screws on the bottom though, as they tend to loosen as the chairs get worn in.", 
    "I was looking for 2 accent chairs for our dining room set. I wanted 2 dark brown leather (or faux) chairs with dark wood accents to match the other chairs in my set. This fit the bill exactly!!! and only cost about $40 a chair. Can't beat that price.", 
    "I ordered 6 of these as I needed chairs for my crafts room/office in my house. These are great. My brother and daughter assembled them- so it's no more difficult than you'd expect, and out of six, only one had an issue. My handyman fixed that one. They are surprisingly sturdy, don't wabble at all, the \"faux\" looks pretty real, and i'd suggest you don't waste another minute on finding a better deal. I've looked through them all and you can't beat this price. This was a great overstock purchase!", 
    "I am so pleased with these chairs! I had ordered from another site and was SOOO dissapointed with the product and return policy that I went back to Overstock whom i trust. I should have started here from the beginning. Found these beautiful chairs! Ordering was a cinch. Arrived fast and my boyfriend said putting them together was a breeze. We were missing one washer on one of the sets but we bought one for 25 cents. The chairs look just like the picture and are extremely stylish and sexy. I just bought a new couch from O i hope its the same great experience!", 
    "I am very pleased with the quality. These are great chairs, especially for the price. The chairs look terrific in my home.", 
    "We order 6 of these chairs a few weeks ago and we are SO pleased! We used to have these hard, iron chairs from IKEA and wanted comfort this time...and we got it. They are very comfortable...the back is higher than I expected, and they're nice to sit in for longer periods of time (unlike my old chairs). We've received many compliments on them, and people are surprised when they hear the price. The legs are darker than I expected...an earlier review mentioned them being cherry/warmer, but ours are a darker espresso. Our table is warmer, but the chairs go great with it and you can't even tell that it's a different wood. We have a 2 year old and cats and dogs, and no one is leaving a mark:) I've been wiping them with a wet washcloth when needed (which hasn't been much). The only con, as mentioned by others, is that they were a bit of a bear to assemble...but once my husband got one down, he was really moving towards the last few. Some of the legs needed a little adjusting to sit evenly, but he did this too with little problems. I highly recommend these chairs and we're very pleased:)", 
    "Love these chairs. The price was great. Easy to put together. Exactly as shown in picture. Very comfortable. Look great with my table...", 
    "Skeptical at first but gave it a try- glad I did. Very enticed to buy 2 more or replace all the chairs for such a great price. Ive searched high and low for a decent prices on chairs and have found it. Catch O.co for great sales and shipping prices. Suggestion: You guys should have a wish list too... there is so much to want on this website. Now if you could only sell textbooks too :^}", 
    "The chairs are a great addition to my dining room set. The only complaint that I have is that the box was not labeled \"do not use a sharp object to open\". If my brother had not been careful, he would have sliced the chair with the case cutter!", 
    "Comfortable, easy to assemble. No complaints. Look great.", 
    "Once they're built, they look great. Just like all the chairs you see in the stores for $+ each, but bought in a set is a great deal. Pretty appearance, sturdy enough for a 250 lb guy. Advice on building... sit down on a chair or sofa with the seat of the chairs on your lap to assemble, waaaay easier than on the ground. Found that out by the 4th chair. All in all, I would recommend, looks fancy without the fancy price tag =)", 
    "The chairs look nice but are not sturdy. The wood cracked and the screws no longer stayed secured to support the legs.", 
    "After only 2 months two of the 4 chairs I purchased had legs that cracked. The bolts that hold the legs to the chairs have to be tightened regularly (every couple of weeks) so they don't wobble to much. The wooden brackets that hold the legs to the chair seats are cracking, 2 of them cracked all the way through. The receptor for the bolts that are recessed into each leg, are stripping and won't hold the bolts in place. I went to the hardware store and bought my own brackets and screws. I also had to buy new 1x3 planks of wood to retrofit new braces and brackets under the seats to hold the cracked legs in place. I have tape around the cracked legs, attempting to prevent any more cracking. I don't know how else to fix cracked legs. Oh, and Overstock's policy is not to replace defective items after 2 months of purchase so I cannot return the chairs, not even for store credit. My options are to toss the chairs in the garbage or try to fix them myself. I'm not sure if I can fix them so I expect to be throwing the chairs in the trash soon. I'd give a zero or -5 rating if I could.", 
    "I ordered 2 sets of these chairs. They are poorly constructed of low quality materials. The legs were split on 3 of the 4 chairs I ordered. They come unassembled, and you have to put them together. The holes are misasligned and chairs cannot be assembled properly. Seats are hard and uncomfortable.", 
    "One broke beyond repair in the first month and another is on it's way.", 
    "I have purchased a number of chairs and pieces of furniture that require assembly, however, this is the first time that I have had chairs that just didn't last.First, it is very difficult to align the legs on the chairs making the chairs wobble.Second, even once the legs are tightened, the bolts holding the chairs legs loosen very easily require frequent tightening to keep the chairs stable.Most recently, one of the corner supports to which the chair leg attaches has cracked.The chairs are very pretty, but not sturdy.I would not recommend these chairs.", 
    "Chairs came before expected delivery date and are very elegant and comfortable. Would recommend to others. Great buy!", 
    "Easy to assemble, look great,", 
    "I love these chairs. They are very comfy and they look presentable. They were easy to put together.", 
    "These chairs look really good, are very comfortable and seem sturdy enough. They were easy to assemble! I don't know how long they will last, but for the price, I am very satisfied.", 
    "Be careful to check all of your pieces. I did find a couple defects, however customer service was great.Overall a good purchase. Finally matching chairs in the dining room.", 
    "Gives my dining area that nice, comfortable and elegant touch. Strongly recommend!", 
    "These look beautiful and are well made. Very happy with my purchase", 
    "Chair is VERY uncomfortable", 
    "For a fake leather chair, this is well built and comfortable to sit on while eating dinner.", 
    "Great chairs and an EVEN BETTER price !", 
    "Goes great with the black walnut table I have and they are easy to put together. Comes with everything you need and they are comfortable as well. Easy to clean.", 
    "They are well worth the money. Easy to put together and very comfortable.", 
    "The Chairs are not only beautiful the quality is excellent. We are so happy with themMy dinning room looks great !!!", 
    "Very durable around children and pets .", 
    "Great value for the price. Chairs look nice and are sturdy.", 
    "Nice , Steady and comfortable", 
    "I have had these chairs about two years now and they are holding up fine. I do not use them a lot, so that may be the reason. They are faux leather, so not top of the line, but for the price, a very nice chair. I would recommend as long as you are not going to be using for heavy use. They are sturdy, but may not hold up under abuse from kids jumping on, etc. I put them together by myself and some of the wholes didn't line up exact, you just have to work it through. Overall a nice chair.", 
    "Really happy with them. They are a really dark brown, almost black.", 
    "I looked at a few place, did price comparisons and quality comparisons (based on pics), ended up going with these. They are perfect, good price and look like they are worth more than what they sell for, easy to assemble! And the color matched perfectly. Quality of the leather looks good, not cheap. I may have to buy two more if the wife lets me.", 
    "I didn't realize they were the same I had bought before, or at least from the same manufacturer. Low quality bad seams and even the wrong color, wayyyy offf! I ordered brown and got more like a black. And of course, I asked for refund and have to drag all 6 of them to *** and pay for my own shipping until overstock determines they really did sell me a bad product. Fat chance!", 
    "cannot be put together. look flimsy also. DONT BUY", 
    "Quick delivery. Chairs are very dark brown. Assembly was easy enough. Look great with my oak table and hutch, updating the look. Happy I bought them.", 
    "If I could give these chairs a \"0\", they would get it. I'm returning mine tonight. The chairs cannot be assembled - the parts do not fit together properly (and believe me, we've spent hours trying to get a few bolts to screw chair legs on and attach the chair seat).", 
    "product is good but the picture on OS is different than in person. it looks very small. but overall they are good chairs.", 
    "The style of these chairs is exactly what my husband and I were looking for .and the price was fantastic because they're for our kitchen table. So we were excited to find them at such a great price. Once assembled they seem to be doing well. The challenge is the assembly mainly the back legs. The pieces are factory cut and therefore, not all of them fit like they are intended to fit. Also, the screw holes seem to not all be stripped properly. We had a bit of extra work to clear the stripping of the screw holes. And using an allen wrench because America has gotten away from real tools can be obnoxious. We are now the proud owners of 6 more allen wrenches to add to our ever-growing collection. It took more work than I'd like it to have taken, but overall we have been pleased thus far with the chairs. We recommend checking each screw hole with the corresponding screws prior to trying to attach the legs. This will save a bunch of heartache and re-do work.", 
    "I ordered 6 chairs. On the one box I opened, one of the seat cushions had an inside seam on the right and an outside seam on the left so the seams are non synonomous. The 2nd chair the wholes weren't aligned so I couldnt even put it together. I didnt bother opening the other boxes since there were flaws in on both chairs in the one box. I will say however the style, quality and appearance were very nice. I would have kept them had I not experienced both those issues.", 
    "I purchased these chairs awhile ago and they arrived within a few days. They do the job as host and hostess chairs for the dining room table, however, the quality is really not great and I had my maintenance guy put them together and they took quite awhile, not easy.!! The price of the chairs reflect the overall quality. That said, I absolutely love dealing with Overstock!!", 
    "I purchased these chairs based on the reviews and it appears that you get what you pay fr so I purchased the accidental insurance and it covers nothing that could happen to the chairs. example: we received our chairs and it was over two months before we used them, after using them for four(4) hours, one chair appear weak and the screw from the leg had come apart. The second chair was weak in the middle and only a 117 lb person sat in the chair. Put in a claim and they are not able to help because its not an accident and there is no product warranty. Fair warning!!!!!!!!!", 
    "Love these chairs. They are very dark, almost black! They are very lightweight and perfect for my kitchen! Great value!", 
    "I love these chairs! Dark brown almost black goes great with my table. And sturdy compared to and other chair I've seen like this. Price is fabulous.", 
    "the chairs are a nice temporary fix until we get the table we really want. they look great for the price. i've had them since jan 2013 and only thing is they wobble after a little bit. i tried balancing them but but they still wobble a little bit.", 
    "I am a mom of 4 kids AND an interior designer. We have guests in our home every day. We wanted chairs that could be used - A LOT, look fashionable, clean easy, stand up to all of the football players, wrestlers and gymnasts that come in and out of our home, AND would not break the bank. THESE CHAIRS FIT THE BILL! I bought 6 chairs for my kitchen and they look fantastic! They were delivered to my doorstep 3 days after I ordered them. They took about 15 minutes/each to assemble -SUPER DUPER EASY! My 6 year old did most of the work - seriously! I have NO IDEA why some of these reviewers had such a hard time putting these chairs together. I am not kidding here - they are SO EASY to assemble - you don't even need any additional tools! They are very good quality - all wood. My husband is 6'2\" and 300 lbs and is very comfortable sitting in them. He loves these chairs! We will be purchasing more - they are such a great bang for your buck. 6 of these chairs cost the same as 1 comparable leather dining chair in a name brand furniture store. I will recommend these chairs to ALL of my clients. P.S. In case I didn't stress it enough above; THEY ARE SO EASY TO ASSEMBLE!", 
    "I was having a dinner party and was sick of using ugly folding chairs for extra seats at my dining table. I ordered two of these chairs. They arrived quickly. A handy friend put them together for me in 15 minutes. I told him that some reviews said there were problems with assembly but he said they were very easy to put together. The other chairs at my table are from Pottery Barn with the cranberry seat covers. These brown chairs complimented the existing ones and worked perfect as extra chairs. They are much lighter weight and probably not something that could take daily use and abuse but they are perfect for when you have extra guests. They also fit cushion to cushion for storage in a closet when not in use. These are less than half the price of high quality chairs and are certainly worth what you pay. I am thinking of getting two more.", 
    "These chairs are amazing! I bought 8 of them and was a little nervous that they wouldn't match with my table that I had bought. They were so easy to assemble. I would recommend this to anyone looking for some great chairs for a great price.", 
    "Bought these chairs because I wanted the look of leather, but couldn't afford the real stuff. These are a good substitute. And I'm not sure what everyone is talking about these being hard to assemble because I had absolutely no problems what so ever.", 
    "The legs are all a little off, so the chairs don't sit level. This can be rectified by a thicker glide, purchased at a hardware store. The look is good, the weight is very light so not sure how they will hold up in the long run.", 
    "These are true to color, dark brown. Large enough size to not feel like you will fall out. A bit of a bugger to put together, follow the advice with how to get rid of the wobble by stabilizing while tightening.", 
    "Not bulky very sleek chairs, love them for where they are placed at the dining room table Kids have room to work around the table without bumping into them!", 
    "perfectly good copy of a leather chair. Not meant for a home with cats. Sturdy chairs.", 
    "Cheap and cheaply made. Not a product that will last a few years with everyday use.", 
    "Poorly made. Had to return. Two chairs broke after he month", 
    "you have to make sure balance all four legs I had to go back and do that", 
    "Have 6 of these chairs look great with my living dinning room area. I get complements all the time.", 
    "I bought them to match existing ones I have and they match really well. The color is very deep brown almost black. They are comfortable.", 
    "These chairs get A LOT of use as they are in a lunchroom for employees. They hold up exremely well and are lovely as well. The price is right!!", 
    "These chairs are so comfortable, they look great, and they were so easy to put together. I have 12 of them. All good!", 
    "The seat is hard and uncomfortable to sit on. The chairs look nice but could a bit bigger and more comfortable, I did not buy more.", 
    "Very impressed with my purchase.", 
    "Love them! They are light weight and feel very good to your back. So glad I got them!!!", 
    "great chair, blends well with antique pieces; easy 15 minute assembly; happy with purchase", 
    "Love these chairs! Great price..easy assembly. Just what I needed.", 
    "These chairs fit great with the dark wooden dining table I have. Needed 6 chairs to complete the set. They are comfortable and make the dining room look elegant. Assembly is easy if you read the instructions.", 
    "These are great for the price. They are durable and comfortable. I wish they were just a little bigger but I am definitely keeping them and I am very satisfied.", 
    "Excellent chairs easy to assemble I went and ordered a third set", 
    "In all fairness, I didnt measure well before ordering. These chairs are nice - but I need something a little larger to match with the other furniture; so I am returning and will be looking for a bigger chair.", 
    "Easy assembly, comfortable chairs. Very attractive. Need to buy 2 more", 
    "We bought these chairs to offer a bit of contrast to our dining room set. They had to be put together, which we knew, and wasn't a big deal. The problem with them is that the pre-drilled holes didn't match up well and each chair had one leg that was shorter than the rest. The chair's instructions claimed that the legs could be adjusted, but the reality was they really couldn't be. If you loosened them up, they would wobble. It left us with a uncomfortable feeling when we sat in them. After a year, one of the chairs actually split and we threw both of them away. Color was perfect though and it did make cleaning up after kids easy. But the overall quality was lacking. At least our set anyways.", 
    "Excellent side chairs when extra dining seating required.", 
    "The seats were not as wide as I thought, but I also didn't pay attention to the measurements before purchasing.", 
    "Comfy too. Hopefully they will last a long time. Plus i dont get worried having my nieces sit on them at the dining room table...totally wipeable and cleanable.", 
    "I ordered these and returned them. Junk!", 
    "Very sturdy chairs. They support my 300 pound son. And they have shown no wear.", 
    "I ordered six chairs and they are used every day. They are very sturdy and look great plus being easy to keep clean.", 
    "Bought these chairs for my son and his family. While were a perfect match for their dining table, the legs continue to come unscrewed. May need to use wood glue to stabilize.", 
    "Excellent value, very dark brown, love them", 
    "...but a little flimsy. Also, one of the chairs came with a damaged leg. Since I bought an extra pair, I chose to mend the damaged wood myself and didn't return it. Good product for lightweight use.", 
    "We purchased four chairs to surround our one of a kind dining room table. We wanted the chairs to blend in and allow the table (a piece of art) to standout and be the center of attention. They look great, were easy to put together, quite comfortable and easy to clean. My husband couldn't believe the low price. It's just my husband and I using them a couple of times a week. May not be sturdy enough for everyday, hard use.", 
    "Chairs are easy to put together, feel like real leather, and very comfortable. Great Buy.", 
    "These chairs are elegant and well cushioned", 
    "sturdy and attractive. Just hope they last!", 
    "The Chairs worked perfectly with my table and they were easy to assemble a great price and who can argue with free shipping?!", 
    "I love these chairs I have to buy two more. I bought at a really good price .", 
    "Love my chairs they are very comfortable well built only wish I needed more!!!!", 
    "For the price these chairs are an excellent value. A little shaky but nothing a little tightening doesn't fix. Very comfortable.", 
    "Good quality and very sturdy.", 
    "A little tough to put together by yourself. They look great and working out well", 
    "They don't stay together very well. We have had two people actually fall when the chair comes apart", 
    "I was very pleased with the quality of this product, the chairs are well finished. I found them to be both pleasing to the eye and very comfortable.", 
    "The seat isn't as wide as my old chairs but then again, these are Parson chairs. Very comfortable, EASY TO CLEAN, and look so nice. Clean lines go with a lot of designs. Dark brown color almost black looking in case you were wondering.", 
    "These chairs were a great buy. I was happy to see they looked just as advertised and were easy to build.", 
    "Not the exact color I was expecting. Very dark brown, almost black in color. The quality is great and easy to put together. Very firm and sturdy chairs.", 
    "One chair the leg was Damaged my friend of 130 pounds fell on the Floor i was So Embarrassed !!!. This Holiday the wood legs are not Strong enough . The Villa Faux Leather Brown Dining Chairs", 
    "the chair are nice but unlevel", 
    "Easy to put together and very stylish!", 
    "The brown chairs we ordered turned out to be black. The boxes were labeled brown, but the chairs inside were black", 
    "When I received these chairs, I was disappointed to find no hardware or instructions in the carton, just a sheet of paper saying that is the legs are wobbly, to remove the Velcro covering on the underside of the seat. So I undid the Velcro and found the hardware and instructions. The instructions are very easy to understand, and the tools are included. High quality chairs, very well-made and good-looking!", 
    "The chairs were simple to put together however not all were the same once they were together. A couple are a little looser then the others. We bought a set of 8. 6 out of the 8 seem to be nice and tight the other 2 are on the loser side", 
    "Easy assembly, very comfortable. Only downside is that they come loose very often, with minimal loose. Tighten right back up, however. I'd buy them again. Love the easy clean up.", 
    "there are nice looing but not sturdy two weeks after i got them a leg broke im still waiting for a replacement", 
    "The chair is easy to assumable, looks good. However the most important are comfortable and quality, both of them are not there.The price you pay for it is exactly what you will get!", 
    "Received 4 Dining Chairs ...... all perfect condition and sized as stated. Beautiful addition to kitchen. No problems with assembly; they are sturdy and serviceable in my décor. Just as expected!", 
    "Bought these chairs as a gift for daughter and son in-law. They look very nice and were easy to assemble. My daughter loves them! I was very impressed with the look and quality of these chairs.", 
    "We bought 6 of these chairs over the last 4 months 4 of them broke. Do not buy. Spend a little extra and get quality.", 
    "Arrived in good shape. Look great!", 
    "We bought several 2 years ago to replace very expensive, real leather chairs that did not hold up to the wear in a small restaurant. We are replacing more of them with this 2nd purchase. So far they are holding up better.", 
    "This pair of chairs works so well with my dining room to provide extra seating. The chairs are comfy and stylish leather with a tall back and extra padded seat. I'm very pleased and you can not beat the price!", 
    "So, I ordered 4 chairs and they came in faster than expected. You need to assemble them but it's not difficult to do so and this is coming from someone that's not very crafty. Between me and my 9 yr old we put them together. One of the chairs came damaged and Overstock replaced it w in a few days! Their customer service representative was amazing! Chairs have been tested by adults and kids and so far, they are doing their job and are very easy to clean.", 
    "Very nice sturdy chair. My only complaint, not that it's really a complaint, would be that the back is more narrow than a standard chair, which is a bit hard to see from the picture provided. Otherwise this is a good chair at a great value. They weren't difficult to put together either, which was a plus!", 
    "I got my chairs one week after ordering them. They go so well with my table and matches the furniture perfectly.", 
    "good price. easy to assemble.", 
    "Very nice. Struggled to put it together, but was finally successful. I use them in my office.", 
    "this is perfect for round table", 
    "I love them! The texture is soft and the is very comfortable .", 
    "Wasn't at all what I expected. Chairs looked beautiful but was lightweight and wasn't durable at all. Easy to put together but was rocky.", 
    "We got 6 chairs for our dining room table. Very nice finish. We had to assemble them but it quite easy. Great deal!", 
    "Great deal for two. Easy to put together. firm at the start but get a little softer as they break in.", 
    "The Chairs look great, but the legs are not very stable, I had overstock replace two chairs 3 months after purchase, then 10 months later another legs broke, but by this time they would not replace the chair. We are not an overweight family so this was very disheartening.", 
    "Love these chairs. They look great in my office.", 
    "Excellent quality, easy esambly", 
    "I ordered 2 sets of these chairs for my new farm house table. They arrived in 5 days and they were a lot nicer than expected. They look like expensive chairs I have seen in furniture stores, but I paid roughly $** for each chair. I assembled the 4 chairs myself in about an hour. I would highly recommend these chairs to anyone looking for something simple, yet classy. Very pleased with my purchase! :)", 
    "I was upset at first because the color is not brown it is black but after I put them in the dining room with the new table setting the look was exactly I was hoping it would be and the chairs are really comfy too", 
    "I got two sets of these chairs recently. On one chair the rear legs were different heights necessitating sanding and modification. On another chair, one of the legs had been repaired poorly during manufacture and the other leg had a 1\" knot hole that would certainly allow for failure of the leg in the near future. The wooden base under the seat is beyond cheesy and thin, and the overall quality of the components that were used in the construction of these chairs would be placed at way below sub par. They also are rather small. I would not purchase these chairs again. I guess you get what you pay for and in this case you're not getting a sturdy foundation for everyday use or otherwise.", 
    "They fell apart and all the wood that holds the legs broke.", 
    "They look black instead of dark brown. Very comfortable though.", 
    "Chair legs break after a few months- cheap quality", 
    "These chairs are beautiful, had hem for about 3-months now and they are comfortable", 
    "Affordable, easy to put together and comfortable", 
    "Looks-wise, exactly what we wanted, at a fantastic price. They are not the most comfortable though - pretty firm seat.", 
    "did not hold up--called Overstock to return, was pleased with Overstock Customer Service and return policy. Looks nice, not very sturdy/strong.", 
    "Great Chairs for the price !", 
    "This are nice looking but we're a little hard to get them to not be off glance putting them together we're easy", 
    "I looked all over my area for these exact chairs. I found them but not at this great price from Overstock!!", 
    "The leather material on these chairs are decent, but the bolts that hold the chairs together constantly loosen. One of the chairs will not tighten anymore, and yet the chair is still loose and will lean back. Not very sturdy.", 
    "I bought 3 sets of 2 chairs to replace similar looking ones bought about 10 years ago from a major furniture store as the leather had started to peel away (but the seat cushions are still comfy, double in size vs. new ones ). Despite the low price, I was surprised that three chairs had at least one scratch; to which I wondered, aren't these items checked before shipped? Secondly, almost all of them are not evenly balanced on the floor (I've tried them in different areas and no change.) I wasn't expecting the same quality given the huge price differential and it did save me good money for now because I didn't have to replace the entire dining set (still love the table.) They serve a temporary purpose. If you're on a tight budget and have no problem in using a marker to cover up possible scratches, then and only then, can I recommend these chairs.", 
    "Was shopping for dining chairs compared prices decided to go with these my god best buy ever worth the money and then some so comfortable and so easy to put together I highly recommend it for the money", 
    "Love, love, love, these! Bought another pair!", 
    "Great for extra dinning chairs for the holidays. Sturdy and easy to put together", 
    "I ordered 6 chairs to replace my cane and chrome chairs from the 1980s. Now my light-colored dining table pops! Assembly went well, made easier by two people working assembly- line style. Follow instructions for getting the legs to seat 100% evenly on the floor. One person sits lightly while the other tightens the bolts underneath. These chairs are almost identical to those in Stein Mart, but these cost $43 each compared to $75 each from Stein Mart with tax and shipping.", 
    "These chairs look just like they do and are exactly what you expect. They look nice in my dining room and were certainly a deal. They assembled fine, but every few months, the legs end up needing some tightening, which is why they are getting only 3 stars.", 
    "The seat padding is firm and legs are sturdy. I'm very happy with these chairs.", 
    "These chairs look wonderful around out table and were easy to assemble. Almost 2 months in and they are holding up wonderfully.", 
    "I purchased these chairs 6 or 8 months ago and they still look like new. They are pretty comfortable, but if someone with a large butt sits on the chair, they might find that the narrow chair base isn't comfortable enough.", 
    "They look really nice but not great for a lot of use. Have to tighten the screws often...", 
    "Not at all pleased with the Quality of these chairs. Don't waste your money.", 
    "Ok quality, easy accimbly", 
    "Not for heavy use. Need to put together well", 
    "Chairs were great quality and look amazing. The only setback is their wobbly on the legs despite everything we did to fix it. Other than that though, I love them.", 
    "Hi, My chairs were not that hard to assemble but once assembled were slightly unlevel. A little disappointed but will try and find a way to make level.", 
    "These are great standby chairs for when you have extra guests!", 
    "Great chairs, easy to assemble, good looking. At an unbelievable price!", 
    "These chairs constantly feel like they're going to fall apart. The screws were stripped and we had to throw one of them out within two months. I can't stand them.", 
    "these chairs are ok. very reasonably priced. you get what you pay for. I still use it. it is functional, but on the light side. i would not recommend letting a young child sit down on it, because they can easier fall over if they are messing around.", 
    "Very comfortable and easy to put together! Very happy", 
    "I purchased 6 of these chairs, they were easy to put together, sturdy and comfy! Would highly recommend this product.", 
    "When took out of box one of the legs was not wrapped like the other and had chips in the finish. Once legs were attached, there they not square. Tried several times to adjust, but could not get them straight.", 
    "Love them kid durable and nice looking no bottom rungs to put their feet on and break. Twelve all together creates an outstanding look in my dinning room", 
    "I have bought these about 8 years ago. Due to the fact they are Faux leather I knew not to expect them to last forever. they are sturdy and after everyday, all day use the faux leather started to peal. For the price and 8 years well worth it.", 
    "Ordered 4 of these for extra seating. Easy to put together after the first one. Sat on them before tightening bolts. They look really good. Just hope they hold up as price was very low, so not sure about quality over the long term.", 
    "Perfect in my dining room and easy to assemble. Great price.", 
    "THE CHAIRS ARE VERY SHABBY AND NOT STRONG", 
    "Exceeded expectations regarding quality and looks.", 
    "These elegant and chic chairs were so easy to put together. They are easy to wipe clean and very comfortable too. One chair came with holes in the wrong place and Overstock quickly and easily provided me with a replacement. Thank you for making my dining room look so great- for such an unbelievable price!", 
    "These hold up nice and great to clean", 
    "I didn't expect these to be so good, since they were really inexpensive, but they are really nice!", 
    "These are probably the 3rd pair that we have ordered . We are a large family and a have a huge table that fits 14 people we are constantly entertaining . We are continually cycling out chairs . These chairs really look great and are tough enough to withstand a lot of usage!", 
    "In a private home with regular usage, 3 of the 12 chairs we purchased broke down in one year", 
    "Perfect comfortable chairs", 
    "Chairs assembled very easily are comfortable and look very nice. They are very light weight which I think is good but hope that doesn't mean they don't last.", 
    "they look much more expensive", 
    "I had 4 similar chairs purchased at an estate sale and needed at least 2 more to blend. These are not an exact match but very close, so much more comfortable then our former oak upholstered seat chairs. Love the simple lines that transitions our vintage table and modern home.", 
    "easy to assemble, nice color", 
    "Great looking chairs and definitely the right price! Easy to put together and they look perfect at either end of the kitchen table.", 
    "Great chairs and very comfortable!", 
    "Easy to assemble, comfortable--just like the other reviews.", 
    "High quality chair. We even bought two additional chairs after we enjoyed the first set so much!", 
    "Sturdy. Expensive looking. Easy to assemble .", 
    "These are decent chairs, but really not meant for long term use. The first set of chairs we got were completely broken, the wood didn't line up and we had to get a new set from Overstock, which thankfully they quickly delivered. After getting them setup, which took a couple hours for just 4 chairs, I sat in one and listened to the wood start to give. They are wobbly at best, and dangerous at worst. I only gave them a fair rating honestly because they happen to match our table decently well. A year later and I find myself buying new chairs that I can actually use.", 
    "We had been looking around for a while and finally decided on these chairs. We have young kids and needed something easy to clean. Honestly, you can't beat the price! They look great with our rustic table.", 
    "Good quality. Nice clean lines. Not bad to sit in too.", 
    "I bought these chair after redoing our kitchen. They are a great, sophicasticated addition to my 100 year old table. They were easy to assemble, alone. They are sturdy, very pretty. I have had them for one year and they look as great as the day I got them.", 
    "Wish there was more padding in the seat but I have an old butt. No one else complained. They look great and were so easy to assemble!", 
    "After looking at Parsons chairs online at many websites, these Overstock ones were the best size-wise, price-wise and not to hard to put together-wise. I'm very happy with the four I ordered!", 
    "Attractive, easy to assemble, comfortable, well constructed. A good buy for little dollars.", 
    "Exactly what I needed. I purchased the chairs to use in two bedrooms with desks and they could double as additional seating for extra dining guests. A little extra work to put them together but well worth it.", 
    "We are really pleased with these chairs. They are sturdy. ColorIs perfect and you can't beat the price.", 
    "They had to be put together and they're not as cushy as I hoped but they look great. There was a nick in one of the legs but I was able to color it in with a black sharpie and I can't even tell which chair it used to be. Leather feels soft. I'm happy!", 
    "Easy to assemble, look great, firm comfort", 
    "Easy to put together (husband didn't complaint a bit) and they are very light so they are easy to move for our two kids.", 
    "Price is great. Legs aren't always even (some of the holes are off). Also I've had to go back and retighten the screws after use as they've loosened up", 
    "These chairs are for a dining table and are sturdy and easy to clean. The brown is very dark. At first it looks like black. Basically easy to put together.", 
    "They are purposeful in there intent.", 
    "Not very heavy duty but they look nice. They went together easily.", 
    "I read some decent reviews online so I decided to buy 4- don't let the pictures fool you, they are very cheap in person. The faux leather feels like rubber, it's sticky- they come unassembled and you have to put them together the holes are a little misaligned so it took several tries to get the legs on straight, despite many attempts the chairs still wobble. I didn't give it 1 star because the chairs still serve their intended purpose, but we'll see how long they actually last. Also, the color looks almost black, but it's a very very dark brown", 
    "These chairs are sturdy, classy, and priced well under their value. After researching, I purchased these chairs knowing they were priced well under competitors.", 
    "Very nice shade of brown. Looks great in my dining room. Not to comfy, but still a good chair.", 
    "Got 10 of these chairs, they are holding up and look very nice.", 
    "I bought these chairs to complete my dining room. They are very comfortable and well made. Color is exactly as shown. Great purchase", 
    "I got these chairs for the advertised height of the seat. It is actually 2 inches smaller.", 
    "bought 4 nice chairs good buy", 
    "They look nice but we have to kept tightening the bottom because the legs become loose very easily.", 
    "Chairs are very nice, but advertised as 18 inches wide, which is what I needed and no bigger for the table I have. They are 19 inches or more. So had to send back. Very disappointed.", 
    "Great product, made very well, love the color of the chairs. I bought 2 sets for my table and they were very easy to put together and with own wrench to assemble the chairs. Best of all great price!", 
    "Love them, I ordered 2 in july so happy the way they feel. i placed order for 2 more. they look great with the table my husband made. easy to put together.", 
    "These chairs were a great value. Comfortable, classic, and affordable.", 
    "Easy to assemble. Sit comfortably. A little lower than regular table height chairs but suits the purpose for which I needed.", 
    "They look nice but there is some Unevenness. I bought them as extra chairs so I'm happy with them.", 
    "Great chairs fir my dining room!!! Super price!!! Have had them about 2 years and still perfect!!", 
    "The chairs look good and were easy to assemble. However, the legs keep loosening up. I tighten them back up and they are good for a while but eventually they loosen again.", 
    "Difficult to assemble. Many of the holes don't line up.", 
    "I bought these chairs because my kids were ruining my chair pads as even though you give them a napkin, they use clothes, cushions etc. to wipe their hands. These chairs were inexpensive and looked nice (one chair was equivolent to 4 chair pad purchases). Everything wipes right off! They stand on them, make forts with them and we eat on them and they are holding up great! My only complaint would be the legs werent even but my husband was able to adjust them somehow and we havent had any problems. For the price they look good and are what I wanted. I dont expect them to last forever, but for the last 6 months, they have been great!", 
    "I would purchase this chair again. Great price and value", 
    "I needed new chairs for my table when I remodeled 10 years ago and bought these. We use the dining room almost daily. Fast forward, my family has grown and we found we needed a few more chairs! So glad to see that they are still available because the ones I previously bought are still good , so adding two more was easy and at this cost, very affordable.", 
    "one chair leg broke already", 
    "I recently purchased a second home in Phoenix , so I needed reasonable items to furnish the 2nd home. I love Overstock because of the selection, quality and shipping costs. I am having everything shipped there, neighbors are great. I haven't assembled the chairs but as long as a person is patient Overstock furniture is a good buy.", 
    "Easy assembly, one you finish the first one, the rest are easy...just READ THE INSTRUCTIONS FIRST! They are average sized dining room chairs...they look a little bigger in the picture than they are in real life.", 
    "at first, the price of these chairs scared me. I thought it would be an indicator of how cheap they would look in person. Ended up buying them and wow is all I have to say. These chairs look great. They don't look like cheap leather at all. Bought two sets and it took me about 20 mins to build all 4. Highly recommend!", 
    "Sturdy and comfortable! Love how these chairs look in my dining room!", 
    "legs never stay tight. support beam does not hold up. super shoddy.", 
    "These chairs are super nice looking but they really are cheaply made. I bought 8 chairs a little less than a year ago and I am down to just 5. The legs loosen constantly and need tightened. The back piece comes loose too. The wood is really cheap pine and splits so that you can no longer tighten anything up and eventually it falls to pieces. I have survived the year by using parts off of the first chairs that broke to mend the ones that are on their way to breaking. I would only purchase if you aren't going to use them very often and can treat them with kid gloves.", 
    "We bought 4 chairs more than 1 year ago, look is good and quality is good too. Its comfortable and soft, much better than my previous wooden chairs. I always wait a while to experience the product and then write a review, when I make sure everything is good about the product I will give a positive review.", 
    "The leg on one of the chairs cracked as I was putting it together.", 
    "Love my new chairs very comfortable well made", 
    "Ordered 10 chairs and three of them came with foam coming out of the material. Otherwise they are good.", 
    "Chairs were pretty easy to put together(didn't have to wait on my husband to help). Had an issue with one of the chairs but contacted customer service and they sent me out another set so now I have a back-up since they come in a set of two.", 
    "I wasn't sure about how this would look but I relied on other ratings and figured I'd give it a chance. It was a good decision. I did have a problem with one chair and Overstock took care of that right away so there are no complaints from me about that. I will have to say that you have to follow the instructions about not tightening the screws until you sit in the chair. That is the way to make sure that the chair is level and prevents wobbling. I am very happy with these chairs; they fit in well with the motif of my new home, they are comfortable, and the price was certainly right.", 
    "Great chairs. Easy to assemble and good quality. The brown is so dark, everyone thought they were black which worked out perfectly for me. I would definitely purchase these again if I need to.", 
    "Needed to return them since they didn't match my table I had.", 
    "I love my chairs they are perfect.", 
    "Very comfortable and durable.", 
    "very comfortable I love it.", 
    "beautifullVery good", 
    "These chairs are soft and very comfortable. They come two to a box and there is some assembly required, but all parts were packaged well and assembly instructions were easy to follow. You simply bolt the seat to the back and attach the front legs with more bolts that are provided with the Allen wrench also provided. I had a problem with missing parts on one of them, and Overstock went above and beyond all my expectations of replacing the defective item. My family loves these chairs, and I like the fact that they are fairly narrow and you can fit more people side-by-side around the table. All in all, I'd have to say this was a great purchase!", 
    "Beautiful - not the sturdiest in the world but comfortable and great for the price point. Assembly was super easy as well.", 
    "I panicked when I first opened the box for these chairs because I couldn't find the hardware! It's under the seat w/ a velcro cover. They were pretty easy to put together (only had 1 hole out of 4 chairs that gave me problems but I eventually got it together). Overall, for the price they seem decent. I did notice last night one of the chairs has some give so I think you need to continue to tighten the screws periodically. Overall I would recommend.", 
    "These are an outstanding value. Chairs are lightweight, however, very comfortable and sturdy and solid, and very beautiful for decor. The key is to READ directions. Do not tighten all legs until you stand upright and level with floor. Make sure front legs are aligned properly. There are longer screws for back legs, shorter for front. I learned this by not reading directions completely for first chair. They came packaged great and basically flawless.Great buy", 
    "Very happy with this purchase. The price was great and the chairs look really nice!", 
    "The chair looks good against the dining table close to the kitchen, but the quality of the chair was poor, for the price that was paid. The legs are not strong enough and the bolt that keeps the joints together needs to be tightened every month so that the legs dont shake. Not a good buy for the price paid on this.", 
    "Wasn't expecting these to be as nice as they are! Easy to put together and fit the modern style perfectly. CANNOT beat this price!", 
    "The chair's I had to send back only because they were smaller than I thought they were. They were nice, but not for our family.", 
    "Sharp looking, thought they would be a little sturdier, but overall, nice", 
    "THE CHAIRS LOOKS NICE & WERE VERY EASY TO PUT TOGETHER. I WON'T USE THEM EVERYDAY SO THEY ARE PERFECT FOR MY SPACE.", 
    "loved these and easy to put together", 
    "For the money a great chair", 
    "really nice . better looking than pic.", 
    "Desk and chair are very good quality. looks beautiful in smallarea. very happy with my choice.", 
    "The chairs are a good deal. They are very easy to assemble. I had a problem with only one of the four. Very sturdy. Again, a good deal for the price.", 
    "They look nice but not good quality,I already had s broken leg and feels like they will brake soon", 
    "Easy to put together. Nice dark brown", 
    "I purchased these chairs in December 2014. While I understand that when I purchased these chairs they were not exactly high-quality items based on the price, I can only say that they were way below expectations. I purchased 6 chairs (3 orders of 2) and at least 2 chairs were defective on delivery and had to be returned. The chairs were difficult to assemble, as sometimes the bolts do not fit in properly. They also came without lock washers, so after sitting on them 2 or 3 times, the legs would loosen up and the chair would need repair. We needed to go to Home Depot and purchase lock washers, then take the chairs apart and reassemble them. After the repair, the chairs are finally usable for more than a day. The seat is not at all comfortable - it feels as though you are sitting on a block of wood, so if you have any back problems, such as sciatica, I would not recommend these chairs - You will end up with numbness down your legs after one meal. All that being said, I knew what I was getting myself into. I bought these cheap, crappy chairs to hold me over until I was ready to purchase better quality ones. At the time I purchased these chairs, I was hoping they would last me 2 or 3 years. Now I only hope they last until the end of the year.", 
    "The chairs were ok but one had a hair line crack and one we could not get leveled no matter what but we decided to go with it and not return. We only use them once in a while so they might hold up. I would not use them for everyday use.", 
    "We have had to re-order 2 replacement chairs and have had them less than a year. They get very little use but average sized people but on both of the broken chairs the back legs cracked where the seat joins the back. They are comfortable and look fine...just don't plan to sit in them or have guests use them. Very light weight chair.", 
    "Very flimsy. One broke the first week. Legs need to be tightened about once a week. Spend a little extra snd buy something else. I already need to replace them.", 
    "The blocks used to secure the legs were not the best you can offer. They should be solid blocking not pressed pine.", 
    "After reading some of the other reviews I was certain I was going to get really sturdy chairs. These chairs are nice looking but not super sturdy. The seats aren't that wide and legs are on the modest side. At first I thought they delivered me the wrong chairs because the faux leather looked black. I had to hold one of the chair up in the light to tell that they were just an extremely dark brown. They won't last forever but look nice and I got what I paid for.", 
    "Matched our existing, but similar chairs in color and style exactly. The only difference is these do not have a seam in the middle of the seat or back. It's hard to tell because of the dark color and shadow in the pics, but there is no seam down the middle.", 
    "Love these easy to cleans also easy to assemble", 
    "They're comfortable, steady and seem to be made of very quality material. At this price you really can't go wrong, even if the chairs last for only a couple of years, though I think they're going to last for a pretty", 
    "Great for the money. You will not find anything remotely this good for this amt of money. It looks great in our dining room. We recommend it highly.", 
    "You get what you pay for.", 
    "As usual with most furniture here, you have a to spend a little time putting them together, but it's so worth it for the price and outcome! These chairs are a little firm, yet we are super happy with them. They look so elegant and so much more expensive than they were. What a deal! Would buy them again for sure! :)", 
    "We ordered these for every day use with two little ones. Overall, I am very pleased with these. They are comfortable, great color, were easy to put together and can be cleaned easily with just a wet paper towel. for the price, they can't be beat. Our girls sit on them with their knees and so far, so good.", 
    "Great chairs very sturdy and elegant looking", 
    "So far so good. They were easy to install and Lois great with our table", 
    "Be ready to assemble chairs. Not what I expected but you get what you pay for. I have replaced them already after two chairs broke with guests in them", 
    "These are very light weight and tip over easy, after sitting in them for a few months, they are not going to last as long as I had hoped. But for the price, they were acceptable. They were for an RV and will likely be replaced in a few years.", 
    "These look great and have held up well (3 years and going). They are attractive, look like real \"bonded\" leather. They are great for a dining chair or extra seating. Not comfortable for long periods but fine for a meal or working at a desk for a few hours (not long term).", 
    "We ordered brown (to match other chairs) but the product was black. Not dark brown, but black. Had to return them.", 
    "You get what you pay for. They are a bit flimsy to me but I can't really complain because they were the cheapest chairs I could fine. They look nice.", 
    "From the category of ' You get what you pay for' I bring you these chairs. They look nice but are not sturdy. It's doubtful the will last more than a year or two.", 
    "Assembly isn't for the lighthearted and I can see why someone might have issues after improper assembly. Color was a decent match with the Sorrento table for 6.", 
    "We had one small problem on one of the four chairs we ordered - holes did not line up properly to insert the screws and one of the legs cracked as a result. We called Overstock: no problem - customer service resolved immediately (thank you!). We plan to \"rotate\" our use of the chairs to keep them in good condition as the faux leather seems a bit fragile. Excellent value and would absolutely purchase again!!!", 
    "I bought these chairs to go with my Kitchen table because i didn't want to buy a whole new dining set they go wonderfully love them", 
    "2 legs on two different chairs have broken off.....just needed something to last my girls a few years in their college apartment but these are not the right choice....wasted my money", 
    "This was a pair of dining room chairs. Great price. Easily assembled and built to last. They look great at the table.", 
    "I bought 2 of these and liked them so much I bought two more. Very easy assembly (you have to attach the legs, but super simple). Enjoy!", 
    "These chairs are so much better in person. I had to have help putting them together but am very happy with the quality.", 
    "The chairs are nice, but small. If you are a big & tall, these might not be for you.", 
    "Good Quailty, just a bit difficult to assemble. Hard to get the legs lined up.", 
    "Great price! Easy clean up if you have kids! Seem sturdy and durable enough so far...", 
    "Easy to put together but requires regular tightening.", 
    "The chairs are simply beautiful. They are comfortable to sit in and they look amazing. I had looked all over and these were exactly what I wanted. Easy to assemble. You can't go wrong with the price, style and value. I purchased a total of 6. Very happy customer", 
    "These faux leather dining chairs look just as I hoped they would with an antique dining table I've recently been given. They look dignified but don't call too much attention to themselves leaving the table with its details to shine. And with their shape I've noticed that not only are slipcovers available for them (not advertised with them) but they would be very easy for me to make my own slip covers if I should ever want to change their appearance for a special occasion. They arrived with all the right parts to assemble them and I had them together in no time. I followed the manufacturer's instructions not to over-tighten the bolts and noticed that in this way when you sit on them they micro-adjust and there is no wobble -- with an old uneven floor like mine, that's very helpful. I am very pleased with this product.", 
    "Easy to assemble, quality is great, it can wobble a little if you are not sitting and just hold to it, but very stable when you sit and you cannot tell at all it will wobble until you move it around. However, that could have do to bad assembling it, Lol. Very nice looking! Love the rich brown.", 
    "Chairs were easy to assemble. Great bargain for the price. They are comfortable.", 
    "Bought 4 for my mom and she loves them. You will need to tighten the legs every now and then", 
    "We were contemplating buying a new kitchen table set, but still really liked the table. We decided to replace the chairs as inexpensively as possible, and so far these have been great. Just had them for 2 weeks, so I can't speak to longevity, but we're happy.", 
    "These chairs are black not brown", 
    "I love them, and they worked out great", 
    "For the price, these are nice chairs. However, several of the chairs are a bit wobbly. I purchased 6, and I'm having trouble get 4 of them to sit evenly on the floor.", 
    "For the price, these are nice chairs. However, several of the chairs are a bit wobbly. I purchased 6, and I'm having trouble get 4 of them to sit evenly on the floor.", 
    "I purchased 2 sets. I was hesitant about ordering chairs online since you can't tell how comfortable they are by a picture. The sale price was good and the description sounded good, but wasn't sure about the quality. Glad I tried Overstock. They were easy to put together, the quality is very good, and comfortable. Even though it says Villa Brown, it is almost black, which is good since I was looking for black. Thanks Overstock! Look forward to more great products.", 
    "I absolutely love these chairs! They look almost black in color due to the rich dark brown color. They are very sturdy and comfortable :):):) I would highly recommend them!", 
    "ordered and received 4. good quality!!", 
    "I really like these chairs and ordered 4. I am really good about putting things together - I read all the instructions, lay out the parts and methodically put them together. The first box of 2 were uneven, so I took them apart again, and reassembled. Still wobbly. The other box of 2 were perfect.", 
    "Bought 6 chairs for my dining room table and they look fabulous. The seat is a little small, so larger guests might find them uncomfortable. Super easy to put together and adjust. Best part is that there's a piece of wood under the cushion so when you sit, overtime the chair won't bottom out.", 
    "Very pleased with the chairs. Not difficult to assemble!", 
    "The chairs look great and expensive! The only reason I did not give them 5 stars is because they are a uneven. They were easy to put together and overall great for the price.", 
    "It's just good enough for a dinette set. Easy to assemble.", 
    "These chairs are very nice looking but very, very difficult to assemble. The bolts did not line up with the holes and I had to pay a carpenter to assemble them. When assembled they do look good.", 
    "For the price, these look gorgeous! I ordered six (3 sets) for my table. They were fairly easy to put together and no issues at all with the pieces. I have had compliments from family members that have come over and have seen them. My only complaint is that they are not very comfortable. I am coming from padded dining room chairs that were much, much softer. If you are looking for something that looks great for a GREAT price - these are them. This will work for me because that is what I needed. If you are looking for something to have the entire family sit around for dinner and coffee/dessert for hours - I don't suggest these unless you are providing a massage therapist for an after dinner treat -:)", 
    "I honestly did not expect much when I purchased these chairs at that price, so I got very existed to see that what came out of the boxes was a really nice looking, easy to assemble chairs! Quality was better than expected! Pretty comfortable. Classic style. I am very happy with my purchase and would definitely recommend these chairs to a friend!", 
    "I looked at ikea and faux leather chairs were around $**. I ordered 6 and all were great except one had a tiny hole...overstock gave me an option for a new one or a credit, so I took the credit. I love overstock. Great quality, I'm so happy that they make my kitchen look so much better. I have 3 little boys, and they're so easy to wipe down and clean up.", 
    "We ordered 6 villa chairs and are very satisfied with them. They are a little darker than the brown we wanted but still look nice around our table", 
    "Took about 30 minutes to put each chair together, but there was no difficulty . They look as good as ones that I was going to purchase in a high-end store. Nice height and very comfortable", 
    "These look great at my table! Love how soft they are too, compared to my old, hard chairs.", 
    "Very nice! Makes my table look brand new!", 
    "Very pleased with these chairs. Very easy to assemble. Color is darker than I pictured, but still blends with my table", 
    "Love, Love, Love this chair!!!! It is a perfect fit for my dinning room table.", 
    "Color wasn't really brown--it's the brown/black. Too dark . sent it back.", 
    "I bought these chairs to add to our current table set. I was sold on the price since my kids are pretty rough on the current set and I knew these would get a lot of use. The color is a very nice dark espresso and the faux leather is easy to clean (which I was in need of). They were easy to assembly (15min per chair with all hardware included). The downfalls:The seat itself is a little smaller than I'd except but still functional. The wooden legs are thinner than my other chairs (makes me think they are a less sturdy) and while assembling them I happened to over torque one which caused a small stress fracture in the wood. Overall a good product for the price.", 
    "Excellent product good looking and perfect price.We are so happy with the chairs and the serviceThank you!", 
    "I bought 4 chairs and plan to buy 2 more. They look great with my antique oak table and I have received many compliments. They are also very comfortable.", 
    "Great looking chairs at an unbeatable price! The set came quickly. The first chair was put together in minutes. There was an issue putting together the second one as the screws didn't line up with the holes. Customer service was extremely helpful in getting replacement parts sent out. This resolved the issue. Would definitely order this product again. Couldn't have asked for more in the customer service department! Thanks!", 
    "Bought 6...I had to return 2 for manufacturing defects, and the remaining 4 are not very stable. Disappointed with this purchase.", 
    "I ordered 2 sets of the chocolate chairs, they came in black put in the wrong box. At first I though maybe I was color blind or it was the lighting making my brown chairs appear black...Nope they are black. I was sent the wrong color. Decided to keep them because it's a pain to send back and my three year old decided to make the boxes into forts. Anyhow, one set had the correct hardware, the other did not. I had to contact overstock and they kindly sent me the correct hardware. Anyhow, the chairs are pretty and put together without the worry of them coming apart. I seem to have crappy luck so I expected things not to go smoothly although I hoped they would. Anyhow, I would recommend the chairs and fingers crossed you have a smoother transaction and the correct color and hardware to boot!", 
    "Looked better in person than on the computer. The chairs were very easy to assemble. It makes our dinette area look fresh & modern. The height is perfect.", 
    "Can't beat the price. Darker than I was wanting. Can be wiped down with a damp cloth.", 
    "These chairs are beautiful, comfortable, and well made. Easy to assemble and very easy to clean.", 
    "Legs were not even, but got some of those felt tips to put under the short leg.Instructions aren't the best (i.e. which screws to use where) but I had someone else assemble who figured it out.Bank on needed padding under one leg to make steady.Overall they look good once assembled though.", 
    "After searching high an low for chairs I came across these.. They are not bad overall for the price .. One of the legs on one of the chairs just a tad bit uneven, but not noticeable. I have carpet so not sure if the floor underneath is a bit uneven.A little disappointed in the color. I purchased the chocolate. Much darker than I thought they would be. I would however recommend to a friend. As a footnote they can accommodate up to 300lbs. I've only had them about a month. So far so good", 
    "Very difficult to put together and level! Delivery on time as stated! Nice looking", 
    "Hard to put together as the holes didn't align well. Not a very sturdy chair. Would not buy again.", 
    "Good price and style compliments my decor. Assembly was easy requiring limited tools and a little hand strength.", 
    "The chairs look good, but putting them together was kind of a pain - the holes for the screws don't line up, and some were missing holes altogether. I get that that's the reason why they're sold on Overstock and why they're so cheap, but it's still a pain. If you're willing to deal with a few bolts missing because you can't screw them in, then i would recommend this product; otherwise, pay a little extra and get better quality ones. That's what I would do in retrospect.", 
    "These chairs are great easy to put together and look really nice for the price", 
    "I really like these chairs. Just needed for the end of the table as my arm chairs were too big. Just a little smaller in the seat that I thought they would be. No one seems to mind. Great deal.", 
    "Chairs are very comfortable and easy to put together. Arrived damaged but Overstock was great with their customer service and sent out a replacement right away. Very impressed all around.", 
    "Very stylish and holds weight well. Mine got a little damaged in shipping, but Overstock took care of that fast! Only complaint is that some legs are a different length depending on how they're screwed in, which is maddening. But would definitely recommend.", 
    "Was looking for brown chairs, the brown color is more blackish.", 
    "Had to be put together and as with anything like this, the second was easier to complete. Fine extra chairs in small bedrooms that can be brought out during holidays for extra seating. I guess they could be used as captain chairs in a formal dining room but not quite up to that quality. Over all worth the price of what I paid.", 
    "I ordered these chairs to go with a table I had, I love them! They were very easy to put together and are really comfortable. I have received many compliments on them.", 
    "I love these chairs! Got 6 for the holidays to replace my old, hard wooden chairs. My family plays a lot of cards over the holidays and these will be SO much better. They are extremely comfortable and the back has a nice curve to it that feels great to your back. Assembly was easy, just screwing the back piece (that includes the legs) to the seat and front two legs. I'd recommend these to anyone who is shopping for new chairs on a budget!", 
    "Very nice chairs! Little darker than picture and description . . Very close to black. When assembled, the chairs are sturdy and comfortable.", 
    "Beautiful, elegant chairs! The only complaint I have, is that the holes in the legs do not match up with the holes on the chairs. You have to really tweak it to get them to fit. Other than that, they are classy and very expensive looking", 
    "These chairs are so affordable, yet look beautiful and elegant. I was a bit daunted when I realized I had to assemble myself; but found assembly to be quite simple. Very pleased with this product.", 
    "Needed 8 chairs for Thanksgiving. How can you beat the price? I order this chairs based on the reviews and the arrived in tact, promptly. There are slight variations between the chairs. The faux leather on one is not pulled quite as tight, for example. Further, these are significantly darker than the photo suggests. These are almost black. Maybe they are black. Another drawback in that the seat is pretty narrow. I'm a little nervous to see how my MIL's backside is going to fit on these for thanksgiving. They are fine for me (I'm quite trim) and fine for my partner (he is a big guy.) There are a piece of cake to put together. Tighten them up well and they are lightweight but sturdy. Minor adjustments were made so they don't wobble but overall, I'm happy with this purchase. Photos available on insta- same user name- mochibunny", 
    "These chairs are very comfortable. The only thing I do not like is that the back sits a little straight. But this beats sitting in a hard chair. I always dread sitting in hard dining room chairs. The free shipping was a HUGE plus.", 
    "beautiful chairs and fast delivery, HOWEVER chairs must be assembled AND they came with WRONG parts.i didn't know overstock meant defective, which is obviously what these are since they came with instructions with specific parts, and they were THE WRONG size screws, therefore could not use included washers, therefore integrity of chair is COMPROMISED.would have been a five star with right parts, now barely a 3 star. :(", 
    "Is better than I expect, it was cancell at first but then they gave me $** off of my new order and the price was even better. When they arrive I love them.Now I need two more and everyone want them for their house.", 
    "These chairs seem to be sturdy and good quality. They won't get a lot of use for our purpose. They look really nice and I feel like we got a great deal. We found these chairs in a store that were double the price but did not seem to be any better in quality. I'm happy with my purchase and would do it again. I've been pleased with everything we have purchased from Overstock.com. They always have what I am looking for!", 
    "I looked at several chairs before purchasing these. They are good for the price however several of the legs arrived cracked at the top and some of the screws were hard to get in. Overstock was very prompt in resolving the issue and shipping out replacement legs.", 
    "These chairs were super easy to put together. They are sturdy but lightweight. I used them as extra chairs for dining table. Color is very dark brown, almost black.", 
    "Color is not as described. It looks black and in no way looks brown, not even dark brown as described. My husband threw away the boxes or I would have returned. Definitely not satisfied with my purchase.", 
    "Pleasantly surprised when I opened the shipment box. The seat is thick, padded and very comfortable to sit upon. The assembly was simple, straight forward and I did not need additional tools. I did, however experience one issue. Though I tried for nearly an hour I could not line up the screw holes on my second chair. Dealing with customer service was a lovely and easy experience. They solved my problem easily. They shipped me out a replacement seat and kept me updated via email as to the status of my delivery. This seat arrived in a few days and went together as easily as the first. I am more than pleased with my experience with overstock. I was hesitant to make my first purchase, but could not pass up this great deal. Now I would not hesitate to buy from them again.", 
    "These were chairs for my waiting area of my salon. It took a bit to put them together, they are the perfect size", 
    "I bought 6-love them. Very comfortable and looks great with my farmhouse table! Happy!", 
    "The chairs are a good value for a set of 2. They clean very easily if anything spills on it. Assembly was not difficult.", 
    "Really like these chairs. Were very easy to assemble, and they don't scratch our hardwoods. Very comfortable too. The only thing I would say is the color brown is so dark, it looks black. It works as it is in a very bright room, but may have found a lighter color had I realized.", 
    "These chairs are the BEST bang for your buck. They look very elegant and feel great without the need to spend too much money.", 
    "I purchased 8 and only 1 gave me trouble putting together. They are for the conference room table and they look great especially for the price I paid.", 
    "The chair was nicely done. It is comfortable and the look is very elegant. Great price.", 
    "I purchased these Faux Leather brown dining room chairs and they were a perfect compliment to my existing set. I was two chairs short and decided to give these a try to compliment what I already have. They matched perfectly and their quality is excellent. I loved the price I paid for these items and I received them really fast in the mail.", 
    "Beautiful chairs....only one issue...on one chair the holes are not lined up, so i am trying to figure out how to widdle away the wood to get the last two screws in. Besides that one little issue, they wirk well and i want to keep them, so we will make it work.", 
    "I bought 6 of these chairs (3 sets of 2) and we love them. They are comfortable, and look great with our brown-black **** ******* table. They are very sleek and modern.", 
    "I received the product on time, the assembly was as easy as indicated. I like them very much.", 
    "For the money they are not bad chairs, but they are smaller chairs then they say, much smaller, sold them to someone else. Now still looking for the right chair.", 
    "Chairs look very nice, modern and expensive. And they were very cheap. Thanks Overstock.", 
    "I bought these chairs for my mom. Just the right size and color for her table.They seem strong and sturdy and very good quality as well. I do recommend.", 
    "i like the look of the chairs for the money, i wish they were wider. the chairs are smaller than i thought they would be since they are dining room chairs. it did not take long to assemble but it is a task to make sure they are level to keep them from wobbling.", 
    "Sturdy and easy to assemble Great value the look and feel like leather", 
    "A needed a few chairs for a private music lessons room, and they look good, seem to be sturdy enough (I'll know about it for sure in a couple of years), arrived fast, and were easy to assemble - I actually assigned it to my teenage daughter and her friend.Thanks.", 
    "The chairs themselves were nice but....two of the eight we bought came in a damaged box with damaged legs. We received an email asking if *** off would be enough of a compensation. I wrote back and said we would like full compensation because the chairs were damaged. We then received a second email saying to disregard the offer to give us any money back and that they were just going to send us two new chairs. We have not yet received the chairs. We were hoping for the money back option. On a positive note, we were pleased with the first six chairs that came in a box that was not damaged, opened and with a big footprint on it.", 
    "Very pleased with the dining chairs for the price we paid. Works well with our mismatched set around a huge antique table..........", 
    "These chairs are very nice and modern looking and comfortable. The only problem we had was the pre-drilled holes had an alignment problem on one of the chairs and it made it very difficult to put together. But out of 6 chairs I guess that wasn't too bad. My husband had to use his drill to widen the hole for the bolt. Overall I am pleased with the purchase. I looked at similar chairs and these were by far the least expensive for the same quality.", 
    "Boughtfour of these chairs before and the 'pleather' on two chairs wore out so I reordered to replace them and to add two more to the table. These are not the same chairs, Look the same but sit differently. Seat is hard, not at all comfortable like the first ones. Looks good, but I am putting these at the table where nobody sits. I hate it when things do not stay the same, quality always goes down, doesn't ever go up. Wish that were not true. For the price I should not complain, but I would have willingly paid more for consistent quality to the first set.", 
    "I have gotten many compliments regarding these chairs, to include others that deliver and install quality furniture from a large chain. These chairs are absolutely perfect. They are comfortable, elegant, sturdy, good quality at the best price. I will be getting 2 more.", 
    "The shipment came within 1 week. We followed the directions for assembly and had no problems at all. The chairs look good and are sturdy. I would definitely recommend to anyone.", 
    "I needed a few extra seats for my cottage style living room so I bought two of these chairs and bought white ruffled chair covers for them. I love it and it totally fits my space.", 
    "The only issue with this product was the assembly. Based on the way it came it should have been a bit easier to put together. The only problem with the assembly was that the holes were not drilled very well, making it hard to make everything fit properly. We worked on one chair for days and finally called Overstock. Their customer service is awesome - they sent us a new chair immediately and didn't even want the old one back so it was literally hassle-free.", 
    "They look good and feel strong and I hope to have NO problems in the future.", 
    "The chairs are very much as shown online. The assembly was easy and they look great in my dining room. I stripped and restained my table, so I have a new updated look in the my dining room now. My only \"concern\" is that the chairs are a little low. Other than that, I am very please with these chairs", 
    "They are very comfortable and look great. So happy I purchased them.", 
    "I wasn't thrilled with these chairs. Could have been better quality. I didn't return them because it would have been too much of a hassle.", 
    "I have been looking for these chairs everywhere. Stores all have them priced $70-$80 each. With this set of two at this price, this is a great value. The chairs are of decent quality. I would highly recommend this deal if you are looking for these chairs at a decent price.", 
    "Disappointed. The one chair was fine putting together, the the other chair was missing drill holes so I was unable to contentedly put it together. I want a replacement but have not heard back.", 
    "the chairs arrived on time and packed nicely in the box...they were fairly easy to put together and it came with its own tools.the only tricky part was making them level...but once we figured that out it sat level and had no problems. For the money I am pleased with them.", 
    "I really love the chairs. they fit in quite well with my bar stools and also the side chairs. they are easy clean and look like they will wear well.", 
    "I so love my new villa faux leather dining chairs! They have added so much style to my dining room! They were very simple to put together. All you have to do is follow the instructions step by step in the booklet. I spent less than 2 hours putting all the chairs together. I purchased a total of 6 chairs. 2 red, 2 brown and 2 red bar stools. All of them were by Villa Faux Leather Design. The price of the chairs were very affordable, sturdy, comfy and stylish. Did I mention the look and feel is awesome! Thank you Overstock. com as I will be making my future furniture purchases through your website!!", 
    "I was replacing two similar chairs and this one did not quite match. The seat is pretty stiff and the fabric does not seem to be as strong as the \"pleather\" on the original chairs I bought. These are for an office reception room and work well. Just hope they hold up.", 
    "We ordered 2 sets & were so please we ordered 2 more for a total of 8. Only 1 issue it appears one of the cross pieces were installed upside down. My husband just redrilled & it was fine. Definitely want to do leveling with someone sitting in chair. Not really made for very large folks but works well for average to large. Had a dinner party last where 1 guest is 6'8\" and he managed fine the rest of the guests all thought they were great! The look & sit as if they were much more expensive. Paired the chairs with grandmothers antique table nice dark brown. They also arrived on schedule. Very pleased.", 
    "Great chairs, easy to assemble look great and an excellent price!", 
    "One chair came broken and was replaced with no problems. Then the leg on another one split for some really weird reason, so used the leg off the spare they sent with the replacement. No more problems and they are very comfortable.", 
    "ordered these chairs for my dining room, they look great, the assembly was a little stressful,,,getting the legs to balance, but like the look and are comfortable as well,", 
    "received 2 chairs, one you cannot put together, holes to be screwed in dont match up :( unable to use it", 
    "great chairs, just the right size , sturdy, great color,made well, just ordered another pair,always the best from overstock.com", 
    "The chairs look sharp and are not bulky so it is great for city living.", 
    "Great value, nice chairs. I have to have 50 characters to submit..........", 
    "Ordered two setts, three of the chairs are wobbly despite following the set-up directions and advice of others who have reviewed the product. Chairs are definetely small compared to average sized chairs I owned before but look nice enough and are easy to clean. 6 months after purchase the wood on one of the chairs split and one of the legs keeps popping out, tried to glue it back together but there is no saving. I will not be buying a replacement and will go for better quality chairs in the future.", 
    "worth the money spent. chairs look nice with any dining set. easily assembled", 
    "These chairs were delivered promptly and easy to assemble. I bought one set at first and am now ordering the second one I need. I wanted to make sure the quality and color make my already purchased table. The match is perfect. My table was purchased from **. They both wobble slightly, but you don't even notice when you sit down in them. For the price of these you can't beat it.", 
    "The first chair was damaged, another chair was delivered within a week.", 
    "I wanted chairs just like this but the brown is almost black. It didn't work with the colors in my dining room. Rather than return them (I bought 4), I gave them to my daughter-in-law, who was very pleased. They were easy to assemble and didn't wobble if you follow the directions.", 
    "I bought two of these chairs to go with two of the blue paisley print. I liked them so much, I went back and bought two more. They are a great chair for the money!", 
    "I wanted a slim dining chair that looked like leather without cheap stitching on the seat. The chairs look great but the screws are difficult to put in. The alignment is off on both of the chairs I ordered. My husband had to use a drill to put the chairs together. It's clear that they're on Overstock because they're low priced and have a manufacturing challenge. If you're handy with a drill then you can assemble this too. Having said that, we went ahead and ordered 4 more to compete our dining set.", 
    "Love these chairs! Couldn't believe the excellent price for TWO chairs and the great qualify!! Thank you Overstock!", 
    "We purchased these chairs for a vacation home, that we rent. We have a beautiful, large wood country dining table that hosts many family gatherings. We rent this house to others and the dining table is the centerpiece of the home. The chairs are comfortable and attractive. I don't know how well they would hold up to daily use, but for the price and our purposes they are very satisfactory.", 
    "While I like the style of the chairs, they weren't necessarily all that easy to put together. I have two chairs where one screw each would not fit quite right...hope this doesn't effect the chairs ability to hold people up too much! I am glad the chairs came with instructions to fix wabbles because I need to find the time to fix all four chairs that I got. With these minor \"complaints\" I do like the chairs and hope to be able to invest in a couple more in the near future!", 
    "Color of dark brown almost looks black even in daylight. Adds a distinctive look to the dining room, however assembly was a bit tricky. The holes were covered with the material as well as the faux leather, one of the screw holes even had a staple in it and prevented the screw from entering the hole properly, one of the screws was not threaded to be able to screw into the seat and one of the screw seat in chair back came out when trying to remove and reset the screw", 
    "Purchased these to complement our dining room chairs as we need extra seating. They not only look lovely,but are very comfortable. Will be able to use them for extra seating in our living room as well. They were easy to assemble and are solidly built. Had seen similar chairs at another store, but these were priced better. Love that Overstock has such great shipping policies as well.", 
    "Great set of chairs. One came defective but received replacement right away. Love the price too.", 
    "They look great! I just had to re tighten one 5 month later. Great deal.", 
    "These chairs are pretty to the eye but very cheaply made. I have had them less than a year and three out of the six have already broken. I would not waste the money on these chairs", 
    "We have only has the chairs for two weeks. Two chairs have broken and now I need to locate a box to send them back in. I as so excited and now I am just frustrated.", 
    "These chairs are sturdy and good looking..They matched perfectly with our Espresso wood table..", 
    "pretty good chairs! construction of them are pretty good for 109 bucks for two chairs. liked them so much i'm gonna order two more. really nice though and would recommend! comfy too!", 
    "First of all can't beat the price.. I bought these for my married kids whose previous chairs took a beating needed new and these chairs will go with any table and can be used as extra for company. they also have young children and the leather comes in handy for spills", 
    "They are well worth the money. They look great and are the perfect size, color, etc...", 
    "The chairs were very nice and they fit perfectly with my dining room table.", 
    "I ordered these chairs on Nov 27 and it is now 12/15 and I am still waiting on them. So I cant give a review until I see them,if I ever see them. I never ordered from Overstock and probably never will again. However, I am hoping these chairs are as nice as everyone who has there chairs and has said in the reviews I have read. We shall see.", 
    "Some legs were alittle unsteady, which can be fixed by adding those small casters you can get at the store. Great value for the money. Very comfortable and rich looking.", 
    "Chairs are on par for the price paid. Found them to be adequate.", 
    "These chairs were a good value for what I paid. I really liked the detail on the back of the chairs--adds a nice touch of class. The chairs were easy to put together and seem sturdy enough. They are a little on the small side, I doubt they'd be comfortable for a large heavy person. The legs seem on the thin-nish side but they don't wobble or seem unsteady. I like the fact that I can wipe them off easily--I am using them in the kitchen with a table I got from IKEA. They look pretty classy for the small amount of money I paid for them. I saw others that look similar in *** and *** but were at least *** more expensive!", 
    "received product delivered as pictured. some assembly required which was explained in the ordering information. 2 chairs once assemble found to be very sturdy,", 
    "These chairs are a nice rich color and are comfy. Really the only issue I have with them is they are pretty light weight; I expected something heavier. However, for the price they are a great deal. And Overstock is great! One of the legs had a chunk knocked out of it and reglued -- as soon as I called Overstock about it, they shipped me a new leg.", 
    "Love my new chairs! They're comfortable, and well constructed, and were easy to put together! What's more the look nice! Thinking of getting two more!", 
    "I bought 6 of these chairs.took a few minutes to get started.couldn't find directions or parts. They are under the seats covered with fabric.Then 1/2hour later all put together..was a breeze..luv my knew chairs..and the price", 
    "I do really love the look of this product. A higher end version is what I envisioned. These were good to put in my rental. They dressed up the dining area nicely. Love the color. One screw in each chair was hard to put in. They are fine for what I'm using them for. Let's see how long they last!", 
    "Good Item, comfortable seating. Would have like more support for the back.", 
    "Very sturdy chairs that are easy to put together. We bought one set of 4 and ended up buying another set of 4 to put all these chairs in our dining room. They are a little stiff when we first got them, but loosened up a little with use. Great chairs!", 
    "Needed extra chairs for the upcoming holiday season. Chairs easy to put together. They fit into my budget.", 
    "these chairs are very pretty and expensive looking plan to order 4more their a very dark brown I picture is lighter but I still LIKE...", 
    "These chairs arrived quickly and very much as described on Overstock. I took a chance in hopes they would match our new dining table and they look perfect! The chairs are a deep brown/espresso color. They were very easy to put together. We ordered 6 chairs total and had no problem assembling in 10-15 minutes per chair. The chairs are comfortable and a nice size. They also clean off easily; we have children so this is important to us. The style of the chairs goes well with either modern or traditional styles. A great purchase!", 
    "dinning chair looks great, sturdy and great value for what i paid for it.", 
    "Received the chairs this week and put all 4 chairs together in less than 1 hour. Assembly was easy, but a little time consuming to get everything tightened down. Quality is good with solid wood construction. The vinyl is soft and blends well with my black leather bar stools. I replaced my old oak kitchen chairs with these around my round oak table and wow, what an updated look it gave the table. Coorinates well with my oak and black leather bar stools. The chairs are very sturdy and comfortable. A really good chair for the money.", 
    "The chairs are priced very competitively. The delivery was very prompt, package well done in protecting the contents. Assembly took 10 minutes or so for the first set of 2 and when I liked them so much, I reorder 2 more. Next time, it took only 5 minutes per chair to assemble. One small annoying problem is that I can't seem to get the chairs not to rock. It was not rocking after assembly but after a week or two it rocks again. I am afraid to overtighten it. Guess I will just have to tighten them whenever it gets loose. Other than that, the chair looks really good and seats comfortably. It is not as thick a padding as chairs that are $50 or $100 more. But for the money these chairs are of average quality and worth the price I paid for them.", 
    "Am very pleased with this purchase. The chairs look very nice. My friend was so impressed with this find that she ordered some for herself ! Only problem is that she has 2 very playful cats who learned how to knock them over!", 
    "I bought these chairs based on other reviews I read, and decided to buy two just to see for myself. I bought my first dining table at World Market, and these chairs look great with the new table. Very easy to assemble on my own. Just make sure to carefully read the directions before assembling (note: it helps to have the chairs on the floor before tightening all bolts to ensure they're level). Overall, very happy and going to buy four more.", 
    "Villa Faux Leather Brown Dining Chairs (Set of 2) is beautiful and looks very expensive, easy to put together once you get the first one done. Very comfortable not to soft or hard. I use it with a black table which makes it look darker, but it works for me. I just did my floors so i had to go out and get the floor save for the feet, wish they had them because the material that is on scratches the wooden floor.", 
    "had them for 2 weeks screws got loose had to return them. Overstock was very helpful on the return", 
    "It was hard to line up 3 out of 4 chairs that I purchased. and all 4 chairs are wobbly. they look nice though.", 
    "I just received my chairs yesterday. It took me (a female) about 15 minutes max to put together each chair and WOW am I impressed with the color, design and quality. They look incredible and are super comfortable. If you want good looking, inexpensive dining room chairs, buy these, they are awesome! I paired them with the Dot Parsons upholstered chairs (I like to mix and match my dining room chairs to keep things interesting) and they look awesome with them! Super happy with this purchase!", 
    "Unfortunately 2 out of the 4 chairs I ordered had legs that were different heights so they were wobbly and I had to return them. And even though Overstock gives you a return label, unless you want to pay for UPS pickup, you have to bring these HUGE boxes to the UPS store. Not happy.", 
    "I was looking for a chair for my bedroom in a small space next to a bookcase with medical information. This chair worked perfectly. The second chair worked out very well next to a small magazine table in my bedroom. The dark wood and leather look matched perfectly.", 
    "Upgrading our living room and dining room. We have white dining room chairs now. So instead of purchasing a new dining room set we are re-using the glass top and white chairs and adding a dark walnut base to the table. We bought these 2 chairs to accent at the ends of the rectangle table. They are perfect ..... and accent well with our dark leather living room furniture as well as the new table base. ******** HARDWARE IS UNDER THE VELCRO COVER UNDER THE SEAT CUSHION (: Did have a slight issue with one of the screw holes but as usual, Overstock is helping me with that issue.", 
    "I returned this item not due to quality or price. I returned this because dark brown is really black the leather and the legs are black, this is too dark for the room I am putting them in.", 
    "I bought 2 sets 4 chairs total and love them. I use them in my dining room daily. I run a full time daycare with some ruff kids and have not had a problem. I have owned them for a year now and would buy again. Great value.", 
    "These chairs are perfect to get us through the toddler years at our home. We wanted \"disposable\" chairs while our kids are young...spills, scrapes, dirt, none of which we wanted on expensive cloth covered chairs. Those can come when the kids are out of the house. Got a fantastic deal on these, so I purchased 3 sets. The chairs were a breeze to assemble and there were no issues with shipment. The color is a tad darker, almost black with some darkish brown highlights, but they blend well with any table in that color scheme. They are comfortable to sit in, however, they are kind of narrow in the seat, and could feel a bit wobbly at times. Overall, this is a great chair for the price, I think I paid $50 or less each and most chairs I found were over $100 apiece. I'm very satisfied.", 
    "These chairs were nicer than chairs that I saw for over $200. I could not believe the prices. Absolutely beautiful and easy to assemble.", 
    "After multiple weeks of use. This is an average priced, average quality product. The big pain was assembly, and that in non professional hands such as mine, means the chair would shimmy and shake with joints threatening to break unless I keep tightening the bolts. And even with that the chair seems a little shaky. The bottom of the seat is a wrapping cloth velcroed to the bottom, corners hang out. The good part is that the chair seat does feel solid - has a base support, has high back, and the faux leather so far has not cracked.", 
    "Terrible chairs. They are ok in the beginning but fall apart in a short period of time. If you lean back at all they are susceptible to breaking. Don't waste your time on these. Pay a little more for quality.", 
    "The chairs were chosen on price and value. I could not be happier. They came in on time and were easy to assemble. I had purchased a unique table without chairs. These chairs are pretty common and I had located them in several stores at almost double the price. They are a bit firm but look much better than in the pictures. As I said, I could not be happier. Anyone looking for pretty chairs that can be used with almost any style table and has a limited budget, these are for you. They sit strong and stable. When a order comes in the mail pirchased unseen, uou hold your breath ...hoping! My delight at the results made me come back to this site to write the good news. I could have used this information to help me, so I want to pass it on. Thanks.", 
    "I purchased these chairs (6) to go with a dining room table we already had. Unfortunately we were having heavy rains when they were delivered and 4 of the chairs were rain soaked. O.co refunded us for the 4 chairs that were ruined. The other 2 were in good shape and were all that I had hoped for. The brown is dark and almost looks black in certain lighting. They are easy to put together and comfortable.", 
    "The only thing I would change would be the leg tabs(I like felt-tabs better then plastic ones) The chairs are perfect for those on a budget, but with great style! Get them while they are here!", 
    "I ordered these chairs for additional sitting at the dinning table. The size is perfect and the quality better than I thought. Worth the money.", 
    "Just wanted to say thanks to Overstock for a great deal. The reviews were helpful in choosing these chairs, but I was still surprised with the value when they arrived. No problem with assembly; I read the directions... lol", 
    "I bought six of these chairs, 2 brown, 2 red and 2 purple. They get one star because they look good. otherwise they are a piece of junk. we have had them for a month and they need to be tightened weekly. They are wobbly, come loose too easily even with minimum use, uneven and cheap.", 
    "Quality seems very good, appearance is excellent. Assembly was complicated by excess glue or acryllic blocking several of the bolt holes, which had to be carefully chipped out and ground out, which took several extra hours. Paint was chipped off on one leg, looking for color match to repair it. But the end result was worth it.", 
    "Bought it for my son who lives alone and hardly used this set. Other day one of the legs broke. He is only 160 lbs and it wasn't a weight issue, these are cheap chairs I expected them to last longer as they looked sturdy.", 
    "If I had a need I would purchase four more of these chairs", 
    "You definitely get what you pay for in these chairs. Definitely not the highest quality available but has same look and feel as more expensive similar styles chairs. A very good bargain!", 
    "I've been shopping online and locally for chairs just like these and finally bought these when I found them because of the price and reviews. True to every word I read, they arrived and are perfect! Color, size, quality...I'd buy more if I needed them! I'm thrilled to finally have a great set of dining room chairs.", 
    "I bought 4 of these chairs for my small kitchen table. They shipped quickly, they are easy to put together and they're gorgeous! (My husband loves them) they don't take up much space and they are easy to clean. Love them.", 
    "just what I needed to update my old kitchen set--easy assembly Glad I made the purchase", 
    "The chairs were easy to put together and are very comfortable. They work very well if space is limited. They clean easily. I don't think they look like leather--they are puckering on the edges where there is stitching. On the whole they are certainly worth the price.", 
    "wonderful purchase. if you are thinking about buying these chairs, do it. bought four for kitchen set and they are beautiful and sturdy. easy to put together. great quality.", 
    "The quality of the chairs are good. The only problem is the seating is smaller than regular chair. So when you sit on it, the space to move around is quite limited. Neither my wife and me are fat (115 lbs and 170 lbs), but we still feel the chairs are smaller than we expected. The bonded leather has good quality tho.", 
    "Love my new chairs!!! They look great in my newly renovated kitchen! The color is exactly what I was looking for...a dark chocolate brown. They are a bit smaller than I imagined but they are comfy and sturdy. Assembly was simple. Would totally reccomend them.", 
    "Bought two sets of these chairs for our eat-in-kitchen table. Great value for the price... The first and third chairs assembled 1-2-3, the second and 4th were slightly more annoying, but all went together eventually. We've used them 3x daily for over a month now, and have tightened the bolts/washers twice-- not a big deal. The material makes the seats a bit slick, but not dangerously so. I LOVE that I can just wipe them down no matter what the toddlers (or adults) spill/drop on them, and do not have to worry about stains or the chairs just generally looking grubby. (Our previous set was an insanely impractical micro-fiber. These were the replacements, and I'm so much happier with them. Learn from my mistake: unless you're kid-free neat-freaks, stay away from fiber on your everyday dining chairs. Dining room? Sure, but for everyday? Leather/pleather all the way!)", 
    "It took me a minute to realize that the assembly instructions were inside the chairs under the velcro bottom. Other than that pause of confusion, the assembly went well and the chairs look great!", 
    "The reviews were super helpful. I knew what I was buying and was not disappointed. I wanted inexpensive but good looking and serviceable, and I got it. The first box of 2 was difficult to put together, but the second box was a breeze. They look great with just one flaw in the vinyl (faux leather--funny how including a French word make it sound so much better and a few spots on the legs where the paint had rubbed off. I easily fixed both. I'd highly recommend them as long as you fully realize that you are paying a basement price for a pretty good product. Considering the price I have no complaints.", 
    "I bought 2 sets of these chairs for my apartment, we've had them less than a year and 2 have already broken, i figured it was a fluke so i bought one more set to replace them and in less than 2 months one more has broken. We're 4 girls 120 lbs and less so i dont think its a weight issue and we dont lean in them. over all these chairs look great and are comfortable but are not very durable.", 
    "Chairs are very comfortable but some are difficult to put together. We had ordered 16 of these chairs and there were a few where the holes weren't drilled correctly and some had missing hardward. Rather than send them back my father in law who is handy with a drill fixed the issue and we found some left over parts laying around we used on the couple of chairs with missing hardware.", 
    "These chairs are a great bargin for the money. Quality is great and very comfy", 
    "I've had the chairs for a couple of weeks now and they are great! Like others have said, it can be a bit tricky to get all the legs even when putting them together. I had to get my husband to help with one of them so I could sit on it while he tightened the screws, but it wasn't very difficult. The color and description are accurate. These are nice looking chairs. My only complaint this that a couple of the legs were a bit scratched up when I took them out of the box. I was able to turn them when installing them on the base so the scratched side isn't too noticeable. They will probably end up with more scratches from use, I'm not too worried about it. The chairs are comfortable and light. Really easy to move around the table. Our table expands but we keep it set up to only seat 4, so I only got 4 chairs. I'm thinking about buying another 4 and keeping them in the boxes to use when we get a bigger house and expand the table. All in all, great chairs and the price can't be beat!", 
    "These chairs are very difficult to get level. I followed all instructions for the six chairs I bought. Two were fine. Two with a lot of work they are mostly level. But on the last two I had to balance them with felt pads. I put these in an investment property, I would not have them in my own home.", 
    "These look so professional and clean up so well. It's tricky to get them to stay flat on the floor - just some adjustments - but worth the effort.", 
    "Received 2 sets of these charis. No legs or screws were in box. Only one set for 1 chair. Have 3 chairs only back and seat, nothing else. Very disappointed.", 
    "Legs started chipping and breaking less than a year after purchase. They are no longer usable.", 
    "Prompt delivery however I had quite a time assembling them, specifically tightening the bolts. Turns out they sent the wrong hardware! Customer service was very helpful , so after a few times-I finally received the correct screws! Not as easy as I thought to balance all of the legs so that they would be even!! Repeated attempts and an Allen-Wrench, finally did the trick. They are very attractive.", 
    "Comfortable and great looking. Easy Assembly. Great price!", 
    "I bought these chairs because I needed two extra for my dining room table. They match well color-wise and were perfect for my needs, for occasional use. I probably would not recommend these for heavy use for various reasons. They are comfortable for short periods of time, but don't compare to the chairs that came with my table and chairs and were higher quality. Also, I have wood floors, and the plastic on the bottom makes them slide on the floor, moreso than other chairs I have. But for the price, they are just what I needed. For assembly, make sure after you assemble them, you put them on the floor and screw them again upright; this will make a difference in their \"steadyness.\"", 
    "These chairs will add character to any room. The color contrasts well with white or off white wall or carpeting. They are comfortable and very ease to assemble I highly recommend these chairs to anyone looking to buy dining chairs", 
    "Overall it was a good buy for the price. The uneven legs are annoying but can be fixed. The chairs actually look more black than latte but I would recommend them.", 
    "I use these chairs for my kids to sit in our schoolroom. The chairs are quite comfortable, were very easy to assemble, and are very lightweight. I am surprised how lightweight they are, yet they are sturdy. We will order more.", 
    "So far these chairs have been great. They look phenomenal and appear to be much more expensive chairs. They are very comfortable and add a very elegant look to our dining room table. I have read a lot of reviews about them falling apart. We have had them for about a month and so far seem to be just great. They don't get a ton of wear, but enough that if they were going to fall apart, they probably already would have.", 
    "I ordered four chair and the legs on two of the chairs are uneven. However, the chairs are visually pleasing & comfortable.", 
    "Received the chairs without incident. Very easy to put together. I purchased two about 10 months ago and was able to purchase a matching pair. They look great. Very pleased.", 
    "On the positive side, these chairs look nice with our new dining table, are moderately comfortable, and don't wobble. However, I'm not an expert but I believe that they are poorly constructed. The wood on the underside of the chair, which you access to put the chairs together (tedious process!), is unfinished and splintery. The legs look like they've been nicked (at least half of them do). The worst part is that when I sat on one of them I heard a creaking sound that did not bode well for the future of the chairs. I'm about 115 lbs. Needless to say, we heard the same sound when my husband sat on one of them as well. The backs do not seem very securely attached on some of them. You could say that it's the way that I put them together, but I do not think so. Lastly, the plastic (or whatever it is) on the bottom of the chairs (to prevent scratching?) make the chairs very slippery on our standard wood floor. They might as well be wheels. I wan't sure how to rate these though because they are pretty cheap and I'm not sure if I have no reasonable expectation for more, but my sister did get similar chairs for a similar price that came already assembled and are superior in quality.", 
    "The chairs loom nice but the black color doesnt go with my dining table. One of the seat bottoms has a large crack. using cheap materials shouldnt mean they are made cheaply and without quality control.", 
    "I was very pleased when I opened the box and saw the chairs. they look like they were much more expensive than what I paid for them. They will be used as extra chairs for the new dining room set I have on order. They are sturdy and comfortable. Obviously they need the test of time. But I will surely not remember to write a review if I wait to long.", 
    "I sent the product to my daughter, once I saw the chairs and set in them I was suprise how firm and well made they are.", 
    "I was looking for some nice looking but inexpensive chairs to put around a poker table for our recreation room. These will work perfectly. They look nice and were easy to put together. For as inexpensive as they end up being per chair, it was the best deal I could find and I'm pleased with them.", 
    "I ordered these chairs for a second home. The price was very good and the chairs look much more expensive. They are comfortably padded and look really nice. I found that the scale is slightly smaller than a dining chair might usually be in the seat depth, only problem for larger people, which we are not. Putting them together was not too difficult however they shorted me a few bolts and finding something to fit wasn't easy. Overall, I was very satisfied with them.", 
    "Product is very comfortable and look expensive. It was delivered in a timely basis.", 
    "We ordered these chairs for our eating area and they look great, we already have a couple from a few years ago and these are better. The seat is more comfortable and the velcro bottom hides the unfinished wood underneath. These are easy to assemble and they arrived in two days! These chairs look good and are comfortable for a very good price!", 
    "Received our chairs, assembled and satisfied with product purchased for the price. One chair sits a little unsteady when not in use, but I'm sure as it is used it will level out. This purchase was to add to existing chairs purchased at another retailer that have long since been discontinued. The color and design matches very nicely. The backs are a bit taller than my set of four, but still fit in nicely. This set of two is comfortable and will be used as occasional seating.", 
    "Chairs are very comfortable allowing one to linger after dinner. Chairs are also very stylish. The four star rating is only because we needed to add felt pads to the legs to cut out a little wobbliness, otherwise perfect.", 
    "I like these chairs for the price. They serve their purpose. But a close look reveals that they are very inexpensive chairs. That being said, for the price, I would purchase again if I needed more chairs like this on a budget.", 
    "I gave this a 4 star just because I bought 6 chairs and one chair didn't have the correct leg length. I contacted O.Co and I was promised to have the correct legs sent to me. I am really satisfied just because the customer service was so fast and understanding. This was a gift to my mum so I was somewhat embarrassing to have to wait for the parts, but it happens! This is also my first time to really have an issue with my orders from the web, it's not a big deal. Overall, the chairs look stylish and very easy to clean which my mum appreciate since she has grand kids visiting all the time.", 
    "We loved the design and the color of this chair! But, we were one of those unlucky customers whom got the defective products. The lengths of the legs were not even, so the chair was shaky. Inevitably, we had to return them!", 
    "The chair construction is not a good one, the simple bolts and the legs are very easy to come out and be loose and could cause the chair to break or loose a leg, Please make sure you tighten the legs acording to the instruction, if over tighten could cause leg to loose a good fit be careful of the fitting of legs to the chair.", 
    "Chairs were much smaller than picture. One of the chair legs was cracked so in the garage they went and will use if need extra chairs for holidays as too expensive to send back.", 
    "Chairs were easy to assemble I used a handyman the color was darker and slightly smaller than I thought also the chairs have a very streamlined clean look I have twin boys so I hope they can hold up to the wear and tear. I have traditional dining set and was looking to give it more contemporary look.", 
    "We ordered two of these chairs to see how we liked them with our new custom-made dining table. When they arrived, we liked them well enough that we ordered eight more! We are very pleased with the set of 10! They look quite more expensive than they really cost! Other reviewers had warned that they were difficult to put together, but my husband had very little trouble putting them together with a cordless drill. Some of the holes lined up better than others, however. The chairs are comfortable, classy, and elegant. I believe they will be easy to care for. I can't speak to their durability yet. But for they money, you can't go wrong!", 
    "Assembly was not difficult but my husband is very handy and had to adjust and readjust a few times so the chairs didn't wobble. They are much lighter than I thought they would be but they are comfortable and everyone seemed to enjoy them. Because I have 4 kids, I am worried about my teenage boys rocking back in the chairs and them breaking. Theses do not seem real weak but they don't seem extremely sturdy either, but my last chairs were made of metal for that reason. They have little rubber things on the bottom which help with the gliding but my husband is a big man and it made small dents in the laminate floor so he is getting different ones to put on the bottom. Overall I like the way the look in my kitchen, they are a nice dark color, looks like they are easy to wipe clean. So far they seem like a good value", 
    "Needed extra dining chairs for Thanksgiving.Thought these looked pretty good for around $$$/piece. They do arrive unassembled. First chair went together like a dream. Second one; not. Holes didn't line up, bolts too short, etc. Had to go get extra hardware to make them work. These chairs have received quite a bit of use during the holidays. The screws need to be tightened, but they have held up well. I don't think we could have found anything better for the price.", 
    "The chairs came in on time and were easy to assemble; maybe an hour for all four chairs. They give a nice look to my dinning room. I can't wait to have guests to show them off!", 
    "Love these chairs, they are comfortable to sit in & they are great value for money.", 
    "One of the four chairs was difficult to put together. Other than that they are perfect.", 
    "Bought these chairs in 2005 and now I have to replace them. All of them simultaneously started to peel, really really bad. They are nice chairs, on the slim side. But it you are looking for something that is long lasting, these are the chairs for you. Keep that in mind when shopping strictly by price; you get what you pay for.", 
    "I would not buy them construction poor, material poor something you would see in ***** or *******", 
    "As I stated earlier the chairs wobble no matter how much I attempt to adjust them, the quality of the chairs are not what I had hoped for. The leather is actually nice to the touch however. The downside is that they are smaller than average dining chairs, and the quality is not high, definately fair to average.", 
    "The chair was too narrow-not comfortable for people to sit on. They were not sturdy at all. The quality was cheap, in my opinion.", 
    "These chairs are very good looking, just what I had hoped. They are comfortable and well padded. BUT the wood is cheap and the screws holding seat to the legs keep coming loose and the legs wiggle. I have re-tightened them 3 times in 5 weeks. Annoying. Every time I slide forward or backward while sitting, I squirm because I know that I am loosening the legs.", 
    "Bought these chairs last year. We have 2 young kids,so the chairs are perfect for spills and stains. About the quality of the chairs: these are cheap chairs, legs were not even, and the \"leather\" looks like it was burnt in a few places, it feels dry and brittle. Overall u can't tell unless u look closely. These are smaller, thinner chairs which we are using in a breakfast room, so the size is fine with us. Just this week one of the \"burnt\" spots tore/cracked, so now I have to replace the chair since you can't really fix these chairs....reason why I'm back on the site, but it seems the chairs are out of stock. Expect the chairs to last about 2 years if u use them daily like we do.", 
    "I purchased 8 of these chairs. They are very pretty, but the legs tend to loosen, even when not using them. 3 of them are horribly uneven. We tried to adjust the legs as the instuctions state to no avail. I ended up putting little pads on the shorter legs to try and even them out. You can't tell too much on the area rug, but they still rock on the floor. I guess you get what you pay for. My dining room is not used that often, so these should be OK for a while until I can replace them with better quality chairs.", 
    "These are quite sturdy and look good with our dining table.", 
    "a real PAIN to put together.Otherwise, really nice and sturdy.", 
    "Overall I had purchased four chairs. All the chairs but one worked out very well We need to put a deeper plastic lift on the fourth chair leg. The chairs are on the tall and very dark side and take some getting used to. My previous dining room chairs were lower and lighter colored. I think that these chairs are a great bargain and I would recommend them to my friends.", 
    "very nice chairs! a little wobbly if the screws aren't in perfect. took a bit more time to put together than i'd like to spend on assembling chairs but worth it!", 
    "We bought four of these chairs for our new place. The price worked with our budget. The color was also a match to the description. However, they were difficult to assemble because the holes in the legs did not match up to the holes in the seats so that you could put the screws in. It took some muscle to make this work. The legs do come loose with use so keep the tool that came with the chair because you will need to tighten them from time to time. The seats are comfortable - but they \"squeak\" when you sit on them. Chair covers ?", 
    "I absolutely love the chairs.the only complaint I have is that one leg of one of the chairs is shorter.i didn't call the company just because I didn't wanna go through the returns hassle.but overall very comfy", 
    "Ordered three sets of these chairs to update my dining room. The chairs are comfortable and are sturdy when first put together. I've had to tighten mine once already (think I've had them for maybe two months) but considering how inexpensive these were I'm OK with that. I have an active family that really uses their dining room, so I'm not sure how these will hold up to that kind of use. All in all I think the chairs are a great quality for this price point.", 
    "You get what you pay for with these chairs. They look good and as pictured but they are not the most sturdy or well made. Assembly was easy and although I wanted to return, my husband convinced me to keep them for extra seating. If you need an inexpensive set of chairs, these are it but beware of the quality,", 
    "I was pleased to find the chairs matched the online description so well. They seem to be good quality for the price. I don't think I would want to sit in them for hours at a time, but they are perfect as accent chairs in my office.", 
    "Great looking chairs once assembled, however it's pretty hard to assemble all 4 legs exactly right so that the chair doesn't wobble (the wobble is subtle though, so if you're not particular then you can look past it). It looks expensive without the expensive price tag, so I can't complain for the price we paid. We researched everywhere and these were much more reasonably priced than the $150/chair at Raymour Flanigan for the same look. Another thing to note is the backs of these chairs - it's pretty much hollow underneath the faux leather (probably just a wooden rectangular frame), so you won't find any cushion support for your back and these probably won't last through kids kicking at it over time. All in all, great looking chairs! I'm satisfied", 
    "I am overall happy with the chairs, but slightly disappointed that they were as deep brown as they are. When I received my chairs, the box stated that they were the \"dark brown\" color but they look black. I was hoping for a deeper, chocolate/nutmeg brown. I will keep them because they are decent quality and not worth sending back, but because of the color, will not work where I had originally hoped.", 
    "I needed chairs to fit into a small office with a small round meeting table. These chairs are comfortable, and well-priced. I looked in MANY places to find something like this, and could not beat the price. Turns out not only do they look good, but they are comfortable. I was very happy with my purchase.", 
    "I am very satisfied with the two chairs that I bought. Quality is good at a very good price. I got the delivery in a few days. It took less than half an hour to assemble both chairs.", 
    "I really like these chairs. A couple of them were a little wobbly when put together, but I don't think it is a coincidence that they were the ones my husband put together. All of the ones I assembled were fine. Gives them character and a chance to poke jabs at my husband when ever someone sits in them. I like these chairs very much.", 
    "We were looking for a table and chairs to replace an existing set in our eat-in kitchen after moving into a much smaller retirement home we built. We had a certain color and style in mind and had looked all over for something that fit in size, style and color. This turned out to be perfect for the space and the color goes well with the wood floors and kitchen counter. It was relatively easy to assemble. It helps to perform the leg adjustment as you are putting the chairs together. There is a separate sheet that tells you what to do if you need to level all the legs so the chair is solid on a level surface once you put it together. You can do this as you are putting it together and before you tighten all the bolts.", 
    "So far I am very pleased with my purchase. The only issues were the instructions are not 100% clear on how to insert the legs, and one of the screws to adhere the chair leg is very hard to turn. I've read similar reports on this", 
    "I love Overstock.com. However, This order has been a nightmare and it's not over yet. First boxes a leg was broken, color sent was wrong. And the replacement Box, the legs of one chair didn't fit in the seat. I'm still waiting for the replacement seat. I haven't received an email from the parts department stating the seat is on its way, or another chair will be arriving.", 
    "These chairs look great and are so easy to wipe down. I bought 6. The only downside is that there is no weight limit given. My husband is about 210, and he feels uncomfortable like he's going to break them. They were easy to assemble after the first one. If you find you absolutely can't get one of the screws in, take it apart and use a flashlight to check the hole. There was a staple in one of the holes that we could not get by. We just used pliers to move it out of the way and the chair went together great. I am having problems getting the legs level, but I haven't spent any time to fix it yet. Hopefully that will work out.", 
    "Sturdy chair but not easy to assemble. Holes are not easily matched up and a few threads were onscured by staples that could only be seen after I shined a flashlight into the hole. I would not buy them again. Now I have 6, hopefully they will last a while. But kudos to Overstock.com customer service for promptly resolving a defect issue. They shipped me a new chair!", 
    "I emailed and got a replacement leg, however the holes that were predrilled were to big for the bolts I have, so now I am waiting to see what to do............This experience has been very stressful!!!", 
    "These chairs came unassembled. I am pretty handy but had a hard time getting these chairs together. It took me several hours. Some needed the material and wood around the bolt holes trimmed. Some needed shims so that the front legs did not go crooked when you tightened the bolts. It was also hard to get them level.", 
    "Product was returned due to the fact that the color was darker than thought. Ordered to go with 4 other chairs ordered for O.com previously. Unfortunately, colors did not match previous ordered items.", 
    "The chairs were very easy to put together but they were very difficult to get level. I purchased 4 & 1 sat perfectly flat on the floor after putting it together. The other 3 required loosening screws & adjusting several times. After messing with them I finally got 2 of those 3 to sit on the floor without rocking. The 3rd one is pretty good but there is still a slight rock to it. They do look very nice though & I can live with the slight rock of the one chair.", 
    "Loved the color and quality when I opened the box...but, the front legs will not fit into the area that they are supposed to, so with out cutting them down, I can not use this product at all. Very dissappointed. I love the look of the chairs and with I could use them.", 
    "There was not a problem with the holes lining up like some reviews mentioned. Our only complaint is there were tears in the seams. I was pleasantly suprised that the feel of the chair was more like real leather than you would expect from faux leather. The leather is a dark brown and the legs are dark brown, almost black so it is an accurate description. Overall it was a good buy.", 
    "I ordered 4 of these chairs and the price was great. The chairs aren't as soft as cushiony feeling but I guess that's to be expected given they are not real leather. Not bad for the price though.", 
    "I love these chairs for the value. We have small children so it is a practical purchase to get less expensive chairs that we can wipe clean rather than worry about fancy chairs. We have 6 chairs at our table and they look fabulous. I'm expecting them to last about 5 years which will get us through the little kid years.", 
    "I should of trusted the one review that was terrible in regards to the assembly of these chairs. Both chairs did not match up with their legs. I had to use all sorts of tools too widen the seat areas to fit the legs in place. This took many hours to accomplish. I should have returned them but I needed them for the holiday dinner party. DO NOT PURCHASE THESE CHAIRS, They are not worth the bargain!!!!!", 
    "The assembly is a little difficult - the legs fit very tight. We did have some issues with wobbliness on 2 of 4 chairs purchased. To remidy this I simply sat in the chair and wiggled around a lot - now the sit perfectly stable! Silly to do but it worked.", 
    "shopped around to all of the furniture stores in my area and it was cheaper to buy these chairs and have them shipped than to buy the same kind of chair from a showroom.. so i bought these chairs. the chairs on not super solid - definitely shouldn't have anyone who has a large lower end .. if you know what i mean or anyone that is \"heavy\" sitting on them, fabric is not real leather and they are not high amazing quality .. but .. i love them .. they are easy to move around .. they seem very functional, i don't mind they are not real leather .. probably better for the animal(s) that got spared and i could put them together - i'm a girl! .. the first one was kinda tough but the next ones were a breeze .. i don't have a lot of money so i am happy with these and don't feel at all like i got ripped off!", 
    "Ordered 6 chairs 4 went together easy 2 gave me a lot trouble Other than that they are OK for a cheaper priced chair", 
    "The box arrived. I opened the box gently (no box cutter in the event there was something exposed). I I inspected each piece as I pulled it from the box (for damage) - and counted each bolt and washer. All there and all pieces in place. I put the chairs together in no time. The first chair was a breeze - but the legs were uneven. The second chair, one of the legs was a bit difficult but I figured it out. In the end, they look great and my husband is happy. Recommendations: - when assembling - do not over tighten anything until every bolt is in its place - you sometimes need some \"wiggle\" room. Also, do not tighten until you put the chair on a flat surface - gently sit on it - and then (without touching the legs) - tighten the bolts (yes, that means laying on your back). I had one chair that is PERFECT. The other chair, uneven. Thus, I have a felt sticky pad on a back leg and another on the opposite front leg. Now it is perfect. Minor adjustment. Based on my experience, this was a no brainer. I'm a happy customer. I have four more chairs coming (different from these). I am hopeful to have a similar experience. I should mention, I bought these for a kitchen, every day use, table. They really do look very nice for kitchen chairs.", 
    "These chairs are going to go beautifully at our dining room table, however, be prepared with your powertools! We ordered 2 sets of these chairs, and both came with issues when trying to fit the legs into the leg holes. We had to sand down both the leg and the wooden support in order to get these chair legs to fit. My hubby is no weakling and no matter what he did, he could not force these down in (mallet, pushing, etc. At one point I thought the chair bottom would break we were pushing so hard.) Once together, these appear to be very sturdy, I can't speak about that since we've only owned them for about a week. All in all a good deal for the money, you get what you pay for but the appearance, once assembled, is high class.", 
    "Good perfect chairs for our needs. We are very happy with our purchase.", 
    "I liked the price of these chairs definitely. They look nice with my existing dark table. They were easy to put together, all the holes lined up fine and I didn't have to drill. However, I was missing 3 washers, and had to make a trip to OSH. A couple of the legs are uneven, but I think as they are sat in, that evens out. They are light weight enough for my kids to push them in, which my old chairs were too heavy.", 
    "Chairs arrived and very easy to install except for the fact that I only had one set of screws, had to go out and find similar to continue to assemble.", 
    "This is a good value for the price. I was looking for chairs to match the other pair we previously purchased from ***. Those were $115 per chair and are leather. We didn't want to spend so much this time and leather didn't matter. These chairs are very similar in appearance. They are the same color, almost same height and shape, and have the same 'T' stitching on the backs. The only difference is these chairs are not as wide as the ones from *** and the back is curved slightly more. I actually like that they are smaller since we don't have alot of space around our table. They are the same size as a standard kitchen chair, but much more comfortable. The main appeal of these chairs is that they are so comfortable (after being broken in, the seats are a little stiff right now) and very easy to clean. I have a 1 1/2 year old who likes to throw food and put his sticky hands all over everything when he's eating and these chairs can be cleaned with a wet towel. They were extremely easy for my husband to put together, all he used was an allen wrench and a screw driver. It took him maybe 20 minutes to do both chairs.", 
    "I really thought this was going to be a no brainer when I ordered it. The price was right! I guess you get what you pay for. I still have two more chairs in the box that I will not open now.", 
    "These are average chairs . The legs are not really balanced. One side of the leg chair about 1 cm shorter than the other. but it's easy to assemble. The seat is a little bit small.", 
    "These are average chairs for household use. The legs are difficult to get balanced with the back bolts, however seem sturdy once together. One chair had one predrilled bolt hole that was not lined up with any of the others, and could not be used. The chair was put together without that bolt, and still seems sturdy as a basic dining chair.", 
    "I am a small person (115 lb and 5'5\") and I found this chair to be too small for my frame. I felt like I was slipping out of it and it was very uncomfortable. I did not find the one chair too difficult to build though it was clunky but after sitting in one we decided to return. The chairs looked fine just were not comfortable.", 
    "I would recommend this product. Its very nice looking, price is great and not difficult to put together. I am looking for a sofa also. This worked out great for my budget.", 
    "item was easy to assemble, got here when it said and looks good with my dining set.", 
    "Simple 3-step assembly to attach the seat and the legs, BUT the holes for the bolts did not line up perfectly and it made assembly much more time consuming. Otherwise the quality was good, especially for the price. But the shoddy workmanship on the pre-drilled hole alignment made assembly frustrating and required extra tools and LOTS of extra time.", 
    "Watched these for a while and finally bought when they went down a few bucks. They arrived quickly and per my husband were easy to assemble. They look nice and are comfortable to sit on. They dont feel super solid, but dont feel like they will fall apart either. For the price its a great look and they get the job done!!", 
    "Ok so these chairs look very expensive, feel very comfortable, and were alot cheaper then every where else. I will say to put them together took FOREVER. Each chair has 9 screws if you have 1 of the 9 in too tight or not lined up right the other 8 wont take and you will be screwing forever and it seemed like it was going in and then you pull on it and it comes right out. Its hit or miss with them.. the first I put together with my two year old in about 20 min the other 3 (I ordered two sets) took about hours. The second complaint I have is that the legs come with knicks out of the paint and look damaged! Is it noticeable if your not on the floor staring at them .. no .. but this isn't a refurbished product there should be no knicks O.co!! I love these chairs and I would still buy them again 100% but be aware of these few issues! I had also first bought 1 set waited for them to come put them together used them for a few days and then bought the 2nd set so I am very happy with them. So you know they are worth it ... it would have just been nicer if I didn't have to go through it!", 
    "These chairs were fairly easy to put together. We ordered 4, and he last one had to be drilled because the holes didn't line up. They are comfortable, look nice and are easy to clean, which is very important to me because I have 2 little boys. The price was great. I would definitely order these again.", 
    "the chairs are very good lokking , the color is just like its shows on the web and are very easy to assemble", 
    "This was a great buy. The chairs are really simple but classy. Very easy to assemble as well.", 
    "I got two chairs. The instructions to assemble were easy and the chairs went together without any problem. The chairs look great and are comfortable. I like them enough that I ordered another set. I had no problem in the assembly of the second set.either and none of the chairs were wobbly as indicted in one of the other reviews. These chairs are a great deal for the price. I looked around in several dicount stores at similar chairs that were prices about $25.00/ per chair higher. The chairs do not seem as sturdy as more expensive chairs and they may need retightening after some use----as such the four star vs five star review. However, if you are looking for charis that look great, feel good and are a good value--these are it.", 
    "These are really tremendous chairs and a great value for the money; however, each chair had one leg which was significantly shorter or longer than the other three, creating a rocking issue. For an additional $8 investment at the hardware store, this problem was solved with plastic feet. I definitely classify it as a quality problem.", 
    "The Villa Faux Leather Dining Chairs arrived quickly and without damage. The instructions are easy to understand, but the construction is somewhat inconsistent and assembly is tedious. I purchased four sets (a total of eight) of chairs, and half assembled quickly and easily; two more were VERY wobbly and required a lot of tweaking; the other two nearly went out the window because of my frustration. Tips: Don't tighten the screws all the way until you are certain it is centered and sturdy, particularly the center mount screw (the first the directions tell you to use.) Assemble the chair loosely, flip it over and lightly sit in it to adjust the legs--THEN tighten everything. The parts are all in a bag inside the velco seat bottom. In three of the chairs, the bags were open and parts were everywhere--I actually had to go purchase a few washers at a nearby hardware store because they could not be found. The faux leather is a very rich dark brown and the legs are a true espresso, but with a slight red tint. They match Target's \"Espresso\" and IKEA's \"Black-Brown\" colors well.", 
    "These are a good size but the leather is definately faux looking and feeling. A little dissapointed with that seeing as though I have purchased faux leather before and you couldn't tell. Fabric is very thin, hopefully won't tear and ruin them.", 
    "I was very pleased with the chairs and with the time it took for them to arrive!", 
    "The seat bottom is toooo hard, I am skinny and I could only sit on it for 30 minutes before the hardness got to me. They look good. This is why I only bought 2 for my table of four, now that I know I will buy two different chairs that me and my wife can actually sit in.", 
    "save your money! these chairs look ok on the picture. however the people of china did a terrible job making the pieces. my husband has made furniture in the past and is very handy. thankfully he is also good with tools because he had to adjust every leg (we got 6 chairs) so that it would fit into the hole under the chair. it took him about 2 hours per chair. they are not at all comfortable to sit in and the material and legs look cheap and nasty. wish we had not bought them."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Villa-Faux-Leather-Brown-Dining-Chairs-Set-of-2/5801287/product.html?recset=f208284b-f00e-419c-92dd-1fb3310db985&refccid=7FY6XRUP2NCL3KSGK5NARCR4HM&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5801287/Villa-Faux-Leather-Brown-Dining-Chairs-Set-of-2-2443a51f-d32b-45e8-81dc-99e132e075fc_600.jpg"
  ], 
  "description": "Evocative of rustic pizza parlors nestled in the lush hills of\nItaly, this stunning pair of faux-leather dining chairs from Villa\nblends together the traditional charm of dark walnut with a more\nmodern, armless design. Soft upholstery wrapped carefully around\nplush padding gives this set of brown dining chairs versatility in\nany environment. Set includes: Two chairsMaterials: Faux leather, pine woodFinish: Dark walnutUpholstery materials: Faux leatherUpholstery color: Dark brownSeat dimensions: 20 inches highDimensions: 39 inches high x 18 inches wide x 22 inches\n  deepStyleTransitionalMaterialFaux Leather, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBrownFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion, Solid, Upholstered"
}