{
  "name": "Villa_Faux_Leather_Red_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 97.46", 
  "reviews": [
    "I bought 6 of these chairs for my new dining room table. They are a very nice quality especially for the price. I love the color - it matched what I wanted perfectly. They were actually pretty simply to assemble, but getting them level was a bit more difficult than imagined. Make sure to keep all the bolts loose until you set it flat. I would suggest sitting on it with loosened bolts (carefully) then try to tighten them without moving the chair..", 
    "These chairs are beautiful deep lipstick red. And they're VERY easy to assemble, just 9 bolts per chair. Yes, some adjustments are necessary as you put them together to make them sit level but that's the case with any assemble-it-yourself dining chairs. Just take the time to tighten each bolt a turn or two, move on the the next bolt and tighten that one a turn or two, etc, making your way around the chair several times until all bolts are secure. Sitting in it a few times during the process helps, too. They're just a bit on the petite side but that's what I wanted for my small dining area. They seem sturdy and well made. I see no reason why they won't last a reasonable amount of time. This is my first purchase from Overstock.com and I'm very pleased.", 
    "The chairs go well with the color scheme in my dining area; they add 'pop' to my decor.", 
    "We ordered four in red for dining room chairs and are very pleased with the quality of them, they feel sturdy for both my boyfriend at 220 lbs and myself, and a great bargain for the money! We've only had them three days so time will tell. Color was nice true red, not burgundy like others we saw. Very easy to put together, need to read instructions to get the level right! Very comfortable.", 
    "I bought these chairs for my office and I love them! The color is perfect and so was the price.", 
    "When I recieved these chairs they were very easy to assemble. In person the chairs look like designer chairs. The quality is amazing! I am a very picky person and these chairs far reached my expectations! Thanks again OverStock. Job well Done!", 
    "I LOVE THESE CHAIRS. i had the same old fairly small wicker chairs forever. been wanting new ones for years. well i am slowly redecorating and these were the first buy. they come in black and brown, but im ready to brighten decor up and friends to say, BAM!!! Pretty easy to put together. They are surdy, soft and comfhy. nice wide seat and tall back. Whatever color you choose, BUY THESE!", 
    "We wanted furniture for an apartment that would look attractive and rich but not make us upset if we end up getting rid of them when we buy a house in the area and invest in high-end furniture. These chairs are a deep rich dark carnelian red. No worries about them being a true red (like Hello Kitty, for example) because they're a different shade. When you put the chairs together, tighten the legs, sit on them and wiggle the chair slowly a little which takes the pressure and varies it on the four legs, and then re-tighten them. Be careful not to tighten them up so much, though, that there is no give at all even after sitting because it might splinter the legs. For $** a chair this is a steal. It's a better price per chair than IKEA, HomeGoods, TJMaxx, Old Time Pottery, Garden Ridge and similar stores. I know because I checked, and none of those chairs were a nice-looking faux leather like these with such a beautiful color. For this price the best you usually get is parsons chairs covered in some kind of cheap linen-look cotton. Definitely a good buy.", 
    "I love these chairs. They are an exact match to go with my dining table and other decor in the room. However, they are not as dark/deep color as pictured., The chairs were extremely easy to put together. I put the two together by myself in less than 30 minutes. Chairs are sturdy and comfortable.", 
    "These chairs are very easy to assemble. I am a woman so I thought I would put that out there for any woman considering this purchase. It took me less than 2 hours to assemble eight chairs. I loved that they packed an allen wrench with every chair, not just every box. There were a few minor blemishes on the legs of a couple of the chairs, but I've seen worse in furniture stores where you would spend much more money, and none of them were return worthy. I have an active household so I would assume they will be accompanied by more of my family's making. A dark sharpie covered a couple of scratches. One had some glue residue on a leg, I'm not sure how I'm going to approach that, aggressively cleaning may mar the finish. I'm a good size gal and all the chairs feel very sturdy. Overstock out does itself with timely delivery.", 
    "I love this red color. My wife thought I was crazy to buy online, but she says the chairs are better than she expected, and as good as the chairs she was looking at in the stores. She was worried about the color, but she is happy, so I am happy. I had to assemble them, but I do not mind, because the price was so good.", 
    "Chairs showed up on time and went together quickly. Love the color and the feel of the faux leather. I also have to say that the chairs are surprisingly sturdy. I'm a big guy and was worried when i first ordered.", 
    "Love these. Color was perfect. They look great around my rustic barnwood table. Can't beat the price!", 
    "I bought 4 chairs and Absolutely love them!! They are also a great price", 
    "Sceptical because the price was so low but to my great delight the two chairs are perfect. Not too large but will accommodate all diners. Super easy to put together I am woman of 70 and had no problems using the wrench supplied. All holes lined up, there were no marks or scratches on the chairs. The \"leather\" looks more expensive and does not smell like some of the cheaper synthetic products. Used every day and so far have no complaints would buy more if I had the room.", 
    "I order these chairs because my family has out grown the dining set and folding chairs are not my favorite things. The chairs arrived very quickly, were easy to put together and look great. My granddaughter has claimed one of them for her chair and declares it the most comfortable one at the table.", 
    "Everyone thinks the chairs are leather. I use them on either side of a bookcase to provide extra seating when needed. Their sturdiness will be put to the test on Thanksgiving when extra seating is needed. Customer Service went above and beyond when I discovered some missing parts. Overstock rocks!", 
    "Got these chairs for my dining room and they look great. Assembly wasn't too bad, only took about 15 minutes to put 6 together. Great chairs for the price!", 
    "I ordered two of these sets of chairs for my Mom and Dad to replace their older fabric dining chairs. They came pretty fast, two in a box. They were lighter than I thought they would be. I was worried about putting them together, but they didn't take too long. Probably 20 min each. Some screws were harder than others to get in. but was impressed with the thickness of the screws and bolts. The finished chair looked very nice and had a deep auburn color. They looked like leather. Will see how they last. I had ordered them without joining Club O Rewards. Then I saw what Club O Rewards offered 5% back. I called Overstock support to see if I can sign up with Club O and have it apply to the order since it was the same day. Support was very friendly and said no problem.", 
    "When we ordered the chairs we were not sure if the color would be what we wanted (off red), but they matced perfectly. We had read other reviews about how hard the chairs were to assemble, but assembly couldn't have been easier. We are looking at ordering other items from overstock. Speaking of ordering, the chairs arrived sooner than we expected and very well protected. THANK YOU OVERSTOCK!", 
    "Loce this red leather chairs very easy to asemble and beatifull looking.", 
    "I really like these chairs. Have had them only for a couple of days now though, so not sure how it wears. However, find it extremely comfortable, and fairly rich looking for the price. Assembly was very easy for me, maybe 1/2 hour per chair by myself, and Im 36 weeks pregnant now.. No misaligned holes etc. I followed the directions to a T though - meaning, I didn't tighten the screws till I sat on the chair to level it - and then tightened the screws while the chair was upright. I don't see any wobbling, like some others have noted. I rate it an excellent - the only thing that might change that is if I find it doesn't hold up with regular use.", 
    "Love the chairs. I ordered 6! was pleased with the color and overall look. It made my dining room/family room look great nd the color really made my rooms pop!", 
    "The chairs were a great buy. They are sturdy, attractive and blend beautifully with my two brown chairs of the same style. They ad life to the kitchen and feel like they will last a long time.", 
    "We have had our chairs for little over a week & we love them. Hubby was able to put them together rather quickly & the color is perfect! I was worried they would not have good support in the seat but was very pleased to find they are quite firm so I don't have to worry about guests sitting on a 'saggy' seat! I would definitely recommend these!", 
    "I was very pleased to receive the chairs, and found them easy to assemble. They look perfect surrounding the pedestal table, with a rich dark red color blending in with the warm mahogany of the wooden table.", 
    "After spending thousands on changes and purchases for our new home, our budget has become very tight. I was prepared to spend twice as much on dining room chairs after becoming very familiar with what was available from my local brand name furniture stores. The 8 chairs that I purchased were very easy to assemble and came with accurate instructions. (Reading the instructions is very important.) I am certain that the quality is as good or even better than what I would have paid at least double for from big name stores. I'm now a believer in Overstock and will likely furnish 2 more complete rooms using Overstock.com - Philip", 
    "I was in shock when I opened the box which was delivered the next day. Very fast delivery. The chairs are too bright but now that I have toned it down with some dark furniture it looks better. I will get used to it. Two of the chairs were easy to assemble but the other two weren't because the pre-drilled holes didn't line up very well.", 
    "Front legs do not fit into slots that were poorly \"designed\". My husband has very good carpentry skills and tools. I watched him put the first chair together. One of the front legs actually broke when he tried putting it into the slot. We are sending them back. We've had good experiences with Overstock and would order from them again, but I will not order something without reviews again.", 
    "I purchased a set of two red chairs about 2 years ago for my home office and I'm very pleased. The color is a beautiful dark red and the legs are dark cherry. They are very sturdy and comfortable. I'm using them every day for many hours and they still look like brand new. Great chairs!!!", 
    "Great chairs for a great price!", 
    "look great. red color is accurate.", 
    "Chairs are great! Look nice in my kitchen. They are really made well!", 
    "I just ordered my second set of these because I liked them so much. The first set has held up well and they are fairly comfortable. You can't beat the price.", 
    "I loved the color and quality of the chairs. Great deal for this price.", 
    "Very Happy. Price was nice too!", 
    "Assembly took about an hour, been using 9 months and are holding up fine and look nice.", 
    "Got a set for my father his back hurt in regular chairs, He loves everything about these He loves the color. Ordered another set", 
    "My ten year old and I put these together. They feel sturdy and look good.", 
    "Comfortable , rich red color, matches my rugs perfectly", 
    "Gorgeous chairs. Would purchase again!", 
    "The chair looks better in person. The red is a little brighter. But they are very well made chairs. I have purchased 3sets.", 
    "These chairs look much more expensive than they are. The color is not too bright and they are not too shiny. My only complaint is that they took a little long to put together (but once you figure out the first one, the rest are easier).", 
    "I love my new chairs they look good with my tablet. They are very comfortable my legs don't go to sleep like my old chairs,we can play cards with our friends now it's been a while", 
    "I love these chairs, they were easy to assemble and just what I was looking for at a great price", 
    "These chairs are beautiful, and they work great for our dining room table which we rarely use. However, they are a bit wobbly, requiring frequent tightening. Definitely not what you want if you're heavy, but for us they work fine and really look much more expensive than they are. Great value.", 
    "The chairs are beautiful..but when trying to assemble, none of the holes are aligned properly to fit the screws to put them together! It took 3hrs. extra, drilling new holes and getting them securely fit!!! This manufacturer should be ashamed to sell these...", 
    "I bought six of these chairs, 2 brown, 2 red and 2 purple. They get one star because they look good. otherwise they are a piece of junk. we have had them for a month and they need to be tightened weekly. They are wobbly, come loose too easily even with minimum use, uneven and cheap.", 
    "It is very hard to find a 20 inch seat height. I was very excited when I found theses. Alas they are clearly 18 inches. Not a cm over 18 inches. Inaccurate description! I needed these chairs for the weekend", 
    "Nice color of red. My husband, the skeptic, put these together and said they are rather well constructed! That is an uncharitistic response for him since he is quite picky. The chairs are comfy. Had no problems with assembly. The only thing is one of the chair has some pulling on the upholstery in the back down close to the bottom so that the cover does not lay completely smooth. However, you see this kind of thing in all these chairs sold at local stores for twice the price. I can live with. All in all....good purchase, attractive and serves the purpose.", 
    "I love these chairs! They look very sleek and modern in our downtown apartment. We ended up buying two of these red chairs and four of the black (same brand/style) and they really give our dining room the \"pop\" I was looking for. The only thing I would mention is that I had a hard time screwing in a few of the bolts...almost like they didn't fit? A few of the smaller ones that secure the actual seat to the back of the chair seemed too small, so I had to compensate by using the larger bolts there, which left a few empty holes. I need to go to the hardware store to find similar bolts to see if I can fill in those holes. Other than some assembly hiccups, they really are great chairs. P.S. I LOVE overstock.com. I have bought several items (from art, to bedroom furnishings, to kitchenware, and haven't been disappointed yet!", 
    "i just received these wonderful chairs today and made them up . I was amazed at how truly lovely they are and well with the money .They are rich darkish red and look like real leather ..sturdy and well padded and comfortable to sit on . Took me less than 15 mins to make up each chair ....easy to assemble but i took my time to get it right and make sure they were well put together and sturdy ...for the price i am MORE than happy and pleased ..thankyou", 
    "I've had these chairs for more than a year now and they've held up well. They wee very easy to assemble and they look like real leather. I must say that we don't sit in them daily and probably not even weekly so I can't say if they would last as long if they were your primary dining chairs. But the quality is good and the price was right.", 
    "Only had them a couple of weeks, so time will tell, but so far I LOVE them. They look beautiful in our breakfast nook and give the room a splash of color. Very comfortable, too.", 
    "I have been wanting Red Dining Chairs for 4 years! I found these and they are perfect. Sturdy and a great value, look marvelous with my black and white dining set!", 
    "On time delivery, easy to assemble, tres chic and I love them !!", 
    "These chair are hot! I purchased 8 (4 sets) for my extended dining room table. Love the sleek design, awesome color, and great price. Was hoping that they would be true to color and they were. My husband assembled them all pretty quickly. We haven't had any problems. Just wipe them off and they are good to go. Would definitely recommend.", 
    "Easy assembly. Just make sure notbtomtighten the screws until you have leveled the chair legs by placing all 4 on a level surface. Then tighten.", 
    "Love the color of the chairs and got them at a good price.", 
    "This fit in exactly hoe I want it", 
    "Under sized chairs. Srew holes cheap need to reset.", 
    "very impressed with my purchase.", 
    "Love my Red chairs!! I may get more... Just saying:)", 
    "WE ARE VERY PLEASED WITH THESE CHAIRS, OUR DINING ROOM LOOK VERY NICE", 
    "The red was just what I wanted, a little darker. It was real easy to assemble. Didn't need any extra tools. Feels comfortable to sit on. Looks great. Am satisfied with purchase.", 
    "We bought these chairs to contrast 4 brown chairs for our dining room table. They look and feel amazing. The quality is great.", 
    "easy to assemble. sturdy and good quality pleather", 
    "These chairs are perfect for the dining table or a desk. Love them for additional seating when needed.", 
    "Hard to put together some holes did not line up right. One of the two has come apart already", 
    "I started off with two to test them. I like them a lot, so I will order them again.", 
    "For price . good. Looks great in son sports man cave home.", 
    "I ordered these chairs to use in my dinning room instead of folding chairs and ordered them in red to add a little pop to the room. I love them! They look so expensive and they are very well made. Thick cushion to sit on padded back. Just love them would highly recommend them. Everyone who visits compliments me on my chairs. I am beyond happy with this purchase!!!!", 
    "These chairs are gorgeous. They have to be assembled but it is very easy to do. My only problem is that the chairs are a bit flimsy. One of the chair legs is wobbly even after I tighten it.", 
    "Not pleased with these at all had to return them because they were not well made", 
    "Sturdy chairs. Feels great to sit on and look great!", 
    "Have had these chairs for over a year. Light weight. Have had to re-tighten the screws a few times. Look nice. Comfortable. I would buy them again. Great value.", 
    "VERY HAPPY WITH THESE CHAIRS", 
    "These chairs are just the right size, sturdy and look great!", 
    "Very easy to assemble and love the feel of the faux leather. Perfect dining room chairs!", 
    "Comfy and sleek bought for poker table", 
    "Bought these to replace white material dining room chairs and to add a pop of color. Wow these were better than I expected. Bought 8 to replace 6 and they make my dining room look elegant. Love them.", 
    "Red color is cute and cherry!Nice firm seats....very comfortable!!!", 
    "small and quality is not that good", 
    "I was really happy with outcome of my purchase. I really loved it", 
    "I was very pleasantly surprised by the quality of the product based on their price. I bought them for my kitchen dining area, they made such a statement!! My area was transformed by the beautiful red color. The picture depicted the color correctly. As a designer, I know that pictures don't always show the color correctly, but this one does.", 
    "Chairs are a good deal for the price. They were packaged well. My husband and I were able to put 6 of them together in about 2 hours.", 
    "Great color! Comfortable and easy to put together.", 
    "Our old dining room chairs were sagging something fierce. With 3 small children, there was no way we were going to buy expensive dining room chairs, but we needed them to look and feel great as we have many guests. Overstock Villa Faux to the rescue. The chairs add a pop of color to our dining room, are comfortable, and inexpensive. We have had them for several weeks and everyone is happy. Out of the 10 chairs we bought (I told you we entertain!), two had minor issues (a seat cushion had a dimple, and a leg did not have a screw receptacle) but overstock customer service was great and replaced them fast and without hassle. And with the extended warranty for **.** bring on the kids!!!!", 
    "great quality and very comfy!!!", 
    "I absolutely love my new chairs for my dinning room. It added the perfect Pow of color to the room! The price was awesome and so is the quality!!", 
    "Legs were very uneven on one so I sent it back. Awaiting replacement", 
    "We actually have SIX of them!!! Red fits perfectly with our decor", 
    "but upholstery on one chair (I bought 2 sets) was not cut precisely, and the cut showed on the back of the seat. Still, comfortable and very worth the money.", 
    "Good quality, easy to assemble. Definitely worth the money!", 
    "I've only taken out the box to examine one out of 8 ordered. I'm waiting for remodel completion to decorate my living room.", 
    "Great looking chairs, sit well, appear quite durable.", 
    "These 2 chairs are very sturdy and looks great in our dining room. They were easy to put together and delivery was expedient. Thank you so much. Will buy from again.", 
    "Absolutely love these chairs! I bought 6 for my farm table and they look great. They weren't that hard to put together. Great red color. You won't be disappointed.... I get allot of compliments.", 
    "Very nice chairs Color and size is great. I put them together by my self no extra tools needed.", 
    "nice chairs, comfortable and well priced", 
    "They are a little narrow then average chairs but you get what you pay for. The red is awesome. The pop of color does the room great. I hope they last...", 
    "Love these. Easy to put together. And beautiful.", 
    "Rather cheaply made but look nice. Won't be a long lasting product but comfortable for now.", 
    "I bought these chairs in May and already one of the chair legs broke because of the cheap workmanship. I am very dispoined.", 
    "one leg missing out of six chairs! otherwise a great experience.", 
    "We really like these chairs. One was not in great shape, but Overstock customer service stood by their product. Very comfortable. Love the deep red color, too.", 
    "I am truly disappointed with these chairs. They look nice but do not try and sit in them the legs are very low quality and broke very easily", 
    "These chairs are a dark beautiful red shade. Unfortunately, when we first received our order one of the chairs was damaged. Thankfully the supplier did send us a new one. The chairs are a little difficult to build for some reason there’s always one leg that gives us a problem. We’ve had them for a few months now and for the most part they have been nice and sturdy.", 
    "We had bought these chairs a few years ago and they were great - a really good chair for the price. We reordered these chairs earlier this year and they are awful…horrible quality - the legs keep breaking off and in fact the wood on the legs look split before we even put them together. The leather material is also much cheaper…going to try and return the 24 I still have that are boxed up.", 
    "Perfect! Just what I was looking for.", 
    "Functional and attractive.", 
    "nice for the price, I would buy them again", 
    "So glad they were sold in pairs. Very easy to put together, excellent price. I was so glad they were not a fire engine red, perfect shade to give some color to my rustic table", 
    "These are worth the money. Great value! I thought the red would be more of a wine color but they were easy to put together and very comfortable.", 
    "I really like the high backs & they were easy to put together. Look nice & more expensive then what they were!", 
    "love the chairs They are used for the head of the table and are very comfortable and my husband says yesss!!!", 
    "great color, goes together easily, smallish", 
    "For the price, I guess it's not that bad. But rest assured this will not stand up to vigorous use. As mentioned in other reviews, the drawers do not glide as they should and I anticipated them falling off track.", 
    "Can't beat the quality for the price. Very comfortable!", 
    "These chairs are poor quality. I wasn't looking for anything too nice, just some simple chairs I could use around my small dining table, so I bought 2 pairs of these and within 2 months of getting them 2 of the chair legs have broken, making the chairs unusable as they easily tip over when sitting on them. The legs are not made of wood, just a lightweight material that is not sturdy at all. Also, after unpacking them, the chairs smelled of vinyl for a couple weeks, which was unpleasant and slightly annoying - the scent did dissipate after a little while though. I do not recommend buying them - wish I had just spent a little bit extra on a more quality product. Will see if I can possibly return or exchange.", 
    "These chairs are really nice. I absolutely love them. They are prettier in person and are very sturdy! Happy that I found them on here. The price was right also!!", 
    "I have had these chairs for about a year. Except for their poor construction I like them a lot. However, the legs are held in place with bolts. Yhey loosen up every couple of months and must be tightened. Easy enough if you have a good 6 mm allen wrench ( certainly not the useless little one that came in the box) Yesterday, both front legs on a chair collapsed. I found that the wood corner braces to which the legs attache were spliting and detaching from the frame. I made new braces, used more screws and wood glue to attach the frame rails braces and to the seat bottom. I hope it will hold up now. But I will have to be more carelul to see when something is loose and tighten it up before it fails. Good furniture is put together with dowels and glue and should last decades. This is NOT quality furniture, but the price is great, the vinyl covers are durable and comfort is good. They also have a nice style with a subtle curve to the backs. The color is a subdues burgandy", 
    "Very happy with the dining chairs…chose the red and love the pop of color in the dining room. Good value.", 
    "The chairs were easy to assemble and seem sturdy. The seats are a little firm but we have only used the chairs about a month. They are a crimson in color not a true red. They match my kitchen well. I may order two more.", 
    "Great deal, loving my new red chairs", 
    "These chairs are exactly what I expected. Their quality is good and were delivered quickly and efficiently. Assembly was a no-brainer. I would definitely recommend them to anyone.", 
    "I ordered these chairs to replace another set that I had and LOVE them. I've received many compliments for the pop of color they add to my kitchen. They were easy to assemble and sturdy.", 
    "The chairs are really easy to assemble. Took about 10-15 minutes to assemble one chair. Gorgeous color and they look great in my dining room.", 
    "Seat cushion is narrower than expected, but chair is well made and easy to assemble, sturdy and durable.", 
    "Amazed at how nice these chairs are for the price. A deep red lipstick color, easy to keep clean, good quality. They're the perfect height for our slightly taller than normal table. Definitely recommend.", 
    "These chairs work great with our kiddos, they clean so easy! The only con I see is the legs have come loose on one chair a couple of times, may need locking washers to help keep this from happening. Otherwise great sturdy chairs!", 
    "Very easy to assemble, sturdy, comfortable and super attractive - especially for faux leather. The red is a gorgeous, deep rusty red - not a blue/pink red. Beautiful!!!", 
    "Packaging is always skimpy but these have worked well. Easy to put together. Not as easy to level but worked out ok. For us a great fit. We won't use them everyday - they were for extra seating", 
    "The chairs are great. However, the box arrived later than expected and ripped open with one of the bolt bags torn open and 3 bolts missing. I don't know when or where this happened but it doesn't speak well of the system at large. Luckily, I had bolts and was able to put the chairs together.The chairs themselves are OK.... I wouldn't used them in high stress, frequent use situations but to add to a few times a year used dining room set, they're perfect.", 
    "Beautiful color, easy to assemble, great buy.", 
    "These chairs arrived on time. Packaged well. They are sturdy and I have not had a problem with them.", 
    "Looks just like the pictures", 
    "Very wobbly. Even though they send a troubleshooting page for wobbly legs, any adjustment made just didn't seem to do the trick.", 
    "The color is very close to the pics. My teenage son put all six together, by himself...took some time but relatively easy (from what I observed from afar). They seem sturdy but I would not trust them for anyone who is well over 200lbs. I'm impressed with the quality of the \"leather\". Really great looking chairs...glad I got them.", 
    "Easy to assemble, quality is great, it can wobble a little if you are not sitting and just hold to it, but very stable when you sit and you cannot tell at all it will wobble until you move it around. However, that could have do to bad assembling it, Lol. Very nice looking! Love the rich red!", 
    "On Four Chairs that I bought one leg from each has broken by where the leg bolts into the bottom of the Chair! it is not a tight fit that allows for some wiggle room and then the leg snaps where the bolts go through to secure the leg to the chair seat. The Chairs are beautiful! Just not well constructed with substandard engineering.", 
    "I always get compliments on the chairs, They look great and you can't beat the price,", 
    "With Club O discount got 6 of these chairs for under $***. They are sturdy, attractive, don't look like cheap faux leather. Color is a little brighter red in person, but still look great with my pink/black granite table. Bit of a hassle to assemble which is why I only gave 4 stars.", 
    "I do love my new chairs. That said, they are smaller and lightweight. They are not perfect. And they are truly difficult to assemble. I bought 6 to replace crate & barrel chairs I bought 7 years ago, and all 6 cost the same as one of those chairs. My expensive chairs were bonded leather and the leather was peeling off every single one of them (and everyone else noted the same problem on the crate & barrel website). So I am absolutely not a fan of expensive dining chairs (because the value just isn't' there over time) and while these may not last 7 years, I won't be upset. I'll probably be ready for a change. The problem with assembly, as others have noted, is that the guide holes do not line up. If you are persistent, keep all bolts loose until they all catch, and have a 2nd person helping to shine a very bright light on the area as you struggle to align them, it will work. My husband was so frustrated he would only put together one each night. But now that they are assembled he is happy with them too. I would buy them again. And they look amazing.", 
    "Easy to put together. Nice color. Adds to my dining table.", 
    "We love the chairs and they are very solidly made. The assembly wasnt too bad", 
    "These chairs added an element of class to my dining area. I like that they are easy to wipe off and keep clean. I have noticed that the fabric is stretching already and we have only had the chairs for 2 months. They seem sturdy enough for my petite family but wonder if they will be able to hold the 250 lb weight limit. Overall for the price that I paid I am very satisfied.", 
    "These chairs look so much richer than what we paid for them. They are a nice color of red...not too bright, but not burgundy either. A rich warm red. They were easy to put together..even with a husband helping with a broken arm, they are a good size for our kitchen table and really brighten up the space.", 
    "Great color quality for the price. Bought these for the durability and easy cleaning until the kids leave then I will upgrade to something more expensive and higher quality.No regrets.", 
    "It's very hard to match reds, but when I received these chairs they matched my kitchen decor perfectly. The were easy to put together and are just wat I wanted.", 
    "Beautiful deep red color and when paired with orange and lime green, made for a colorful dining area. Quick delivery and assembly. Check holes before assembly for any fabric/foam obstruction. Great price value!", 
    "I bought these for my Mom. Gorgeous chairs! Look expensive too! My Mom also saw them featured on Let's Make A Deal TV show & they even wowed her there! My brother said they were easy to assemble also. Don't pass them up! Saw them offered in a pretty wide range of colors such as this red, lime green, white, espresso & black!! Excellent $$ for a set of TWO!!", 
    "It took a friend about 2 hours to put 4 of these red leather chairs together, but once together,they are just what I needed! They are sturdy, comfortable, and well (!) worth the money.Do not hesitate to grab these for the price. PS: The red is a rich deep red, not burgundy, not red-orange.Just right!! Very rich looking. Goes great with my glass topped dining table!", 
    "We love these chairs! The red is a deep color, the faux leather looks real, and they add a wonderful pop of color in our dining room. The reason I got them was for comfort - our old chairs were wood and uncomfortable to sit on if we wanted to linger over dinner with guests. These chairs are super comfortable and I'm VERY I ordered them! Service was speedy. Assembly? Not hard to put together, but I had my son come over and level them out. Perfect!", 
    "The chairs are still in the box and will not be assembled for awhile. We purchased them in advance of a remodel in our home. They look like two other chairs I have purchased elsewhere (this was my reason for choosing them), however the other chairs need additional re-enforcement for assembly than what was provided or suggested by the instrustions. Therefore I am assuming the quality of this product will be similar and we will adjust to that as needed.", 
    "They are beautiful chairs,but they arent for everyday use.Legs are not level.The good thing is, that a called and explained the situation to a representive,she was very helpful.She ask me if i wanted to return them or if i wanted some kind of compasation.I didnt wanted to return them,so she provide me with a credit ,for the inconvinience.", 
    "Nice shade of red giving the right amount of color to my dining area. Good value.", 
    "I have had my eye on these chairs for quite a while and finally decided to get them. I bought 2 sets (4 chairs) in red. I put the chairs together myself (it was very easy) The color, style, and quality is awesome! I think this might be my favorite buy so far. Thank you Overstock!", 
    "Beware! The expression \"you get what you pay for\" never seemed more appropriate. These chairs were very inexpensive and a great deal, but if I had known how difficult they were going to be to put together I would not have purchased them. It took me almost 5 hours to put 6 chairs together, mostly because the holes didn't line up very well. Also, the quality isn't that great, the padding in the back is very thin. At some point I will definitely replace them with better quality chairs, but for now they will do.", 
    "I bought 4 of these Villa Red Leather dining chairs. I could not be more pleased. They are comfortable and feel very stable. I assembled them myself and I am not the family assembler. The first chair took about 30 minutes but once I had that one done the rest took about 15 minutes each to put together. I am so pleased with my purchase. I recommend these chairs. They look really good in my kitchen and they are far and away more comfortable that what I had previously. They fit under my table when not being used and they wipe up nicely.I was grouting a mosaic project and that grout goes flying. I noticed it was all over the backs of some of the chairs and they cleaned up with a damp cloth. I was able to buy 4 chairs for right around $150 with coupons and overstock dollars. You can't beat that, combined with free shipping. A super great deal. I love overstock. I am a happy woman.", 
    "I bought six of these for our kitchen dining area and everyone loves them. Could not be happier.", 
    "Excellent quality for the price. Easy to assemble. Clear instructions. Saw chairs similar to this for twice the price elsewhere.", 
    "Awesome chairs! See my first review on the Villa Faux Brown Leather Dining Chairs. Please do not second guess purchasing these chairs at the amazing price they are going for. You will not be disappointed! I absolutely love them!!", 
    "Chairs are a great value for the money. They were a little difficult to put together but they fit wonderfully in our dinning room and make it seem much more modern with our older table.", 
    "Perfect chair very well made and cannot beat the price for it!", 
    "I bought these chairs in 2012 and are constantly having to tighten them. Plus I had company over and chair just collapsed.", 
    "For the price, these are good quality. I am perfectly satisfied!", 
    "just be aware that the legs need to be tightened regularlynot good for heavier people, legs could collapse", 
    "I love my chairs, brought 2 red chairs and 2 black chairs. Wasn't too sure about purchasing them online but couldn't turn down the price. Easy to assemble, only thing is I have to tighten one of the chairs up often,maybe because my 6 yr. old likes to ride on it...lol. the chairs look and feel great. Only 1chair the wood was broken and prevented the leg from being tightened,otherwise I love them.", 
    "I love this chair! Very comfortable, soft and easy to assemble! Nice color as well...", 
    "Love these chairs! Couldn't believe the excellent price for TWO chairs and the great qualify!! Thank you Overstock!", 
    "These are stylish and pretty. While they are not leather, they do not look cheap. The seat is not too generous, so if that is important you might reconsider otherwise I would recommend. I did have a problem with the seat support beam cracking when I knelt on the chair but looks like they are sending me another seat", 
    "We took a leap and bought 6 of these chairs. They were half the price of similar chairs we could get locally. We loved them so much, we ordered 2 more. They come with very easy to follow picture assembly instructions, and we had them together in about 10 minutes per chair. The fabric looks like real leather and feels great (but we haven't sat on them in summer, in shorts just yet). We have 4 kids (2 teenagers and 2 tweens), and we are pleased with the chairs' construction. We did not order these chairs to last a lifetime, but for the price, we feel like it was a great buy. The red \"leather\" looks awesome with our dark brown table, and the width of the chair gives us plenty of room between chairs.", 
    "The chairs are well made and the color looks really well in my dining room. Had many positive comments about them. I would recommend them.", 
    "We couldn't be happier about these chairs. They were exactly the color we were looking for: darker not brighter red. They are well made and look like leather. For the money, this is a fabulous deal.", 
    "Chairs are easy to put together and look very nice. They feel solid in use and I would definitely recommend. Very good value", 
    "Very easy to assemble and quite sharp looking. The color is rich and it is difficult to tell it is not leather. Excellent puchase", 
    "Good price and easy to put together, not to mention really good looking furniture.", 
    "These are very nice chairs. Easy to assemble and easy to adjust if not level on all four legs. However, double check the quality of the chairs you receive! I assembled mine the day I got them and on one I had to keep tightening the bolts because it kept becoming wobbly. I never overtighten anything so I just assumed I didn't tighten the bolts well enough. This went on every couple of days for a week before I was fed up. I took a good look under the chair and realized the metal holes that the bolts screw into were coming out of the wood! So the more I tightened the more the bolts came out. It was impossible for the chair to not wobble. I ordered these chairs 9/6 and the replacement leg is scheduled to arrive 10/1. It took a week for them to arrive, a week to realize the messed up leg, and a week for the new one to be delivered. Don't order these chairs if that is too long for you. It is my personal opinion that if a company has to deliver a replacement part at the very least it should be shipping via 2-day shipping at the least. Now I have a 3-legged chair I have to take extra care with so it doesn't become further damaged while I wait for the new leg. 100 dollars for 2 chairs? I still might return them.", 
    "Got these chairs for my sons to match overstock's gray student desk. needed a high comfy chair without wheels for my young kids. so comfy, easy to assemble, high enough and worth it! Couldn't believe price was for 2!", 
    "These chairs were not the right color for what we were looking for. The color is much more lipstick red, not cinnamon red so they were returned. The return process was very easy. Great customer service.", 
    "Good chairs, I don't think they will last too long, but for few years, it will be fine... for some reason mine got scratched in few places but with kids you never know... they are not super expensive, so I am happy with them.", 
    "I love the color of red....it is a darker, deeper red which is what I was looking for. The quality of the chair is very good for the price. I put the chairs together by myself and it was quite easy. The pre-drilled holes for one of the chairs was not lined up correctly so I have yet to get it together. I also found it pretty easy to even out the legs. I haven't contacted Overstock yet about the chair so I cannot comment on how the return process works. Overall, I love the look of the chairs and it compliments my room décor perfectly.", 
    "Our kitchen needed a little energy and the vibrant color of these chairs supplies just that. They are lightweight, easy to assemble and the color adds life to the room. I was worried when I purchased them, almost settling for brown but I am thrilled with my lovely red/brown chairs.", 
    "First time I bought furniture online. Chairs arrived in excellent condition and color was exactly as displayed on site. A very difficult color to find. Most other red chairs are bright lipstick red while this is more subtle. Have received many compliments. Blends very well with my table and other furniture in the room.", 
    "These chairs are great. They're easy to assemble. Leveling takes a few minutes, but is not difficult and I think would be even easier if you have two people. The quality seems high and the chairs are very comfortable. The color is lovely. They're not bright red, but not burgundy either. Another reviewer described them as \"lipstick red\" and I think that's just about right. I have them in a breakfast nook with this table, http://www.overstock.com/Home-Garden/Udine-Espresso-Breakfast-Table/2481097/product.html, and I'm very pleased with the appearance and quality for such affordable pieces.", 
    "as an interior decorator i purchased this set of chairs with a context dining table..clear table top. they look great over a bold black and white damask rug. the color is a nice rich wine red so it really tied in very well. a great buy, even better look.", 
    "I purchased four of the Emma Paisley chairs and needed something brighter to match the deep red colors of my small open great room without adding more busy fabric patterns. These Faux leather red chairs fit the bill. They integrate the muted tones of the Emma Paisley chairs and accentuate the muted reds over the predominant hunter greens and rusts plus they're smaller than the Emma and take up less of a footprint. Surprisingly all the chairs work well together and the deep red solid Faux chairs \"tone down\" the patterns of the Emma Paisley and my paisley and striped pillows. The one problem with mixing these chairs is that though both sets are supposedly walnut brown legs these Faux leathers have the typical Parson espresso colored legs while the Emma has the dark brown walnut stain--which no one seems to have noticed but me. These chairs are at the end of the table and are \"extras\" when we have more than the typical 4 people for dining.", 
    "I ordered the faux red villa dining chairs. These chairs were very simple to assemble (very few pieces), but took a bit of coaxing to get the legs level. The are fairly \"firm\" yet still comfortable. They are also fairly petite (narrow towards the seat back) so that is something to consider if you have larger family members.", 
    "The chairs arrived on time in excellent conditions. Very easy to assemble. Chairs look expensive for the price.", 
    "The chairs are nice but trying to level the legs made things somewhat difficult. I had to call my nephew to come over and help me , I was only able to put one chair together. I ordered (4) chairs. Even though a couple of chairs aren't perfectly level, I am very pleased with my purchase. They look great!!!", 
    "After ordering a set of ivory dining chairs, I changed my mind and decided I wanted a pop of color. Against my white accent walls, these chairs look amazing! The color is exactly what I expected and the quality is great! I have a set of real leather stools and these are very comparable. It does not feel like cheap plastic faux leather. We have a bench paired with our dining table, but I am seriously considering another set. Love them and for the price.. even better! I am a woman and it took me 30 minutes to put the set together.", 
    "The recommendations for assembly is very good. Once you put the first one together the others are easier. We stopped using the allen wrench provided and used a socket with a metric allen wrench in the socket. This was much faster. Otherwise the quality of the chair for the price is very good. We are pleased with the results. Remember when you put in one for the quantity you are getting TWO chairs. So four chairs would be a two in the quantity area for the order.", 
    "I recently did a \"spruce up\" for my kitchen. I added these chairs with other red accessories and they completed the project. Perfect!! In addition to asthetics they are comfortable and do not look like faux leather.", 
    "Very lovely chairs. See sturday enought, although they are pretty lighweight.", 
    "Chairs for my husband man cave great construction and value.", 
    "Easy to put together and very sturdy. They look great! Like they cost a lot more than they did :)", 
    "we would recommend. seems like they are made good. We have ordered 5 sets of different chairs from overstock . seems a couple in each set need shimmed on the legs. Nice if you have someone handy in the family,", 
    "My husband and I are very pleased with these chairs. The color was hard to see in the picture, but it is a very dark red, not burgundy, red, it is beautiful. As the other reviews mentioned, the chairs were pretty easy to put together except for one set of holes did not match up so the chair is a little wobbly. However for the price it is worth it.", 
    "We bought the chairs for daughter's first apartment small dining area. They look nice and are sturdy. We had seen the same chairs at various retail stores priced higher. The chairs arrived with some of the screws missing for one of the chairs. That is why I rated it 4 stars. My husband is handy, so we had some screws on hand that fit. He then put them together with no trouble and in a short time. However, I don't know that my daughter and I could have done the job without him. You do need the proper screw driver. My daughter and her room mate have had the chairs for about 2 to 3 weeks and use them daily. They have said nothing negative about the use and comfort.", 
    "My dream chair, my cats dream scratching post.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Villa-Faux-Leather-Red-Dining-Chairs-Set-of-2/6055446/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6055446/Villa-Faux-Leather-Red-Dining-Chairs-Set-of-2-b3bece21-0268-416c-b847-9efc30057a4c_600.jpg"
  ], 
  "description": "Transform your dining room with these faux leather bright red\nchairs. The daring red color adds character to the space they\noccupy. Dark walnut wood can coordinate with similarly finished\ntable and cupboards to complete a room with a modern feel.Set of two chairsMade of red faux leather and dark walnut-finished pineFilled with fire retardant foamSeat backs measure 20\" highChair measures 39\" H x 22\" W x 18\" DStyleContemporaryMaterialFaux Leather, Pine, WoodChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightHigh BackBack RestYesColorRedFurniture PatternSolidSeat StyleUpholstered"
}