{
  "name": "Villa_Faux_Leather_Black_Dining_Chairs_(Set_of_2)", 
  "price": "EUR 92.58", 
  "reviews": [
    "I did a lot of comparison shopping before purchasing four of these chairs for my dining room table. Wow, am I glad I went with these. They are absolutely beautiful. They look like real leather. They are very comfortable and I can tell their construction is of very high quality. I put them together myself (I am not very handy) and it was a breeze. Highly recommend these!!!", 
    "I shopped ... and I do mean shopped before making the decision to purchase these chairs. You will not be disappointed. They are very comfortable, easy to assemble and look amazing. We originally ordered two and like them so much we ordered two more.", 
    "Great buy, looks even better in my dining room than I expected. I'd been on the fence about new dining room chairs for a while and after no luck at the outlet furniture stores (too much $$ or no selection) I decided to try Overstock. GLAD I DID, LOVE THESE CHAIRS - nice looking, good value and they're super comfy.", 
    "These chairs are perfect to have with children. The spilled food wipes right off. No stains....what more could a gramma ask for.", 
    "A friend of mine ordered these chairs and for the price I liked the style and color so I have ordered some for myself. I have also told people about your website so look for new customers. Thank you overstock for your continued service.", 
    "I have been waiting to add to end chairs to my dining room set. All the chairs I had looked at previously were out of my price range. I wanted something different from the side chairs to my table. I chose these because they were black with a simple design. They have the look of leather and are quite comfortable. Assembling was very easy and the directions were clear. I am very satisfied with this product", 
    "Very pleased with appearance, comfort and sturdiness of the chairs. Will be ordering more to replace 4 other chairs.", 
    "Assembled these two chairs in about 15 minutes. Very easy. Chairs are very nice looking and comfortable. Highly recommended.", 
    "I bought a set of six chairs as a housewarming gift for my daughter's new home. She had already bought the dining room table elsewhere. These chairs went perfectly with the table. We were very pleased with the quality and the look of the chairs.", 
    "Bought these chairs for a black wrought iron dining table - they are perfect and update the table beautifully. The leather \"look\" could fool you - they look like real leather chairs that cost 3 times as much. In addition, they are extremely lightweight. Very easy to pull out from the table to sit in. Other similar chairs I have seen are much heavier and bothersome to move, especially if vacuuming under the table. I will be buying another set to complete the seating at the table. With no tax and virtually free shipping you cannot beat these chairs.", 
    "These chairs were easy to assemble and look great in our dining room. I ordered 2 sets, and I am getting ready to order another pair. Lots of compliments over the holidays. Great buy!", 
    "chairs were exactly as i expected. assembly was a snap", 
    "We bought four chairs for our dining table. They were easy to put together and have a nice, clean appearance. Comfortable seating, and natural looking faux leather.", 
    "We had no trouble putting the chairs together. They go good in the dining room as extra chairs.", 
    "Love the chairs, very beatifull, beatifull black leather bery easy to handle and very elegants..", 
    "Like so many people, I was nervous about ordering a set of chairs on which I never sat. These chairs are very comfortable for my frame (female, 5'4\"). They are a nice size for the small sunroom/dining area of our townhouse; not too large and definitely not bulky. The brown legs are a perfect match for the round table with glass top and dark brown legs shaped like an \"x\" that I bought on sale at a store that's the synonym of \"dock\" one. I put them together myself and all the holes matched up, much to my relief after reading about the trouble that other people had.", 
    "These chairs look great out of the box and are simple to put together. They are very lightweight. Sadly, the way they are designed makes it nearly impossible to tighten the screws tight enough on the legs to keep them from wiggling and finally collapsing under about 180lbs. If you try to tighten the screws, the wood splits. And this isn't just one chair this happened to. 6. Yes, 6, needed to be repackaged and sent back to Overstock. Overstock was great about it, but what a waste of time and energy (and money to pay for the boxes to ship the chairs back). Unless you are a tiny human or buying the chairs for use by children only, do not buy these chairs. They are fine to look at, but when used on a daily basis, even for a week, they will not hold up. Most of the reviews I read on them talked about how great they looked. They look great. If you want to actually sit in them, don't waste your money and time.", 
    "When we received the first set, one was severely damaged...scratches in the wood legs, vinyl scratch and the vinyl where it had been stapled was loose. It was obvious someone had sent it back and they forwarded it on to us. Overstock sent a replacement...great customer service, but slow to get confirmation on the shipment. The replacement they sent us was damaged...obviously it was not checked. The wood leg was bubbled out about two inches in diameter. Overstock customer service was frienldly and said they were sending another replacement, but I am still waiting. I let them know how important it would be for someone to check the quality of the replacement part.", 
    "We got these chairs very quickly. We opened the boxes and found all the legs and hardware under the bottome cover, and immediately started putting them together. My 15 yr old and I did it in about an hour. One of the four chairs has one hole that will not line up at all, but the rest of them went together pretty well as expected. I use the chair with one less holding screw in my youngest son's spot (since he weighs the least). These make my old dining set really liven up. I love them.", 
    "These chairs are great and look like leather. We love them!", 
    "Other than parts missing, this was a great find on Overstock", 
    "I was worried the quality would reflect the price I paid for these chairs (super cheap). I was pleasantly surprised. They are nice, the \"leather\" is soft and true to color. One leg of one of a total of eight chairs was wabbly but that is my only small complaint. I just added an extra floor protector thingy to the short leg and now it's perfect. Not bad for 8 chairs with 4 legs each, 1 out of 32 with a slight flaw. I could not be happier.", 
    "I particularly like the six chairs we ordered because they are not too wide, and therefore make it more comfortable to have many around the table. They look great, and are very comfortable.", 
    "This pair of dining chairs represent very good quality for the money. The assembly was quick. There were no issues with the condition of the upholstered material or the wood legs.", 
    "These chairs are such an amazing value. No issues with construction/quality. Maybe I got lucky, I don't know. They seem to be sturdy and after 3 weeks still no problems.", 
    "When the chairs arrived, I followed the directions, and surprisingly enough they went together easily. It took me about 2 hours to do six chairs. Once you get it figured out it is simple. These are sleek affordaable chairs. I put them with an antique library table and it looks fabulous! Honestly, I found similar chairs in the furniture stores for tow and three times more. Plus, they charge for delivery! One note: make sure you actually measure out the deminsions on the chairs. I found so many different sizes and shapes. I was happy I took time to measure my table and mapped out the exact size of the chairs", 
    "I absolutely loved the chairs and once I purchase a new dining table I am goin gto get 8 more of these chairs a true bargain.", 
    "really happy with this product!!!! assembly was not that difficult. the chairs are very sturdy and look exactly like the picture.", 
    "These chairs were just as pictured and were very straight forward to assemble.", 
    "I really like our four new chairs. They are light weight so they are easy to slid out from table, yet they are sturdy and sleek. We have a small dining space and these chairs fit perfect for our needs. The faux leather not only looks good, but easy to keep clean. An \"Allen wrench\" is included, so it only took a few minutes to assemble each chair. I would recommend these chairs to anyone looking to update a small space. For the price, you can't beat them!", 
    "I am very satisfied with these chairs. They were easy to put together and are very comfortable. The quality is great and they look very nice.", 
    "The size of these chairs is perfect for my kitchen. They were fairly easy to put together and so easy to clean (which is the reason I wanted them in the first place) Overall I am very happy with this purchase, the price was right and the product is very good.", 
    "Has an expensive look. Very nice and comfortable. Light weight. Easy to put together.", 
    "easy to assemble,first time to assemble & i don't have good grip but it took me 15 mins for each chair to finish, i bought 4 pcs, the only problem is the last chair, it has missing bolts & washers but they immediately sent the parts, when i complain about it...i'm happy with the chairs, it compliments my house motif...and most of all the shipping company they use is UPS which really did a good job, right in my door and knocks, to inform me that my order arrived, unlike the other shipping company...good choice Overstock & good product...", 
    "I have had these chairs for 3 months now. I was leary as they will be used as our primary kitchen table chairs. So far they are great !! They were easy to assemble. They look great and can be wiped clean very easily. I am now going to order 2 more. Great chairs for the price!", 
    "These chairs are light in weight, but sits good and looks good.", 
    "Wonderful deal- much cheaper than any other place and the quality seems great. They assembled easily. The holes on 1 seat did not line up and I need to get help drilling a wider hole.", 
    "The chairs came promptly and looked as described. I immediately put them together. And it was not difficult even for me who is somewhat mechanically challenged. The tool for assembling was included. A couple days later I had to tighten again a little bit as chairs had loosened with use. My only concern is that they are rather slick when sitting on them. My dog fell off the chair due to the slick leather seat. But mostly I think they are great looking and comfortable at a very affordable price. A friend was with me when I assembled them and she is going to get them for her son's apartment.", 
    "I am glad I listened to the reviews here! These chairs are great. I ordered two sets for a total of four chairs and them came quickly and were packaged well. After I had the first chair set up, I completed the others by myself in about 10-15 minutes each, very simple! They look awesome. My table is slightly country/rustic and these chairs pull a modern-rustic look together very well. The only problem I saw while assembling these chairs were that not all holes were equally as precise-- in some cases I had to push a screw through the hole to punch out some left over wood. In other cases I had to play a game of \"place this screw in loosely, tighten legs, tighten first screw, tighten legs again, if that makes sense. It wasn't this way with all 4, this is more of an assembly tip than complaint! Overall, I would recommend this chair to anyone looking for faux leather chairs! They're awesome for the price.", 
    "Great products and good delivery timing. I am very satisfied. looking forward to my next purchase.", 
    "Great quality chairs, look good, very comfortable, easy assembly. No complaints whatsoever. Look great next to my Crate & Barrel table :)", 
    "I was looking for chairs that didn't cost that much, that could easily be wiped off and were comfortable. I have kids and have struggled to find the balance of practical, yet stylish. These will be great for our small kids- so easy to wipe off and looks great with our table. The price was very reasonable. We didn't have any trouble putting them together and the legs seem sturdy, however, I wouldn't try to put a lot of weight on them. They are very sleek and not at all bulky, yet there seems to be enough support. I love them!", 
    "We've now ordered four sets of these chairs (6 chairs for the dining room and 2 for the office). They look great and are actually very comfortable. We've only had them for about a month so we'll see how well they hold up but so far, no complaints.", 
    "I needed a couple of chairs to add to an existing dining set. We occasionally have additional guests and have to provide seating at the table. These chairs are comfortable for the purpose and neutral enough to fit in most areas of the house. can go in the office or game room when not being used in the dining room.", 
    "I ordered 4 chairs and loved them so much I ordered two more. The are easy to assemble, look great, are comfortable, and sleek. I was concerned they were too bulky for my Manhattan apartment but in fact they are pretty compact, just how I wanted them to be. They also cost much less than many chairs of this category. The chair legs once assembled according to the instructions (do not overtighten at first) are all level. Highly recommend,", 
    "These chairs are perfect. Great size, sturdy, easy to assemble, wipe clean w/ a damp cloth. I've paid $$$ - $$$ for chairs like these. Great buy.", 
    "I received these chairs within 2 days. I had hunted on overstock for quite some time to find what I was looking for. I wanted a chair that was sturdy and looked good but without the high price. This chair is it! Yes, you need to put the legs on, just some time. Having them on carpet is better than on hard wood, just seem more sturdy. Thanks for all the other comments that helped me make my decision on Overstock!", 
    "Very nice chairs, exactly as described. Couldn't be more pleased.", 
    "I would recommend the Villa faux chairs to anyone I ordered them for my daughters dining room . we had a table refinisined in black and these chairs just put the finish touch to the room .... They are awesome and worth the money", 
    "These chairs are beautiful and sturdy...I love them and am so happy with them. Easy to assemble and look great.", 
    "Love the product. Assembly was frustrating with one of the chairs, as directions were not very clear, and screws did not fit at first.", 
    "I was happy to see that these are the same style as the Villa Chairs I bought earlier. I bought the Dark Brown last time, and I saw the Black with the same name (Villa), so I took a chance they would be the same style, because I also wanted some black chairs for my office. These are very sturdy chairs for the price. They look good in my office. You should make it more obvious that these Villa chairs are available in two colors.", 
    "I ordered 4 chairs and i was able to put them together all by myself in a very short time.They look great with my table and are also very comfortable and look wonderful", 
    "a very good buy for the price. had to pull a few staples but overall not bad assembly", 
    "I ordered these for extra chairs in our home office that we could grab for extra seating in the dinning room, etc. I am very pleased with them. They look great and you would swear they are leather.", 
    "Bought so many of these for kitchen and dining room. Cannot beat the price and they look great and are pretty comfortable", 
    "I ordered six of these chairs for my dinning room. They have met my expectations so far. We will see how they hold up to wear and tear. These chairs are pretty comfortable for up to at least a few hours of sitting. The assembly was pretty straightforward although some of the holes did not want to line up. I would recommend buying these to someone that is interested.", 
    "Assembly is very straightforward--you really can't screw it up. The final result gives you stylish chairs that can take all types of spills and beatings. These chairs rock. They'll take your dinner parties to the next level. If your veggies are overcooked or your meat is dry, your guests won't eve notice because they're seated comfortably and having a grand time being around you.", 
    "Legs have broken off 2 of the 4 chairs I bought.", 
    "Perfect for a dining room table. Very sturdy", 
    "Great chairs great quality very nice", 
    "the chairs were very good quality and was delivered in a timely manner.", 
    "I love these chairs! They look like real leather and are very comfortable. A steal at this price.", 
    "I have had these chairs for about a year. We have had to repair them several times, the legs screws do not stay in. We have had to wood glue them back in because they pull out from the wood. I would not recommend these chairs if they will be getting alot of use. One of them we can not ever use anymore", 
    "Excellent, great value, fast shipping", 
    "So far so good. Easy to assemble. Makes the room look very modern and chic.", 
    "They finished off our dining room! Should have bought more!", 
    "I ordered these chairs couple of months ago and they were very good chairs, practical and simple and the same time", 
    "Its very small but looks fine, the leg broke while i was trying to assmble them", 
    "I needed a chair for a writing desk and got these two for less then I could find 1 ! Nice - say to assembly and just what I was looking for", 
    "These chairs are marvelous. I would like to order 2 more, but I noticed they are out of stock. Will they be in stock soon?", 
    "Chairs are exactly what I wanted. Was a little skeptical about purchasing furniture online but I was very satisfied with my puchase.", 
    "Bought for poker table comfy and sleek", 
    "It's just want I need for my home.", 
    "I have them for a few years and they still look great.", 
    "I received my chairs a week or so after I placed my order. The arrived well package and in tact. One I figured out how to put the 1st chair together it was fairly easy to put the other ones together. I encounter 2 issues the holes for weren't aligned properly for one and the other chair had a leg that was shorter than the others. I contacted customer service and they put in an order to replace the chair.", 
    "These chairs are wonderful. Love them. They were easy to put together. The holes lined up perfectly to screw the legs on and it was very easy. They look great and the quality is great! I would definitely purchase these again. I bought 4.", 
    "These are average chairs to have, I have problems installing the chairs, the holes were not lining up, but after calling the customer service they sent me a brand new one, CS is great and they support. I'm expecting to use these chairs for few years and replace them again.", 
    "LUV, LUV, LUV THESE CHAIRS, EASY ASSEMBLY AND FOR THE PRICE THEY LOOK GREAT AROUND MY TABLE. I RECOMMEND THIS 100%", 
    "While the chairs are lovely, they are crooked. Not one of the six I ordered have balanced legs. They are wobbly. I am trying to figure out how I can get all four to the same level.", 
    "Overall, I am very pleased with the chairs for the price that I paid. However, the legs are a little unstable but can be fixed. These chairs will be used occasionally, so I hope to have them for a long time. When I tested them, I felt that they are comfortable. They look beautiful at my dining table. Thanks Overstock!", 
    "Happy with how they match my other set", 
    "These chairs were easy to install and are very comfortable. They go well enough with our black and antique round pedestal table, also purchased from Overstock.", 
    "Tremendous value. Relatively sturdy, comfortable seat cushion, and they look great. Putting the chair together was a pain (holes /threads don't perfectly align) and the chair will likely not be 100% level. if you can get by these challenges, you'll really enjoy the chairs. People who see them think I spent $200 or more for each.", 
    "These chairs are not great quality and are smaller in the seat ( length wise) than you are led to believe because the back takes up some go the space. Not very comfortable either.Some of the legs WERE shorter and it came missing a nut. Fortunately we had a similar size in our tool box. They don't feel sturdy enough that I would let a heavy person sit on them. They are cheap and as I said you get what you pay for. For me these can only be temporary as they will surely not last. If you're going to use these chairs often DON'T GET THEM! I was hoping they'd be better than some of the reviews stated and that I would get the chairs where all the legs were even but that didn't happen. Again, they are not well made but for the price they are exactly what you pay for.", 
    "Very unsturdy no matter how tight you tighten the bolts.", 
    "These chairs are nice for the price. Packaged well. My husband and I were able to put 6 chairs together in about 2hrs.", 
    "Great buy! These chairs look high end. They were fairly easy to assemble. I recommend them.", 
    "They look great, easy to put together and very comfortable.", 
    "Great quality! Shipped in a timely manner. Very easy assembly", 
    "We were able to put together 3 of the 4 chairs we ordered without problems. The last chair however has one leg slightly longer than the other. As a result, that chair rocks. We decided rather than take it apart for the fourth time, we would just live with it.", 
    "Hard to put together. One came broke..others look nice", 
    "Great surprise for the price", 
    "decent quality very satisfied", 
    "I am new to Overstock.com and this was my 3rd item I ordered. I received these chairs yesterday and I am quite pleased. I was able to put them together by myself and didn't take me very long, maybe a half hour for both. I didn't have any wobbly problems like some mentioned in their reviews. I put the whole chair together, then tightened the screws and had absolutely no problem. They are the perfect height for my dining room table and look great. I am a very happy camper!", 
    "These chairs look nice and are comfortable enough to sit in. The problem is getting them to stand evenly on the floor. Of the 4 chairs we got, I had to return 2 of them because the legs just wouldn't align in a way so that the chair wasn't wobbly, especially without someone sitting on them.Even now, if you fully tighten the legs, the chair will be wobbly. So, you have to leave the screws about hand-tight to allow enough flex for all 4 legs to reach the floor. BUT, that also means that the screws work themselves loose. So, I need to regularly flip the chairs over and re-tighten those screws. This is not what I expect from a finished product these days.", 
    "I needed these two chairs for guests in my office. They're fine. They're nothing special. My daughter and I were able to assemble them on our lunch break with the tool provided. Considering their price, they're just fine. Hopefully they will last 5 years.", 
    "Somewhat a hassle to assemble but final product looks great and you really can't beat the value.", 
    "I bought 8 and took my time with the first one and putting together the rest was easy and less time than i expected. Under an hour for all 8. They are what you call getting your monies worth!", 
    "Not really a generous size.they look ok and sit ok until the backs and legs start coming loose which is constantly. Now one of them won't even tighten. You get what you pay for, they are cheap for a reason. Get better quality for something you use often", 
    "The chairs look very chic and modern. They are very easy to keep clean as you can just wipe them with a damp cloth. Ex elect value for the money", 
    "Thsee needed replaced less than 1 year after I purchased them. Definitely not for daily use in a home with teenagers.", 
    "They look great in our dinning room, we combined them with the brown chairs", 
    "comfortable, easy to assemble", 
    "They are very elegant and of great quality. Very comfortable too.", 
    "I paid a lot more money for the ones these replaced and wasn't nearly as happy. They are comfortable and not too wide that they won't slide into my mid century modern dining table. I just love them and so does everyone who sits in them.", 
    "Nice chairs however they are very small, stiff and uncomfortable! I'm a medium size person, 5' 5\" 160 lbs and barely fit seated, feel very uncomfortable after 10 min or so. Recommended for decoration purposes only.", 
    "I bought 4 of these chairs and they are amazing! Very comfortable and very well made!", 
    "These chairs aren't expensive and they're good looking and comfortable. I know they aren't the most durable chairs in the world, but for the price, they're a good buy.", 
    "I was looking for a great deal because we moved in to a house having to buy lots of furniture and appliances. We already had a dining room table and needed to upgrade the chairs. These are a great buy for the money, they are simple and modern and very comfortable to sit in. Very easy to assemble, and shipping was fast.", 
    "Bought for dining room. They aren't the most high quality but you get what you pay for. They look nice.", 
    "Legs are always loose and I have to tighten every couple of weeks. One of the chairs broke in the first month and we are not large people.", 
    "but poorly constructed and will have to replaced in another year already! Had them for over a year now, and they are falling apart, avoid this manufacturer's items.", 
    "I love these chairs they are beautiful and comfortable! They all came at the same time! Great service!", 
    "We were looking for chairs to go in our poker room, I purchased 4 ..These are beautiful chairs & very comfortable.. We play poker all night long ... Must say that when we originally received one of the chair legs was stripped, called customer service & they immediately sent another chair leg out to correct the issue.... I was very Happy with Customer service of overstock and with the dining room chairs so most def 5 stars....", 
    "I purchase these chairs from overstock.come after shopping local furniture stores in my area I could not find a better price also the chairs are very comfortable and great looking", 
    "They look great but have to be tightened often", 
    "Great buy for the price, look expensive, light weight, Nothing wrong when we got them, put them together,Ready to go.", 
    "I am pleased with the quality!", 
    "These chairs are the best value for the money!! They look great and sit great, and are so close a match to my real leather chairs that no one has said a thing. They are a little firmed than real leather, but it's nice to trade off when my back needs more support. I need 14 more chairs around our table, so I'll definitely be purchasing more of these!", 
    "I havent opened these chairs yet, but the package arrived in a timely manner and not damaged in transit. Will update once I open them and put them together.", 
    "I should have paid more attention to the negative reviews than the positive reviews. This is a prime example of \"you get what you pay for.\" These chairs are average. Need a backup chair in case the person using them is large. These are very lightweight. The leg color described online by Overstock indicates \"dark walnut,\" which I was expecting and which would have matched my new dining table. The legs on the chairs I received are painted black. I will discard these chairs when I find what I am looking for. VERY DISAPPOINTED in this purchase--waste of money.", 
    "I was never able to get these together where they would hold an adult to sit in. The screw holes were very difficult.", 
    "Great quality very comfortable so excited to have these and what a great bargain!!", 
    "THESE CHAIRS ARE JUNK.THE LEGS BARE DIFFERENT SIZES AND THE HOLES THAT SCREWS ARE SUPPOSED TO GO DONT LINE UP.DONT WASTE YOUR MONEY.", 
    "The chairs are a beautiful addition to my dining room table.", 
    "Great size. Easy to put together. Only issue is the faux leather is easily scratched by cat claws. But I put chair covers over them and no one can tell they've been scratched.", 
    "These are the most fantastic chairs!!!! I bought them to add to my dinning room chairs and they were almost a perfect match. My dinning room furniture came from a very high end dept. store. I ordered the black. You can not go wrong with these chairs. They were very easy to assemble. Thank you Overstock!!!!!!!", 
    "I purchased these chairs for my son whom got his first apartment. These chairs worked out great. They are comfortable and perfect for his needs.", 
    "I used it for my front office the chair look like leather, very nice and easy to assemble.", 
    "Look great in my son's first house. Assembly was simple with no issues! Hope they hold up as well as they look!! Great buy for Mom!!", 
    "The chairs were great quality for the price and perfect for my dining room!", 
    "put the together and do not over tighten.. use for a week and then tighten them up. If you over torque the adjusters they will fail. if you follow directions they are great. Same chairs 125 each at store.", 
    "Very pretty, relatively sturdy. We don't use them very often but have had them over 6 months and they have held up nicely. My husband is on the heavier side and only uses one chair that he feels is sturdiest. They look great and are very affordable!", 
    "I ordered 4 chairs. My husband and I put the first two together with a little difficulty but not bad. The second two were a nightmare. The issue was the holes for the bolts to put the legs on did not match up with the holes in the chairs. After several hours we were able to get one together but the last chair probably took 5 hours over 2 days to get the legs on. We ended up having to drill the holes in the legs larger in order to meet up with the holes in the chairs. As a result of that the chair is very wobbly. We had waited for a couple of weeks on the chair to come in because of weather issues which we understood. Because of that long wait, we did not have time to send the chairs back and get replacement because we had ordered them for a family event that we needed. Overall, I am happy with teacher, very disappointed with the other two.", 
    "comfortable and easy to put together. This represents the second purchase of a set of two as we were very please with the classic style and the comfort...perfect for the dinner table.", 
    "Very easy to assemble, and great value for a nice looking chair. On one chair, the mesh fabric was covering up the holes where the screws were supposed to go, but we were able to use a box cutter to remove that extra fabric without any problems.", 
    "The chairs arrived promptly. Were easy to assemble and look great. Great purchase may order two more with this discount.", 
    "chairs wobbled so I sent them back", 
    "the legs are not the right length. one leg is shorter a bit on each one and causes the chair to be wobbly", 
    "easy to assemble, look great for multiple types of tables and styles!!", 
    "it looks nice, really nice, but not firm and strong enough.", 
    "These chairs broke within 6 months of purchasing. Do not buy if they will be used frequently, they do not stand up to that amount of use.", 
    "very impressed with these chairs for the price - delivered to my door for $** - can't beat it!", 
    "Very easy to assemble, the ease to clean it, you can't go wrong for the price.", 
    "easy to put together. looks and feels like leather. The seat base is a bit smaller than my other parsons chairs. But nice and sturdy.", 
    "Only complaint was putting them together took a lot of extra time to get them completely level so that they weren't wobbly at all... they look nice and you can't beat the price! just hope they are built to last...", 
    "The chairs came in good time, and where of good quality for the price. We put them together in a short time and followed the instruction given and also to in a few of the past reviews that gave some added ways of doing it. We put the chair together and tighten the bolts up to a point and put it down on a level floor and one of us sat on the chair with some weight not all the weight the I shook the chair to level it out which it did very nicely the I tighten one of the bolt on each leg and the turned it over on the kitchen table with it covered with a beach towel and finished the tightening and tried it again on the floor and they both came out great. One was a little harder than the other. Would recommend this product", 
    "These chairs are really off scale - legs very skinny. Not comfortable. Cost too much to ship back so put in attic until we have a yard sale.", 
    "Perfect size for the space. Extremely easy to assemble.", 
    "I have been looking for a kitchen chair that does not cut into my legs and supports my back. I found everything I wanted in these chairs. The price was amazing and the quality is unbelievable for the cost. BUT, the chair is so comfortable that I can actually stay and finish my coffee and not want to leave the table. INCREDIBLE VALUE AND PRODUCT!", 
    "I bought these chairs for My two kids to use for the desk in their bed rooms, since I don't want traditional roll chairs that dig up the hardware floor. These are perfect, look really nice, can push in so they don't take up much of their room space, and I put little felt pads on the bottom so they can push them around easily without harming the floor. The faux leather looks good and will be easy to keep clean. I don't know if I would put them in a dining room, since their stature is on the small side. They were easy to put together and arrived quickly.", 
    "The chairs exceeded my expectations. We love them, they are really comfortable, easy to assemble and elegant/modern looking . We love them, and they really were a great value.", 
    "Very easy to put together. I received many compliments on how sylish the chairs looked.", 
    "Great!!! Love these chairs!!! Fast shipping and easy to put together!!!", 
    "I needed to update my dining set. A designer told me to just change the old wooden chair and replace with these black faux leather chairs. What a difference!!!! the room looks so much larger and streamlined. I am very happy with my purchase", 
    "The assembly was simple an the look was exactly what I was looking for! They are beautiful! I kept my old table because of the history attached to it, so the chairs completed my modern look! They are also very comfortable an the price was amazing!", 
    "Other than some assembly trouble on one of the chairs, they turned out great and they look great in my space. You cant beat the price and they don't look cheap by any means. They are also comfortable and sturdy!", 
    "Great chairs. Easy to put together and very comfortable.", 
    "I purchased 2 chairs as a room accent to go with a built-in card table which had benches on two sides. They look beautiful and are comfortable as well. However, they are quite challenging to put together because the holes are not perfectly lined up. I have already put 2 apartments of furniture together of Ikea furniture without incident. I was so wishing they had been built as well as ****. I still have one bolt that does not go completely into its hole but it doesn't seem to be a problem. I don't live near Ikea and the chairs were delivered promptly and look nice.", 
    "We're very happy with our purchase. They're just a tad more narrow than our other chairs that we paid 3x more for but it's worth the price savings!", 
    "The seat and back are all padded and feel soft and comfy. I was so pleasantly surprised when I saw these. They went together in a snap, and they are lightweight, but look heavier. They slide easily without scratching the floor. I absolutely love them and would order again. They're a gorgeous black color, and look more expensive than they were.", 
    "We looked all over for chairs that were cheap, but didn't look it for our dining room, these chairs were perfect. A couple of them do wobble a tad but it's fixable. They look great and feel sturdy. Overall we are pleased with them.", 
    "I ordered two sets of these black chairs for my dining room and was extremely happy with the appearance, style, and quality. I really Love these chairs and would Highly recommend them!!!", 
    "I love these chairs. A very good product for the price!", 
    "Very good bargain for the price. I have been pleasantly surprised with the comfort of the chairs", 
    "These chairs look great and were very easy to put together. The value is great but that's because the price is so good because they don't seem sturdy or have great quality cushioning. They are very light. I bought two to try them out, but I will be buying something else that is more heavy-duty and made for daily use. These don't seem to be for everyday use. I don't trust them for daily dinners, games at the table, and having company over. I feel like if you twist wrong in the chair, a leg might crack. The only reason I would not recommend these is if someone uses their chairs all the time. Otherwise, it's a good purchase. They will be good back up chairs for me.", 
    "Nice chairs for the money, fairly good quality and comfortable. Assembly is straight forward and comes with Allen wrench tool for each chair. Style is modern and simple.", 
    "My new rug is beautiful. Completely happy with delivery, and product.", 
    "I had a slight challenge inserting the screws on some of the legs. Four of the six chairs had no problem. These chairs fit nicely because they are slightly smaller. And lighter.", 
    "Easy to assemble and extremely comfortable. Perfect chairs for my computer hutch in my kitchen dinning area,", 
    "I really liked the chairs online (style and price) but after I started to assemble them, my husband could see it was going to be a problem. The holes were not aligned for the screws and although we tried to drill new holes, it could not be done. I ended up just throwing the chairs away since it would have been too difficult to ship back for a refund.", 
    "I am so glad that I took the time to read all the reviews, everything they said was true, great quality, great price, although faux leather they do look and feel like leather. so glad I bought them", 
    "These are nice chairs for the price. I was looking for seats that were 20\" high, so these are perfect! I ordered two sets of two; one of the sets could not be put together because the holes did not line up - had to get them back in the box and UPS picked them up to return. Still waiting for replacement set to arrive.", 
    "These chairs are great for the price and look nice in my apartment. The only problem was that they were a little difficult to put together. While trying to put them together we realized the hole that we needed to get a screw into was in the completely wrong spot so we had to improvise and kind of create our own way of putting together. But overall they are good chairs.", 
    "I ordered 4 chairs online. I got the chairs in a timely manner, however when attempting to put them together, it became very obvious that the holes to screw on the legs of the chair did not line up with the holes of the back of the chair. I had to drill out my own holes, buy new screws and spend a ridiculous amount of time to make these work. I would not recommend these to anyone!", 
    "The only thing that stopped getting 100% excellent reviews was due to one (of 6) chairs having badly located staples which restricted the screws that lock the seat to the back from being inserted and screwed in place. After a lot of probing I found two staples legs were positioned inside the female component of the assembly, the staples were then removed with pliers which allowed the screw to be inserted and the seat and back locked in position. Sounds easy but a lot of time could have been saved with more care in positioning the staples. The chairs look good and the value is excellent, let's see how they hold up in 6 months.", 
    "Stylish leather chairs, light weight and sturdy for the price. The backs of the chairs actually give somewhat with your sitting posture to make it more comfortable to me. Assembly required. Easy to do. Instructions are included.", 
    "The chairs look wonderful in my small space. They are sturdy and are comfortable to sit on. I would prefer something with a wider seat (I weigh 230), but could not pass up this bargain.", 
    "It's great quality for the price very east to put together", 
    "The chairs are exactly what I had been looking for. The size is perfect and the look is very cosmopolitan and contemporary. We ordered six chairs and had absolutely no problems with the product or with assembly. It is important to put the screws in loose and then tighten them one at a time. Don't tighten each screw individually. Sit on the chair to level it and if that doesn't work, follow the manufacturers directions for leveling. I shopped and researched extensively for this exact style of chair and the quality and price of these chairs can't be beat.", 
    "thank you for everything .....Great prices, great products ...", 
    "The items arrived quickly and in perfect condition. Assembly took approx 30 minutes for the 4 chairs. They appear well made and a very good value for casual use.", 
    "Needed help assembling these chairs. Luckily, my husband didn't have any problems. These chairs are easy and comfortable to sit in during long periods, but they aren't well sewn. The sticking is unraveling right out of the book.", 
    "These chairs are so light weight and flimsy. I would recommed purchasing these. You get what you pay for!!!! I'm going to return them.", 
    "Elegant and very easy to assemble. We are using them for contact lens training in our optometrist office in Orange. They look great with the antiques and the rest of the furniture!", 
    "They were very hard to put together and while we can sit in them, they are definitely wobbly.", 
    "These chairs are nice looking and were fairly easy to assemble. However, they are not very comfortable to sit on, and the screws keep coming loose. I have to tighten them about once per week. Also, I get nervous anytime someone over 200 lbs sits on them, because I feel like at any moment they might hit the floor. I guess I need to remind myself next time that you get what you pay for, cheap is not always good. I would not recommend these, spend a little extra and get something more durable. I'll be doing the same, except now I'm out the $$ I spent for these.", 
    "The chairs are comfortable and sturdy. They look very high quality and at any price they are well worth the money. The price is what I would expect to pay for one and I got two great chairs that dress up my small kitchen table. I loved them so much I bought an additional two that I can use at Christmas for the \"kids table\". We are very pleased with this purchase and of course they arrived only a few days after ordering. Overstock is great", 
    "We liked our first order of these chairs enough to order another set. The second set had a weak leg which when screwing on, broke. I have yet to contact customer service to get a replacement leg.", 
    "I purchased 2 sets of 2 chairs. Directions to put the legs on was very good and took about 45 minutes for each set of 2 chairs. They are very sturdy and light enough to easily move around even when sitting on them. They are very stylish and comparable to similar chairs from much pricier dining room sets. Definitely recommend them.", 
    "I thought the chair would have been a little heavier. But the chair is nice.", 
    "Easy to assemble, very comfortable and look great. I was looking for chairs that did not take up too much space and these are perfect.", 
    "These chairs look great and are very comfortable! Please disregard any negative comments about them being wobbly. If put together properly, and the directions followed, you will have no issue.", 
    "my only regret is that I only bought 4 and not 6. Now I will need to order again :-)", 
    "I do like these chairs. The feel a little plastic, but I wasn't concerned about the feel upon purchase, as I place to use chair covers. Now that I have changed my mind about using covers, I wished I had opted for genuine leather. They are comfortable and will not get much use, so I guess they are okay.", 
    "Got these chairs for an old table I spruced up. They really updated the look of the kitchen and table. The only problem I have with them is I constantly have to keep tighting the screws on the legs. But I am not for sure if this problems is the chairs or the tile when they get pulled out. Other than that I would recommed them.", 
    "Chair is very comfortable. We liked the color. It looks well made. I had one issue with one leg. Customer service took care of it promptly. We liked the seating height.", 
    "I thought the seats would be deeper to match a chair I already had, but they're much small than the average chair and not so comfy. They're great for smaller adults and big kids, but I'm tall and the chairs are not at all comfortable for my long legs.", 
    "When the box arrived, there was a large hole in the side and subsequently some of the washers used to secure the legs was missing. A live chat with Overstock customer service fixed that. One chair leg had a scratch in the back about an inch long and showed the real wood color. My hubby decided to keep the chair and correct the minor problem himself. Once the chairs are put together, they look great and are very sturdy. Another fine purchase from Overstock!", 
    "Much easier to assemble with a power drill- only took a couple of minutes. I just purchased them for a kitchen dinette table so they won't be used all the time, but I'm confident they will hold up for awhile. Not cheap looking- so a good purchase for the price.", 
    "These chairs look great. the chairs arrived and were easy to assemble. Very nice.", 
    "The chairs were nice at first but fell apart after less than a year of use. The legs need to be tightened often, and 2 of the 4 chairs I bought are past the point of tightening. Now I need to buy a new set of chairs to replace them. My advice is to pay the extra money in the first place for higher quality product.", 
    "I purchased three sets of these chairs for a total of six chairs. I wanted to add a slightly more modern and polished look to my dining room table and loved the simple looking design of these chairs. Each set of chairs arrived in a large box. Each box weighed over 30 pounds. Of the three, one box arrived with a big hole in the box. Fortunately, all of the contents inside were wrapped except for two chair legs whose wrapping had come off and the hardware was ripped open and loose inside the box. As a result, several washers were missing and I am unable to assemble that chair until I go out and purchase some additional washers. Since I had to bring each box up to my second floor apartment, I had hoped to assemble two chairs, clear away the boxes, bring up the next set, etc. But I was unable to locate and instructions for how to assemble the chairs so ended up opening all the boxes in search of them. It was on the third box that I brought upstairs that the packing slip was included and had a note about the bottom of the seat portion of the chair. It was then that I realized the underside of each seat cushion had a removable piece under which the directions were included. Thank goodness! Overall, it wasn't too difficult to assemble the chairs. Some holes were hard to match up and it definitely helps to have a drill to secure all the pieces together. The chairs are all a bit wobbly. There are notes about how to correct this but it was more than I could be bothered with after spending close to two hours putting 5 or my 6 chairs together. The 6th chair will have to be assembled at a later date due to the aforementioned missing washers. They aren't the sturdiest of chairs either, meaning if you have very obese company over for dinner, I would not feel safe letting them sit in them, but for the average weighted person, they seem fine enough and fairly comfortable. They do look fantastic though.", 
    "the legs are of the same length but when you put it together somehow one of the legs is shorter --- ive tried to mix and match all the legs just to find the perfect match --- but it is the same to both chairs, one of the legs is shorter, but when you sit on it, it is just fine.", 
    "We got our money's worth with this purchase, one of the chairs is uneven but they both look great and it wasn't noticeable to our guests (the uneven chair)", 
    "Love the contrast to my leopard print and zebra print chairs at my dining table. I wanted the chairs to be different, but especially comfortable for my guests. They are certainly that. The only reason I didn't give it an excellent rating is because these are light weight and and I'm not sure how they will hold up over a long period of time with all sorts and sizes of people sitting on them, but only time will tell on that one. Overall, I'm very happy with this chair.", 
    "Chairs were ordered and order was processed very quickly and accurately. Chairs arrived as scheduled and were very easy to assemble. I would definately use Overstock.com again", 
    "The chairs are great price and they are great in our kitchen.", 
    "Overstock service is impeccable but this merchandise with one chair defect surprised me. I'm single and have physical challenges, I expect what I order to be spot on, so I won't have to wast my time with returns. Thank you", 
    "Had purchased 4 chairs previously which I liked. Decided to add 2 more... now I have 6. Love them like look great and are comfortable to sit on. I love shopping with overstock.", 
    "We ordered 3 sets of these chairs for your dining room. All arrived quickly and only one was broken. The replacement was sent without the legs but the 3rd one was fine. They look so expensive and nice in our dining room.", 
    "They look beautiful and they look like the expensive ones! I really like them I bought 3 pairs, and they are very comfortable.", 
    "I was very happy how quickly they arrived. They were easy to put together. All was going great until the last chair, the holes for the legs were off and made it hard to screw in and one leg is off a bit it looks like it leans forwar to much. Overall for the price I am happy with the purchase. I hope they last a long time.", 
    "I ordered two sets of these chairs (so, 4 total). Unfortunately, I could not assemble one because the seat had been put together improperly and the leg would not go in. I had to return the whole box because getting a replacement part would have taken weeks. Even with the first box, I couldn't get the chairs level despite the suggestions on the instructions. I would have loved to have four of these, but I guess it'll be two and I'll have to order others and have mismatched chairs.", 
    "Chairs were packaged well and require some quick assembly. One chair wobbled slightly, but there are instructions in the box on how to steady the chair. I think they should have been priced more around $70 or $80 for the pair, considering they are not real leather. Also, they are titled \"..black dining chairs\" but mine look more like dark brown. All in all, they are good. So far.", 
    "Very happy with these chairs, and especially for the price, you cannot go wrong! The faux leather looks good, legs came without any damages/ bruises. Legs are slightly darker than how it appears online, but I was happy with that. Takes about 30 mins to put together. I paired these chairs with a glass bistro table, looks so chic! I slept on these chairs a few days before purchasing, glad I did after all.", 
    "These chairs look really nice. They were a little tricky to put together - I had problems with getting them level. Two of the chairs I had to return because they just couldn't be put together - maybe the holes were drilled incorrectly. I have to say that they look very nice in my dining room but I am a little nervous about who sits on them. I am not sure they would hold a heavy person..... All in all though, for the price I paid, I am happy.", 
    "We just moved into a large house and needed to furnish it on a budget. These chairs fit in great with a table for which we needed chairs.", 
    "The chairs are poorly made as every chair wobbles, despite trying to level (manufacturer includes tips to help this problem). One of the chair's pre-drilled holes was approximately 1/4 off and that chair could not even be assembled.", 
    "We ordered four of these chairs, and two other leather chairs in red. These four black chairs were easy to assemble and look really nice. They seem not to be the sturdiest chair ever made but they are perfectly fine. They match our black Crate & Barrel dining table, and with the two red chairs as anchors, the whole set looks amazing.", 
    "I was looking for a set of chairs to match the new table I just got and these were perfect for it. Great value and pricing and fast delivery...definitely going with Overstock again for furniture purchases.", 
    "I liked the chairs. good quality and comfortable. The instructions to put them together were poor and complicated.", 
    "These are not the most expensive chairs and not top quality, nor are they priced that way. As long as you expect to get a solid deal, you will be happy. If you think you are getting a top quality chair for this price, think again,", 
    "The complaint that I do have about this product is the drilled holes were not completed properly. I had to on one chair add wood glue in the hole so that it would be safe to sit.", 
    "I am pretty happy with these chairs. The quality isn't the best. However, they were priced really well. You get what u pay for.", 
    "Purchased this set for a friend who lives close. Chairs assembled easily, upholstery was exactly as described and really nice. When I sit in one of the chairs, it was very comfortable. My friend was delighted with the chairs. I would not hesitate to purchase more of this brand. You can not beat the price of this set for such quality.", 
    "The chairs were as expected. Works perfectly for the basement. Not too expensive, but good quality for the price.", 
    "They arrived on time. I only ordered one pair cause I wasn't sure if it was going to match with my 6 seater dining table. It was so easy to assemble and it my dining table looked very elegant. I will definitely order the other 4 chairs to complete my dining set. I love the price, it was on sale at $$$ when I bought it. I'me very satified and happy with the product."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Villa-Faux-Leather-Black-Dining-Chairs-Set-of-2/5986072/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5986072/Villa-Faux-Leather-Black-Dining-Chairs-Set-of-2-0b81ed71-952c-4e7b-b692-a20908408256_600.jpg"
  ], 
  "description": "Give your dining space a sleek, contemporary vibe with these Villa\ndining chairs from Monsoon. These chairs feature black faux leather\nupholstery and pine wood legs finished in a dark walnut hue for a\nminimalist look that works well with a modern glass-topped table.\nThe chairs come in a set of two to simplify coordination.Set includes two chairs for convenient dining room\n  coordinationPine legs sport a dark walnut finish for an upscale lookFaux leather upholstery in black adds sophisticationFilled with fire-retardant foam for safety and comfortTotal chair dimensions are 39\"H x 18\"W x 22\"DSeat height of 20\"StyleContemporaryMaterialFaux Leather, Pine, WoodFinishBlack FinishChair TypeDining ChairsSet SizeSet of 2AssemblyAssembly RequiredChair Back HeightStandardBack RestYesColorBlack, BrownFurniture Frame MaterialWoodFurniture PatternSolidSeat StyleCushion, Solid, Upholstered"
}