{
  "name": "Vintage_Tabouret_Stacking_Chairs_(Set_of_4)", 
  "price": "EUR 216.58", 
  "reviews": [
    "AFTER ordering these chairs, I read many customer reviews- some great, and some not so flattering. Needless to say, I was a bit nervous to see them in person. Well, I didn't have to wait long- my order was placed Saturday night, and the chairs arrived on Thursday. They were well packed, and in PERFECT condition. The finish is nicer than expected (nice warm patina on the metal, with slight variations in the finish) and they seem to be very well made. I was also concerned about the size of the seat, since some reviewers found them to be a tight fit- I am 5'9\" and full in the booty :) and these are nice and comfy for me, as well as my 6'2\" husband. One SMALL SAFETY CONCERN to mention if you have small children or pets in your house: there are 4 small rubbery \"pegs\" inserted underneath the cross-braces of each chair, below the seats. You can't see them unless you flip the chairs over, and they don't have any use I can determine. You may want to remove and discard these, as they seem to be a potential choking hazard. One of them fell out while I was unpacking the chairs, or I wouldn't have even noticed them.", 
    "I am a size 14 and I just fit in this chair. Anyone larger should not purchase this. Also, the chair is very, very INDUSTRIAL--meaning scuffed, painted sloppily, and otherwise roughly finished. The cuts on the solid portion of the chair back are still somewhat sharp (not sanded out) and I was a bit shocked by that and glad I didn't cut myself getting the first one out of the box. I am returning the whole set. I was banking on something just a little better.", 
    "Great purchase! These metal chairs don't just look good; the rounded back and arm rests make them very comfortable to sit on. The vintage finish is matte, slightly more copper-colored than appears on the picture.", 
    "I love these chairs because of the price, look, and color. They were the perfect addition to my kitchen table so it was more casual than my formal dining table which sits within view. They are definitely metal and make that metal ting sound when you move them, but that doesn't bother me. I like the small arms because it's enough to hold my 2 yr old even though I don't particularly trust him on chairs by himself quite yet. As occasional chairs they're great, but if I were planning on using them every day for all meals I may consider a cushion for bum comfort. They really do have a nice curve to them though along the back so they're surprisingly more comfortable than I expected.", 
    "I wanted some of these popular metal chairs for our new house. This was a great deal. A set of 4 for the price of one at other places. I am using them in my dining room. Make sure you check out the dimensions. I love they way they look--a very neutral gunmetal color. No assembly required and arrived within a week packaged snugly.", 
    "I stalked Overstock for 2 months waiting for these chairs to come back in stock and I almost gave up. I scoured the internet looking for something similar but everything was 3-4x as much. I'm glad I waited! These chairs perfectly complement the industrial, farmhouse aesthetic I was going for. Like other reviews have said, these are on the small side. I'm 5'1\" 100lbs and even I felt like the arms were hugging me. They are comfortable enough, probably not for hours but fine for dinner. The backs of the chairs are somewhat low-profile which I like. I would prefer them better if the arms didn't extend so far out -- for one they enclose you in and they don't tuck under the table very far. I somewhat expected this from the pictures, so it's not a deal-breaker. They have an uneven glaze that gives them a unique, tarnished look. The only defect is a drip of black glaze (or paint?) down the back of one chair. I was disappointed to see that, but my husband had already unpacked them for me. They come very well packed so trying to fit them back in the box to return was going to be a pickle. I put that chair on the side of the table that I don't see everyday -- hopefully I forget about it. :)", 
    "GREAT CHAIRS! They are deceivingly comfortable too. Awesome Value for dollar too. I saw comparable chairs for double the price. I am very happy with this puechase.", 
    "Just bought a drop leaf table at a consignment store and was looking for chairs that would match the scale. I'm adding a little of the industrial look to my transitional scheme and these work well. Decent quality and more comfortable than I thought they would be. Really welcomed the reviews others had posted. I'll be making some chair pads to add a little more style and comfort but these look nice. Thought I could possibly paint them in the future if I want to change them up. Great chairs for the price.", 
    "Perfect size and color. Exactly what I had hoped for when ordering this product. I really like that they are stackable. Lots of compliments already.", 
    "These chairs are fantastic! industrial, modern, and will truly last a lifetime. the seat is big (for my larger guests &obviously durable). you cannot beat this price. i paired it with a heavy farm table and 2 upholstered gray chairs on the end.. absolutely LOVE.", 
    "My apartment is somewhat of a vintage-contemporary blend and these chairs are perfect for the style. They require no assembly, and the finish is a warm, antiqued metallic colour - keep in mind the finish is industrial, and so there are plenty of imperfections, but it's part of the style - and thus not a problem for me. The metal seat base isn't the most comfortable (obviously), but it's easy to find inexpensive chair pads that make sitting on them perfectly comfortable for long periods. One of my chairs arrived with a damaged (bent) back rest piece, and Overstock quickly and without issue shipped me a new one - with no need to ship the broken one back, so overall I was impressed with the level of service I received as well. Like other metal items I've received from Overstock, the quality is never super high-end, and so some of the welds are a bit ugly (but not terribly noticeable given the 'industrial' nature of the items) though solid enough that I'm not worried about the structural integrity of the chairs. I think they're a perfect size (though neither my partner nor myself are particularly big people) and they add a lot of style to our dining room. All in all, I'd not hesitate to purchase again, especially for the really reasonable price point.", 
    "These are the same chairs you see on other websites for four times the price - they're gorgeous and sleek, the perfect addition for a modern dining set. I paired this with the Cable Grey Oak Finished Dining Table and they look fabulous together. Such a great bargain!", 
    "I have to say, I was skeptical that the quality would measure up at this price, but it truly does and I'm in love with these chairs (so much so I'm going to order a second set). Nice vintage patina look that goes nicely with my rustic/modern decor. I have a farmhouse style table from Pottery Barn, and they go very nicely. Plus they are sturdy and easy to clean. What more could you want?! You get more than you pay for on this deal.", 
    "Scale too small for our 60\" oak farm table. They didn't look right.", 
    "These chairs are attractive, sturdy and comfortable. My only complaint would be that it hasn't been easy to find cushions to fit them.", 
    "Great chairs to match our industrial wood table- not the most comfortable, but definitely complete the look.Recommended!", 
    "Needs butt cushion. Comfortable otherwise. Color very nice.", 
    "These chairs do exactly what they are made for. They look super stylish and provide nice seating. The value is great! Don't expect something super comfortable with these as they are metal hard chairs. But they seem to be very sturdy and function well. Really you are buying these for the look and they are very nice. I bought the vintage finish and they go great with my mahogany farmhouse table. We are using these for the middle 4 chairs with 2 end chairs that are upholstered. These are much better than the Target brand ones I first bought (these are quite a bit taller and sturdier).", 
    "We have a small apartment that's always filled with projects. We've avoided having any dining table for years but finally found a good folding table and these stacking chairs. They tuck perfectly into a little nook when we're not entertaining, but look super sleek out.", 
    "We bought a set of these chairs to go with our farmhouse style dining table. We wanted to find chairs that were rustic/industrial looking but also comfortable and sturdy - these fit the bill perfectly. The color is great, a brown-bronze-copper that's not too dark. And the price for set of four was amazing - I saw similar chairs online at other sites where one chair would have run you as much as these 4 did together. I am extremely happy with this purchase.", 
    "I bought these to go with a round dining table with a stainless steel top. These chairs look so great-they coordinate, but the vintage color keeps it from being too \"matchy-matchy.\" Everyone who sees them raves about them!After reading other reviews, two concerns were quickly eliminated. First, They do fit most of the way under the table so space is not a problem. Second, they are comfortable for adults to sit for long meals and game nights! Highly recommend for a great look and great price!", 
    "I love these chairs. I bought these chairs because my husband always ends up loosing the legs on chairs that have wooden legs then they become weak and don't last a couple of years. I love the simple design. The only thing is you do need to add a cushion and I added a back pillow for hubby. If you are over 200lbs.you will never fit into these chairs. These chairs will hold the weight no problem but the size of the seat area is only 13\". They are very strong will hold a lot of weight but not size of butts. These chairs will last a lifetime.", 
    "We have these in our dining room. They are surprisingly comfortable, very durable, and look great in our dining room.", 
    "Quality build, design, finish and price. What we've got on our hands here is an all around stellar product for one ell of a price. And bonus- they stack up for easy storage when you want to open up more floor space. I threw one of these things clean across the room the other week, ripped a hole in the sheet rock, took a chunk out of the floor, but not a single solitary scratch on the dam chair itself. A truly classy piece.", 
    "I was going to buy restoration hardware versions and they were double the price...so decided on these and love them!", 
    "I love these chairs, much cheaper than at ****** *******. Color is true to the photo. They are stackable and sturdy. Came well packed.", 
    "I read all the reviews and although I had my doubts I went ahead and purchased the chairs. The box arrived in a few days and I immediately opened the box. All the chairs were in perfect condition. The finish was not cheap, but they are industrial. I thought they were comfortable and sturdy and the rubber on the bottom of the feet keeps them from scratching my wood floor. The one thing I did notice was that they were cold to the touch at first. This was perfect for the hot summer but I wonder if they will feel cold in the winter. This is just the mixed materials look I wanted. I am very happy with this purchase.", 
    "These chairs are really comfortable and look amazing with our barn style dining room table.", 
    "I love these chairs. They are sturdy, look great with the table and they are very stylish. Great purchase decision.", 
    "These chairs are really beautiful in person!", 
    "No surprises. The chairs are very sturdy. We had one that was scratched and we had a replacement within two days. This is a SERVICE company who cares about their customers.", 
    "Love these chairs! They go perfect with my Jackson table from World Market. Very durable and you can't beat the price.", 
    "***Impossible to get out of box w/o destroying boxfits 8 around 60\" table", 
    "They're nice light-weight chairs that fit well with the Renate Dining Table. They're all metal, but are actually pretty comfortable. I haven't sat in one for extended periods of time yet, but they do the job. Plus they look really nice.", 
    "These are fabulous. Look very expensive. People always ask where I got them.", 
    "they look great - just a bit hard to sit on.", 
    "Love these chairs, but they need cushions", 
    "oh my goodness. I was so happy to receive these chairs after debating about them for weeks. I bought a table from Restoration Hardware and wanted these chairs for casual dining. They are perfect in every way. Everyone that visits make comments about the table and chairs. I am so very happy with this purchase.", 
    "There are many other similar chairs on the market but the style and price of these chairs are perfect for our family. I prefer the look of the lower back with a slight arm rest. While I can see that the extension of the arms could make the available seat size a tight fit for some people, again, they are perfect for our family. They arrived well-packed and undamaged. They are the perfect touch for our remodeled kitchen and we receive many compliments on these chairs.", 
    "Love these chairs and the price, compared to similar designs where a single chair could cost over $***! Two of our four were damaged upon arrival (one bent significantly, and the other had a big scratch in the finish), but Overstock was AMAZING in their customer service and they immediately sent replacements. We might eventually get cushions, since they're metal and sometimes cold, but otherwise, my husband and I are thrilled with the look and quality of these chairs!", 
    "I love these chairs! I recently redid our living room in an industrial farmhouse decor and these are beyond what I thought they would be. These now sit around my antique farm table. I was worried about them being too small because our dining room is large and I have a few tall ladderback chairs that also sit around the table. The size is perfect. I love the mix match heights and they definitely aren't too small. The quality of the chairs and the price can not be beat. I'm seriously considering buying another set just because. Also, at one point I had these chairs in four finishes added to my cart. I was so indecisive on which finish I wanted. Finally I chose these and am very happy I did! They are the perfect shade of industrial metal without being too shiny or too dull. Perfect!!", 
    "Sturdy and comfortable - don't find that they are at all \"tight\" to sit in. I get loads of compliments on the look of these chairs - and you can't beat the price! Don't go all the way under the table due to the curve of the arms - since we have plenty of room in that area it's not a problem for us - but might be for someone who is \"space constrained\". Packed well with fast shipping - and nothing to put together. Love vintage look!", 
    "I bought these 4 chairs for my kitchen table because I have young kids who are messy and I wanted something sturdy that can't get broken and would be easy to clean and these chairs are exactly that. I was very impressed with the quality of the chairs and they are far more comfortable than I imagined. Great purchase.", 
    "I love these chairs!!!! They arrived in time for our large Christmas dinner. The chairs are very attractive and add a nice industrial edge to our traditional dining room. It is also a great feature that they will stack for easy storage. I've very happy with the quality and price of these chairs.", 
    "Love these chairs but could have gotten them for a lot less at one of the discount stores nearby", 
    "Very happy I ordered these. I have three toddlers. I\"ve been through 4 sets of kitchen chairs in the past year searching for the right ones. I was worried these would not be great for the kids, but decided to take a chance. I was so wrong! They are the best chairs I could have purchased with little kids for these reasons.1)they came assembled (I don't have time to brush my teeth let alone assemble chairs!)2) They have arms. My bumbo booster seat fits perfectly on it and my 14 month old isn't going to topple herself out of it because the arms keep her secure. They have also helped my 2 year old(who loves to stand at the kitchen table instead of sitting like she is supposed to) to not fall off which happened all the time with our old chairs.3) They are SO easy to clean. Do they get food in the little crease where the back meets the seat, yes, but no more than any other chair would4) They look GREAT with my kitchen table!Love Love Love these chairs. My only complaint is that the barstools (for my kitchen island) do not come in this finish.", 
    "If these will work at all with your style, get them. You will not find a better looking dining chair for this price.", 
    "Versatile - Sturdy - Nice", 
    "I bought 8 of these and they are sturdy and look amazing. 2 of them had some brush lines under the clear coat. Overstock quickly took care of them and I bought 4 more. I have a huge table outside that fits all 12", 
    "The chairs have a nice industrial modern look but 3/4 were damaged upon delivery - overstock quickly replaced them but they are very easy to scratch & don't seem like they will last long", 
    "Looks good and well packaged. Very comfortable chairs and fits well in my dining room", 
    "Purchases these chairs and the matching dining table. I needed something to fit in my compact apartment and this fits the bill. Color is fantastic and matches my room design perfectly. The price cannot be beat. I plan on keeping these chairs in my home for a long time.", 
    "Product was just what I was expecting.", 
    "I love these chairs- exactly what I was looking for and at a great price. My only complaint is the size. They are definitely a little narrow for someone who is very tall and wide.", 
    "Great chair- great price!", 
    "These shipped quickly, were packaged very well and look perfect! Love them!", 
    "I could not believe how much of a value these chairs are!! They look very sophisticated and are heavier than I thought. They go perfectly with the dark brass in my kitchen and my antique dinning table!! The price and the free, quick sipping were great!!", 
    "Love my chairs, very sturdy. These are great transition chairs. I have my eye on some chairs from West Elm, but they are 1200.00 for 2 chairs. These chairs work great for the time being. They can also be used in the back yard patio when I finally do buy my West Elm chairs.", 
    "These chairs are just as described. They were delivered within just a few days.", 
    "These chairs are extremely sturdy and well made. Loved the look and glad I found them cheaper here at Overstock! I used them indoors sodomy know how durable in outdoor weather. They were used daily and held up great. Barely a few scratches after more than a year of daily use - with kids.", 
    "They have a high-end look at a low-cost price.", 
    "Shipping and delivery were really fast. These chairs are beautiful and the color is just as pictured. They do scratch easily though, and if I wasn't into the industrial look, I'd return them as most of them have some scratches. The other issue is that the actual seat is pretty small, so if you've got a bigger butt these will probably be too small for you. I'm getting them in addition to a bench, so it might work out in the end. They seem pretty sturdy.", 
    "Nice chairs, a little light weight", 
    "These chairs are both good looking and comfy and I would recommend choosing them unless you are worried about larger folks fitting the seat as the arm design does indeed limit width. The color is more of a bronze then gray however they still work nicely with a steel table I purchased at world market because it is a matte dark gray.", 
    "Love these chairs. They are modern and useful and well-made. Price is appropriate for the quality.", 
    "I was scared of this purchase because they seemed too cheap, but buying them was the best thing I did. They're truly great and you can't do better with the price. These are simple chairs, nothing fancy, but they are industrial looking and that makes them seem quite elegant. Make sure to buy some cushions and your be set!", 
    "I love my new chairs, and Overstock's customer service!!! Great chairs for the price. One of the chairs came missing a rivet, and Overstock quickly replaced the chair. When the replacement came, the back was bent (I believe from the way it was packed and shipped). Again, Overstock quickly replaced the damaged chair. Kudos to Overstock for standing behind the products they carry.", 
    "Absolutely love these chairs. They match perfectly with our table. The only thing I would say is to be careful cleaning as it is metal and there are a few sharp edges.", 
    "I ordered 8 chairs after a long search for the best deal and right color. These are perfect! They don't feel cheap and are actually pretty comfortable. I am so pleased with this purchase!", 
    "Exactly the look I was going for, I paired with a refinished draw leaf table. A good mix of antique and industrial.", 
    "Just received the chairs and love them. Color is a bit different than the picture but great. Well constructed and comfortable. The packaging was very impressive. Can't beat this price anywhere I have looked. LOVE them!", 
    "Smaller than envisioned but they are a great price!", 
    "Chairs arrived fully assembled, well packaged and padded and were exactly what I needed for my vintage reclaimed patio table! Thanks Overstock for te great price!", 
    "Good quality, nice height, cool finish", 
    "I was a bit skeptical about purchasing steel chairs for my dining room but the moment I set these babies up around the table I was obsessed! They have a rich color, super sturdy, and surprisingly really comfortable even without any cushions. I still cant believe I fell in love with a set of 4 chairs for the price of what 1 formal dining chair typically costs.", 
    "These were a good option to match with the iron table I bought. Hard to find seat cushions at the right size.", 
    "These chairs were packed well and had no scratches. The quality is very good and they look really nice in the apartment. They are surprisingly comfortable for metal chairs. They have a really nice coloring detail that wasn't shown well in the pictures that was a nice surprise. The chairs look much better in person than on the website. The coloring goes well any color decor. The matte finish makes them look expensive. LOVE THEM!!!", 
    "Great color, good quality, great price", 
    "Really nice chairs...perfect match to my oil rubbed bronze chandelier..... Great quality!!!!", 
    "Just arrived yesterday. Beyond perfect. Comfortable, sturdy, Modern accent to breakfast room table. Thank you.", 
    "Love these chairs! I have ordered two sets. Great deal.", 
    "Lightweight, sturdy, classic design, stackable... the best option for a chair offered at a great price. Happy.", 
    "We love them, they complete our modern farmhouse style.", 
    "These are great, sturdy, beautiful chairs", 
    "Loved! They are very sturdy and I love that they came built. They are very comfortable and I have received many compliments.", 
    "I have a loft style decor and these chairs were perfect for my large dark wood table - I placed charcoal gray upholstered chairs on the other side of the table. The chairs are sturdy. Finish is not cheap looking, and I love being able to wipe them down.", 
    "great industrial looking char for my upstate house", 
    "Uneven color but rustic looking.", 
    "These chairs are true to the color, a very nice olive brown. They are sturdy and have kept up with my 3 boys for the last year. And they still look great! Very pleased with this purchase.", 
    "Love them. They look great around our table and are very sturdy. Wish I could buy another 2 for guests.", 
    "Very sturdy. Excellent. Look very in a farmhouse/industrial setting.", 
    "Love these chairs! Affordable, no assembly and great quality! No complaints.", 
    "Great price for great chairs!", 
    "For the price, these chairs are a grab value. They look great in my dining room and think they're very comfortable.", 
    "Very sturdy and look great! I get lots of compliments on them!", 
    "could not be more thrilled about these chairs.. excellent quality and the metal is a beautiful color!", 
    "Awesome chairs! I have 8 around my farmhouse dining table and they look amazing! Very comfortable and expensive looking- would definitely buy again!", 
    "Love the style of these chairs. They are well made and sturdy. They work perfectly in our vacation cabin which is a blend of rustic and refined.", 
    "The chairs are great.The only downfall is that they are not made for every shape so if you are little on the robust side it may be a tight squeeze. Other than that they seem to be holding up very well as we purchased these chairs for outdoor use.* *The chairs are brought in each night.", 
    "Chairs are cool and modern. size is just right. only wish it came with cushions", 
    "Good solid chairs I rather go with these then the cheap wood kind. The wood after ia few months sometimes become shaky. Not to worry this is all metal and looks awesome fro the vintage modern look!", 
    "these chairs are awesome. I purchased one set then another after the first set came since they are stylish, durable and great looking. Especially would recommend for a rental house. Super nice looking and well made for the money.", 
    "GREAT chairs! Amazing price for some great chairs! Very Very happy with this purchase!", 
    "Great set of chairs. Feel pretty comfortable and look great. They have a little more of a bronze tone to them than what I expected from looking at the picture online, but I still really like them.", 
    "I feel like these are more readily available now, but still think this is a great price for the quality. I use in my dining room, along with a collection of mis-matched chairs and an old church pew. Really comfortable to sit in.", 
    "looking for industrial style chairs to go with wood and metal dining table. These were half the price of World Market and just as nice! Exactly what we wanted.", 
    "I have had these chairs for a year now and they look brand new plus they are easy to clean and give my dining room the perfect industrial look that I was going for. Great buy at a great price!", 
    "For this style chair, these are a great price. I like how they look and how the arm curves around. The only negatives are that they don't fit all the way under the table and there is a small gap between the seat and where the back connects to the seat in the middle. I have a toddler and wanted chairs that were easy to clean and food can get stuck in that little crack. For most people that probably wouldn't be an issue, but it is hard to get stuff out of there.", 
    "I have a farm table and they look great coupled with a bench!", 
    "Beautiful chairs! I get compliments on them all the time.", 
    "Came quickly and all in one piece... they are perfect for our country style home. And at a great price!", 
    "We bought 12 for a conference room. Very inexpensive. Very durable. We ended up having cushions made for them that cost more than the chairs but well worth it on cold winter days and long meets.", 
    "Great chairs. Great price &arrived quickly.", 
    "They look just as pictured and all arrived in great shape and all were matching tones. Comfortable for a few hours of card playing", 
    "These chairs scratch tile easily and also the metal scratches easily, but thats to be expected. overall these chairs have that modern look everyone lusts after and they go perfectly with my wood top table!", 
    "Comfortable and stylish! Great addition", 
    "I had a small round table that I refinished and I needed smaller chairs to go with it. These are perfect! They have a small width, but work absolutely perfect! Glad I made this purchase", 
    "These are very decent chairs. My other half thinks they are hideous, but they are practical and do the job. I did buy seat cushions for them and have had not complaints from other friends or family.", 
    "love love love.........I love them so much that I ordered two sets of 4....great super quality...", 
    "They came in fast and look great with my farmhouse table. They are comfortable and a good size.", 
    "These chairs are great quality, very cost efficient, shipped quickly and go great with the Tabouret rustic bar stools!", 
    "I ordered these to pair with a large farm house table and ivory setee. Looks fabulous and much higher end than the price indicates. The Restoration Hardware look at a fraction of the price.", 
    "Sturdy and fashionable. And a great deal. We ended up re-rdering another set!", 
    "I read the reviews here before purchasing and I was concerned with the size of the chair and them being too small. I actually think they are perfect. It's true a large person wouldn't fit in them but my 180lb husband fits comfortably. The chairs are sturdy and look expensive.They did come with scratches and even a few small dents but because I got the copper looking ones it just added to the rustic feel so I didn't send them back.These really chairs are a steal at this price.", 
    "We wanted something interesting, and comfortable to go with the farm table we made. These are perfect! We have received numerous compliments from family and friends. Thank you!", 
    "These chairs were a great buy and were exactly as described on the website. The chairs are for normal weight range (less than 250 lbs.) and size. Would not recommend them if you have oversize family members. Finish is rustic yet distinguished. Chairs can be stacked and are nice for small kitchen or dining area.", 
    "love them, very comfy put them with my mahogany table looks good", 
    "Better than expected. They come fully assembled and are welded together which makes them super strong. Nice seating area for my big butt. :)", 
    "Came pre-assembled. Simple but great looking structure. Feels sturdy like higher end pieces.", 
    "Received these chairs quickly and they look wonderful!", 
    "They are in use in our furnished rental and the renters tell me they are comfortable. They appear to be holding up well.", 
    "These chairs are awesome and look perfect in a dining room setup", 
    "I needed additional chairs for my dining room. These blend well with a my wood table. They are comfortable.", 
    "Provide an industrial look yet are very comfortable. Love them!", 
    "They are nicely stackable and good looking. I like them much better than folding chairs and they are much more comfortable.", 
    "Chairs are awesome! We mixed these in with tufted linen chairs and a bench for our dining room set. These chairs made a great addition to the mix. And you can't beat that price!", 
    "Very modern industrial look! Comfy, just add some seat cushion because it can get cold in winter. Very chic!", 
    "One of the chairs was severely scratch in several places . I'm too lazy to send it back so I will live. But they need to work on their quality control.", 
    "Super fast Shipping. Quality is good. Think they just spray painted them before sending them out. But good value for the money. Modern, but a bit hard and cold on the butt ;-) Think need to get some pillows for the winter :-) Overall happy with them :-)", 
    "They don't stack super easily but I ended up using as dining chairs because they are so cozy and gorgeous.", 
    "I just love these chairs. Rich color, substantial. These vintage industrial chairs are comfortable and have plenty of room for any but the heaviest. Just the look I wanted to go with my natural butcher block farmhouse table. After reading other reviews I was concerned but they exceeded my expectations. Comparable to Restoration hardware quality but so much less money.", 
    "Love the style, color and chair!! Very modern. My only complaint is that the paint chips easily. So with kids that push chairs into the table hard and are rough on everything paint is already chipping where the chair hit the table on the arm rests. Otherwise I love them!", 
    "I paired these industrial-style chairs with the mid-Century modern Canvas White Wood Dining Table, and it's a great look. These chairs came in one box stacked and fully protected by plastic and styrofoam casing. They look sharp, and their low profile makes them a streamlined option perfect for an eat-in kitchen or similar. (They'd be cool as bedroom seating too!)", 
    "These chairs are excellent. Sturdy, good height for a hip-height table (the can push in) and the color is a bronze patina. We have a light grain wood table with flecks of the same color, which is a nice complement and brown furniture, also a good compliment. They all arrived in perfect condition and it was as easy as pulling them out of the box with your significant other, sitting down and enjoying a glass of wine!", 
    "These chairs are fantastic! 4 for the money is a steal! They are a bit smaller/tighter fit in the seat, but they are beautiful.", 
    "Very sati supplied with this purchase. I LOVE the look and the design of the curved arms. Very beautiful for an industrial look (which is not exactly my look). They look well made and like they are worth more than we paid.", 
    "We lucked out on these chairs - for a group of 4, the price cannot be beat. They add a perfect modern rustic look to our dining room. We love it!!", 
    "These chairs look great in my home. Very stylish.They are pure metal. I just wish they came with something to protect them from scratching the floor.", 
    "Awesome chairs. Stackable. Comfortable. And trendy. We love them. Got two sets.", 
    "I love these chairs. They are sturdy and heavy, well-made, and exactly as pictured. Mine are completely smooth (no \"rustic\" markings or imperfections), which I am happy about. They have a slight bronze tone to them under the right light, which I think is great. I paired these chairs with a round wood (dark-finish) dining table I bought from a higher-end furniture retailer, and these chairs look absolutely stunning with it. I'm very happy with this purchase. I read several reviews before purchasing, and saw most people complain about the size - well, the dimensions are listed in the product info section, and they are CORRECT, so read up before you buy.", 
    "These chairs are amazing. They are comfortable and look so awesome with my handmade kitchen table! I get a ton of compliments on them.", 
    "I was looking for industrial style chairs but everywhere I looked they were about $$$ each. I saw the ones at ****** similar but the reviews weren't good- you had to build them and they were smaller. So when I ordered these I was surprised that they came stacked neatly in a box and ready to use! If I had a bigger table I would definitely purchase again!", 
    "I ordered these chairs to add to an industrial modern design, They are the perfect accent to pull this together.", 
    "Two chairs damaged !!! We just openedBox to find two very damaged", 
    "Loved them, great buy! Great quality.", 
    "Love these, they go perfect with my elegant industrial dining room.", 
    "The title of this post says it all. These chairs are study, well built, and fashionable. No reason to complain here!", 
    "These chairs are sturdy and fit our decor real well. Plus the shipping was faster than expected. Thanks Overstock !", 
    "Adorable chairs, but far too small for a regular dining table. Also, seat is 15 inches wide, so a bit pinchy for a regular sized person. Patina is great and these would be wonderful with a bistro type table.", 
    "Was a bit more golden looking than expected, but overall a really really good chair for the price!", 
    "great size, great price and quality", 
    "PERFECT! I made a table -- industrial piping for the base and dark-stained wood tabletop. These chairs were a perfect match for the look I was going for. Although they are metal, they are quite comfortable! I actually ordered 4 to see if I would like them, and then ended up purchasing four more! Highly recommend.", 
    "We have these paired with our farmhouse table. They look great, though not uncomfortable they are metal. Look great and functional with kids!", 
    "I purchased these for my house that I have elderly parents in because I was scared every time some one would sit on the old wooden chairs I had. These have been wonderful so no worry when some one sits down. Had lots of compliments on the chairs and people wanting to know where they could get them. Great Chairs.", 
    "We bought a new table with out chairs and these were exactly what we were looking for. Great packaging, on time delivery and most of all! She was very happy!! LOL!!", 
    "I fell in love with these chairs at a friends house. She had recently ordered a set for her new home and after falling in love with the look and sitting in them for several hours (comfortably) it was a no-brainer. If you love the look, order them...you will not regret it!", 
    "Great chairs! I am 5'10\" and they are more than spacious and comfortable. Arrived in perfect condition and assembled. Recommend.", 
    "Bought these to go with the Ink and Ivy Concrete Dining Table. They look great and are quite comfortable. I added some leather look cushions from Pier 1 to complete the look.", 
    "These are nice knock offs. They are heavy and solid, while maintaining their aesthetics. We have kids day so these are perfect for us. No tip overs yet!", 
    "exactly what I was looking for", 
    "Great chairs love them! Would recommend", 
    "i just added cushions & I love how heavy these are, not too heavy where you can't lift it but too heavy for kids to move easily", 
    "love them and the ability to stack them and store is great", 
    "I love these chairs. They look great with a vintage/industrial feel and they are sturdy. They stack to boot! Great buy at a great price!", 
    "We have 12 of these chairs and we love them. Very versatile. Everyone comments on how great they look (we have ours paired with a farmhouse table from **). They aren't the most comfortable chairs to sit in for long periods of time...but with 4 small children we wanted something that was easy to clean that would still look great. We've had 8 of these for the last 2 years and just needed 4 more for our basement kitchen (or just added seating, as our table can seat 12). I was concerned that they wouldn't be the same but they match perfectly. We use them outside too on our deck when we need additional seating (parties or large family dinners). They are great! :)", 
    "They are solid, comfortable, and perfect for the dining room.", 
    "Perfect for my needs, light weight, stackable and attractive.", 
    "LOVE these chairs....very light and stylish! Great addiction to our deck.....wish I had more.", 
    "Love the look & they seem to be sturdy & will hold up well. Easy to clean. Actually comfortable. Only drawback is the seat size; it's not built for \"hippy\" or larger people. I liken it to the width of an airplane seat.", 
    "These chairs are great for our porch, with or without cushions. We brought one inside our mountain home for bedroom use - nice size for sitting while dressing. We will keep the others in the garage over the snowy winter, but they would work year-round outside in warm climes.", 
    "I love the vintage feel these have. If you were going to be sitting in them for hours and hours, they would not be the most comfortable. For a meal and chatting though, I don't find them to be uncomfortable. Would buy again.", 
    "Cant beat the price! Very nice to have with a toddler, and really aren't uncomfortable. We added cushions to them for guests, and it actually looks very nice, just have to get creative with tying the cusions down since the back is like a razorback, not the typical back that cushions are made for.", 
    "These chairs are really nice, but...they have a few issues. Three things to keep in mind. One, the color isn't quite what is shown on-line. There is a lot more gold tones in it than I expected. Two, they are a bit narrow for someone who might be larger than average due to the arms of the chair. And three, the arms make it difficult to push the chair under the height of a table, so expect your chairs to be sticking out more than normal chairs do. These points aside, these chairs are very sturdy and look great.", 
    "The chairs are very nice for a rustic type of look, however, they are too narrow for most people to sit in. We had to return them and are going to purchase the same chair without the arms.", 
    "Great chairs and they are so stylish. I love the way they bring together my kitchen/ dining area. I have a round black Ronin table and the chairs make it pop. It also looks great in an area with black granite counter tops...like mine! I love it!", 
    "Great looking chairs--and they stack!Good for indoors or outdoors.", 
    "I love these chairs. Obviously wasn't expecting the most comfortable chairs when I ordered them -- and they're not, but they are gorgeous and look great!", 
    "They arrived in perfect condition. The color is perfect. I love that I dont have to worry about my kids messing then up. We have used them for 5 months and not one scratch - and I have a 5 & 3 yr old! I have recieved tons of compliments on them with my farmhouse table.", 
    "We were looking for some chairs to complement a concrete top dining table we purchased. The metal was the perfect mix against the concrete and wood. Very comfortable too. Absolutely love these chairs!", 
    "We are wanting to buy the bar stools to this also at some point because they are very comfortable! We are tiny people and they are great! Very sturdy and thick feeling metal with a smooth finish.", 
    "Great chairs with a rustic wood table, Comfy. They are rustic looking, just what I wanted! Not flimsy, sturdy when sitting in them.", 
    "We picked these chairs (vintage color) to go with an industrial style dining table. They are a great pick. Much more comfortable than expected for a metal chair. I thought the arms would get in the way, however I prefer the armed chairs over the side chairs (the seats of which for some unknown reason are about 1.5\" shorter.) I wish I would have gotten 8 of these instead of 4 armed and 4 side chairs. They came packed securely and are a great deal. I highly recommend.", 
    "great look for a modern dining room! not much comfort", 
    "I love these chairs! They are perfect if you're going for the industrial look. I bought these to go with the Dorel Living Trestle Wood Dining Table and they look great together. I also added seat cushions and they are much more comfortable.", 
    "I can't believe how reasonably priced these are compared to elsewhere! We received ours, one was bent, and Overstock immediately sent a replacement within the week! They are sturdy and look great with our rustic dining table.", 
    "I really enjoy these chairs. They seem to be high quality, but only complaint is they sit a little low. I have a circular table and these chairs sit about an inch lower than my old chair.", 
    "Delivered on time, Packed great. We had an issue with one chair, we called the company and the made it right immediately", 
    "these are the most uncomfortable chairs I have ever had. small, oddly angled and generally painful. I'm a size 12 and my husband is 6' and neither of us can deal. Keeping them to use for company as they are tood ifficult to send back but these are a better, more comfy option *", 
    "These are exactly what I wanted! Love the color! I love that they stack. Great price! I actually think I am going to order another set! Don't tell my husband! ;)", 
    "Great set. Would recommend.", 
    "These go perfectly with my industrial dining table, very sturdy and great bronze metal color", 
    "Their chairs look great in my dining room.... constructions seems good, lightweight, pads on feet keep them from scratching my hardwood floors... I will have some cushions for those late night card playing tho... friends complain they are not very comfortable but I didn't buy them for 6 hour sitting LOL", 
    "Very nice chairs love them", 
    "I bought these as a gift and my daughter loves them!", 
    "I bought two sets of these to go around a large dining table and I love them! They really add character, are comfy to sit in and look amazing! Received lots of compliments on them!", 
    "I love the color and quality of the metal; however, I've been keeping these under a covered roof in moderate climate and after a month I've already noticed that they are starting to rust. So unfortunately, I may have to repaint it soon with a rustoleum color.", 
    "The great industral look and comfort made this a great pull-up dining chair. You won't be disappointed.", 
    "excellent value for a 4 piece set, really sturdy and color goes great with other industrial style furniture in my apartment", 
    "These chairs look great. And even my 76 year old mother said they were comfortable!", 
    "I searched all over for these style chairs at an affordable price. The 4 fit perfectly under my round 18\" table with room to spare. The seats are really comfortable and roomy. So glad I got them!", 
    "Arrived on time, well-packaged, no damage. Very cool, stylish chairs that match the rustic look of my home. A little sharp on the edges, but not so much that it would cut you.", 
    "They arrived to my home in time and they are perfect! I have received countless compliments. They really do go with any table!", 
    "Just as pictured. Very comfortable and incredibly sturdy.", 
    "Absolutely love these chairs - comfortable and classy. Finish is beautiful", 
    "I love these chairs. They were fully assembled and feel really sturdy. The color is perfect.", 
    "These chairs are a beautiful, rich color. Very sturdy and well made.", 
    "These are extremely sturdy, I wish I would've gotten a different color bc the brown rubs off easily.", 
    "Price was great quality was even better.", 
    "Don't let anyone sit on the back, it will buckle :-(", 
    "Awesome chairs. Great color.", 
    "Very nice. The only thing I have to say is it is not comfortable for people overweight.", 
    "Love these chairs for the price. I was worried they would be too low profile for my table, but they work great!", 
    "Got them last year and they are still looking good.", 
    "Super happy with my purchase. They arrived nested together in a box, carefully packed with foam covers and plastic. No scratching or damage. The feet are level and the color is uniform and just as I expected based on the picture.I'm 5'2\" and weight proportionate, and I could see how someone substantially heavier/wider than me (ladies size twenty and up) would not care for this chair because the hand rails curve inwards slightly in the front, so you might need to squeeze into the chair. But they feel sturdy and my 6'4\" 275 friend had no issues.Similar chairs cost double elsewhere ($$$ for two at ****** right now). I am using these around a ***** ******* table from ***** ******. I don't think I'll keep the upholstered head and foot chairs (also from **) but we'll see. Maybe I'll do all tabouret chairs.", 
    "Got 4 then got 4 more. Good for outside or in. They look really nice with my cement table or outside with a rustic wood table. Got a nice pad to go with them which makes them more comfortable.", 
    "These are simple and sophisticated. Just perfect in our dining room.", 
    "I have had several guests comment about how surprisingly comfortable these chairs are! They look great and have a slight coppery tone to them in certain light. I like that the seat height is fairly low as I'm a pretty short and tiny woman. Overall, I am really happy with these chars.", 
    "long lasting quality. more comfortable than one would think", 
    "nice chairs. looks exactly as advertised.", 
    "these chairs fit perfectly under my table. i wish they sold 2 packs so i could compliment my larger table. good construction, intentionally non perfect finish adds to the character", 
    "I received my new chairs just the other day and I am beyond delighted!! They were packed securely and well cushioned. When we took them apart there wasn't a scratch or a dent in any of them. I have already gotten compliments from family and friends and would highly recommend them!!", 
    "We love them! But we did buy cushions because your butt hurts after like 45 minutes.", 
    "These chairs are very sturdy and have a beautiful patina that matches the original metal casement windows in my loft. I've paired them with a white parson's table and everyone comments on how surprisingly comfortable they are. Absolutely recommend and they are totally a steal!", 
    "They are reminiscent of Restoration Hardware with an affordable price tag. Hip dimensions are a little snug, but quality is amazing. One of the chairs leg was bent and Overstock replaced immediately.", 
    "Great value! Comfortable and stylish. They work well in my modern home.", 
    "Awesome beautiful chairs.", 
    "fantastic price, solid build!", 
    "Yes, I knew the dimensions before buying...but dang! They are so small! Other than that, very awesome!", 
    "These are sturdy, comfortable little chairs that we are using in the kitchen. They cost about half here what I've seen them elsewhere for, and complement our metal-clad breakfast table perfectly.", 
    "Nice chairs that are stylish and comfortable. Well made and sturdy. They stack easily and are a joy to sit in.", 
    "exactly as pictured, boxed very well. couldnt be happier", 
    "Great chairs! They go perfect with my table!", 
    "Look Great at my RH dining table! Comfortable and high quality", 
    "Price is great, they look great, sturdy, and are pretty comfortable too.", 
    "These chairs mimic much higher priced versions. They are high-quality and not as lightweight as some reviewers might lead you to believe. Perfect industrial/farmhouse look.", 
    "Nice looking. One had a flawed chair back (bent)", 
    "its exactly look as pictures. im very pleasure i bought them", 
    "I've had these chairs for almost a year, and I still love them.. This was a great purchase.", 
    "They look nice but are as comfortable to be expected for a metal chair... I put some chair pads on and it helped", 
    "Came quickly and in great condition.", 
    "I have been looking at this style of chair at many of my local stores. I loved the look but the seat always seemed small. I decided to give these a try and I LOVE THEM!! The seat was wider than most chairs I have found and are very comfortable. They also add the perfect look to my farmhouse table. Shipping was super fast and they were packaged nicely. I totally recommend these!", 
    "Highly satisfied with this set of chairs. My kids are worried about cold seats in the winter but nothing seat cushions can't fix.", 
    "Just what I expected but they do not push under our table like I thought. Great quality product for the price!", 
    "Industrial look, comfortable, we love them. Used with one of the black adjustable crank tables and they look amazing. Everyone who sees them is impressed. The price was great too. Very trendy as well as practical", 
    "Absolutely perfect chairs, very heavy and not flimsy like ones from Target which I bought then returned. These are sturdy and will last forever, so many compliments already! Also I have a toddler and think they are perfect. Yes he must be watched in them but love he can eat and get them messy but they wash easily. One set I ordered was damaged in shipping but Over stock quickly and without question, fixed the problem by promptly sending me a new set!", 
    "Really cute! Great chair for the price.", 
    "Comfy, stylish and affordable. I especially appreciate that they stack.", 
    "Love these chairs. They stack well, are very sturdy, and the price can't be beaten. Many reviewers have stated that the seat is small but I haven't had any problems. Great Buy!", 
    "Love these chairs - the patina, the quality. EXCELLENT.", 
    "Great office waiting room chairs.", 
    "After looking for chairs for months to go with an Antique mahogany table I bought, I shifted from looking for wood to an aged, metal look. I saw the combo in a design magazine, and loved it! The chairs are light weight, yet super sturdy! everyone compliments us on them when they come over.", 
    "I absolutely love these chairs. They are comfortable (for a metal chair) and stylish. Definitely worth the price.", 
    "These chairs were a great addition! Great quality value buy!", 
    "These came quickly and are exactly like the picture and maybe even better! I love the look and they are comfortable and durable! Totally happy with them!", 
    "These are easy to clean, sturdy and add a lot of style.", 
    "Look as pictured, and are actually pretty comfortable for being metal and flat. A nice rustic touch", 
    "loved the chairs, well made", 
    "Great chairs and an excellent price.", 
    "They were exactly what I was looking for and they match my dinning room furniture perfect.", 
    "Loved them so much I bought a second set. The style of the backs are a little low- perhaps reach 2 inches above table height, but they are stylish and comfortable. My 6'4\" husband can sit in them comfortably as well. Love the vintage finish! Gives them a rustic industrial look that goes great with my farmhouse style table.", 
    "Great chair for the price", 
    "I love the way the do NOT scrape the floor. Feel like they will last a lifetime!", 
    "I've priced these various places and these were a great day. were well made and shipped in perfect condition.", 
    "I loved these chairs. They are lightweight but sturdy, The color is true to what is shown in the picture. Surprisingly comfortable considering they are metal. I get compliments on them all the time. Love the way they look with my dining table. Would highly recommend.", 
    "I purchased these chairs first, and then decided to buy the counter stools to go with them. The quality is decent with some minor blemishes. The only real complaint is that the seats are cold, which I solved by making cushions for them.", 
    "Was worried about comfort - very comfortable, easy to wipe off and sturdy!", 
    "I had been eyeing these for a while, shopped around and the price could be beat. I love them very well built look great,, am going to buy 4 more...", 
    "Love them!! They are very comfy (for metal) and work great with our dining room decor. Excellent price.", 
    "Bought a set of 4 chairs recently. Two chairs came dented so i informed OS customer service. They quickly arranged for a replacement of the damaged chairs. My farm style dining table stands out with this 4 chairs and i get so many compliments!", 
    "Absolutely love these chairs and how they look in our kitchen. Comfortable. Great price chairs. Highly recommend!", 
    "I had my eye on this chairs for months. I decided to purchase them to go with a wooden round dinining room table. Very modern rustic feel. The chairs are stylish, durable and very comfortable. A must have!!!!", 
    "Bought these to go with a refinished antique table in my kitchen. I love how they contrast and compliment each other. They arrived put together and very well packed!", 
    "These chairs look great, are comfortable and have a nice industrial look to go with our modern rectangular wood dining table. The brown wood and the vintage/industrial looking grey chairs look great together. They are cold to the touch, so some people may want to add a cushion but I like them as is.", 
    "Look so much better than you would expect for the price. They don't look like stacking chairs...but rather a comfortable, industrial-look chair. I have them around a small wood and class table and I think they look great. I also think they would look just as good asa stand alone chair.", 
    "comfortable,as pictured great value", 
    "Sturdy and paint finish is very good. Only 1 complaint - there is a sharp angle to the metal where the chair back meets the top rail. A few people caught their clothing on it but we were able to bend it slightly and so far so good!!", 
    "Chairs are sturdy and better made than expected, however, they are a very dark bronze color completely unlike the finish shown here. They don't have any of the variation shown, either- just some shiny spots where they've been polished/sanded.", 
    "We bought these to go with the Tabouret table and they fit well. Absolutely no problem with them", 
    "I really love these chairs. Super affordable compared to what else is out there. They are a great shape and sturdy. The only reason why I didn't give these chairs five stars is for the bronze-y color you sometimes see in the right light. They are pretty true to the color you see online except for those random moments. Otherwise, great chairs!", 
    "Highly recommend! They stack neatly. Shipping was fast & packing was proper. They are perfect.", 
    "We love these. They look even better in person!", 
    "Great chairs for price, sturdy nice color. A little too short for my table though", 
    "Love the color on this chair and the metal is coated so not too cold", 
    "Love them ! light fun cool and comfortable!", 
    "These look great and were shipped fast. Fully assembled I'm very happy thanks.", 
    "These chairs are super cool! The color is a dark bronze with a slight iridescence. It goes great with our rustic wood table. They are sturdy and easy to clean, which both my kids have already put to the test! Highly recommend them if you are looking for that juxtaposition between rustic and industrial.", 
    "These were the cheapest tolix styled chairs I could find. They look expensive and wear well. They sit around a round table in my eat in kitchen area. I've received a lot of compliments on them.", 
    "We love these chairs! They're extremely durable and came in excellent condition.", 
    "These chairs are nice and pretty comfy. Be aware though that if you stack them up the finish scrapes off.", 
    "I love these chairs. I am using them around a game table and they look fabulous and add just the right amount of vintage to my setting. In fact, right after I ordered them I spotted the same exact chairs being used around a dining room table on the HGTV shoe Property Brothers! What an endorsement!", 
    "i have been looking at chairs similar to this style and they were running around $*** each! When I saw these on overstock, I knew it was a good deal. They arrived pretty quickly after the order was placed. NO assembly was required which is GREAT! And they look just like the picture. It gives me the exact look i had been dreaming of for my dining room - I had just purchased a farm table and was wanting something industrial to go with it to mix up the materials used in that room. I LOVE them! Great value and couldn't be happier.", 
    "Great color and lines. I really wanted a wishbone back chair but not the cost of a well made wooden one. After reading the reviews, I was nervous about the color, but it's great; I would describe mine as \"dark bronze patina\", though I am sure there are variations I did not find the paint finish \"runny or gloppy\" as described by another reviewer. My good fortune. To get the color of the finish there are probably 2 paint colors used; maybe black under and bronze over.The seats are the same size (15\"x15\") as other dining chairs in my home, but if one has a wide behind, the arm rest may cause a squeeze situation. Are there some sharp edges? Of course. They are metal chairs; any more effort in the manufacture of these to round out the edges would add to the price tag. They are super sturdy and have rubber caps on the feet. The arms start 26\" from the floor and are 32 at the back. Good info if a purchaser is thinking of nudging the arms under the table. The packaging was a bonus; the chairs were well protected and I didn't have to put them together. Who these are not for: toddlers and people with wide girth and not for someone expecting padding under their behind.", 
    "These chairs are great. Some reviews said they were small but I found them comfortable and perfect for our new home. The price was key as dining chairs can get so expensive.", 
    "I get tons of compliments on these cool chairs. They only look expensive. And as a bonus they are pretty comfortable.", 
    "Industrial look, for comfort you might need a chair pad. Beautiful design.", 
    "I thought for bring metal they will be uncomfortable but I was wrong. The chairs look perfect and are confi enough for the dining table", 
    "These are made so well. They go great with my rustic farm table. We have had them about 6 months and they are a blessing for parents of young kids... Easy clean up! They've survived meals, playdoh, paint, and spilled cereal! Look as good as new still. Finally a good purchase we won't need to replace.", 
    "Excelent nice chairs good quality", 
    "Was afraid that after a long meal with friends the metal would be uncomfortable on old bones and behinds but surprisingly they are very comfortable!", 
    "Chairs were just as pictured. They are very comfortable and the style is great. I only wish the backs were a tiny bit higher as you can barely see them over my table--likely the table's fault :)", 
    "Great chair for price. With many compliments.", 
    "Great looking dining chairs, good quality, packaged well but unfortunately with the arms they do not slide under my table so I have to return. Very disappointed. I thought table was a little higher.", 
    "These chairs are great! Just enough of an industrial look. I was afraid they would be cold but they aren't. Very comfortable and a great buy.", 
    "I love these chairs. Why spend four times more from other retailers, when these are perfect.", 
    "They are exactly the color I wanted (shown in pics). Not shiny and not silver. It is 100% bronze and mate. packaging is impeccable. there is no way these chairs can get scratched during shipping. Just one thing... I noticed there is one chair that would make a popping noise everytime someone would stand up from it. It doesn't happen with any of the other 3, just that one. Not enough for me not to loooove these chairs and the price.", 
    "These chairs are a good value, but each one came with a little defect of sorts. A scratch, a dent, a discolored patch. I find these imperfections ok, since they are distressed looking to begin with. Happy with my purchase.", 
    "Looks great! The kids can scratch the **** out of it and it will still look great. Used in the game/craft room. I don't sit on it because I have a bad back but a cushion can easily add more comfort.", 
    "These chairs are beautiful!!! Super quick delivery (ordered Sunday evening, received them Wednesday evening) Paint color is even and there are no sharp edges and they are surprisingly comfortable. Excellent packaging.", 
    "GREAT DEAL. Color and quality is great. I would definitely recommend", 
    "I was hesitant to order these chairs as I was afraid they wouldn't be sturdy or comfortable. They are quite comfortable, nice back and arms and so far seem to be sturdy; although they've only received minimal use thus far with a family of four. My husband is comfortable sitting in them he's average weight and just under 6' tall. They are in my kitchen nook area and a bit chilly to sit on first thing in the morning, so should feel great on a summer morning! The way the arms are designed makes the seat a bit narrow, so could be a bit snug for a wider bottomed person.", 
    "I ordered these chairs to go with a farmhouse style kitchen table. I looked all around for chairs that would work and for the value of this set, they absolutely cannot be beaten! They are sturdy and hold up to daily use for my 2 and 4 year old children. They don't look like they are only $50 apiece and the industrial look of the chairs pairs perfectly with the rustic table in the vision I have for my kitchen. The finish (color-wise) is a little inconsistent, but again, that goes with the look I'm going for. If you want a finish that is 100% uniform, just be aware of that. I would absolutely order these again!", 
    "We ordered these as an extra set for Thanksgiving dinner. We ended up liking them so much, we plan to keep them around the breakfast table year-round. They appear very well made, are study, and easily stackable...useful cleaning up. Very happy with these chairs.", 
    "Bought these for a small kitchen area, perfect fit. So far they are holding up, I worried about scratching easily or no holding up to cleanings after spills, but they are doing ok. Really good for a smaller table since they are shorter an lighter weight than regular dining chairs. Looked all over and for the price, these were a great deal.", 
    "I really liked the look of these online, very nice patina. However, in person, they just look very flat dark brown. Too close of a match to our dark wood table when i was looking for contrast.", 
    "I coordinated these chairs with 2 fabric end chairs for my dining set and they are GREAT! I'll just add some pads to make them a lil more comfy and soften up the appearance.", 
    "Love these chairs they go perfect with my table i got from ***** *** ****** (wood top with needle nose legs) buy these! You won't be disappointed", 
    "Bought these for breakfast table. Wanted sturdy and easy to clean chairs secondary to two year old. These met my wants beautifully. Would buy more if needed. Attractive and surprisingly very comfortable with good back support.", 
    "They are perfect for little people to sit on because they are durable and sturdy.", 
    "If you need extra seating and are limited on storage ... these 4 chairs take up about as much room as folding ones will and are much more sturdy and visually appealing. While I wouldn't recommend sitting on them for hours w/o a pad - they're great for those times you need just a few more chairs. I've seen others are retail stores for 2-3 times the price here on Overstock.", 
    "Love thee chairs , very stylish, comfortable and stackable!", 
    "These chairs are an absolute steal. I shop for everything on the internet and I'm shocked at this price. The chairs are comfy enough, they are sturdy, they have a great color to them and the cost is ridiculously affordable. When they are back in stock I'm going to buy another 4-pack eventhough I only need two. They are that worth it.They look great anywhere, but I use them with my cherry kitchen table. I'm 6'4\", 215lbs and I find them comfortable.", 
    "I'm in love with these chairs, they are extremely sturdy and the finish is awesome. They look great with a wood table! I ordered these as a replacement for the chairs that came with a set I ordered from overstock that fell apart. I wasn't willing to go with wood again after that. These look good in any room of the house they are so versatile I can see having these for the very long haul.", 
    "These chairs are very comfortable and my order arrived quite fast. However, I am very disappointed from the quality of these chairs. Their quality is very poor. One came dented, others have scratches and uneven coloring.", 
    "I have already recommended these to another friend. I love these chairs and they fit perfect in my smaller dinning area.", 
    "These chairs offer style and value in one sturdy package. They were delivered quickly, and while well-packed, I had them out of the box & ready to go in just minutes. I was a little surprised at the coloring. With my chairs, \"vintage\" looks like matte, aged bronze. I thought they would be more of a dark grey, but they still work fine. I'm pleased.", 
    "Sweet chairs, very sturdy and quite comfy. As always, arrived in great shape and quite quickly. Gotta love overstock!!", 
    "I fell in love with the rustic/industrial look recently while in Crate and Barrel. I already owned a large natural wood farmhouse-style table. The chairs in Crate and Barrel were expensive. I found these on overstock which replicated the style perfectly. However, budget friendly especially in a family centered home with the kitchen being a high traffic area! I LOVE these and would definitely recommend.", 
    "These chairs definitely have a vintage feel. The color is a quite muted bronze - which I like. It is not too overwhelmingly metallic looking.They stack well. They are comfortable, though I am not sure they would be comfortable to sit in for hours and hours. Note the width is just a tad narrower than many kitchen chairs. For my purposes, this is fine.", 
    "We read the reviews and thought it might be a risk but the price and style looked like a deal. They arrived well packed although one chair of the eight had a bent back, not too bad. These are outdoors for an old twelve foot farm table so rustic is good. They been in the rain and if needed we'll touch up with rustoleum. Comfortable and we aren't kiddie sized. Didn't notice any scary rough parts although I am sure if I searched I might find one. Didn't expect perfection at this price point.", 
    "Super cute sturdy chairs!! I was concerned about the seat being too small but, it is very comfortable even for my larger frame. I love them so much I want to buy another set of four to scatter around the house.", 
    "These chairs have everything going for them -- rock solid construction, excellent industrial/mid-century design, and comfort. I was concerned that some of my larger guests might not fit well, but even some bear-sized men have dined comfortably. I paired mine with a white Saarinen Tulip Table. They look fabulous. I wish they were sold in singles or pairs -- I'd love 2 more!", 
    "These are the best quality chairs for value out there if you're looking for burnished metal. I had previously bought another brand and they looked cheap and shiny. These are actual finished metal and look striking next to my white table.", 
    "I absolutely LOVE these chairs! I was impressed at how well they were packed during shipment. I ordered two sets, so a total of four. They are exactly as pictured and actually really comfortable!", 
    "I shopped around for these chairs, and of course found best price with Overstock. They are top quality and did not disappoint. This finish gives the chairs a vintage quality, and they were expertly packaged so everything arrived safely! LOVE them!", 
    "We actually ordered a good deal of these chairs for a lobby space and they worked out great! They are comfortable enough to sit in for an extended amount of time. Plus they look good.", 
    "Exactly what we were looking for. Vintage look goes well with reclaimed wood table. Would recommend tabouret bench as well. Very sturdy chairs.", 
    "I love the industrial vintage look - they are a taupe/gray", 
    "We absolutely love these chairs. They arrived stacked together, packed well and in only three days. They are beautiful and well made and the paint effect is perfect vintage. Very happy with these, and even on ****** the price can't be beat - on other sites this price for a similar set only gets you two chairs!", 
    "Beautiful look and match for grad-student apt. This is gorgeous w/gray-stain \"farmhouse\" table..", 
    "Love the vintage look of these chairs paired with our rustic farmhouse table they are perfect!! They are amazingly comfortable for a metal chair", 
    "these chairs are awesome, great looking and great value", 
    "These chairs are very cool and were accurately represented online. I received them quickly, and they were well packed and undamaged. They're just really cool chairs, and the stackability is a nice feature. I will probably buy another set and store them stacked for when I have a full house.", 
    "So affordable, we don't have a ton of company, so we didn't want anything terribly expensive, so we paired these with 2 nice leather chairs and a custom made reclaimed bench and table for a rustic modern funky look. These truly fit the bill. They are just very interesting.", 
    "We needed to replace our kitchen chairs. The style on these are perfect and coordinate nicely with the hardware on our cabinets. They are painted so there is some variation in color but they work nicely in our space. We also got matching counter stools which complete the look.", 
    "Bought these for my son's first apartment as he starts his first real job. Very cool look and a vast improvement in price over expensive catalog brands. He reports that he and his football-player-sized friends find them comfortable, too! Quick shipping!", 
    "Love the look and style of these chairs. They work really well with the smaller dining room table I ordered them to match. The finish was noticeably damaged on one of the chairs and a new one was sent out and delivered within 5 days. Perfect for someone that likes a modern industrial style chair.", 
    "These were what I was expecting when I ordered these chairs. Color, style and quality all seem good and were well-represented, and they arrived in good condition. They are a little smaller than what I imagined (I wish a person was in the pictures with the chairs so you can see scale) but they're still comfortable for metal chairs and look nice.", 
    "Chairs arrived very well-packaged and undamaged. Really nice quality, although a touch small, but manageable. My only problem was that each chair has a notice on the bottom which says it is not suitable for outdoors and cannot be exposed to water or direct sunlight - which I didn't see mentioned on the website description. I bought these for my terrace so that will be a problem.", 
    "These are just what I wanted... however like the other review said, they aren't a BIG seat so to speak, there a bit of a smaller scale which is fine for me but for a larger person they may not be so comfortable... I do want to thank the other reviewer for mentioning the tabs under the seat as one did fall as I was unpacking them and my cat immediately put it in her mouth, glad I was right there as it would NOT have ended well... PULL THEM OFF if you have kids or pets, they don't serve a function outside closing the hole under the seat, you won't miss it, but I do appreciate the finishing tough IF it weren't an accident waiting to happen... VERY well made...", 
    "The chairs arrived shipped in a sturdy box. They are exactly as described. They have a sort of rubber bottom which is exactly what I needed for my hardwood floors. Even though they are metal, they are comfortable. I don't see any reason why they won't last a long time. The style is perfect for us.", 
    "They're metal chairs! They fit humans! Cushions may be desired... good quality. Would buy again, if I already own 4.", 
    "These chairs are perfect for our eat-in kitchen! They're low-profile, lightweight, and very cleanable--but they still look stylish. We had purchased some counter stools in a similar finish and style from a high-end retailer that were 3x the price. Took a chance on these to save some money, and I'm so glad I did! I ordered the set of 4 and then 4 more because I liked them so much, just to have extra seating. With 3 little kids under the age of 6, I needed something wipeable and easy--but still wanted enough seating in case we have guests or extra kids around. No, they aren't the most comfortable chairs in the world (they're entirely metal, after all!) but they look great and I love that I can stash them out of the way if I don't need all 8 chairs at my table.", 
    "We paired these chairs along with the matched bench sets around some large wood block tables in our beer hall and tasting room. ... they're perfect.", 
    "I read all the reviews on these chairs before purchasing. Since almost all were favorable, I felt comfortable in buying them. Since they will be used mostly for the occasional dinner party (I won't need to use them every day), the fact that they can be stacked and stored in a corner of the dining room is a nice feature. Some of the commenters said that the chairs were hard on the bottom after one sits for a while. This was easily remedied by the addition of 16-inch square throw pillows. I already had an assortment of these in ethnic textiles. Using them in the new chairs gives my dining room a colorful, boho vibe. So glad I found these on Overstock.com at this great price.", 
    "Industrial, comfortable, sturdy. Really happy with these! The color is great.", 
    "They're a little smaller than I expected, but that ended up working out well with my space. The color is just like that in the picture - gunmetal gray with a hint of sheen. The slope of the back is great, very comfortable, and the arms are helpful but not so intrusive that they feel in the way. Overall, a good deal for nice chairs with a modern aesthetic.", 
    "Great value here, Chairs are great to go with a cream wood table or dress down to have outside for gatherings. They stack up easy and can be cleaned with just a damp cloth. Talk about a great buy!", 
    "Great chairs. Purchased vintage as well as silver colors. Chairs have heavier feel to them showing quality materials and construction but can be moved without struggle. Comfortable even without cushions. Had an issue with UPS banging up the chairs during shipment which was handled by overstock after only one email. Great customer service.", 
    "Great look for the price. Not for large people. Edges are a bit sharp. I added seat cushions for comfort.", 
    "These chairs are absolutely perfect. They are made well, look nice, and are very affordable. We have a substantial farm table, and they do sort of disappear around the table, but if you keep them pulled out a few inches, they look great. They are very comfortable, all things considered, and I am very happy. Tremendous value.", 
    "Very satisfied about this purchase. The chairs are perfect, accurately described. Overstock customer service was very helpful. Two of the chairs had been damaged during delivery and they processed replacement in less than a week.", 
    "Chairs are very attractive and really solid. Also stack easily. Very pleased with this purchase.", 
    "I purchased these chairs for my new Bath and design showroom to use in front of desks for our clients to sit. Nice chairs , great style, great finish, These chairs are made well, look great and fit the style I was trying to accomplish.The only downside of these nice chairs is the comfort.Great chairs, but not comfortable.", 
    "I like the chairs for their industrial look and they are paired with a small rustic table that has iron legs and details. They have a small profile which works well in my casual kitchen dining space. Their not built for really large hips or seats. Overall, I'm pleased with the purchase.", 
    "These chairs go perfectly with my vintage farm table.", 
    "The are downplayed just enough. I bought them to go with my new glass circle dining table with cherry colored base. They are just right and light weight but not flimsy at all. Just becareful taking them out of that box. they come stacked 4 to a box and I slightly bent one of the legs forcing it out of the box. Other than that I love them.", 
    "I love, love, LOVE these chairs! They look great and were a steal at this price! I've seen that some reviewers had issues but I certainly didn't. My chairs (and I bought 2 sets of 4 chairs) are all uniform in color without any sharp edges, scratches or other defects. They are quite comfortable to sit in and, as a bonus for me--I have 4 small children--they are a breeze to clean up! I also love that they stack together! I have our 2 extra chairs out of the way right now and can easily stack all the others up in one location when I need to clean the carpets. One warning though, they are shipped very securely and these, while lightweight, are more hefty than I realized. While trying to pull one of the chairs off of the stack in the package (I was unpacking without help), I got the back legs stuck in the plastic wrap/foam mess on the other chairs. While tilting the box and wiggling the chair, trying to ease it out, it abruptly broke free and struck me in the face, chipping my front tooth! Obviously I should have taken the time to remove everything before pulling the chairs out or at least waited until I had help!", 
    "These are great stylish chairs! High quality and easy to clean off from messy kid hands!", 
    "I purchased a rather expensive farm table and had to get chairs on the cheap. I gambled on these and they are awesome. Top quality and style. You won't be disappointed.", 
    "In love with these chairs. They don't feel cheap at all, heavy and the perfect color. There aren't any chairs out there this style that are this good a price, especially for four. Surprisingly more comfortable than I was expecting. I would absolutely recommend these chairs.", 
    "Great chairs that could either lean industrial or mid-century modern. Quality is great for the price.", 
    "Great chairs for the money! Used with a farm table and bench, it looks fabulous!", 
    "They are perfect for the industrial look I was going for.", 
    "very glad I purchased... Highly recommend them to anyone looking for metal chairs Great construction Very durable And just the right size", 
    "The chairs arrived in 4 days. They were well packed. I loved the chairs. The vintage color was just what I wanted to go with my farmhouse table. Previous reviews talked about the size as being a problem. The size worked for our average size family. The info stated that the chairs were powder coated. But they do not work for outside. I have had them for only 4 weeks, and we have had 3 rains . They are totally rusted. I am so disappointed. NOT FOR OUTSIDE USE.", 
    "Great product at a great price. I looked for metal chairs for months and the cheapest I found was $XX a piece without arms, what a steal.", 
    "These chairs are better than I expected and comfortable. Very sturdy, yet easy to move around", 
    "These chairs go GREAT with the Cabin Creek dining table! Arrived in perfect condition.", 
    "These chairs are hip and stylish. I need a more low profile chair for the kitchen, instead of high backs. These fit the bill and updated my kitchen. I like the vintage industrial look, but only need a touch, not a total kitchen of it.", 
    "Two chairs were bent when they arrived. We just kept them anyway, but that was disappointing.", 
    "I was really tired of my old oak high back chairs and needed a change. These chairs are IT! I was a bit nervous how they might \"sit\", but after they came and got unpacked and my husband and I sat in them....they pass the test!!! The color was as expected (and lovely) and they were packed well and arrived in perfect shape.A couple of things: because they all have arms, there is a physical limit to the size derrierre that will fit into them. A friend of mine who is rather large sat in one and said she would be comfortable only for a little while. The other thing, being metal, they will be colder. I plan to buy or make cushions later when the colder weather starts.I love these chairs!!", 
    "We've been looking for sturdy, interesting chairs for a public space where people sometimes need to sit down, and kids are among them. Upholstery can be damaged. These metal chairs cannot. Thanks so much!", 
    "While these chairs are definitely on the \"smaller\" side, they fit perfectly fine for my husband (5'10\" 200 pounds), myself, and my two kids. We figured beyond that, guests won't really be using these chairs and we'd just pull from the dining room. My favorite part is how easy they wipe down--with a 1 and 4 year old, clearing upholstered and wood chairs was becoming quite a nuisance, but these chairs wipe clean in a matter of seconds! I did add felt bottoms to the legs because the plastic was pretty loud, but now they slide easily. Great prices for the money!", 
    "Love these chairs. Affordable, kid friendly, easy to clean and stylish. Paired it with our trestle table for a vintage eclectic feel.", 
    "The chairs were inexpensive, relatively speaking, but you get what you pay for: they're uncomfortable. Primarily this is because the seat is as flat as a baking pan, not at all molded to the body.", 
    "Nice chairs no assembly fir once. the only thing is its cold to touch in the winter. would recommend getting cushions if your going to sit for a long time. other than that I love them!", 
    "These chairs are an incredible bargain! They look fantastic and the fact that they are stackable is key. 2 of them had significant denting, but Overstock sent out replacements right away - no hassle.", 
    "I bought these chairs for a porch table outdoors. They look great and are comfortable to sit in with the back and arm rests. I will probably add a seat cushion to up the cozy factor. These shipped immediately. One chair was damaged in transit--the straight back was bent as if the chair had been dropped. Overstock customer service responded right away to my inquiry and promptly shipped out a replacement chair that also arrived quickly. REALLY APPRECIATED THAT. This is why I love shopping on this site. Great value & great service.", 
    "These are really great chairs. I have them in the playroom around an antique pine table and they really work well. They are on the smaller side and do feel more comfortable with a pillow. They could also go on a patio. I may order a second set. I really love them.", 
    "Very nice looking, sturdy chairs. I have 3 little kids and so far the chairs are holding up well. I ordered the \"vintage\" color, which is like a rusty-brownish color. They stack easily, so I can put extras in the corner of our dining room. As for the seat width, yes, they are narrow, esp. with the arms, but weighing over 150 lbs myself, I can easily fit, though it's a little snug.", 
    "I really love these chairs, very comfortable and look awesome with my dark table. One chair has a bend in the back but I didn't feel like dealing with sending them back.", 
    "Looks like XX but a small percentage of the price. The seat is a little small and I added cushions to make them a little more comfortable. Rubber pads on bottom are great too!", 
    "I had been looking for this style for a while- but could never find what I wanted in my price range. These chairs were well under what I expected to pay and heavy on the style. They are an amazing addition to my home!", 
    "I love how these chairs look with our farmhouse type dining room table. I am very satisfied with the chairs, however I wished I would have gotten the taller back ones that had no arms as these kind of make the chair feel smaller when you sit in them. Definitely taken a little time to get use to but I'm very pleased :)", 
    "These chairs are really stylish and we have already received compliments on them (not that that matters... we like them:) Well built and sturdy. We may get cushions for them, but that isn't really necessary. Awesome!", 
    "I love the look of these chairs, they really look like the picture. They are comfortable and give my farmhouse table some cool, contemporary flair. I have a couple issues with the quality. One of the chairs had a very sharp piece of metal that wasn't properly adhered to the back of the chair. My husband was able to take this off without it being too noticeable. Also, I have two small children. The chairs have rusted in some areas from wiping them and not drying them right away or from the boys spilling on them. I really wanted the chairs that are similar to the metal ones from crate and barrel. These were a nice alternate...the c and b chairs are 199 a pc and these being 200 for 4 are a really nice deal.. If you don't have to worry about excessive wiping and spills you will really enjoy these chairs.", 
    "Cool chairs! Great color and quality. I have them around a table on my screened in porch, and they look great!", 
    "Need extra office chairs but don't want some of the same old boring folding chairs? These stack nicely, have a cool color and matte finish, and don't look completely office-y, yet blend well with casual/ waiting room, type-decor.", 
    "Love these chairs with my farmhouse table. Surprisingly comfortable, though a little cold on my bum. Not for tall or big people. Probably best for people 5'8-9\" and under 200 lbs. My dad is 6'1, 195 and he said they were a little small for him to sit comfortably (low to the ground, so his knees hit under the table).", 
    "These chairs came beautifully packed, stacked together in a huge box, and are exactly as I hoped from the photo and description. They look great!", 
    "Durable, modern and exactly what I expected. Shipped quickly. A great value", 
    "An acceptable knock-off. Functional and well made. Works outdoors as well as indoors.", 
    "Love the look and the make! These chairs are exactly what I was looking for for our kitchen.", 
    "We ordered 4 chairs. They're obviously sturdy and slightly heavier than expected which is a good thing. We were concerned about them being so lightweight that they'd tip over but not the case.", 
    "I purchased four of these for my indoor play center party area after the first set of chairs we purchased began to break - literally as people would sit in them. They screws were always coming loose and it was only a matter of time before they gave out all-together. These are sturdy, great looking, and are exactly what I needed! LOVE THEM! Just completed my second order of an additional 16 more! *The stacking option is also fantastic should I need to move them out of the way - they are also one solid piece so there is absolutely NO ASSEMBLY REQUIRED!*", 
    "Finish is good, not really heavy weight, but well made for the cost.", 
    "These are sturdy, comfortable chairs. Reading various comments about the size of the chair seats, I had some concern but ordered them anyway. I'm here to say that they were plenty big for my ample seat. Nice chairs!", 
    "Nice chairs. Just like images and description. Hard to beat eight chairs for $***.", 
    "This is the best price I could find for vintage style industrial chairs to match our new dining room table. The pads on the bottom of the chair could be better and the packaging had far too much plastic for my liking but the chairs are so awesome. I would buy these again.", 
    "I was looking for four chairs to use around a small glass-top table for a short term rental. I didn't want to spend a fortune because I don't know if I will have a use for this furniture in the future. I am very pleased. These chairs are sturdy and attractive, and I can use them outside if need be in the future.", 
    "My only complaint with these chairs is that the finish is uneven on 2 of them. It is a bit streaky. I love the color of them!", 
    "Much more comfortable than I would have expected. They are well crafted and the color, though more bronze than it shows in the picture, thankfully it worked well with decor.", 
    "Great chairs at a fraction of the price at other sites/stores... love the vintage finish, which complements a variety of decor styles. I paired our chairs with a raw wood bistro table, and they look fantastic!", 
    "We bought a really expensive dining table that only came with bench seats. We wanted chairs but didn't want to pay $400-800 per chair for the ones we found that we liked and that suited the table. I've been keeping an eye out for chairs and stumbled across these. We ordered two sets - they arrived quickly and suit the table perfectly! Two of the chairs were damaged but I've never experienced such amazing customer service before - in no time two replacement chairs arrived! I have no idea how they could have been damaged as they were very well packaged - perhaps at the factory? They are very comfortable and my husband, who is tall and strongly-built, has no problem fitting easily between the arm rests. The only thing I would note is that because the chairs have a metalic finish their colour changes in different lighting conditions so sometimes appears more warm brown and other times more pewter/ dark brown. Amazing value for the price.", 
    "The chairs are as pictured, but here and there are discolorations in the metal.", 
    "I am really pleased with these chairs. They are cute, comfortable and versatile.", 
    "These chairs are a great deal (similarly styled chairs were selling for $XX a piece full price). They are sturdy and stylish. My only complaint was the finish. I am not sure if it just got worn off in places the protective padding was placed or if it was not done evenly to begin with, but not one of the 8 chairs we ordered were solidly covered. Other than that no complaints.", 
    "So, like a lot of the other reviewers, I had my doubts that these would be as awesome as they looked. I stalked this style of chair to the ends of the internet. Restoration hardware, world market, Target... the list goes on. Nowhere could I find nearly the price for the quality. Target has similar chairs but the dimensions were smaller and the reviews were negative. anyway, I took a chance, and I ordered 2 s/4= 8, and they fit PERFECTLY around my 6'6\" farm table. The are a good size - the finish is really nice, I got the warmer finish, I forget the name. And they are comfortable! This was my biggest worry but the arms are quite nice for leaning back after dinner for conversation. I can see where an obese person may not be the most comfortable in them, but any average sized adult will be perfectly fine. My husband is over 6' and was comfortable. I would absolutely say get these, they finished my rustic/modern approach to this farm table and I could not be happier.", 
    "These chairs are great. They look much more expensive. I saw the same chairs in a store for twice the money I paid at overstock.", 
    "Love these and the price is excellent. I would recommend to anyone. very rustic.", 
    "Great buy! I love these Vintage Tabouret chairs. I purchased them for my nautical inspired office and waiting room . The construction and vintage color is outstanding. I have lost count of how many compliments I have received. Couldn't be happier!", 
    "We ordered one set of these along with the matching bench and two different chairs for our dining room. We have a reclaimed wood farmhouse table with curvy legs and soft lines. I love the juxtaposition of the sleek modern lines of these chairs with the antique look of the table. The color is a lovely patina greige that keeps the chairs from looking too cold. I find the chairs to be quite comfy, though my husband prefers something with some cushioning. I'm a fan of arms on dining chairs all around the table and I like that the arms on these are low enough that they don't hinder movement and they can be pushed in somewhat. They're great for mixing and matching with other chairs. Some people have commented on the size being too restrictive for people with wider hips. I wear a size 16-18 and I fit just fine, though it may not be comfortable for someone who is in a size larger than that. The chairs were packaged very well with lots of padding and wrapping to prevent scratches, but one of my chairs was damaged anyways. I contacted Overstock and they sent a replacement in just a few days. In addition to being very happy with the chairs, I am blown away by the fantastic customer service that I received. I was a little cautious about ordering furniture online, sight unseen, but will not hesitate in the future to order big items from Overstock.", 
    "Love the Chairs, they are very comfortable and look terrific. I ordered 8 chairs, one came damaged and I called Overstock and they were very nice and sent me a replacement within one week! Great customer service and beautiful chairs. I would highly recommend this chairs to anyone! Very happy I decided to buy them.", 
    "These chairs look great with our farmhouse kitchen table. Easy to clean, sturdy, and hip--not to mention the price: all 4 cost what 1 or 2 would cost elsewhere. And you are not sacrificing price for style (I say this because the last thing I want is to have cheap-looking chairs, and these aren't). Some people said that they may not be comfortable for larger folks, but as a larger folk, I find them comfortable and plenty accommodating.", 
    "I love these chairs. I needed something sturdy that won't be easily ruined for the next few years at my toddler son grows up. These fit the bill becuase not only are they on trend right now, but they are stackable so when I am done with them in a few years I will use them as outdoor chairs. I did read a review saying that the arms made them a bit \"snug\" for larger people. I have seen a lot of people sit in them in the past few weeks and I admit that I do have one plus size friend who did seem a little squished. Although not to the point where I think she was uncomfortable. But I have also had large full grown men sit in them and there were just fine.", 
    "Yea, they don't fit ALL the way under the table. I still love them and their exactly what I was looking for.", 
    "Fast delivery and love the chairs! They are exactly what I was accepting.", 
    "Great chairs, at half the price of similar chairs available out there. I actually did buy 80 of these for my business- and have no regrets.", 
    "These chairs are a steal. They are great looking \"industrial chic\" and a good value. They are small, however they are perfect for a smaller space. Very cool looking chairs!", 
    "I love these chairs and the look of industrial metal furniture. These were a fraction of the cost of the more popular Tolix chairs, a French cafe style chair that I've been wanting to purchase. I love them and they suit our space beautifully. I was also interested in the painted red ones!", 
    "These chairs are excellent and sturdy. The bottoms of the legs are well crafted and not scratching our oak floors. I do agree with the other reviewers that these are not chairs for overweight people.", 
    "I love these chairs!! I am so glad we went with the darker color-- they look great in our mid century eclectic home-- slightly industrial, but European. I am surprised how comfortable they are! They only issue at all is that they don't slide all the way under the table, but they do go partway.", 
    "I was a little worried about the size of these chairs, based on other reviews. But they are great! My husband and I have no problems sitting comfortably in these chairs (both of us are average weights and heights). I love the look of these as well. We've gotten lots of compliments. And you CAN'T beat the price! I've seen similar chairs on design/decor blogs that cost double the price of these. Packaging was secure. They came without a scratch!", 
    "If you are looking at these chairs...they are a MUST have purchase!!! Can't imagine they will stay in stock!!! I've made many great purchases on Overstock but these are by far the best!!! Fabulous look in my dining room with a designer wood table!!!! Lots of compliments!!!", 
    "I got these chairs for my outdoor table. The style is great, but the color is a little different than I expected (more bronze, not silver). I think they should work fine, and I recieved the package within only a few days.", 
    "These chairs are great. I love the burnished finish and the vintage, industrial look. I was a little nervous purchasing these because I read reviews saying that larger people don't fit well in them. My husband is 6 feet tall, and weighs 190 and fits in these chairs just fine. My kids climb through the back since they're a little heavy for them to move but it works fine. I looked and looked to find a price that was comparable to overstock and couldn't find anything even close. If this is the style of chair you're looking for, get these! I waited until the furniture was on sale and saved even more.", 
    "Exactly what we expected! As with the other reviews, be warned that these are not for anyone above a women's size 12. Other than that, we love the color and the uneven worn looking finish.", 
    "These industrial chairs are a perfect compliment to my shaker style farm table. Rustic yet sleek, I've received millions of compliments from people that thought I paid 3x's what I actually paid for the chairs. Love them!", 
    "I ordered these for use in a new store. The store has an industrial look/feel to it, so these fit right in. They'll be used around some cafe tables in a seating area along with other chairs. I love that these stack and are one solid piece (no assembly required!) They're well put together and quite comfortable for a metal chair. At this price, I'm considering purchasing some for my home patio in some bright colors! Love these!!", 
    "The chairs match my decor perfectly, and they're actually really comfortable. I've already received a lot of compliments on them. These chairs as sold on overstock are also the cheapest price I've seen the like anywhere else - i believe they usually retail for $100+/ per chair elsewhere!", 
    "Love the industrial look- have seen for much more money.", 
    "I bought these chairs and had them sent to my daughter for her first rental house. They had an existing old dining table that I thought was ugly but, when paired with a set of these chairs, it suddenly looked stylish. These sit low and don't take up much visual space and I love the look of them. I went to get some for my own home but they were sold out! These came very well packaged with no damage and they arrived very quick.", 
    "These chairs are quite charming. I paired them with cream leather side chairs. One of the chairs came with a bend in the back. Overstock sent a new one immediately with only one quick phone call.", 
    "Has a nice vintage look and a good value for the price. Arrived quickly and was well packaged. Works well with other fixtures.", 
    "I received my chairs a few weeks ago and have been very happy with them. They shipped VERY quickly. I was a little upset that they are only sold in sets of 4. I needed 6, so had to order and pay for 8. The over-all style is great. I find them comfortable to sit in. They look good around my farmhouse table. I get compliments every time someone comes over. The color is a little more brown/bronze than I would have liked. I was hoping for more of an old \"steel\" color. They are a bit small too. My husband is 6 ft, 160 lbs and barely fits in the seat. They would definitely be uncomfortable for a large person. They are half the price of any similar chairs a found, so they are a good value for the money.", 
    "The chairs arrived exactly as described and in record time. We paired them with a table from CostPlus World Market and they are perfect, at a fraction of the cost. If this is the style you've been looking for, pick these up now and you won't be disappointed. Would recommend getting chairs cushions though if you plan to sit in these for longer periods of time.", 
    "These chairs may be the best buy of the year! I bought 8 chairs (2 sets of 4) and the whole cost was $438. Free shipping. Delivered on time and in perfect condition. My only regret was I hesitated to buy them when I first saw them priced at $200 for 4,Then they ran out when I went to order them.. I assumed Overstock would reorder them (they are so unique) but the price went up to $219 for 4. But still well worth it. Don't hesitate! Go for them. Best deal in town.!", 
    "I've only had these chairs for about a month now but I love them. I've desperately needed new dining room chairs for some time now but held off until I found something I loved in my price range (which wasn't easy). When I found these, they were out of stock, but I loved them so much, I decided to wait for them to come back in stock (although I considered buying them in another color). It took a few weeks but when they came back in stock, I made the purchase. They arrived in a decent time frame and were perfect right out of the box. My only complaint: where the metal comes down on the leg, it's a little bit sharp and I've scraped my foot on it, so has my husband. It's not so sharp to cut skin and we have them set up in a tiny space, which is maybe why our feet even manage to come in contact with that part.. but still, for those with tiny children crawling around, they might not be ideal.", 
    "These chairs are such a bargain for the quality you get! I had read some reviews saying these chairs were for smaller people, but I've had several dinner parties with no complaints from any of my friends (and they are all shapes and sizes). I was most pleased with the color and weight of the chairs. The color really feels like a vintage metal and is a little less gold than the picture shows. These chairs are very sturdy and heavier than I anticipated, which was wonderful since some of these style chairs are a more light weight aluminum. All in all, they really make my dining room come together. Really beautiful and the best deal around on this style chair.", 
    "They are a great tub chair for price. Everyone comments on how cool they are.", 
    "These chairs are super cool and unique in person. The vintage color and finish goes very well with our farm table and other transitional pieces. We were so impressed with the chairs that we ordered the barstools to match. If you are looking for quality design and build at a fraction of the price these are perfect for you. I have found these exact same chairs at a high end retailer for a lot more per chair, once these were delivered I saw that they were the very same chair. I would def recommend these to anyone who is high on style and low on cash..haha..", 
    "I ordered these chairs to pair with my antique farm table and I love them! My kids think I'm the coolest Mom and my friends have complimented me on them. If you love the vintage look then you will totally love them. I did have one chair damaged in shipping but I called Overstock and they shipped me another chair with no problems! I would highly recommend these vintage, kid proof, classic chairs.", 
    "I bought these for my nail salon's waiting area. They are good quality chairs and true to the color showed. I would buy more of them if needed. However, they are quite slender....if you have wider hips or bigger legs they are very uncomfortable. Other than that they are worth every penny paid for them.", 
    "We found these chairs at World Market for $100 each. I received an email from Overstock - 4 for $199! Shipped quickly, box was in good shape and chairs were padded and wrapped. We love them!", 
    "To my surprise, an art dealer came into my home and thought they were vintage and thought I had found a find. He even turned the chairs upside down to inspect the labeling. He thought the chairs were the vintage and even said the distressing looked authentic. I'm very happy.", 
    "We could not be more pleased with this purchase. The chairs go great with our rustic farm table. They complete my dining room and give it just the look I was going for!", 
    "These chairs are a great value for the money, half the price of the cheapest knock-offs out there. Nice rustic brown metal color and sturdy feel. The dimensions are perfect for sitting though of course they do not slide under the table due to the arms. Just a great vintage look that works with our industrial/bungalow vibe. They really warm up our kitchen and tie in all the copper and brass we have in the room. Very happy with them.", 
    "We love these chairs. They are very comfortable and beautiful. We are very happy with this purchase.", 
    "Came well packed in one large box. So far finish has held up great, of course, I've only had them about a month. They were noisy to move around on my tile floor, so I put felt pads on the feet, which got rid of the metal folding chair kind of sound. NOT A VERY WIDE SEAT. Heavier set people aren't very comfortable in them. Otherwise they are comfy.", 
    "I am happy with these chairs, they are very nice and comfortable. I was not pleased with how they arrived. The box was completely beat up and held together by a single, small piece of tape. The delivery man stuck around in hopes that we would open it before he left to make sure everything was ok inside. Thankfully, nothing was damaged (that's a good sign for the durability of the chairs), but I am still appalled at the condition of the packaging.", 
    "The chairs are a bit darker than I had expected, but that is a good thing! I had ordered them to go with my new Cooper Round Dining Table from World Market (weathered-looking wooden pedestal, steel top with rivets) and was a bit nervous that the metals would be too different-looking. Far from it -- my husband keeps congratulating me on my choice, saying they look like a matched set! I have to agree. They are just what I was looking for. And quite comfortable. I'm a very averaged-sized woman (5'6\", size 10-12) and they feel great. My husband is 6'0\" and 235. He says he wouldn't want to sit in one all day but it's perfectly comfortable for the length of a meal. Very happy with my purchase and the fact that I got a cool, high-end looking kitchen table and chairs (that my toddler can't destroy) for $$$!", 
    "Love these chairs! Thay look perfect around my kitchen table. They are child friendly and super easy to clean off.", 
    "These are very nice chairs for an excellent price. We love them with our dining room table and our friends have rave reviews, as well. I think these will last for a while. The only downside to them is the arms are high enough to stop the chair from being pushed in \"under\" the table. The result is that the dining table and chairs take up a little larger footprint than before. However, it's not that big a deal for our space and it was a possibility I was prepared for.", 
    "This is a great set of chairs for the price! I've seen chairs of similar styles for much higher prices. These chairs don't have all of the intricate details of a $200 chair, but I also didn't expect it at a quarter of the price. I'm really happy with this set. It looks great!", 
    "I had been in search of metal chairs like these for months, but couldn't convince myself to spend $100+ per chair from somewhere like Restoration Hardware. I was a little hesitant to buy furniture online (especially since quality and comfort are of the utmost importance to me), but when the chairs arrived, I could not have been happier. They are very comfortable (for a metal chair), the finish is beautiful, and they're heavy, sturdy chairs. They're the perfect size and height for my dining room table and look great with my mix of yellow wooden chairs. I would highly recommend this product!", 
    "These chairs are amazing, especially for the price! I couldn't be happier.", 
    "I am very pleased with this chair. It is a little more brassy than expected but I still love the color. I am using then as dining chairs and they are very sturdy. The rubber on the bottom prevents any slipping on my wood laminate floors. They are also easy to clean.", 
    "We recently found a great deal on a hammered metal table at a local interior design house. Unf, the chairs they had paired with it were not a great deal (and didn't really look good), so I went online and found these chairs. They go perfectly with our new table and were exactly what I was looking for!", 
    "First of all, love the finish of these chairs!! They're almost like ab oil-rubbed bronze. Too bad they don't have this finish anymore!! Love that they stack, makes cleaning kitchen a snap. Wish they offered these chairs in packs of 2.", 
    "I have been looking everywhere for chairs like this, and I could never find them for less than $99/chair. This set was less than $200- and had FOUR chairs! The color option was one I couldn't find anywhere else, and I LOVE them. They arrived in record time, they turned out perfect, and I couldn't be happier!", 
    "Im absolutely in love with these chairs. Im using them in my dining room to go with a framhouse table i built and they go along with the motif perfectly! Only gripe is if your house is cold, these are indeed metal so they will be cold at first! Other than that i have no compliants! These are very industrial and go perfect with antiques and rustic furniture. Can't believe i got these chairs for *** a piece! very good deal compared to the *** per piece replicas **** is saling!", 
    "No one could believe what we paid for these. The only down side is I've had clothing get snagged on a couple of the eight chairs we purchased. Otherwise awesome chairs!!!", 
    "I was a little wary about the quality of a chair at this price. Especially when I have seen similar chairs at 4x the price. I have been wanting to purchase this style of chair and figured wore case scenario I would have to return them if they were not a good quality. I was so pleasantly surprised at how sturdy and well constructed the chairs were. Not to mention the amount of compliments my husband and I are receiving about the look and feel as well as the comfort of the chair. Awesome chair...even better price!", 
    "metal on the back is a little thin but overall I am very satisfied with the product. looks great with our raw pine table. thanks", 
    "I have been looking for Tolix chairs for about a year and finally decided to get these. They are absolutely stunning and look much better than in photos online. I have to say they compliment so well with our rustic farm table. Now our dining room is complete. I am pleased with the quality as well as style and finish. Thank you, Overstock.", 
    "These are great chairs! They look and feel like the ones that cost double in price. They are perfect with our wood table for that mix/matched cafe feel. They also work great with my two young kids...their booster seat fits perfectly and the chairs are very easy to clean. I would highly recommend them.", 
    "These were perfect. Exactly what I was looking for!", 
    "Let me just say that I have high standards for what I put in my house. I can only admit my desire for high end items as I sit behind a screen name. I have debated and looked at every major brand of metal chairs for my farmhouse table. Pottery Barn makes a great chair--but it is 200 per chair and while I like the silver color more..I have been blown away by the quality of these chairs. They are very solid and will last forever. They will need a seat cushion to seal the deal...but otherwise they are great. I opened the 4 I ordered today and already ordered another 4 for the other side of my table. Look..the very best deal I could find anywhere other than Overstock was at Restoration Hardware...and even then they were 100 per chair. Buy these chairs and you wont be disappointed.", 
    "Sorry. I send it back because they were no as expected.", 
    "They're metal chairs. I'm on a budget. They're fine. I don't want to review everything I buy- please stop sending me a ton of emails inviting me to do this.", 
    "I bought 80 of these chairs for my restaurant. The arms break off and the legs bend very easily. The paint chips off. These can not stand up to commercial use. I am having to replace all of them after 14 months. They are for light use only."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Vintage-Tabouret-Stacking-Chairs-Set-of-4/6839588/product.html?recset=7632a343-e4b0-420e-8945-b10232f0391e&refccid=JREAS4G5YN7L7QCFKKYYDQAJDM&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6839588/Vintage-Tabouret-Stacking-Chairs-Set-of-4-2149e052-bc4c-4b5f-b73b-940a4963be2d_600.jpg"
  ], 
  "description": "Furnish your home for style and comfort with this set of four\nchairs from Tabouret. Vintage meets modern industrial style in\nthese stacking chairs with their dark bronze-tone finish, and the\ncontrasting combination of crisp lines and graceful curves lends an\nindustrial chic appeal to this set. Fashionable and practical, this\ndining chair set also features a powder-coat finish, which is\nscratch and mar resistant.Set includes four industrial-themed chairsDurable steel construction withstands normal wear and\n  tearNatural patina powder-coat finish lends flair to these\n  chairsLightweight and stackable design makes this set easy to\n  storeNon-mar foot glides protect your floors from scratches and\n  marringScratch- and mar-resistant construction keeps these chairs\n  looking new for yearsSeat measures 17\"H x 15\"W x 15\"DChair measures 31\"H x 20\"W x 19\"DStyleContemporary, Rustic, Shabby Chic, VintageMaterialMetal, SteelChair TypeDining ChairsSet SizeSet of 4AssemblyAssembledChair Back HeightHigh Back, StandardColorBrown, GreyFurniture PatternGeometric"
}