{
  "name": "Winslow_White_Wall_Mounted_AV_Entertainment_Console", 
  "price": "EUR 140.28", 
  "reviews": [
    "I was looking for a nice affordable and compact piece and this was it! I love it and recommend it to anyone and everyone!! Looks beautiful on my grey wall!!", 
    "This TV stand far exceeded my expectation! It was so easy to put together, it's sturdy, and it looks fabulous in my freshly painted room.", 
    "Easy assembly, simple to hang. The screws that fasten it to the wall are visible after installation and the plastic plugs for the screw heads don't fit very well. Take note: There's plenty of room in the rear for cords, but be sure to use a good surge protector and mount it where you can get to it when the unit is installed.", 
    "What a unique and functional AV organizer. I absolutely love it. My walls are a similar color to the stock photo so it looks almost the same. I get nothing but compliments from everyone that sees it. My only complaint was how slow Overstock shipped it. Almost two weeks for delivery.", 
    "Relatively easy to assemble. Seems to be sturdy. Only reason for 4 and not 5 stars is that you have to hide wires. The shelf can't exactly hide them. Overall though it is a nice item!", 
    "It took a very very long time to get to me because it had to clear customs from Canada. Other than that I love it! It's very sturdy and looks great on the wall!", 
    "love it looks good in my living room", 
    "very nice piece...easy to put together and wall mount. Seems very stable and well made. Really frees up floor space and offers quite a bit of storage for a small unit", 
    "REALLY GREAT QUALITY....LOOKS GREAT!", 
    "It looks great in our living room. Product is as described on site.", 
    "I love my Winslow console table gives a great modern look and very sterdy!! Great for small living area", 
    "I purchased two of these. Hung them higher over table and chest. Saved so much space! and the shelves hold all the media hardware.", 
    "After doing a research on this item I was satisfied that it is made sturdy, and it is also a beautiful piece of work. Love the fact that I can vacum or sweep underneath it. The only con is that it is not flush with the wall it leaves about half an inch from wall to the wall mount.", 
    "i with it was a little smaller", 
    "We actually installed this above the TV in our home which works out great as we try to get all the wires and things up off the floor. It looks nice with other items we have installed on the wall matching quite well. Perfect size to fit our PS3, Wii, a laptop and speaker system and decorative items, with a small selection of DVD's. The hardest part was getting it on the wall. The screws for the studs kept striping and one even got too hot and broke off in the stud. We had plenty of standard drill bits and none of them were long enough to pre-drill for the length of the screws provided (about 1/4 to 1/2 inch to long). So we spent some time at the hardware store looking for longer drill bits (no luck) so we found some sturdier screws (different metal) that wouldn't strip and were the proper length for pre-drilling so we could get it on the wall and it works great now. Only con was the frustration with the provided inferior hardware that couldn't handle a hardwood stud.", 
    "Not so practical as the unit is very heavy just to hang on the wall requires too much laborI would not purchase from the standpoint of assembly also looks really deep when it hangs I had to take it down after all the trouble off assembly is just big and unpractical"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Winslow-White-Wall-Mounted-A-V-Entertainment-Console/9739707/product.html?recset=6c4992ad-3e7f-4f11-bc32-71483409937c&refccid=63FQHEI6GEMIYVSKP7PCV4V4PQ&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9739707/Winslow-White-Wall-Mounted-A-V-Console-Console-e170c03d-633a-4fe9-9609-dd5e7c8c3153_600.jpg"
  ], 
  "description": "Save space with this Winslow wall-mounted entertainment console. Designed to sit directly below a flat-screen television, it offers streamlined good looks to complement your decor. With its clean white finish and contemporary styling, the console coordinates with most furnishings.White color with laminate finish for a clean feelMade from MDF and composite wood for strengthHangs on wall to save spaceTwo shelves provide storageMeasures 16.75\"H x 48.5\"W x 16\"DStyleContemporary, ModernMaterialLaminate, WoodTypeEntertainment Units, Storage, TV StandsFinishLaminateAssemblyAssembly RequiredColorWhiteNumber of Shelf3Weight CapacityUp To 100 Pounds"
}